["The next Biennial should take place in 2018. The grounds of the museum will be renovated in a similar fashion to the Museum of Modern Art and the Art of War. The theme of the 2019 edition will be “Phantom of Rome” and will be “The End of the Dream.” The exhibition will showcase work by the show’s thirty artists who have participated in the exhibition in order to “draw attention to the dishonorable state of art and architecture that we live in.” The museum will also host a discussion about the exhibition at 22nd Street on the museum’s fourth floor.\n\n\nThe Metropolitan Museum of Art in New York is preparing to welcome visitors back to the institution, following a temporary closure due to the Covid-19 pandemic, on November 8. Though the museum is open to the general public, on Wednesday it began reopening with a $50 price tag, and on Thursday it will be free to the general public for forty days. On Friday, it will also be free to the general public for twenty days during the high-pressure week of November 16–23. Museum director Daniel H. Weiss said: “We know that many visitors are looking for a quick and convenient", "The next Biennial should include works by the artists who were invited to the exhibition—including Malama Baldene and Lina Bickel—and focus on how their practices intersect with the development of the exhibition. The exhibition will be hosted by the biennial’s curator, Alexander C. Breivik, at the exhibition’s venue through March 18.\n\n\nThe Museum of Modern Art (MoMA) in New York has established a new $500,000 fund to support artists whose practices are at risk of being disrupted by the novel coronavirus. The fund will provide $100,000 to cultural workers in New York City whose practices are at risk of being disrupted by the novel coronavirus. The fund will distribute another $100,000 through MoMA’s own endowment, which will distribute another $100,000 through grants to independent arts organizations.“The fund is designed to serve as a critical lifeline for cultural workers whose work is at risk of being disrupted by the novel coronavirus,” said MoMA director Daniel H. Weiss. “These artists are the critical mass that will continue to catalyze change and shape museums’ future trajectories in their favor. Their work embodies the cultural heart", "The next Biennial should include an exhibition of work that is 'exactly like' the work at the centre, which is a 'seamless flow of information in and out of the structure, which is a sense of place'\u0097Biennial 2020, or, as the organizers say, a 'transformation of the world.”In a statement, the organizers said that the “event will consider the possibility of a new kind of biennial” and “will consider, in as many ways as possible, how we can meet this challenge and how we appreciate it.” The deadline to apply for a spot in the show is October 22.\n\n\nFrench artist Georges Apostu, who often presented works in public spaces such as the Louvre and the Louvre museum, has died at the age of eighty-three. In his late sixties, the France-born, Rome-based artist established his own studio in Paris to direct his own activities and to produce works for exhibitions and other public displays. The artist, who had lived in France since the late 1940s, was a prolific writer\u0097his first book, “Demian,” 1955, was published by Guerrilla Gallery in Paris. His later works", "The next Biennial should be held at the  Alexander Graham Bell Gallery in New York in 2021, and the 2020 edition was held in October and November.The 2019 show was curated by James Turrell. The artist’s new exhibition, the artist’s first, will open at the Belowground Museum of Art in New York in 2021. The biennial will soon be making its inaugural trip to New York City and will be back before the New York City Museum of Art (NYCMoCA), where it has been held since 2015, in 2021. \n\n\nHuawei has announced that it is now shipping its new flagship smartphone, the Honor 8, to over sixty European countries. According to a release, the device is available in more than sixty languages and will arrive across Huawei’s core markets of China, the United Kingdom, France, Germany, Italy, the Netherlands, and Sweden in Q2 2020.The Honor 8 was designed by the Shanghai-based company, alongside designers Jin Menghui, and Inspired by Nature, and will feature a quad-core Snapdragon 600 processor and 4GB of RAM. The phone is estimated to cost around $249. The Honor 8 will", "The next Biennial should be held in 2020. The next edition will be organized in the Rio de Janeiro archipelago, in the city of Minas Gerais, Brazil, and will have a budget of $39 million and a run time of ninety minutes. Here is the full list of participating artists:A. Carmel BalabanArturo CamposArache AlvesDeana ArnaudDeana BarrosDiane Carvalho De La Guerra Desmarais DiasGalina DanikenDiane HartleyDiana Isabel IannottiDiana María MartinsDiana Maria MurilloDiana Miro ChetwyndenDiane PasqualiniDiana Pinto GarciaDiana Pinto-VillegasDiana Pinto-Villegas (colectivo)Diana Pinto-Villegas (méxico)David A. CaraballoDavid S. GuggenheimDavid K. GeisslerDavid LebovitzDavid Lebovitz (colectivo)Emma L. AinsworthHans Ulrich ObristHannah J. LincolnHarlan K. WilliamsHans KotteKanae OkaHannah S", "The next Biennial should be held at least ten years from now. The intention is to give the Museums and Collections of Liverpool a form in which they will be able to engage with the outside world, able to present works of the contemporary, re-creations of works that have survived the modernist revolution, and continue to present works of art, and have a voice in the public life of the city.”\n\n\nPrinceton University announced yesterday that it has awarded $46 million in grants to establish program centers in areas such as health and wellness, education, and the arts. More than $20 million have been allocated for fellowships and fellowships, which would complement the university’s existing health and wellness and education initiatives, and will initially provide support for students to enter the university’s undergraduate and graduate health and wellness programs.Since the project centers are not connected to the university’s campus, they will not receive funding from the university; thus, the development of their own businesses and the collection of their own collections will be supported. Research, education, and outreach for the fellowships will be organized within the Princeton Graduate Student Health and Wellness Center (PGSC), as part of the university’s existing relationship with the thousands", "The next Biennial should be up and running by the end of the month. That would give everyone a good month to rest and recover before the festival opens in March.The biennial’s theme is “Reclaiming Nature” and will focus on how to sustain life on Earth while mitigating climate change. For the past ten years, the festival has been a platform for cultural exchange and dialogue between Iceland and the rest of the world. The first edition was held in Reykjavík in 2008. The second edition was held in Reykjavík in 2013, and the third edition was held in Reykjavík in 2017. The event will culminate with the exhibition “Aurora Borealis: Gísli Maamnet” and a virtual reality exhibition in Reykjavík.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the temporary closures of public spaces in the city in order to protect the artistic and cultural heritage of New York and New Jersey. The guidelines, which were issued on Monday, March 20, follow a string of attacks on cultural institutions in the city, including the devastating explosion of the Z-plus nuclear reactor in Fukushima Daiichi in Japan", "The next Biennial should be held at the University of Toronto in the fall of 2020. The first World Congress of Museums in Manila (CMA) will be held in January 2021.\n\n\nThe University of California Berkeley announced today that it has selected Mary Anne Oxtoby as its next dean of the College of the Arts. The appointment was made by chairing the institution’s biennial, “Graduates of the UC Berkeley Graduate Arts,” which will run from April 17 to April 19, 2020.“After a distinguished career at the College of the Arts, Mary Anne Oxtoby brings a wealth of experience and knowledge to the university, providing leadership and ensuring a robust and compelling learning experience,” said chairing chairing chairing chairing chairing chairing chairing chairing chairing chairing chairing chairing chairing chairing chairing chairing chairing  . Oxtoby comes to the university from the University of California, Los Angeles, where she serves as the associate provost for academic affairs. She succeeds Adrienne Edwards, who was appointed as the chair of the College of the Arts in March 2019.“With a deep and expansive knowledge of contemporary art and the environment, O", "The next Biennial should be held in Miami Beach from February 11 to March 8, 2020. The first would be held in January 2021, the other in September 2022.The March date is notable for several reasons, including that it coincides with the April 14 date on which the first exhibition, “The Future Is Present,” will open in Qatar. In a statement, the Qatar Foundation for the Arts (QFE) said: “The Qatar International Festival is a platform for Qatar’s artists to present their work in a global, regional and personal setting. In line with Qatar’s philosophy of presenting work and art in the context of local and global audiences, our artists will be presenting works at the Qatar International Festival and participating in the flagship exhibition ‘The Future Is Present,’ at the Dubai Art Museum in March.”The Qatar Contemporary Art Foundation (QCFA) said the opening of the biennial was a “special moment for all of us.” It added that the organizing committee “beat the US’s Department of Education’s and the Department of Commerce’s efforts to prevent the exhibition ‘The Invisibility of Photography’ from being held at the same venue", "The next Biennial should be held in Morocco in December 2020. \n\n\nEleanor Roosevelt Center for American Studies at the University of Chicago. Photo: Eric Stoltz. Courtesy of the artist. \n        \n\n\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of $10 million from the Howard W. Hunter family, who donated the collection of more than three hundred works by American photographers Theodore and Virginia Hunter. The collection includes work by the late photographer and activist Richard Black on his commitment to social justice; a selection of works by John Maynard Keynes; and works by Edward Weston on his years as a soldier in World War II.The gift also includes works by several artists whose work has recently come to the museum, including Sarah Galloway, Michael Ondaatje, and Adam Pendleton. The National Gallery of Art will display these works in its exhibition “Theaters of Light” next month, and the gift will help support the work of the Hunter Family in the museum.The gift was made in the summer of 2019 after the family donated the collection to the museum in honor of the Hunter’s first-born son, Adrian Hunter. The son, who", "The next Biennial should be held in 2021. Museum director Roberto Cicutto, who has been working with the new director of the Museo de Arte Contemporáneo (MAS), Adriano Cretaro, and the new curator of contemporary art, Anna Maria Pazzal, said: “I’m very much looking forward to our work in the next years. It’s a very challenging and demanding field in which to conduct an exhibition, but we will do our best.”The upcoming exhibition “Art and Public Life” will be on view at the Museum of Fine Arts, Boston, until March 4.\n\n\nPhiladelphia Museum of Art (PMA) president Sean O. Hickey announced today that Peter Hartigan, who has served as the director of the museum for more than twenty years, will be promoted to the post of director of the newly renovated  Pulaski Gallery in downtown Philadelphia, which is slated to open in the fall of 2021. Hartigan, whose current responsibilities include the development of the center’s urban farm and permanent collection, is an independent contractor who works primarily as a freelance curator. He first joined the museum as a curatorial assistant in", "The next Biennial should focus on the 'delusion of the human.' “We must confront this reality,” Biennial director Guy Martin said. “Our mission is to invite a critical and reflective public to play a role in the future of our planet. We have a responsibility to serve.”The biennial, which commemorates a lifetime of working on human rights, human rights abuses, and public health, will shift to a “multi-dimensional strategy of advocacy, education and intervention,” Martin said in a statement. “It will have a biennial-like quality, differing only in that it will consist of a series of exhibitions that combine the full range of artmaking and activism.”The conference will now begin back up, with the full lineup of the upcoming event to be announced in the coming months. “We are delighted that the current roster of artists participating in the Biennial is as strong as it was when the exhibition was first announced in April 2017,” said Paul Mpagi Sepuya, director of the Biennial. “It is a new era for the Biennial as we look to 2020, and the network of artists and activists who are sharing their stories around the world", "The next Biennial should commence in 2021 and will be hosted at the new Museum of Contemporary Art (MoCA) in New York. The exhibition will be divided into two parts, “The Black Metamorphosis: Avant-Garde Art on Race and Resistance,” which will be staged at the museum in 2021 and “The Black Metamorphosis: From Painting to Cinema” in 2022.Commenting on the changes at the museum, James Cuno, director of the Museum of Art, said: “There are three things that are central to my curating that have not changed since I began. The most important, and the least talked about, is race. I will address that in the next exhibition. But what has changed is the world we live in. There is a critical mass of artists, designers, writers, performers, and youth that has an impact on our world. We have long struggled to reach that critical mass. And with the recent advances in our understanding of black and international art, the Black Metamorphosis is possible.”Prior to joining MoCA, the artist-turned-author was a professor of art history at Columbia College Chicago. He is the author of Black and the Body: Feminist Art and the", "The next Biennial should launch in the spring of 2021 and be comprised of a group exhibition of work by twenty-four contemporary artists, including Nicola Kammerer (Berlin), Léa Glimcher (New York), Nikolay Grivko (New York), and Hiroshima Tada (New York), among others. The 2019 event, titled Art and Vision, included work by Sara Cwynar (New York), Joëlle Blum (New York), and Léa Glimcher (New York), among others.\n\n\nRoger and Edith West, the creators of the hugely popular 1970 television sitcom Family Ties, were found dead on Monday, November 24, at their home in Los Angeles. They were eighty-two years old. The show was inspired by the West Coast’s Gold Rush, a time of great optimism and economic prosperity that lasted from March 1973 to July 1973. The Wests’s influence was felt across America as the show was adapted for the small screen by the Pittsburgh-based duo Cirque du Soleil in the summer of 2016.The Wests’s last-known address was Pasadena, California; they had", "The next Biennial should be held in 2021, with the aim of developing more social media-based models of art and collaboration.\n\n“With the rise of new media platforms and collaborative culture, the importance of cultural collaboration is becoming more and more relevant,” said Patricia Fenoy-Sobel, executive director of the Sentosa Foundation. “We are convinced that a new exhibition-based and community-based model of exhibition design and curation will be the future of the art world.”The Art Newspaper spoke to Julia Black, director of Tate Britain, about the future of Tate’s arts program at this year’s Venice Biennale. Black said: “As we move into the next decade and beyond, Tate is working with two hands on the arts, engaging with the very issues that inform and challenge our lives.” She added that the corporation would continue to engage with artists and the creative community in the months ahead.\n\n\nThe twentieth edition of the Venice Biennale, curated by the Norwegian director Morten Hoemann, has announced that it will be held from March 22 to March 24, 2021 in Venice, Italy. The event will feature work by twenty artists and will", "The next Biennial should be a great success! After all, you have to show that there is actually a market for the exhibition. We are all very optimistic and optimistic about the future of Biennales. We are also very focused on the new challenges that will come to us, at the end of the line. We will try our best to keep you updated with the project, the proposals and the analysis of the exhibition. We are actively on track to produce a highly detailed programme in the coming months. \n\nThe Léger Triennial of the Arts (Lit) in Paris is facing a massive loss of revenue after it canceled a show by Haitian artist André Bickel, an African American artist who resided in the city of Port-au-Prince, Haiti, for two years, in March 2019. Although he was only twenty-two when he died, Bickel had already made important contributions to African American art. In 1965, he founded the Léger Triennial of the Arts in support of the Black Arts Movement (BAMP), which gained momentum in the late ’60s and ’70s. He was awarded the Presidential Medal of Freedom in 2007, and the National Medal of Arts", "The next Biennial should take place in 2020.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has received a major donation of fifty paintings, drawings, and prints from the collection of Italian collector Rosa Donatella. The donation includes works by Signorelli, Barbara Berlusconi, Camillo Brindisi, and Vittorio Cattelan, as well as two works by Maurice Remarque, which were on display for the museum’s inaugural full-scale exhibition, “The City of Art,” inaugurated by the Italian architect Dario Franceschini in May 1998. “I’ve been to Rome a few times and have seen the works for the first time in the collection of the Met, and the collection now comprises fifty paintings, drawings, and prints, all from the Italian Renaissance and the Italian Renaissance,” said Steven Kadul, the director of the museum. Commenting on the works, Kadul said: “These works were originally placed in full view of a large public museum in Rome, but they were not exhibited or readied for public viewing until the twentieth century. I believe that these twenty-five works, the exquisite work of", "The next Biennial should have been held in the spring of 2020, but was postponed, and the 35th Biennial in the spring of 2021. The first Biennial in the Japanese city of Nagoya will be staged in April 2021.The central role of art in the Japanese culture is reflected in the tenor's Birthday Party in Tokyo on May 29. The event will feature music that has not been performed live for more than twenty years, and will be the first time Saitō Iguchi has ever performed a live song. Actors such as Yuji Kondo, who portrays Renji Abarai, the protagonist of My Sister Is a Monster (1961), and Akira Takayama, who portrays the character Chōji Konatsu, the protagonist of The Little Mermaid (2017), will also participate in a live performance that will run from 10 PM to 2 AM in the Tokyo Metropolitan Government Theater (TMG). The event will be hosted by the TMG, with minor contributions from the National Museum of Art, the Nichiren Shimbō, and the Takashi Museum of Art.\n\n\nThe Chinese artist, designer, and designer-turned-multimedia artist Wang Wei, who created early av", "The next Biennial should be held in 2020, and the pavilion will be completed in the same year.\n\n\nThe Metropolitan Museum of Art in New York, the Whitney Museum of American Art in New Orleans, and the Brooklyn Museum in New York have committed to rescheduling dates for their upcoming editions of the biennial, which will take place this fall, in anticipation of a possible reduction in the number of exhibitions that will be staged. The cancellations are a further setback for the organizers of the annual event, which has drawn more than 130,000 people to the city each year since it was founded by collector Angel Guría in 1976.The institutions announced their decision to cancel the fairs shortly after Artnet reported that the Metropolitan Museum of Art in New York had lowered the attendance figures for its upcoming editions by one tenth of the total number of visitors that were would have been expected had the fairs been canceled\u0097in order to meet future demand. The decision to cancel the fairs has also been protested by a number of museums, including the Brooklyn Museum, which has been trying to secure a piece of the $1 billion deal that would have seen the Met’s former building at 60 Elmhurst Street converted into a museum and is currently negotiating with", "The next Biennial should take place in 2021 and be hosted by the Museum Al-Qasimi. Until now, the institution has only staged three biennials: the inaugural edition of Art Basel Dubai in 2010, the 2008 edition of Art Dubai, and the 2013 edition of Art Dubai. Its next event is scheduled to be held in 2021.\n\n\nThe United Arab Emirates announced today that it will establish a $1.2 trillion fund to help artists and cultural workers in the Middle East and North Africa (MENA) region. The fund will be managed by the Ministry of Culture, Arts, and Tourism (MCA).The $1.2 billion fund was established with an additional $1 billion from the United Arab Emirates’ foreign ministry and was announced last month. It is part of a $7.5 billion package of aid announced by the UAE government for its yearly aid program, “The Fund for Arts and Cultures.”“This year’s ‘The Fund for Arts and Cultures’ marks a turning point,” said Abu Dhabi Governor Hamdan bin Isa Al Khalifa. “This is a moment of renewal for the entire region.", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has hired seven new staff members in an effort to stem the decline in attendance and revenue of its festival, Artadia, which has been canceled since 2020 due to Covid-19. The staff additions, which were made on Tuesday, August 21, include Sophie Alonso, who will be promoted to the role of director; Ryan Murphy, who will be a senior curator at the institution for the next twelve months; and two artists who are represented by galleries.“After careful consideration, I have decided to make two appointments for next year,” said MoCA director and CEO Courtney B. Davis. “We are excited to welcome Matt Sturm, who has been a terrific partner to the museum, and our inaugural 2018 artists, who are Kris Katt, Nigel Roesler, Tyler Ross, and Eileen and John.”Additionally, the organization announced that it will invest $30 million over four years into its artistic development program. The funds will go towards the development of new programs, including an open studio residency program, the exhibition of work by local and international artists, and the acquisition of works by artists of the San Fernando", "The next Biennial should take place in the autumn of 2020 and will be hosted by the Royal Academy of Arts, in London. The theme of the 2020 edition will be “Architecture at the Crossroads.” A special exhibition, “HELMUTS 10,” will also be staged at the Museum of Modern Art in New York in 2020. The twenty-third edition of the Samanta Biennial, titled “HELMUTS 11,” will be held in the summer of 2021.\n\n\nThe British architecture and design firm Foster + Partners has been awarded a $30 million contract by the Ministry of Foreign Affairs (MoFA) to design and install a new fence around an existing archaeological site in the northern Syrian city of Ain al-Arab over the next four years. The design will be carried out by Foster + Partners, the London-based firm specializing in cultural heritage projects and who will be contracted to the Syrian government, in collaboration with contractors and archaeologists from the Institute of Architecture and Design (ADI) in the Syrian city of Aleppo.“The Ministry of Foreign Affairs is thrilled to have this project come to fruition,” said Foster + Partners president and CEO Andrew Foster. �", "The next Biennial should focus on the birth of the New York Philharmonic, whose current exhibition, “The Evolution of the Orchestra,” will open on May 28 and run through November 22. The next began as a group show that included a selection of works by forty artists.“I’m excited to be the first to present the Biennial at Rockefeller Center,” said artist Monica Grady. “The first stage of this exhibition will be in March 2020. We look forward to continuing the work of fostering and celebrating New York’s music and arts in the spring of 2021.”The show will be curated by Yo-Yo Ma, associate curator of contemporary art at the Museum of Modern Art; Scott Aaronson, an independent curator; and Adam Weinberg, a founder and director of the self-described “indie” gallery. The exhibit will take up themes such as the relationship between artists and institutions, the power of the arts, and the history of the city.The 2018 show, titled The Power of Art, captured the imagination of an audience of twenty-six artists, including Paul Gauguin, Robert Irwin, Lenny Abraham, Woody Allen, and", "The next Biennial should be held in 2021.The Paris-based organisation MassArt and the Swiss artist Klaus-Dieter Abbeel will lead a second edition of the exhibition at the Galleria Beyeler in Lausanne in 2021.The show will be curated by Beyeler director Guillaume Barra and will focus on the story of the Eiffel Tower and its history. The exhibition will be inaugurated by an interactive installation, “L'Âge des études,” which will feature work by forty-two artists from thirty-four countries. The list of participating artists is as follows:Tadashi Yoshida, JapanSofia Balsom, SwitzerlandElizabeth Banvish, New ZealandLarissa Bannister, New ZealandHannah Buckingham, United KingdomSara Braithwaite, New ZealandKura Bass, CanadaSara Busch, United KingdomSara Cammock, NetherlandsCheryl Callaghan, IndiaAmina Camacho, MexicoCheryl Chan, CanadaLainie Chaikin, CanadaTia Chan, CanadaNina Chan, CanadaSamantha Chiu, AustraliaMichele Corrigan, ChinaLéa Cresp", "The next Biennial should be set up at the New Museum in New York, which is currently renovating its grounds and will open in 2020. The programme will then move to a new location, the Metropolitan Museum of Art, and finally to the city. The new venue will be housed in a former grain elevator, a former steel mill, that will be equipped with solar panels, a rooftop terrace, and an outdoor garden. The exhibition will be hosted by the artist and curator, Kiki Smith, who will lead the contemporary art exploration from a panoramic platform in the museum. \n\n\nAs members of the contemporary art community brace for a repeat of the devastating fire and explosion that ripped through the New Museum on February 14, 2024, and which severely damaged much of the building, which is housed as part of the arts complex the Gallery of Modern Art (MoMA), in Manhattan, New York, the New York City Department of Buildings and Design (CAD) has announced that it will allow the Museum of Modern Art (MoMoMA) architect Will.i.am to remain on the premises as long as he pays a $50,000 fine. The fine has been set by the department of buildings and design for a building code infraction", "The next Biennial should take place in 2022. \n\n\nThe Italian archaeologist Francesca Boetti, whose groundbreaking archaeological research led to the construction of the enormous site-specific monuments of Pompeii and Herculaneum, has died at the age of ninety-three. Boetti was the first Italian researcher to excavate in such detail the city of Gioia, Italy, which she described as \"the capital of the empire and the nucleus of the empire’s body’s ecosystem\". Boetti’s excavations were published in a book, The Empire and the City of Gioia: Studies in Honor of Christina Martino, and in a documentary, The Empire and the City of Gioia: The Untold Story, produced by the Italian filmmaker Giacomo Savino.The Venice Architecture Biennale’s third edition, of which Boetti curated, opened on December 11 and ran until January 5. \n\n\nThe British artist Nara Pindell, who often drew her inspiration from pop and American music, has died at age ninety-eight. The British Museum has called her “a virtuosic, contemplative, and compellingly intelligent artist whose work embraces a wide", "The next Biennial should take place in the fall of 2022, with the first exhibition to be held in the new site being the 2021 edition. \n\n\nThe Metropolitan Museum of Art has been awarded a $12.5 million donation from the Charles and Lucille King Family Foundation, a group of wealthy philanthropists that supports the museum and ensures that it has enough funds to finish its work on the Metropolitan Museum of Art, which opened in 1889. The grant follows the Metropolitan’s decision to remove the Charles King Family Trust’s donations from its holdings following its purchase of the building in 2001. \n\n\nThe 1100-year-old Roman amphitheater at the Forum Medici in Rome has been restored to its original state by Italian and French artists, who created a documentary art-historical exhibition that traces the activities of the controversial institution in the months leading up to its demolition by the Italian government in 2017.The exhibition, titled “Ecco di Beppo,” (Culture and Imagination, 1100 B.C.–11 A.D.), will debut at the museum next month and will stage a number of works that are currently on display in the exhibition “Theater of Operations: The Rise and Fall of the Muslim", "The next Biennial should take place in 2020.  More information is available at: https://www.facebook.com/events/4472905954563/\n\n\n\n\n\nThe British artist and educator Mark Rylance, who designed and installed works by Marianne Atget, Olu Ojo-Aoki, Massimo Pincotti, and Peter Zumthor, has died at age seventy-two.Rylance, a New York–based curator, artist, and educator, was born in London in 1940. After receiving his undergraduate degree from the University of London in 1962, he relocated to New York to study with John von Neumann, who taught Rylance at the School of Visuals Arts in New York from 1963 to 1972. In 1972, the artist moved to New York to teach photography at the Academy of Arts in New York, where he would remain until 1978, when he returned to his birthplace to teach at the artist-led school at Rylance’s request. In 1988, Rylance was awarded the Royal Academy of Arts’s Gallerist of the Year, the prestigious award that is presented annually to a British artist. His works are extensively recorded in the British artist�", "The next Biennial should take place in the spring of 2021. The next edition, which will be held at the Desert X Research Center in Boulder, Colorado, will be held at the Mesa Art Museum in Arizona in March of 2022. Next year, Art Out Of Space, which was held at the Center for Art and Design, will return to the Southwest in August of 2022. The 2019 event, which also featured work by sixty-five artists from eighteen countries, was held at the Boulder Museum of Art. The 2019 edition featured work by fifty-two artists from twenty-eight countries, and was presented by architect and former winner of the Prix de l'Art et l'Humano, Eric Fischl, in collaboration with Palm Springs’s Linda Owens, the museum’s curator of contemporary art.The museum also plans to open a new branch of the museum in Beijing, called the Art Institute of Contemporary China. Credited with advancing the institute’s scientific and technological goals, the institute will present research and exhibitions in Beijing, Shanghai, and Hong Kong. \n\n\nFrieze announced today that it is restructuring its board of directors following the 2016 coronavirus pand", "The next Biennial should be hosted in December and January 2020. In the meantime, the South Korean pavilion will remain closed until February 18, 2020, and the Royal Korean Academy's exhibition will be moved to March 7–March 14, 2020.\n\n\nAn earthquake measuring 5.9 that struck in Nepal on Thursday night and Friday morning, injuring many people, killed at least twenty-seven and injured hundreds more, has been classified as a possible act of volcanic activity. The epicenter of the quake was in the Himalayan region of Nepal, which is home to several active volcanoes. The US Geological Survey (USGS) said that the epicenter was located near Bapu Village, where the eruption began. The USGS also said that the epicenter appeared to be \"primarily energy-rich and not affected by the local environment.\"\"This means the eruption is probably not related to earthquakes in the area or to the recent strengthening of the quakes,\" USGS assistant director of science and global seismology David King said in a statement. \"Rather, it appears that the eruption began as a gas phase eruption from a hot-plate formation and grew into a much larger eruption. This means the eruption is probably not related to earthquakes in the area or to the", "The next Biennial should take place in the Fall of 2020. “I had always hoped that, at a certain point, a new generation of curators would emerge that would take the place of the current one,” said Hans-Ulrich Obrist, the president of the association. “The current Biennial, which is only twenty-five years old, is in a very critical moment. I believe that the next one will be even more. I am proud to stand in the footsteps of these brilliant men and women, in the name of art and culture, and to see that Biennial emerge and flourish.”\n\n\nThe International Council of Museums (ICOM), a global network of more than 3,000 US museums, has released guidance on how it will respond to the coronavirus pandemic. The document, published on May 6 and titled “Museums and the Future of the Art: Communicating with Others,” outlines seven steps that museums can and should take to help prevent the spread of Covid-19. First, museums should develop and exhibit programs that engage with audiences and the communities where the art is housed.“Museums are at the epicenter of a", "The next Biennial should be held in 2021. Columbia Pictures has not yet announced which artists will be featured in the event. \n\n\nThe British artist, curator, and educator Tawanda El-Shabazz, whose groundbreaking work explores the boundaries of color and shape, has died at age seventy-two at her home in London.Born in London in 1940, El-Shabazz is perhaps best known for her surrealistic sculptural installations in which she uses light, not color, to shape and shape. “El-Shabazz challenges the idea of line and color and their formal, symbolic, and conceptual relationships,” the Art Newspaper reports. “Inspired by the power of color in painting, she shifts her focus to sculpture and creates surrealistic paintings that underscore the defiant visuality of form.” El-Shabazz’s work has been exhibited at the Museum of Modern Art, London; the Museum of Modern Art, New York; and the Museum of Modern Art, Paris.\n\n\nThe Oxford University Book of Art (OUPBO), which has been closed since March due to the Covid-19 pandemic, has appointed Shirley Brock-Foodston as", "The next Biennial should take place at the Biennial Center in London in December 2020.\n\n\nThe French Ministry of Culture and the Louvre have jointly awarded the Belgian pavilion to the French artist - and the Belgian film director-turned-actress Marion Cotillard. The exhibition, which will be held at the Louvre until November 25, will be the first of a new series of exhibitions that will highlight the work of Belgian artists in Paris.The show’s opening will coincide with the opening of a new series of exhibitions and performances at the Biennial Center, which will also be inaugurated by the new show “The Future Is Now” curated by the Belgian director Michel du Cillema.The new program will include work by six artists who have been selected for the 2020 Paris Biennial: Marcel Dehaene, Sylvie Pfeiffer, Wangechi Mutu, Terri-Anne Miller, and Julie-Louise Persson. The partners will each receive a lifetime achievement award at the event.Commenting on her invitation, Cotillard said: “I am thrilled to welcome these six artists to Paris, and to introduce them to the many fascinating people of Paris through this", "The next Biennial should be housed in the Museum of Fine Arts, Boston. The exhibition should open on December 13, 2020 and run through January 21, 2021. The 2020 edition of the exhibition will include work by artists including Nari Ward and Sohrab Mohebbi, and will feature work by twenty-seven artists who have been selected from a pool of fifty artists. The artists that will represent Iran at the 2020 Art Basel World Developers Conference in Hong Kong are Tahma Haroon, Sara Javan, Celeste Ngai, Sara Parachutei, and Rae-La-Mac, as well as a selection of work by artists from Azerbaijan, Belarus, Kosovo, and the Republic of Moldova.\n\n\nThe Kannur Arts Council, a group of twenty-six regional councils of the Kathmandu region in southern India, has issued an international call to arms. Organizers cited the threat posed by climate change and the spread of poverty and exploitation in the region as the reasons behind the call, which was addressed to the global community at a time when the region was still reeling from the devastating floods that ravaged the country in 2016.The Kannur Arts Council was formed by the Kath", "The next Biennial should be held in 2022.\n\n\nAs the coronavirus worsens across the globe, the Museum of Contemporary Art (MoCA), Los Angeles, has come under intense scrutiny for its decision to postpone a retrospective of the artist-designed institution’s new collection of modernist works by Erik Friberg and Rineke Dijkstra. The works, titled Away From the Light, which opens on February 21, and “Greetings from the Desert,” which will run March 18–March 19, respectively, are part of the museum’s America ’s Conversation, a platform that gathers together artists and scholars for three days in early March.The exhibition, which is organized by the Los Angeles County Museum of Art (LACMA) and the Metropolitan Museum of Art (MoCA), was supposed to open on March 13 but was pushed back to March 15 due to the coronavirus. The exhibition was originally scheduled for March 21–March 23 and was meant to coincide with the opening of a new exhibition of art by John Bishop.Following the exhibit, which was originally supposed to open on March 17 and move to April 10, the Metropolitan Museum of Art announced that it would now be held in", "The next Biennial should have been made.”\n\n\nThe National Gallery in London has appointed Thomas Wright as its new director. Wright joins the gallery from the Royal Academy of Arts, where he was the principal curator of the exhibition “The Black Spot.” He succeeds Caroline Crowther, who has led the institution since 1997, and will take up the post on January 5, 2020.“Thomas Wright is an internationally renowned curator whose expertise comes from a deep understanding of the art world and the ways in which art can make a broad and visible impact on our lives,” said Charlotte Allingham, president of the National Guild of Art Historians. “We are looking forward to working with him to ensure his vision for the gallery is ambitious and reflects the National Foundation for Contemporary Art, and our collections and exhibitions.” “As a curator, he has a proven record of bringing together exceptional teams to challenge the boundaries of contemporary art and to develop new ways of presenting and displaying art. We are confident that he will build on the considerable achievements of his more than twenty-year tenure at the National Gallery.”Prior to joining the academy in 2012, Wright was a curatorial assistant at the National Galleries of Scotland; a", "The next Biennial should be held in the United States and will be held at the Biennial Center, in the city of New Orleans, Louisiana, in 2022. The Biennial Center’s inaugural edition, “Next Dimension,” was held in Shanghai in 2018 and the exhibition included works from the exhibition “Fashion,” which was organized by Maxime G. Tabet and Niels H. Henriksson and premiered at the Saint Louis Art Museum in 2009.The next Biennial will be held in the United Kingdom in 2022. The show will be hosted by a team of international curators comprising David Berrios, Atif M. Aqilaba, and Ayesha Iqbal and will be organized in partnership with Tate Britain and the Royal Shakespeare Company.\n\n\nArtists and collectors are banding together to protest the sale of works by a select group of American workers in the face of an economic crisis brought on by climate change. After the United States Environmental Protection Agency (EPA) announced on March 23 that it is capping methane emissions from existing power plants and factories—a move that would cut carbon pollution from existing power plants but would not curb emissions from new construction—a series of actions was", "The next Biennial should be held in 2021 and will focus on the eternal struggle between these two worlds: the power of tragedy and the power of hope. The biennial will be organized as a series of performances, including a memorial performance and the upcoming exhibition “The Power of Cinema.”\n\n\nActors competing in the upcoming edition of the Hong Kong International Film Festival (HKIFF) have been banned from China for participating in a protest staged outside of Hong Kong’s government headquarters in Hong Kong on February 22, the Sunday Times reports. The protest was organized by Aphrodite Alliance, a Hong Kong–based group that describes itself as a “non-violent struggle for freedom from oppression.”“We demand that Hong Kong government headquarters be opened up to the people of Hong Kong.” The group’s protest was meant to draw attention to the ongoing pro-democracy protests against mainland China’s interference in Hong Kong, and to announce its intention to stage a “Day of Action” in protest of the Hong Kong government’s handling of the protests. During the Hong Kong protests, activists and journalists were often detained by police, and the authorities have since launched a number of crackdown", "The next Biennial should be held in 2021. \n\n\nThe Austrian artist and theorist Christian Hofmann has died at the age of eighty-two.Born in Vienna in 1937, Hofmann studied art from a young age, attending the same private art schools as the likes of Ingmar Bergman, Ulrike Bacher, Franz Kline, and Kurt Vonnegut. His studies in art history and art criticism led, in 1977, to his appointment to the Freie Kunstverein in Berlin, where he would later work, advising artists such as Koons, Piet Mondrian, and Dietrich Reimer. Over the course of his career, he made many films, paintings, sculptures, and prints, and appeared in a number of documentaries, including Die Walküre (The Walküre), 1971; The Selfish Gene (1972), about a humanist triptych; and The Castle of Cagli, 1977. He also composed numerous fiction works, including several novels, The Last Day on Earth (My Struggle), 1976; The House of the Chaplain, 1979; and A Letter to the Sun (My Struggle II), 1995.In 1978, the year after the death of his first wife, Hofmann married and", "The next Biennial should be held in 2020. The Twelfth Biennial will take place in 2021 and the Twelfth in 2022. The twenty-fifth Biennial will take place in 2050. The twenty-eighth Biennial will be staged in 2061. The twenty-ninth Biennial will have a twenty-ninth curation by a seventy-one-year-old American artist. The twenty-ninth Biennial will open in 2021. The twenty-ninth will be the first new exhibition by Architectural Designer James Onai of the twenty-fourth century. The twenty-ninth will mark the centenary of the exhibition “Oblivion” (2017–2018) at the Metropolitan Museum of Art. The twenty-ninth will be the first exhibition in the United States to feature work by the artist-in-residence, Nira Barre, and will receive the $100,000 Roy and Felice HBO Prize for excellence in art this year. The venue will also stage the opening of “Away From It All: Art and the Making of American Life” (2019) at the Whitney Museum of American Art. The show will feature thirty-two", "The next Biennial should be held in 2020.  The museum is also developing a new exhibition called Art and Meaning, which will delve deeply into the history of art and will begin previews in January 2021. \n\n\nWalmart has unveiled its future strategy for the U.S. health care industry, which has been plagued by growing uncertainty over the health of the Affordable Care Act (ACA). The move follows an announcement last month that Walmart would increase the premiums of plans sold by HealthFirst, a Michigan-based nonprofit, by $1, reducing their reimbursements by up to 70 percent. A new website where shoppers can compare plans has also been launched, and the company is asking for your help in soliciting ideas for future editions of the annual Best Buy Awards.According to a release, the company also wanted to eliminate some of the redundancies and workloads that were previously caused by the ACA and to focus on helping retailers reduce their carbon footprints. The changes will be delivered in two parts: “First, to help you understand how we are addressing the many challenges facing the health care industry, we are releasing a new survey, called the Marketplace Effect, that will gather you and a group of friends and give you a unique opportunity to see how our health", "The next Biennial should be titled “The Future Is Now” and will be held at the Promenade de Paris in Paris from January 10 to February 16, 2021. The exhibition will also include the first editions of the “Art of Life” and “Art of Movement” exhibitions. The 2019 awardees include Olivier Simon, Dang Wang, Léo Delaunay, Luis Manuel Santos, Thomas J. Mächtel, and Pablos Nagy.The Aichi Triennale is currently scheduled to end in March 2020. An announcement regarding the 2020 edition will be made this summer.\n\n\nThe Museum of Modern Art (MoMA) in New York is preparing to welcome visitors back to the institution in early 2021 with the announcement that it will rebrand the show from “Modern Art” to “The Future Is Now” and introduce an all-new program that will begin in October 2021. The move is part of a broader plan to reshape the museum, which has faced mounting criticism for not committing to maintaining the eighty-five-year-old building in a way that would preserve the institution’s intellectual, technological, and financial resources", "The next Biennial should take place in the summer of 2021. The real question is not whether the museum will survive, but how long it will survive. The answer, as it stands, is that the institution will come under further pressure to shut its doors. It has already begun to feel this pressure. The current exhibition, “The Future Is Present,” has just wrapped up its third year. While the museum was closed this spring because of Covid-19, after its spring opening it announced that it would reopen to the public in September. The exhibition, which was inspired by a conversation with Durrell Merritt, a contemporary artist, was staged in conjunction with the exhibition “The Future Is Present: From Art to Politics,” which was staged at the Museum of Modern Art in New York earlier this year.Both exhibitions were inspired by the themes of our time: whether we are reminded of our place in the world through art or politics. In the case of “The Future Is Present,” the museum selected art from a range of fields—including design, performance, and architecture—to explore the idea of presence, the possibility of self-movement, and the ambiguity of place. In the case", "The next Biennial should be held in the year 2020. The 2019 Biennial was held at the Palazzo delle Papesse, on the Campus delle Papesse, in Venice. The 2020 event will be held at the Museo d’Italia in Rome and will be presented by the artist Villeneuve-Montil. The seventy-one-year-old artist will receive a commission to design an exhibition space for the event. In February, a public petition on change.org that has garnered more than 1,400 signatures calling for an end to the Biennial was launched. In support of the petition, the artist wrote: “The 2020 show has made me realize that I am not alone. Artists of my generation are doing the same things as I am, but in a different way, for a different audience, and I am not the only one.”\n\n\nThe Center for Art and Public Policy at Columbia College Chicago (CCOC) has launched a new initiative that will assist artists in financial need by providing them with free studio time and housing. The program, called the Artist Payback Fund, will offer up to $3,000 for individual artists and up to $5,000", "The next Biennial should take place in the spring of 2022.The museum hopes to draw a total of twenty-five thousand visitors to the event. \n\n\nLONDON—The British government is allowing the Israeli Museum of Antiquities (IMAM) to open in Jerusalem, marking the first time this country has granted an international cultural center the permission to build in the city. The decision has been made after British Prime Minister Boris Johnson signed a bill into law on February 18 that allows the institution to begin construction of an observatory and museum in the Old City.The move comes amid heightened tensions between Israel and the United States following Donald Trump’s inauguration and following months of anti-Israel protests across the United Kingdom. The British prime minister announced the legislation in a televised speech and signed it into law after touring the northern West Bank, which is home to some eighty thousand Palestinians, in a New York Times interview on January 31.The move allows the museum to begin the construction of the observatory “Area C”—a designation that distinguishes parts of the Old City, including the Al-Aqsa Mosque, from the rest of Jerusalem and prevents visitors from entering the Old City. The museum will also display twenty-four artifacts that are housed", "The next Biennial should be held in 2020. “After referring to the multitude of institutions that have hosted the delectable exhibition, the twentieth exhibition should be the last,” said Hiromi Ito, director of the Fukushima Biennial.  The sixty-fourth Biennial of New York is currently on view until October 8. \n\n\nThe Institute of Contemporary Arts (ICA) in Beijing has received a gift of more than ten thousand artworks from collector Kamel Salloum, who also owns the private art museum Guggenheim China, from the royal family of Bahrain. The gift includes a collection of works by artists such as Arafat al-Kasasbeh, Alia al-Hadid, and Youssef Al-Qasimi, as well as a selection of works by the Kuwaiti architect and theorist Abu Ubaidah, the Kuwaiti novelist Maha Hasina, and the Kuwaiti artist Raad Shaikh, among others.“The gift comes at an important juncture for Bahrain, which is grappling with the aftermath of the Arab Spring. Since the Arab Spring began with protests against corruption and police brutality, Bahrain has been facing", "The next Biennial should focus on “An Inquiry into the Future,” a 2016 exhibition that explored the theme of the exhibition by using a collection of fifty thousand artifacts from the museum’s collection. The series will also consist of a performance of the exhibition, which will take place at the Museum of Modern Art in New York from October 19 to October 21, 2020, and will include a selection of short films made in the theme.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Julie Margolis as its next director. Margolis comes to the institution from the New Museum, where she has served as deputy director of development since 2015. She succeeds Edward L. Montoya, who was hired as director of the Solomon R. Guggenheim Museum in 2017, and will take the helm from Richard Armstrong, who retired after twenty-six years as director in December 2019.“Julie is a visionary leader of a great institution whose scholars and staff have built an extraordinary collection over a twenty-five-year history, and who represents a deep and wide-ranging range of perspectives and experiences,” said Guggenheim director Daniel H. Weiss. “Her elevation to the senior leadership role reflects the G", "The next Biennial should be held in 2022. The opening of the exhibition was delayed due to the outbreak of Covid-19. A further exhibition, “Awarding the Natural,” will open in the basement of the museum in 2022. The Biennal was founded in 1974 as a place for the exchange of ideas and information among scholars, and its inaugural exhibition, “The Nature of Things,” was organized by the visionary artist and curator Huyghe Gyatso in collaboration with the Dutch artist and curator Geert Hof.The Biennal’s collection comprises more than 1,500 works, and it is the home of the works of more than fifty other artists and collectors. The exhibition, “Awarding the Natural,” which was a part of the exhibition “(‘Exhibit/C) (’70’s’s’s’s), is the first in a series of exhibitions organized by the Museum of Contemporary Art (MoCA), New York, the Museum of Contemporary Art, Los Angeles, and the Metropolitan Museum of Art, New York; “Assemblies: Between Painting and Drawing” is a solo exhibition of", "The next Biennial should focus on sexual violence and the body, and should aim to: “ensure that the art of the twentieth century is created in harmony with modernity.”\n\n\nOn Saturday, artist and curator Sergi de Sousa, who helmed the exhibition “Anomalisa: Contemporary Art in the Twenty-first Century” at the Russian State Museum of Fine Arts (MUSE) in Vladimir, was also detained in connection with the 2019 hijacking of a plane by a group of men in a gray minivan; the incident happened on December 29, 2016, shortly after the Museum of Contemporary Art (MCA) in Saint Petersburg announced its reopening.According to the Art Newspaper, the men who hijacked the plane were arrested in Egypt on December 25, but were later released without criminal charges, and the Museum of Contemporary Art in Saint Petersburg confirmed that they will investigate the incident further.After the hijackers were identified, the men were detained by the Egyptian authorities on December 29. Unlike the MCA, the Museum of Contemporary Art in Saint Petersburg did not expel the hijackers from the premises.“We have been closed since December 27, and we were considering the possibility that the MCA would open on January 11", "The next Biennial should be held in the fall of 2020. The theme of the exhibition will be “Art as a Social Phenomenon.” The first edition of the Global Art Biennial, held at the Art Institute of Chicago in 2003, featured work by fifty artists from thirty-six countries. In 2006, a second edition of the show was staged at the Art Institute of Chicago. The global exhibition was organized by artist-in-residence Sembeneke Dijkstra.\n\n\nThe Hong Kong–based Hong Kong Foundation for Contemporary Art has canceled its 2020 edition, scheduled for March 31, citing health concerns, the New York Times reports.The Shanghai-based organization, which was set to stage the first edition of the Hong Kong International Biennial in September 2020, said it was forced to cancel the event after the  Network for Contemporary Art (HoCA) in Tokyo canceled the 2020 edition of the Biennial on March 9 and declared that it would move the event to March 23.The announcement led to both a severe financial loss for the organization as well as a delay in the event’s opening, which was originally scheduled for July 28–July 30. The organizers are now hoping to reschedule the event for 2020", "The next Biennial should be held at least once every other year, in order to allow for a cumulative return and a revitalization of the museum. It should include a special exhibition dedicated to the life of the artist and a substantial project for the collection of the artist. It should also be able to avoid a disruption to the activities of the museum due to the construction of a new building.In the meantime, the museum is preparing to reopen in October 2021. Among the works on display are Nino Dini’s “The Five Body Problem” (1957); Lionel Aitken’s “The Man in the Window” (1957); Sara Bennett’s “The Rope in My Step” (1963); and Elizabeth Bishop’s “The Message from God ” (1967).\n\n\nThe National Gallery of Art in Washington, DC, has created two new advisory roles for artists. The institution will create two consulting positions that serve as liaison to arts and cultural groups and as advisors to the National Endowment for the Arts (NEA) and the National Endowment for the Humanities (NEH).“The National Endowment for the Arts and the", "The next Biennial should be held at a location that has a current exhibition of work for the first time. The exhibition should consist of no more than twenty-five works selected from a catalogue. “One of the greatest challenges in the biennial is to create a space that is accessible to everyone,” Allen said. “The Prize will serve as a platform for the artist to participate in a cross-disciplinary and international festival of arts, to reexamine the themes of his exhibition and to engage with the cultural and historical heritage of the city of Chicago. They will also receive a prize of $10,000.”The biennial will run from March 16 to March 18, 2020 and will include seven artists: Amie Suttie, Teela Swain, Allison Hunter, Bethany Whittle, Ravi Gupta, and Zulfiqar Ali Khan. Additional artists will be announced in the coming weeks.\n\n\nThe Bechdel Test, an annual literary critique show that has run since 2002, has announced it will not resume its “Mathematical Equations”—a.k.a. the annual discussion about the ideas, art, and aesthetics of mathematics—in solidarity with the Women’s", "The next Biennial should focus on the history of the exhibition’s theme 'modern life and art: the theatre and the film'\u0097a legacy of which James McKean-Dixon, the director of the National Gallery in London, intends to refocus the exhibition in the coming years.”\n\n\nThe Metropolitan Museum of Art (the museum) in New York has commissioned the Italian artist, architect, and landscape artist Giampaolo Cattelan to create a new exhibition marking the centenary of the Italian artist’s birth. Titled “Giampaolo Cattelan: The Art of Ground,” the exhibition will examine how the artist extended the work of the late Italian architect Ado Blagdon, whose polyester resin works are often linked to the late Italian designer Paolo Baratta, and will include work by artists such as Alessandro Michele, Luca Prada, and Alfred Stieglitz; architects such as Daniel Libeskind and Filippo Cattelan, whose limestone structures are often incorporated into works that will be the subject of exhibitions; and artists such as Giambattista Vico and Frank Gehry.The exhibition will be curated by Michael Dewitt, who", "The next Biennial should take place in the spring of 2020.\n\nThe Whitechapel Gallery in London has announced that it plans to move the exhibition from its current location in the city’s Regent’s Park to a new space in the city’s St Andrew’s Anglican Church. The new venue will be called the Max Mara Centre for the Arts and will be inaugurated by an installation of work by the artist Marian Anderson, Exhausted, in the gallery on September 27. Anderson, who is based in Brooklyn, New York, and has had work shown at the exhibition space, the Gallery at Lincoln Center, and the British Museum, London, since 2002, will serve as the special guest artist of the new venue. “Marian Anderson’s work is an inspired reflection of her own contemporary world and of the rich and expansive world of contemporary art,” David Wallechinsky, cochair of the Max Mara Centre for the Arts and director of the Center for Contemporary Art at Lincoln Center, said. “Her installation of Marian Anderson’s life and work in the Max Mara Gallery in London is the most important work of a long-lived artist, and the", "The next Biennial should be held at the museum in 2021.\n\n\nThe New York City Department of Cultural Affairs (DCLA) filed a suit against Gagosian today in federal court in Manhattan, according to The Art Newspaper, over the upcoming exhibition “Between the World and Me: Art of the Late September Period” at the gallery, which was founded by the artist Auguste Merak in 1932.The department alleges that the institution failed to inform the public of the twenty-three-time winner of the Prix d’Art Contemporain (1924) for the second consecutive year, and that the omission was “particularly egregious” because of the September 11, 2001 attacks. The suit also claims that Gagosian failed to inform the public of the current state of the exhibition and that it intends to sue the gallery for $2 million.“The city is demanding that Gagosian make a genuine effort to address the public’s concerns, and to act in good faith and in good faith within the legal requirements of the city,” attorney general Eric T. J. He said. “At the same time, the city is demanding that Gagosian cover the shortfall by making the payments it promised and", "The next Biennial should be held in 2022.\n\n\nArt Basel Hong Kong is planning to open a new physical space in the company’s headquarters in the city of Wuhan in 2020. Located in the Raffles Building, the new exhibition space will offer around twenty-five thousand visitors an exciting new story-driven experience.“We are delighted to announce the opening of a new Digital Area, which will be inaugurated in Shanghai on October 20, 2020, with a special short-list show,” said David Johnston, the global director of Art Basel. “The Digital Area will be a collaborative space where the artists that have expressed an interest in exhibition space can present their work and will include an international audience. The activities of the Digital Area will be similar to those that were offered in the Biennial in Hong Kong.”The Digital Area will be powered by Art Basel’s world-leading software, ArtViewer, and will be centrally located in the exhibition space. The Digital Area will be powered by a new two-way system that will deliver live content from the collections of the four Art Basel partners: Antenna, Art of Modern Life, CARIC, Gallery92 and the KUNG F", "The next Biennial should take place in the autumn of 2020, and the first in the spring of 2021.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has opened two new locations for the Museum of Modern Art (MoMA) and the Museum of Modern Art Research. The institutions will be inaugurated on Friday, September 14, 2020, with a private premiere of the greatest work of the twentieth century, Bertolt Brecht’s “V/O” at the Hirshhorn. The exhibition will include three exhibitions: “Victor Brecht: V/O” (September 2020), “Bertolt Brecht: ‘I’ve Been to Rome’s,” and “The Plastic Garden.”The new places will be inaugurated in the first exhibition, “Victor Brecht: ‘I’ve Been to Rome’.” The exhibition, which will feature forty artifacts from the artist’s studio, will run until November 21, 2020.The exhibition will introduce the new venues to the public through a series of interactive activities, including a retrospective of Brecht’s work in 2020, “", "The next Biennial should be held in 2021. The deadline for the event was changed due to the ongoing conflict in Iraq\u0097the festival was originally scheduled to begin in 2018.\n\n\nThe Four Seasons Hotel and the Metropolitan Museum of Art in New York have announced that they will cease operations as part of a partnership that dates to 1999. The move is in the partnership’s best interest to the museums, which were already targeting the end of the year.The two institutions were already planning to close their doors in early March, but a change of plans due to the ongoing conflict between the United States and Iraq led them to postpone the scheduled closing of their doors.“I’ve been a museum man for thirty years and have supported the Met through a partnership that has taken place between the institution and the government of New York City since 1999,” said William C. Dietz, the director of the Met and the former director of the Whitney Museum of American Art, who has been involved with the partnership since the 1970s. “I’ve always believed that the partnership between the museums was a good thing. I’ve supported the Met through tough times by ensuring that when the museum reopened it was still in a state of great repair", "The next Biennial should be a celebration of the biennial as a whole, and the work of the artists involved. We should support the work and the work of the artists that are represented, and be inspired by the visionary young artists who have made such a difference.”\n\n\nThe National Gallery of Canada has received a donation of $5.2 million from the private and public sectors to help strengthen its collections and increase its staff numbers. The gift is part of a $25 million plan to increase the number of its staff through attrition and retention. The institution is also working on a restructuring that will increase the amount of time that the museum’s main exhibition space, the Gallery for Contemporary Art (GCA), will be open to the public.The plan includes the hiring of 120 new positions, bringing the total number of staffers in the GCA to 225 by 2021. The museum also said that it will consider reducing the hours of some of its most senior staff, but only if it does not have to close its doors permanently.“The GCA has been through a period of profound change,” museum director and CEO Raja Krishnamurthy said in a statement. “Over the years, we have made tremendous progress in our efforts", "The next Biennial should aim to introduce new issues and a new narrative that will reflect on the history of the museum and of the city, as well as the ways in which the artwork and design of BAY can define a critical moment in the history of art and design.”The inaugural edition, “100 Years of Art and Design,” was held in London in 2017. The biennial, which included work by twenty-eight artists, including Richard Avedon, Alison Haig, Peter Cook, and Rirkrit Tiravanija and was curated by Paul Gromacki, featured works by a diverse group of international and emerging artists, including Kiki Smith, Emilio Lecuente, and Michael Rosenblum.Wang is the founder of the London-based gallery and museum, Alsop Contemporary, and is a member of the CUNY Graduate Center’s curatorial committee. He is also an artist represented in the 2019 Whitney Biennial.\n\n\nThe Peabody-Essex Museum of Art in Salem, Massachusetts, has appointed Susan Oxtoby as its next director. Oxtoby will take up her new post on January 18. She succeeds David McAllister, who will remain involved with", "The next Biennial should be held at a location that will facilitate the exchange of local art and ideas, as well as the development of a significant collection of work by local artists, with an eye to the future, with an emphasis on the cultural exchange of the arts. We are currently considering several sites and the timeline for the next Biennial is still in flux.”Though the decision to cancel the exhibition was made by the organization, this is not the first time the museum has considered moving the exhibition. It was also asked to postpone the exhibition, which was due to open in August 2019, by a month, and the institution canceled’s 2019 edition in March.The event will now be held in September and will take place at the Museum of Contemporary Art Detroit (MoCA). The decision to move the exhibition was made after MoCA board chair Anna Pape, chair of the board of trustees, and Detroit native James Turrell, a Mellanby, Georgia native, raised concerns about the exhibition’s placement in the city. They cited the exhibition’s exhibition “The Rooms,” which is on view in a different location, as the reason.The exhibition was chosen for its universal themes of architecture and architecture", "The next Biennial should be completed by March 2022.”The exhibition will be organized as follows: The Analog Workshop: First-Person, Title Architectural Experience, Art), The Analog Workshop: Futurist, Title Architectural Experience, Art) The Analog Workshop: Contemporary, Title Architectural Experience, Art)\n\n\n\n\n\nThe British artist David Hockney, whose daring and often surreal installations combine earth, water, and fabric, died on Monday in London. He was seventy-three years old.Born in London in 1930, Hockney studied at the School of the College of Art, London, before moving to his native Kent, where he worked in architecture before joining the Royal Academy of Arts. He studied under Robert Irwin at the Academy of Fine Arts in London, where he met his wife, Susan, and their son, James. They became a couple and have three children together.Hockney’s work has been collected by the Tate, the National Galleries, the Serpentine Gallery, and the Tate Britain, and he was represented by David Karp, who represented the artist in the 1960s, and the artist’s sister, Jo Casteel, who represented Hockney in", "The next Biennial should be held in 2020 and will explore the history of Japanese art and culture in the context of contemporary issues and themes, including the relocation of artworks to the United States in the postwar years. The theme, “Coming of Age,” will be accompanied by text by artist Riko Murai and Cindy Sherman. \n\n\nThe Museum of Contemporary Art (MoCA), London, has appointed Elizabeth Blagdon as its new deputy director for collections and exhibitions. Blagdon will be responsible for overseeing the curation and development of the Museum’s collection of modern and contemporary art and will be responsible for creating and managing the Museum’s partnerships.“In this challenging political climate, it is vital that MoCA remains an independent and talented institution,” said Blagdon. “I look forward to working with the team, and building on the unique strengths of the Museum of Contemporary Art as a new centre for art and culture in the heart of London.”Blagdon comes to the museum from the Institute of Contemporary Arts, London, where she has served as the department head of contemporary art since 2014. She succeeds John Cawley, who is retiring after ten years at the helm", "The next Biennial should aim to create a new and more inclusive environment for the exhibition of contemporary art, which will focus on the work of women, underrepresented, and underrecognized artists. The architecture of the exhibition should incorporate a more interdisciplinary approach, with the aim of increasing the participation of women and people of all ages.”In its first edition, the show was canceled after a woman claimed that a representative of the museum asked her for her number and asked her to pose as a customer. The woman also alleged that the museum failed to inform the public about the cancellation and that she was the only one who canceled the exhibition. In March of 2019, the museum paid the woman $10,000.\n\n\nThe National Gallery in London is facing a legal complaint from a group of artists who claim they were unlawfully denied the chance to present a solo exhibition at its upcoming event, “The Last Tango in Paris.” The group, which comprises thirty-nine artists from Northern Ireland and the Republic of Ireland, submitted a formal complaint to the museum on May 28.“The National Gallery is committed to ensuring the museum’s exhibitions and collections reflect the diversity of our communities and are accessible to a wide and diverse audience,” director", "The next Biennial should be held sometime next year. In the meantime, the Museum of Contemporary Art in the Arts (MCA) in Los Angeles has introduced several new exhibitions and a number of programs designed to advance the work of contemporary artists. Those events include the exhibition “Anton Kern: Death in the Making,” which opens in February, and “Amarzia Catellani: The Fourteenth,” which opens in October. The biennial will run from October 18 to October 21, 2020.\n\n\nThe Carnegie Museum of Art in Pittsburgh has received a gift of more than 1,500 photographs from the late Cate S. Carter, the former director of the Baltimore Institute of Art (BIA) for American Art. Over the course of her career, Carter collaborated with many of the great American photographers. Among her many notable collaborations are with John Metcalfe and David H. Koch, who provided the foundation of the Institute; with Betty Kayne, who helped develop the photography program at the Museum of Fine Arts, Houston; and with Paul Gauguin and Jean-Luc Godard, who helped shape the BIA’s 18-year-old art program.“Cate’s", "The next Biennial should take place in 2020, at which time the institution will have completed its expansion project, the museum is planning to create a new location in the city of Salone, and aims to have a permanent collection of more than 3,000 works.The museum has faced various setbacks in the past, including on the eve of its inaugural exhibition, “Kino,” in 2019. The exhibition was originally scheduled to open on March 23, but due to the coronavirus outbreak, it was pushed back to April 5. In June 2019, the museum closed to the public, and its next exhibition, “Gleb: The Black Russian Gaze,” was canceled.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Hameed Akram as its new deputy director. He will be responsible for coordinating the curatorial, development, and execution of the museum’s eight-year-old master plan, which aims to establish a new cultural identity around New York’s Metropolitan Museum of Art, the Museum of Modern Art, and the Metropolitan Museum of Art.“We are thrilled to welcome Hameed to MoMA,” said museum director Robert M. Rosso.", "The next Biennial should be staged in 2021, but the festival is currently negotiating with the state government to postpone the event. The decision to cancel the event has been made in conjunction with the commissioning of a new set of European guidelines for biennial exhibitions. The guidelines, which were published by the European Parliament in April, outline the optimal production methods for exhibitions, how the exhibition should be organized, and the question of whether a biennial is a good idea at this point. The biennial will be the longest exhibition in the history of the European Union, and will take place in the heart of the former Neuer Kreuzberg, which has been under construction for more than twenty years. The exhibition’s designers, Willem de Kooning, Pawlio Hrabal, and Alexander Lidendorfer, will collaborate with thirty-three artists, including Hildegarde Duane, Piet Mondrian, and Kao, in the exhibition’s first exhibition in the new venue, which will be housed in the city of Bremerhaven, Germany, in 2021.\n\n\nA new exhibition of work by fifteen artists, including Andy Warhol, David Salle, Andre Gide, Ed Moses, Dennis O'Keefe, Peter Suter", "The next Biennial should focus on how to better address climate change across all its forms, from climate justice to climate politics. It should also continue the work it started in 2004, when it shut down the museum in protest of its trustees’ decision to sell off its assets.“I’m looking forward to working with the museum’s artists, staff, and patrons, to develop a new program that can better serve these troubled times,” said John King, director of the San Francisco Museum of Modern Art.\n\n\nThe École des Hautes Études in Paris (EHEP) has appointed Amara Antosca as its new director. Antosca, who currently serves as the director of the University of Next-Ditch in Geneva, France, will assume her post on January 6. She succeeds Christine Heger, who has served as director of the Palais de Tokyo (East), since February 22.“The École des Hautes Études is one of the oldest and most prestigious arts institutions in France,” Antosca said in a statement. “Both Amara and Christine have been dedicated to supporting the École des Hautes Études in Paris and to building", "The next Biennial should take place sometime between May 31 and August 5, 2020. \n\n\nThe Department of the Interior has issued a statement regarding the ten-year-long commemoration of the Black Lives Matter movement. “The department’s longstanding commitment to supporting the work of local, state, and federal governments in recognizing and countering anti-black racism has never wavered,” said Secretary Ryan Zinke. The statement concludes with a call for all Americans to “come together as one people.” Zinke’s comments come amid the ongoing protests sparked by the May 25 killing of George Floyd by Minneapolis police officer Derek Chauvin. The unrest has had bipartisan support across the United States, where activists have been galvanized by a series of high-profile incidents in which police have used excessive force, killed a black man, and killed a woman.The Black Lives Matter movement has faced off with the American Civil Liberties Union (ACLU), the NAACP, and several states’ defense of Black Lives Matter legislation, known as the so-called 'Rightful Place Acts,' while also facing off with activists in defense of Black Lives. On Saturday, thousands marched in defense of Black Lives in New York, Atlanta, St", "The next Biennial should take place in 2020. During its inaugural exhibition, Celebrate, the museum reopened its doors to the public on January 20, 2021 to introduce a new collection of French and European art, curated by Jean-Pierre Berger. Next year, the biennial will present the first retrospective of work by artists from the Bénédicte Pica Foundation, in Paris, the Bénédicte Levelange in Berlin, and the Galerie Luise Alberts.\n\n\nThe Teddendorfer Art Museum in Vienna, which has been closed since February 18, has postponed the upcoming edition of the exhibition “The Last Days of Europe,” which will be held at the museum until August 18. The exhibition, which was originally scheduled for August 15–August 19, has been postponed twice since the pandemic began. The first time, in July, it was originally slated for August 21–August 23. The second time, in August, it was originally scheduled for August 13–August 20. A third and final round of postponements followed in September.The news comes three weeks after the museum revealed that it expects to be closed for a minimum of nine months. The announcement was made after the", "The next Biennial should open on September 1 and will be hosted by the Museo de Arte Contemporáneo in Madrid. The exhibition, which will highlight the work of emerging and established artists and will take place in the same space as the National Museum of Modern Art, will be curated by artist and curator Georgia Ostrander and will be led by director Andrés Rodríguez.Rodríguez told the Art Newspaper that the Basel Biennial has not experienced a surge in interest from international galleries and institutions as a result of its decision to remove the works from circulation. “That was a mistake,” he said. “We have always maintained that the works in the collection were previously undiscovered, and that they could have been discovered again.”Gass and Rodríguez’s list of works that have previously been discovered includes the work of David Salle (2017) by Richard Avedon (2017), the Temescalero (2008), and the Nude (2017), which were previously undiscovered and only recently added to the public’s collection.The next Biennial, which will run from January 31 to March 6, 2022, will feature forty works by twenty", "The next Biennial should be held in 2021.\n\n\nThe Philosophical Society in London has announced that Nari Ward has been appointed as its next chair. Ward will be based in New York but will have the opportunity to travel to South America or Europe. In her new role, she will be responsible for spearheading a number of initiatives, including the New Art for Africa and South America project, which aims to increase the visibility of works by African artists, and the Art of Presentation program, which will focus on presenting contemporary art.“Nari has been instrumental in shaping the next generation of American artists, and we are eager to work with her to further expand our knowledge of and appreciation of their work,” said Sanjeev Gupta, chairman of the board of trustees. “Nari’s knowledge and expertise make her a strong fit for the role of chair and we look forward to working with her to further develop our engagement and understanding of their work.”Ward was selected from a shortlist that included Amira El Fadlallah, Sargent Mary Beard, Guy Fawkes, Jane Goodall, and Louise Nevelson, who was nominated for the Nobel Peace Prize. Ward is the founder of the New", "The next Biennial should focus on issues of local and international exchange, including the possibilities of opening up the exhibition to guests from neighboring countries. It should also include the development of a digital platform that will allow the public to interact with the exhibition, which will be curated by a select group of artists, and the exhibition should be opened up to the public on a regular basis.”The full list of participating artists is as follows:\n\n\n\n\nArt Basel Hong Kong will hold the first edition of Art Dubai, its new global event that will take place in the UAE from August 27 to August 30. Curated by Samir Ali, the founder of the Beirut-based nonprofit Art Guardians, the biennial will focus on showcasing the international works of locally based artists, and will debut at the iconic Terrace Gallery in downtown Hong Kong.Dubai-based artist Ai Weiwei, a longtime collaborator of Samir Ali and a cofounder of the Beirut-based non-profit Art Guardians, will provide the theme of the 2020 edition, which will be titled “All in a Day’s Eye.” The exhibition will include works by fifty-four artists. After an initial public preview at Art Dubai in March, the show will present its full collection", "The next Biennial should be held in the first quarter of 2020, and the Southern California artist-run exhibition will return in the second quarter of 2021. According to Oramo, the cost of staging the event was a challenge for the museum, which has already put the program on hold due to the Covid-19 pandemic. “The art can't just be distributed for free, it has to be reproduced in a meaningful way,” he said. The museum will also be paid to host one of the biennials, which will be organized as part of the institution’s yearlong celebration of its 150th anniversary this fall. While the museum previously hosted the exhibition that same year, the exhibition was canceled due to the Covid-19 pandemic.\n\n\nThe Metropolitan Museum of Art in New York has purchased the works of artist R.H. Andrews, a prolific painter of abstract geometric forms, from Sotheby’s in an attempt to secure his long-term future. The Met on Friday announced that it is the latest major arts buyer to make a major investment in the artist’s portfolio. The auction, which was held at the gallery’s New York outpost, marked the end of an eight-", "The next Biennial should be held in 2021. The next once-in-a-lifetime trip to the museum should take place in 2021. The next exhibition of the Museum of Contemporary Art (MCA) art should be held in 2021. The next exhibition of American art should be held in 2021. The next museum dedicated to African art should be held in 2021. The next museum dedicated to the exploration of the African diaspora in the United States should be held in 2021. The next museum dedicated to African art should be held in 2021. The next museum dedicated to African art should be held in 2021. The next museum dedicated to the African diaspora in the United States should take place in 2021. The next exhibition of art from Africa should be held in 2021. The next museum dedicated to African art should be staged in 2021. The next museum dedicated to the African diaspora in the United States should be on view in 2021. The next museum dedicated to African art should be staged in 2021. The next museum dedicated to African art should be on view in 2021. The next museum dedicated to African art should be staged in 2021. The next museum dedicated to the African dias", "The next Biennial should take place in Oslo in 2021. The collection will then feature works in a wide range of media. An exhibition of pieces in the exhibition will be held in 2020.\n\n\nThe nineteenth edition of the Bienal Biennales in Miami Beach, Florida, has announced that entries from the Los Angeles–based collective are now eligible for a $50,000 prize. The announcement follows April 2’s announcement of the twenty-fourth edition of the Bienal Chicago and the twenty-third and twenty-sixty-ninth editions of the Bienal Los Angeles, Bienal New York, and Bienal Tokyo.The prize, which was established by the Los Angeles–based artist and collector George Bienal, will be awarded in partnership with the Los Angeles–based nonprofit Beyond The Bienal. The $50,000 prize will be awarded in partnership with artists, organizations, and institutions that participated in the exhibition. The seventy-ninth edition of the Bienal Miami Beach will take place in May.The biennial, “The Case for the Bienal,” will run from March 14–March 20, 2021. The full list of participating artists can be found on the exhibition", "The next Biennial should come in 2020, and the exhibition should kick off with a lecture by artist Doa Seo-kyung, who was one of the main organizers of the exhibition “Biosocialism” (2016), and be followed by an extended retrospective of the work of Ana Mendieta al-Khan in 2021.The next exhibition of the newly established company will be “Our World, Our Future: Art and the Recent Struggle” (2019), which is curated by director and curator Thomas K. Lee. The exhibition will feature artists such as Tanya Bonakdar, Terje Jonsson, and Michael Kwan, and will be held at the National Museum of Singapore in Singapore through September 20, 2020.\n\n\nThe New York–based nonprofit the Center for Art and Innovation (CAAI) has announced that it will award $12 million to twenty-four artists this year. The recipients are Amina Hatoum, Hisham Alsham, Ali Hatoum, Youssef Kheir, Tarek Atoui, Jawad Asiri, and Saleem Akram.CAAI was founded in 2017 by Bill Davis, Tom Friedman, and ", "The next Biennial should take place in 2021 and will be organized in collaboration with the Museum of Modern Art (MoMA) in New York. The theme of the exhibition is “The Body in Art.” The museum will be holding a workshop on the exhibition in May.\n\n\nThe Yale Center for British Art (Yale C.B.A.M.) announced today that Guadalupe Albizu, a curator in the department of modern and contemporary art, has been appointed its next director. Albizu will assume her responsibilities in January 2021. “Albizu’s professional experience and ability to identify and prioritize the significant recent work of artists and to work with the museum’s collection and collection projects gives her the ability to help shape the future direction of the C.B.A.M.,” said director Lesli Klainberg. “This is a great year to welcome her to the department as we continue to experiment and think together in collaboration with artists, curators, and others in the field.” Albizu comes to the institution from the London-based NGO COPE, and spent ten years in the UK as a freelance curator. Prior to joining COPE, she was a freelance curator", "The next Biennial should be held in 2021 and the exhibit would take place in the city’s old Exhibition Building, which the biennial is named after. However, under the terms of the lease, the biennial has until now been moved to a third location, a non-profit museum in the city’s historic Park Viewing Place, which is currently undergoing a $3 million expansion. The new pavilion will be located in the city’s new and revitalized Portico, which will include a restaurant, a public garden, and other outdoor spaces. The construction of the pavilion and a new museum complex is expected to cost an estimated $9 million. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has cancelled a third exhibition in the series, titled “The Future Is Now,” due to the coronavirus, the second strain of the virus to ever be identified in the United States. The show, titled “The Future Is Now,” was supposed to feature twenty-one works by thirteen artists, including Adam D. Alvarez, Imane C. Sanchez, James H. Ooi, and Kelly Rowland, who are currently working on their first retrospective since the", "The next Biennial should be held at a local institution of higher learning in the city of Boston. The next Biennial will be an extension of the Paley Festival. The new event will be organized by the Boston Cultural Center (BCC), with assistance from the Boston Arts and Cultural Partnership. The biennial will take place at various locations across Boston, including the Boston Museum of Art and the Boston Garden, and will be held from March 19 to March 21, 2020. The first iteration of the event was held in 2022. The event was initially scheduled to be staged at the West Brighton Museum in Brighton, Massachusetts, but the project was put on hold last year when the Covid-19 pandemic forced the cancellation of the event. \n\n\nGlenn Ligon, director of the Museum of Art, Design, and Photography at the University of Minnesota, has announced that he plans to depart the Minneapolis institution in January 2021. He will be replaced by Suellen Sola, the current director of the Gallery at the University of California, Los Angeles, who will assume her responsibilities in January 2022.“I’ve known Glenn a long time and admire his work as a curator and educator,” Suellen Sola said", "The next Biennial should take place in 2020, the same year the exhibition will celebrate its thirtieth anniversary. “The Biennial in London is a seminal event in the history of art,” said Mark L. Sisson, chair of the trustees. “The exhibition was born from a request for different approaches to the development of art, and it has always been guided along these lines. The redesign of the exhibition is a continuation of that strategy.”The exhibition will engage with themes such as the history of modern art and how it is made in a particular setting, the exhibition “Towards a Modern Art History,” which will be staged in a central location in London, and will draw from a range of contemporary and historic sources as well as new and contemporary art. It will also include a number of exhibitions and special projects, including a new music program, a performance/lecture series, and a new digital exhibition. The full list of participating artists is as follows:Andy Ball, England/France/FranceAmericaTony Cuno, USAAmericaTony Cuno, USAAmericaDavid Chipperfield, USAAmericaDave Davies, USAAmericaNathan Davenport, USA/UKTanya Davenport,", "The next Biennial should be held sometime in the third quarter of 2020 and will be held at the Municipality Palace, Nara; Tokyo, Japan. \n\nThe Frankfurt Biennale has announced that it will now begin accepting visitors from Saturday, April 24, at 6 PM to 10 PM on May 5. The event will be hosted by the city of Frankfurt and will feature more than fifty artists, animated works, and installations. The installation will be the first of its kind in the European capital, and will be centered around the character Klaus Beck, who became synonymous with the word 'frenetic. This exhibition marks the first of Klaus Beck exhibitions in the United States since 1983. Beck, whose work is considered a precursor of the modern abstract, died in 1992 at the age of eighty-nine. His work was included in “The American Abstract” (1992), “Klaus Beck: The American Abstract” (1993), “Klaus Beck: A Retrospective” (1994), “Klaus Beck: The American Trip” (1995), “Klaus Beck: The Modern Age” (1999), “Klaus Beck: The Modern Experience” (2001),", "The next Biennial should be announced soon. \n\n\nRichard Avedon, a curator and educator in London, has been named the next director of the Royal Academy of Arts (RA). Avedon will assume his new post in January 2020. He succeeds Anne-Marie Taylor, who has served as director of the academy since 2011. Taylor will resign from her post in March 2020 to pursue a new career.Avedon was appointed as director of the museum in 2006. He served as RA’s director from 2011 until his departure in 2019. During his tenure, the museum received twenty-five international awards, including the British Association’s Tacita Dean’s Award for Outstanding Curatorial Practice and the British Museum’s Cooper-Hewitt’s Award for Outstanding Curatorial Achievement.Commenting on his appointment, Avedon said: “I have been privileged to work with the RA for many years and have seen it through a remarkable transformation under the leadership of Anne-Marie. The RA is an internationally recognised institution with a rich and diverse collection, a strong and active collection, and a clear institutional mandate to make a real difference in the lives of arts and creative professionals in London.", "The next Biennial should be held in the spring of 2021.\n\n\nThe Beijing Art Museum (Beijing Art Museum) has announced that it is planning to open a new exhibition dedicated to the cult of the late Chinese artist Cai Wang. The exhibition will mark the museum’s first direct collaboration with the Chinese government. The exhibition will feature works by fifty of Cai’s contemporary artists and will be organized as a biennial, alternating between China and Hong Kong. “Cai Wang is an extraordinary artist whose work carries a timeless and inspiring quality that is both beautiful and at the same time deeply relevant and relevant today,” said Wang Shuai, the museum’s director. “His work and creative life is full of energy and activity, and of the possibility of new and deep relations.”Cai’s works were exhibited at the Shanghai piece “Michael Kistner” (2015), and the Shanghai Biennale (2016) and at the Beijing Art Museum (2016); he was awarded the Golden Lion of the People’s Republic of China for his work in the exhibition “Young Man and the World” (2016); and he was included in the eighty-ninth", "The next Biennial should be held in 2020. \n\nPhotography by Rob Ryan’s first exhibition at the Center for Contemporary Art in New York, Oolite Gallery, will be presented this September at the Center for Contemporary Art. The program will be co-curated by Ryan and Elissa Rees. The show will feature work by twenty-three artists, including Adam Chinn, Leah Dachhorst, Brett Lee, Fanny Melton, and Louisa Pérez, and will run for twelve weeks.“I’m excited to further complement the work of the Center for Contemporary Art by organizing a series with a multi-disciplinary, multi-ethnic, multi-racial, and transgender-inclusive team,” said Ryan. “These artists are the most important pioneers in their respective fields, and their work is often ignored and underappreciated. We have to make sure that they are recognized and celebrated for their art, and their vision of how the future might look if they could’t.”The artists are represented by W. W. Norton, Chinati Gallery, and the Metropolitan Museum of Art.\n\n\nThe British design and cultural conglomerate Glimcher has", "The next Biennial should be held in the autumn of 2021, and the first in the spring of 2022.   The event will focus on the collaborative and collaborative work of artists, researchers, and institutions and will draw from the work of over one hundred artists from twenty-four countries. \n\n\nThe Albuquerque Art Museum (SAM) in New Mexico has received $7 million from the Association of Art Museum Directors (AAMD), the industry group representing the major art museums in the United States, in an agreement that will ensure long-term care of its collections. The funding is part of a new $10 billion plan to strengthen the fortunes of American museums and plans to be unveiled later this month. The AAMD-backed grant program was established in 2017 to ensure that museums receive at least $10 billion to protect and care for their collections and infrastructure, and to encourage the development of creative and public-serving projects. “This is an historic agreement that will ensure that the Albuquerque Art Museum continues to thrive for generations to come,” said Brad Adams, executive director of the American Association of Museum Directors (AAMD). “For more than two decades, AAMD has advocated for a stable, long-term plan for", "The next Biennial should be held in 2021. The first exhibition will be a retrospective of the work of David Salle. The Biennial will also return to the museum in 2022 and will feature the last works by the late artist.   Thank you for visiting our website.\n\n\nThe Museum of the City of New York (MoCA) has launched a virtual reality experience that will allow visitors to live out their favorite memories in a digital world. Titled the Diary of a Virtual Reality Adventurer (DVRA), the virtual reality video diary will allow guests to experience and interact with MoCA’s collection of 23,000 works of art, including works by artists, designers, and scientists.“The museum is committed to celebrating the life and work of the arts and is excited to launch a virtual reality experience that celebrates the important role VR plays in our culture and our city,” said MoCA director Jim Murray. “The DVRA virtual reality experience will introduce the museum to the life and work of Ting Abney, a pioneer in the field. The virtual reality diary will highlight the important moments of his life and career in order to inspire and challenge visitors to think about their own lives and works.”", "The next Biennial should be held in 2021. “It is with great regret and disappointment that we announce the cancellation of the 1921 Biennial Belgium, the twentieth of its kind, at the Boston Art Museum, the first of its kind, and the only one organized in a completely open-air setting,” said Robert Hulett, director of the Museum of Fine Arts, Boston. While the museum has not indicated whether it will stage the 2018 event, Frost, a descendant of the famed artist and collector Robert Frost, intends to organize the upcoming exhibition in conjunction with the museum’s reopening in 2021.Frost said: “The history of the exhibition is of great importance to me, as I am the rightful owner of the work of the contemporary artist David Salle. I have been involved in the exhibition since its inception and now use it as a platform to present new work in an effort to highlight continuities between artists in an effort to build bridges between contemporary art and art history.” The current exhibition, “The Three Gospels: Three Essays on Christmas,” which features a selection of works by artists such as Thomas Krens, Fred", "The next Biennial should take place in 2022 and will introduce a new line of programmes. \n\nThe Australian Council of Contemporary Arts (ACCA) has announced that the event will now focus on the history of Australian art from the Founding of the Commonwealth of Australia in 1901 to the Year of the Boat. The 2020 edition will explore the evolution and significance of the Australian archipelago from its nineteenth century beginnings, to its current state.The exhibition will also examine the current state of Australian art and the exhibition will grant $50,000 to any artist or curator who is selected as the winner of the 2019 Oscars for Drama and Media, Variety, or Media.Curated by Michael Platt, the director of the Institute of Contemporary Art at the University of New South Wales (UOW), the 2020 exhibition will celebrate the enduring legacy of Breman Estelle, the first indigenous woman to win the Nobel Prize in Art, and the contemporary art of the Pacific.Estelle, who first met Australian artist Wally Loveridge at an American Art Museum in Sydney in 1959, was nominated for the prize in 1969 after he painted  The Dreamer in a blue-and-white garden, which was one of the first works to be exhibited at the annual event", "The next Biennial should be held in 2021 and the first in 2022. \n\n\nThe Museum of Fine Arts (MFA) in Boston has released its list of the 100 most influential artists of the twentieth century. According to the New York Times, this year’s cohort comprises fifty-five artists, including Jean Piaget, Richard Anuszkiewicz, Robert Irwin, and Jean-Michel Basquiat. “Artists­* is a label for a collection of visual arts,” said James Fadiman, the museum’s director. “All of these artists contributed significant new work, and some of their most important exhibitions, but they are not counted together in the same year. It is about recognition that matters.” The list—which comprises fifty works from the field, including Jean-Michel Basquiat’s Body, 1963, a work that was exhibited at the 1963 Biennale of London; the documentary The Untitled (1962), which debuted at Artforum’s 125th anniversary; and several lesser known works—is part of the museum’s ongoing campaign to increase public awareness of the legacy of artists. Its exhibition “", "The next Biennial should commence as soon as possible.The exhibition will schedule a panel discussion with David Byrne on the exhibition between August 17-August 23. The curator of photography, Nancy Edmonds, will present the opening event. The show, titled Live From the National Gallery of Art, will face the themes of Social Justice, the Grand Illusion, and the Spirit World. Its third edition, which will take place at the National Gallery of Art in Washington, DC, will be organized by the artist and curator, David K. Johnson. The show will include work by twenty-seven artists and will feature work by artists such as Jack Hanna, Simon Kinberg, and Michael Hebert. The 2013 edition of the exhibition, titled Live From the National Gallery of Art (LGA), was organized by Marc Heller; his wife, Melissa; and Daniel Schuessler, the architect behind the project LGA2, which was completed in 2017, was curated by Walker Percy.“Life After Death is a project that combines the creative and social practices of David K. Johnson and Jerry Lee Lewis to present a historical evocation of the final days of Jonathan Lewis, Jr., as the Son of God,” said ", "The next Biennial should be held at the Institute of Contemporary Art in Rome in May 2020 and will invite artists from around the world to participate. The event will also be hosted at the Institute of Contemporary Art in London in May 2021 and at the Centre Pompidou in Paris in May 2022. \n\n\nThe Royal Society of Edinburgh (RSEE) has appointed Rosalind Nash as its new chair. Nash will be responsible for leading the academic, research, and outreach initiatives of the Royal Society of Edinburgh (RSEE), which was established in 1911 and grows to more than 1,500 members through its annual spring/fall meetings. She succeeds David Humphreys, who served as chair from 2018 to 2022 and was succeeded by his successor, David McAllister, in 2019.“It is an exciting time at the Royal Society of Edinburgh as we undergo a considerable transformation,” said Nash. “The new role of chair of the Royal Society means that I will be able to strengthen the RSEE and deliver on my promise to deliver a new scholarship programme and exhibition in 2021/22. I am also excited to work with the RSEE’s audience and engage with their interests in 2018.”Nash succeeds David Stroud", "The next Biennial should be held in 2019. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it will postpone a planned triple exhibition of works by Lee Krasner, J. Paul Getty, and T.J. Dill, scheduled for February 2021 and February 2022, respectively. The postponement was made after the museum received a letter from the National Association of Art Museum Directors (NADA), which stated that the cancellation of the upcoming exhibitions would cause “unacceptable delay and disruption” to the institution’s operations.The letter concluded with a warning that “[MoCA] will not be able to responsibly address these issues if it does not take immediate and immediate action.” In a letter dated February 8, the NADA said that it “has put forth many compelling and compelling arguments in favor of the future of exhibitions and programming at the museum, and in favor of continued funding of the museum. The letter and the cancellation represent a new, unprecedented vision for the museum, one that I believe will benefit the museum and the community for many years to come.” One hundred and twenty-nine museums and three thousand galleries have signed an open letter, signed by more than 3,400", "The next Biennial should open in the spring of 2022 and will involve a selection of work by thirty-two artists.\n\n\nThe fair’s executive director, Isabel Astrup, has resigned after telling the Danish newspaper Aftenposten that the event’s upcoming edition would be canceled due to the coronavirus. The Danish newspaper reports that the move was made on February 7, after the country confirmed that it had become the epicenter of the virus outbreak.The decision to cancel the exhibition was made on March 28, the same day that organizers of the annual art fair announced that they were relocating the event from Copenhagen to the city of Oslo. Organizers cited safety concerns as the reason for the move. “The future of the event is now in the hands of the Danish government,” Astrup said at a press conference in Aargæq. The move prompted outrage from cultural figures, artists, and politicians, many of whom criticized the decision, and many other countries, including the United States, Australia, Russia, and Germany, followed suit.As the number of coronavirus cases in Denmark skyrocketed, Astrup and other organizers of the fair faced backlash from a number of quarters, including activists and artists. Many criticized the", "The next Biennial should be held in Shanghai in 2021, the New York–based organization announced on Tuesday. The announcement comes amid a global health crisis caused by the coronavirus and the coronavirus-like illness called EV-D, which involves inflammation of the stomach and intestines.According to the World Health Organization (WHO), there are now more than 7.5 million cases of the virus and 3.7 million cases worldwide. In the United States, the number is expected to rise to 8.9 million by December.Advertisement\n\n\nThe Chakron Museum in New York has appointed Bénédicte de Montalès as its next director. In her new position, De Montalès will work with the Chakron team to construct and execute the institution’s new cultural center, which will be located in the Hudson Yards development, in Manhattan’s Little Italy, and will spearhead the institution’s partnerships with local, regional, and national arts and cultural organizations, including the Metropolitan Museum of Art, the Metropolitan Museum of Art, the Brooklyn Museum, the Bronx Museum of the Arts, the Bronx Museum of the Arts, and the Bronx River Walk. De Montalès, who has served", "The next Biennial should have taken place in 2020, but because of the coronavirus epidemic, organizers have postponed it. The 2020 exhibition will still be at the Guggenheim in the summer, but will no longer be curated by Kaj Kapp, the director of the Kunsthalle Basel. The exhibition will still be organized by Tadashi Endō, the director of the Museum of Contemporary Art Tokyo, but the 2019 edition will be held at the National Museum of Art in the National Museum of History (NMO), Tokyo.Nakamura will continue to work with his wife, Kajie Nakamura, on the exhibition, which will open in March 2020 and will have a running time of three hours and forty-nine minutes.Kapp told The Guardian that he expects the exhibition to draw a healthy audience. He noted that the Nakamura/Kapp exhibition is not a “serious” project and that he plans to continue working with the Torrance-based artist until the end of his life. The artist described Nakamura as a “career-ending” artist, and said that he left the workshop to “explore the possibilities of art through the lens of contemporary life,�", "The next Biennial should be the ’60s-70s, when the function will be to “re-create the landscape of New York’s Lower East Side,” according to Houston’s curator, Julie Roscoe. “In the process, we’ll be enacting a certain kind of urban renewal,” she said, “one that returns the world to its pre-industrial roots, one that embraces the infinite possibilities of the natural world.”“The biennial will be a celebration of the city’s rich visual and performing history,” Houston said. “It will also be a time to consider the legacy of the journalist Algernon Adams—a man whose adventures in reporting led the New York Times to publish his first article for a daily paper in 1924. His work has appeared in the biennial as well as in numerous books and exhibitions.”The commission comes on the heels of the Museum of Modern Art’s announcement earlier this month that it will open a museum devoted to the life and death of Pablo Picasso. The initiative marks the first collaboration between two museums in the United States in sixteen years. In January, the Museum of Modern Art", "The next Biennial should have a minimum of five artists nominated in order to allow the institution to keep the schedule of the previous years. The next one should be Saturday, March 13. The next one should be the 14th. The next one should be on Saturday, March 15. The next one should be on Wednesday, March 19. The next exhibition should be Saturday, March 22. The next show should be Wednesday, March 22. The next show should be Wednesday, March 28. The next show should be Thursday, March 31. The next show should designated Friday, March 24. The next show should be Friday, March 25. The next show should be Friday, March 22. The next show should be Friday, March 24. The next show should be Friday, March 28. The next show should be Friday, March 22. The next show should be Friday, March 26. The next show should be Friday, March 28. The next show should be Friday, March 25. The next show should be Friday, March 28. The next show should be Friday, March 24", "The next Biennial should aim to develop a new perspective on the cultural production of the twentieth-century. In addition to conceptualizing the retransmission of texts, the exhibition should include a discussion of the cultural production of the twentieth-century through the lens of the new media.”That there are still members of the Harlem Renaissance who reject the museum’s position that the institution was instrumental in their lives and work, is shown by the fact that the museum has yet to nominate a single person for the award.“In the past, this award has been bestowed by an intergenerational group of artists,” said museum director Michael Harris. “It has been a long-standing tradition, and indeed one of the themes of the inaugural Biennial,” he added. “That they are so unwilling to take the time to consider and consider the question of who shall receive this award is a reflection of their own narrow understanding of the meaning of this award.”\n\n\nThe James D. Alexander Center for the Arts (J.D. Alexander) in Salt Lake City has received a gift of seventy-two works by twelve artists\u0097including David Blaine, Charles Atkins, Larry Akomfrah, Mandy Gallo", "The next Biennial should be held at the city’s Civic Auditorium in 2021. Although the venue will be a renovation, the exhibition will still be organized as a public gathering space. The exhibition will consist of one hundred works by seventy artists, who are grouped according to their themes. The first season, “The Face of the Body,” will be held at the Civic Auditorium on August 3–August 6, 2021. The second season, “The Body of Photography,” will be held at the Institut d’Art et d’Urbain in Paris on August 10–August 12, 2021. The third season, “The Body of Painting,” will take place at the Royal Academy of Fine Arts in London on August 23–August 29, 2021. The fifth edition of the Palais de Tokyo in Paris will take place at the Palais de Tokyo on March 8–April 2, 2022. The sixth edition of the Palais de Tokyo in Rome will take place at the Palais de Tokyo on March 13–March 21, 2022. The seventh edition of the Palais de Tokyo in Cologne will be held at the Palais Des Nations in Paris on March 13–March 24,", "The next Biennial should be held within the next few years. Perhaps then, in collaboration with the hundreds of artists and scholars who have signed the Statement of Purpose, we will finally be able to put an end to the occupation and create an independent future for Palestine.\n\n\nThe Israeli government is preparing to demolish a Palestinian home built in 1948 but not yet demolished by Israel, in an attempt to make way for the construction of a new settlement. The municipality of Nablus in northern Palestine is now considering whether to grant the family of Ahmad al-Shalomi, a descendant of Ahmad al-Shalomi, the historic rights to their home, which is located at the northern end of the West Bank, the al-Quds Regional Council reported.The site of the structure is considered illegal under international law, and Palestinian Authority (PA) officials have repeatedly rejected requests for the demolition of the structures, which were built in 1948, in an attempt to obtain the return of some 2,400 Palestinian homes that were established in the West Bank prior to Israel taking control from Jordan in 1967. In an attempt to change the debate, former Israeli president Shimon Peres signed a law in 2017 allowing the government to take down historical structures, but it only applies to structures", "The next Biennial should be held in 2021, and the novel should be completed sometime in 2020. The exhibition will feature new works by around seventy artists. The Australian government granted $1.1 billion for the arts this year, and the biennial has been targeted by critics, artists, and arts organisations as an example of how significant investments can be made in Australian culture. Prime Minister Scott Morrison said: “I am truly honoured to be able to present this year’s Biennial in Canberra next year in the extraordinary circumstances of being able to travel to Australia from New York. I am confident that our artists and curators have brought their best work to this year’s exhibition and that it will stand as a model for future audiences.”\n\n\nA group of artists and collectors at the Centre Pompidou in Paris are protesting the retrospective of Jean-Michel Basquiat’s nude sculptures, which were imported from the United States, at the institution. The exhibition, “The Body in Space” (2019), will also include “An American Painter” and “Terence Blanchard” (2019).“The exhibition poses questions about art and its commodification,” Patrick", "The next Biennial should be held in the spring of 2021.\n\n\nThe University of Washington (UW) in Seattle has appointed Esmond Bradley as its next executive director. Bradley had been the associate director of the School of Art and Design (SAAD) in Seattle since 2016. Bradley began his tenure at the institution in July 2019. He assumed the role in February 2020.“Esmond Bradley embodies the qualities that make the UW region such a compelling and ambitious destination for talent and inspiration,” said Paul Cheyne, chair of the university’s board of regents. “These are qualities that are central to the future success of the institution, and we are confident that he will be instrumental in ensuring that we continue to attract and educate the world’s most talented students and continue to build on the legacy of the UW’s Art and Design Pavilion.”Bradley also serves as the director of the Seattle Art Museum. He joined the institution in 2018 as a curator of historical art, a position he held for fourteen months, and has worked as a curatorial assistant and assistant curator at the museum for the past three years. During his tenure, he curated “The History of the Chinese Art Museum in Seattle", "The next Biennial should take place in the fall of 2020. The twenty-third edition of the festival will be held at the Museo de Arte Contemporáneo in Lisbon. Organizers said that the theme of the upcoming edition will be “Eccentric adventures,” focusing on the artist’s most recent projects. The exhibition will include works from the artist’s archive.The Biennial’s inaugural edition was held in Milan in November 2018. The event drew 1,500 visitors, and included new works by eighty artists, including Isabel Millet, Kiki Smith, and Léa Seydoux. The festival has since been moved to New Delhi.\n\n\nAn exhibition of work by the late British architect and theorist Peter Daal, which opened in the Netherlands on Thursday, April 4, has been postponed due to the Covid-19 pandemic. Organizers have canceled the event in an attempt to conserve as much of the Dutch capital’s art as possible in order to avoid spurring further unrest over the country’s ongoing political crisis. “We have taken this decision in order to preserve as much art as possible in Amsterdam and at the same time, as", "The next Biennial should be held in 2021.  The institution will also be closed until March 28 due to the Covid-19 pandemic. Artist Ravi Prasad, who came to the Biennial from the American Contemporary Art Museum in New York in order to participate in the group exhibition “Feminine” in order to promote awareness of the ongoing work of female artists, will also be leaving the Biennial with his family next year. The closing of the Museum of Modern Art in New York City and the museum of contemporary art in San Francisco follows the recent closure of the Centre Pompidou, the Louvre, and the Museum of Contemporary Art in London.The British artist Paul Gauguin, whose art is based on a radical understanding of the organic in terms of relation to the surrounding landscape,  will also be departing the Royal Academy of Arts in London, with his wife and daughter, in March of 2020. He highlighted the importance of female artists, and their lack of male-dominated fields, in his work.  The announcement makes it the first major institution to cancel a major piece of work in the artist’s lifetime. The Tate’s decision to cancel a major exhibition of Gau", "The next Biennial should feature a selection of works by leading contemporary artists, including Stéphane Berger, Robert Irwin, and Tschapare Leutza. The returning artist-in-residence, Sheikh Hamdoun Ahmed, a Chinese American artist and activist, will serve as the theme for the biennial’s fifth edition, “We Live in a Different Place,” which will take up the theme of the festival, which is being organized by the Cultural Centre of the New York Museum of Art, under the direction of historian and curator Benjamin Krepinevich. The 2017 event, titled Art: Life in the Time of Crisis, was held at the Museum of Modern Art in New York. The last edition, which featured works by seventy-five artists, was staged at the Groundswell Art Center in Brooklyn on December 28, 2017.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Catherine Kreps, the senior curator of modern and contemporary art at the Smithsonian American Art Museum in Washington, DC, as its next director. Kreps comes to the institution from the Los Angeles County Museum of Art, which she has helmed since 2013, and will assume her post on March 23.K", "The next Biennial should start with a presentation of new art by a new artist each month, and should take place at the museum. It should also have a curriculum that will integrate local, national, and international teaching methods, and should present a selection of works by contemporary artists. The board of trustees also wants to establish a biennial of contemporary art by a new artist every three years. Esther Schipper, the board president, told the Art Newspaper: “We are in the process of a large-scale consultation with a huge group of artists and art historians from twenty-five countries to decide which of the thirty-two works by the most celebrated contemporary artists of the twentieth Century will be included in the biennial. We are in the process of a long-term research in the art of the twenty-first Century, which will include five hundred exhibitions each year.” The biennial will be hosted at the museum from March 19 to March 21, 2020. The full list of participating artists is as follows:\n\nDavid H. Bradley, Jr.\n\n\nEbony and American Art, 1933–1941.\n\n\nEbony and American Art, 1933–1941.\n\n\nNancy Lee Payne, The", "The next Biennial should focus on reconfiguring the biennial as an extension of the city’s cultural landscape, in recognition of the city’s rich and vibrant contemporary art scene. The museum also wants to engage more broadly with diverse audiences across the region through a series of programming that will hold events for people of all ages. “We are thrilled that the city of Calgary has endorsed this cultural initiative, and that it is so aligned with Biennial Calgary,” said city councillor and chair of the city’s cultural affairs committee, Kristyn Wong-Tam. “We will continue to work closely with the city of Calgary and city staff to develop and deliver a series of innovative programming that reflects the vibrant culture and arts of Calgary at this exceptionally important time.” \n\n\nThe Carnegie Museum of Art in Pittsburgh has named Jeffrey Gibson as its next director. Gibson, who has helmed the institution since 2013, will be responsible for managing the museum’s collection and exhibitions through 2026. He succeeds Marc Treib, who departed in February 2019 after a decade with the institution.“We’re thrilled about this appointment,” said Jeffrey Deitch, the museum’s interim director and chief executive", "The next Biennial should be held in 2020, but organizers are assessing the situation, and will present a revised version of the exhibition in early 2021.The exhibition, “The Convergence of Martyrs,” will feature the works of thirty-six artists and will be held at the Museo de Arte Contemporáneo Rio de Janeiro between December 28 and January 3. The exhibition “The Exile of the Radical,” will be held at the Museo de Arte Contemporáneo Rio de Janeiro from January 5 to January 8.\n\n\nThe National Gallery in London has appointed Penny Marshall as its new chief executive. Marshall will be responsible for running the museum, which has faced various changes of leadership in recent years. The museum’s new chairman, Huda Berlin, will serve as acting director until Marshall’s successor is appointed.“Penny is a formidable executive who has a deep and distinguished record of leadership, exemplified in the dramatic transformation of the National Gallery into Britain’s largest arts institution and the launch of Gallery Viewing Rooms,” said David Bailey, chair of the National Gallery’s board of trustees. “Her achievements in transforming the National Gallery will", "The next Biennial should be held in 2020. “New York has been a model for the rest of the world, and I am honored to be a part of the next edition,” said Vasily Kandzhartov, the director of the Museum of Modern Art. The venue will be located on Park Avenue across from the Museum of Modern Art and will be inaugurated by a solo exhibition of new works by the artists known for their participation in the first edition of the Biennial. A retrospective of artworks by the second- and third-generation group of European sculptors, the Biennial will also feature works by artists who have participated in previous iterations. The public will be able to visit the exhibition space from March 8 to April 5, 2020.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has acquired the rights to thirteen works by the late Egyptian-American artist Mamoun Abdalati, a pioneering African American artist who is best remembered for his critically influential The Body in Space (1961), a sculpture that examines the sacredness of body and individuation through two versions of the American Civil War. The exhibition is titled “The Body and Space: The Met in the Age of Black Power” and will be", "The next Biennial should take place in 2021.”\n\n\nThe University of California, Los Angeles, has established an endowment for Charles Darwin’s museum to house the collection of Michael Shermer, a professor of zoology at the University of California, Berkeley, and a coauthor of the book A Simple History. Shermer and Darwin were friends, and Anderson, the philanthropist and cofounder of the Los Angeles– and San Diego–based nonprofit Charles Darwin Studies Center, offered his services as a consultant for the final stages of the project. “We are extremely grateful to Anderson for his visionary leadership in leading this project,” said museum director Charlotte Gray. “His expertise and vision for the Shermer Museum were instrumental in making this possible.”The $10 million gift was made by the Los Angeles–based philanthropist and investor Thomas J. Marchetti, who was a cofounder of the Sylvie & Ida Marchetti family, which has donated more than $250 million to Museums United States’s commitment to supporting the collection of Charles Darwin’s works. The gift also includes $3 million for the D", "The next Biennial should kick off on November 4 and explore “the power of photography in the contemporary world,” a statement by the festival said. The Danish-French exhibition “takes a radical stance,” the Art Newspaper reports. The show will be organized as an exhibition of works of the exhibition “Art and Life in Denmark,” which will be curated by Jørgen Tellinghaus, a Danish curator who works in New York.The exhibition will highlight photography’s relevance in the contemporary world and will include works by artists such as Ed Moses, Denilson, and Tingvall, who will each receive a cash prize of $50,000. The show will also feature photography artifacts from Copenhagen, Helsinki, Oslo, and Stockholm.In the United Kingdom, the Biennial will feature works by Alexander Calder, Elizabeth Cady, Thomas de Morgan, and Doreen Hurwitz. Art and Life in the UK will be held at Tate Britain between September 5 and September 10.Sara Millman will represent the United States in the exhibition, titled “Avant Garde Still Life,” at the Museum of Fine Arts, Boston. The show will be curated", "The next Biennial should take place in 2021–20. The city’s budget for the event has yet to be determined, and the theme of the upcoming iteration will be “solidarities of flesh and bones.” In a statement, the city said: “The creative process is central to the city’s identity and Art in Toronto is grateful to be a catalyst for people, artists, and institutions to think critically and creatively about how other cultures, histories, and social practices connect with and intersect with our own.”\n\n\nCanadian authorities have launched an investigation into charges that a Montreal-based fraudster stole $4.5 million from the Dorothea and Iwan Wirth Foundation, an Ottawa–based arts organization that supports artists in the country. The allegations were first raised by the New York Times, which reported that the foundation ran a program in which artists signed a twenty-year contract for $1,000 apiece, only to be billed thousands of dollars later on.Since the program was shuttered in 2016, the foundation has said it was unable to show how the sculptures, works, and other works of art were made and therefore cannot be held responsible. In March, the organization was ordered to pay $750", "The next Biennial should take place in 2020. A statement from the venue reads: “We’re proud to present the sixth edition of the Biennial, and we hope that you will be able to enjoy it for some time to come. We know that we’ve got more work to do, but we’re determined to make it happen.” In the meantime, Gallery101 London will continue its annual Biennial in June with its seventh edition between June 23 and June 26. The show will go on without the show, which has become a critical platform for artists and critics to engage with the city. “The Biennial is a good model for the kind of public space that we want to see in the city,” said Artnet editor Christopher Brewin. “We need more of these events, and we need them now. We need them now because the biennial is a starting point for something that can be the template for a city in the making.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Shawn Howard as its next executive director. Howard comes to the institution from the City Museum of Art, where he has served as deputy director", "The next Biennial should be held in 2021, in collaboration with the South China Art Museum in Beijing and the Beijing Institute of Contemporary Art. The show will be led by a team of international curators led by David K. Huang and Matthew Y. Chuang, and will be organized under the themes of the planned exhibition “The Art of Life: Art and Life in Hong Kong” (2019).The Universal Periodical, a new publication dedicated to modern art in Asia, will be published by the Sino-Japanese scholar Tsutomu Goto in 2020. Its first issue will focus on Hong Kong, and will include a selection of visual arts created in the region. The book will also include a selection of essays on art history, historical subjects, and philosophy.\n\n\nThe Mondrian Museum in New York has appointed Peter Ottaviani as its new director. His appointment was made on December 22—the day the museum opened to the public—and takes place amidst the reopening of the museum, which is currently undergoing a $500 million expansion. Ottaviani will assume his post on January 18, 2021.“Peter has been a visionary leader of the Mondrian, and we are incredibly grateful for his dedication and passion for the Mondrian", "The next Biennial should take place at the Los Angeles County Museum of Art from February 3 to March 5.  The 2020 edition will be held at the Los Angeles County Museum of Art (LACMA) from March 19 to March 21.  The museum is preparing to open a new fifty-three-thousand-square-foot expansion and is working on a series of exhibitions and educational projects that will include the opening of new programs and galleries. The museum has also expanded its endowment by $1 million, bringing its endowment to $5.7 billion, and has added a new $500 million endowment for the International Center for the Arts. The institution’s board of directors and management have also approved a $500 million contribution from the Los Angeles and Santa Monica Counties to the Arts and Cultural Fund.\n\n\nThe Fine Arts Museums (FAUM) in New York and Los Angeles have teamed up to launch the #DraftMeCampaign, an online campaign to stop the use of excessive force in the United States’s largest urban court system. Using a combination of social media, petition writing, and art criticism, the campaigns are attempting to draw attention to the growing movement against police violence that has taken place across the United", "The next Biennial should take place in 2021.\n\n\nThe Sydney Museum of Art (SMA) has released the list of twenty-five artists who will participate in “The Time Is Now” at its new venue, the Sydney Opera House. Dubbed the Neo-Narrows,  the exhibition will focus on the past and present through twenty-five works by twenty-one artists, including Paul Gauguin, Pablo Picasso, Pierre-Auguste Renoir, Louise Nevelson, and Renzo Piano. The exhibition will run as part of the museum’s ongoing work on the Royal Institute’s new exhibition “Between the Sun and the Moon” alongside the recently released “The Time Is Now: The Art of Looking Back,” a project that will return fifteen works by Renzo Piano.The artists who will receive fellowships include Hannah Arnold, Salaam Zaman, Nathan Hämäläinen, John Amis, Daniel Barenblatt, Antonio Caruso, Ulrike ċnjoki, and Yoshitomo Nara. The twenty-three-person team behind the exhibition, which will be located in the museum�", "The next Biennial should be held next year.\n\n\nDavid Guaraldi, who founded the contemporary art museum in Paris in the 1980s and founded his own eponymous gallery, the Sursock Museum, in the Sixties, has died at age eighty-one. His unexpected passing prompted a number of cultural figures to pen statements of condolence. Former director of the Nationalgalerie François Pinault, who was sixty-two, said: “David was one of the few people who could have brought about a decade of my life. He was always honest with me, honest with others, and most of all, honest with art. The Parisian art scene was best represented by his collection, which was always curated by a wide and knowledgeable network, and that network was the very heart of what made Parisian art amazing.”The gallery’s current president, Vincent van Lieshout, announced: “At a time when the old world and the new are at war, when life is full of uncertainty and pain, when art is being rebranded and taught to be reconfigured, when art is being made to appear more acceptable, Guaraldi was the man who taught the art of the thirty-first century to Parisian", "The next Biennial should be held at the invitation of the President of Brazil, to be held in the year 2020.\n\n\nThe Annandale-based nonprofit Artadia, which supports contemporary art in the United States, has received a $14 million donation from the Russell Sage Foundation. The gift, which comes on the heels of its inaugural awards to foster creative and artistic excellence in the United Kingdom, Ireland, and South Africa, also includes a $12 million grant for fellowships at the Artadia Center in New York. The money will be used to support the fellowships, which are jointly awarded by the center and the artist-in-residence program (AIR) and will be announced soon.“This is an enormous relief to Artadia and the artists and institutions who have been working tirelessly to secure the future of the center, and who have been fighting for years,” said artist-in-residence Doris Young. “We are grateful to the Russell Sage Foundation for supporting our work and for championing the artists and organizations who have made such a significant contribution to bringing their projects to fruition.”The foundation also announced that it will begin to phase out the artist-in-residence program, which has been offered by the", "The next Biennial should be on the history of photography in New York City, in 2020. “New York City is a city of extraordinary beauty, a melting pot of people, cultures, languages, languages, cultures, languages, languages, languages, languages, and languages,” said Elizabeth Liang, president of the New York Academy of Arts.The 2020 edition of the Biennial will include works by seventy-five artists, including Damien Hirst, Mark di Suvero, Katja Krijniewski, Frank Gehry, and Léa Marx. The biennial will also host a text by artist and scholar Doris Salcedo, and will feature a lecture by Mark Halperin, a professor of art history at Columbia University, and an exhibition of work by artists and collectors Ken Russell and Richard Avedon. The 2020 edition of the Art Newspaper, which first appeared in London on June 5, chronicled the development of the British photographer Kent Beck’s career and the rise of American photojournalism. The biennial has also attracted controversy, as images taken by Beck at times included in his series “collateral damage”—pictures of dead children, and of graffiti artists who were deliberately", "The next Biennial should showcase the work of the biennial’s artists, in order to better understand the concept, and should be an opportunity to experience the exhibition space and the exhibition process through the artist’s own eyes. The Biennial Program will also be a platform for artists to collaborate with a greater range of artists, and will be a wonderful vehicle for the exhibition of work by the artists who are not represented in the biennial. The program will be organized as follows:1. The Art of the Biennial: A series of curated exhibitions organized by the biennial artists for the 2018–19 biennial season.2. Biennial: A program of curated projects which will include works by the artists represented in both the exhibition and the biennial.3. Biennial: A collection of works by the Biennial artists and curated by a curator.4. Biennial: A group show which will feature the works of all the artists represented in the exhibition plus a selection of the biennial artists’ own works.5. Biennial: A curated exhibition with a special focus on the exhibition of the Biennial artists’ new works, which will be presented in the biennial in its entirety.6. The Art of the Bi", "The next Biennial should be held at least four years after the expiry of the current contract, and should aim to present at least two hundred works in the medium of cultural exchange and cooperation. The deadline for artists to submit works is February 5, 2021. The seventy-fifth and seventy-ninth years, respectively, will be given a maximum of five years to organize and produce work.\n\n\nThe Asian Art Museum (AAM) in Japan has received a gift of twenty-seven works by twenty-six artists from Joachim Neugroschel and Osgaldo Fontana, who were long-time collaborators and collectors. Neugroschel, a German artist who lived and worked in Japan for forty years, donated the works to the AAM in 2011, and the works will be organized by the AAM in collaboration with the Exhibition Design Center. These works are scheduled to be exhibited at the end of the year.In addition, the museum received two works by the artist from Sia Yoon in Seoul, South Korea, and Yuji Matsuda in Kyoto, Japan, in 2017. Both paintings are part of the three-dimensional installation Maelstrom, 2014, which explores the relationship between light and shadow and will be presented here in", "The next Biennial should take place in Shanghai in the autumn of 2020. Artist-designed exhibitions, including the upcoming Biennial of Italian Modern Art in Milan in January 2021, will be staged concurrently. “One hundred percent of the Biennial will be completed in 2020, and the remaining 10 percent will be completed in 2021,” said David Littman, president of the Weston Foundation and the Museum in London, to the Art Newspaper. However, the full scope of the 2015 disaster, which has been likened to a fire that broke out due to a faulty exhaust fan, remains unclear. Since the building is currently being demolished, the fire investigators have yet to determine the cause of the blaze.The fire first broke out on September 9, 2015, in an unfinished, pre-fabricated, fifty-three-thousand-square-foot office complex currently occupied by the foundation. According to the New York Times, a second-floor pocket of the office complex had already begun to burn when an employee reported a heavy smokey odor. Within three days, the building had already lost nearly four hundred square feet of its original floor plan, and by the time the fire brigade arrived, the space was already aflame.The firemen who extinguished", "The next Biennial should take place in the summer of 2021. \n\n\nThe National Gallery in London has launched a crowdfunding initiative to support artists whose works are currently on display in its autumn exhibition “The Handmaid's Tale,” which runs through November 6. The event, which was organized as part of the group show “The Middle Kingdom: Turkish Art and Modernism”, raised nearly $60,000 from 1,600 donors in less than two weeks—the largest amount ever raised by the exhibition.The National Art School in Manchester (Narm) is also expanding its programs to support the growing number of artists whose work is currently in the works of the Tate, the National Gallery, and the National Portrait Gallery, and to introduce new funding opportunities. The National Galleries of Scotland (NGA) announced today that it is now accepting money from individuals and institutions for “The Handmaid’s Tale.” The work, which was created by British artist and activist Germaine de Kooning and is currently on display in the exhibition “The Handmaids Tale: The Art of Germaine de Kooning” at the NGA until March 5, 2020, will be presented next year", "The next Biennial should be on September 14–20, 2020. \nThe first iteration of the biennial was held in the city of Long Island City, New York in January 2019. It was then moved to Rockefeller Center, New York, and staged at the venue until March 2019, when the venue reopened to the public. The second iteration, “Showstooms: Contemporary Art and Politics” (March 22–March 27), 2019, was staged in Rockefeller Center from March 27–March 29. The event, which was curated by Fernando Rojas, was cancelled in late March due to the Covid-19 crisis.The third edition of the biennial, “Theoretical Art in the Age of J. Paul Getty’s Three Spaces” (March 28–March 31), 2019, was curated by artist and curator Allen Linville. The event featured works that explored the intersection between painting, sculpture, and the social and cultural life of the American West. The fourth edition of the biennial, “Robert Rauschenberg: Sculpture and the World” (March 30–March 31), 2019, was curated by artist and curator Robert Rauschenberg. The event featured Rauch", "The next Biennial should take place in the spring of 2020. The exhibition will be hosted by the Institute of Contemporary Art in the City of San Francisco and will feature work by forty artists ranging in subject, and will draw from the database of the Museum of Modern Art.The exhibition is organized as an extension of the city’s long-standing commitment to supporting both arts by giving more than 1,600 artists and organizations the opportunity to present their work in the city.“We are thrilled to present this year’s Biennial to the San Francisco Arts and Artists,” said San Francisco Arts and Artists director Emma Mayhew. “This is a unique year to host, and to present work by artists whose practices are in transition or have yet to be fully realized, and to celebrate the extraordinary range of the talented and the diverse communities that make San Francisco such a vibrant and compelling place to live and work.”The 2020 edition of the Biennial will feature work by seventy-nine artists, including Amanda Conner, Beatriz Berenga, Fernanda Cervetto, Alex Golden, Xiran GmbH, and Christo, and will be held at the Museo de Arte Contemporáneo in", "The next Biennial should be held in the summer of 2022, in the city of Milan. The panel will decide on the next format, which will be presented by the artist, next month. After a recent exhibition at the Museo Nacional Centro de Arte Contemporáneo in Milan, Artforum spoke to Paolo Cattaneo, the president of the committee, about the upcoming edition.\n\n\nRebecca Blackstock, the British curator and director of Tate Britain, and her husband, the British filmmaker Jim Thompson, are returning to the Tate to become the next director of the Tate’s new art collection, The Tate Modern. Blackstock, who won the Prix d’Art Moderne in London last year, will assume her post in September.“We are thrilled to have Rebecca and Jim back in the fold, as they have been a central part of Tate Britain since it began in 1998, with a new initiative, ‘The Future We Want,’ that was launched last year,” said Tate director Maria Balshaw. “Their commitment, passion, and creativity will be crucial as we embark on our next four years at Tate, and ensuring that the Tate Modern reflects the", "The next Biennial should be announced soon.\n\n\nThe Chicago Architecture Center (CAC) has received a $250,000 donation from the Cursa Foundation. Cheryl Cursa, president of the foundation, said: “The Cursa Foundation has long supported the Chicago architecture and design community. We are thrilled to welcome the Cursa Foundation to the CAC as a new member of the collection. We strongly believe the Cursa Collection will be a strong addition to the CAC collection, adding a new generation of great artists and inspiring new conversations about design.”Previously, the foundation has supported the collection through its International Council. The Cursa Foundation also recently established a new office in Paris, which is dedicated to the collection. In addition, the foundation has supported the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of the art of"]