["The next Biennial should be held in 2020.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York is planning to open a new outpost in Istanbul in 2022, partnering with the Turkish cultural heritage organization Gültürköyöğündar (Gültürköyöğu) to establish the new museum. The Metropolitan Museum of Art is one of the largest cultural institutions in the country, and has hosted more than three hundred exhibitions since it moved into the city in 1924. The institution, which is currently working on a redesign that will improve accessibility, is also planning to stage a number of exhibitions, including “Gültürköyöğu: Spaces, Models, and Objects” (2019), “The Exhibitionist in Venice” (2019), and “Museum Tango: The Magician” (2019).The announcement of the partners came as German Chancellor Angela Merkel and Turkish President Recep Tayyip Erdogan announced they would work together towards a peace agreement between the Turkish and German governments. The plan was finalized after Erdogan—who has repeatedly threatened to tear up the Turkish-German bilateral treaty—spoke to Merkel at an event at the Eiffel Tower in Paris on March", "The next Biennial should take place at the Museum of Modern Art in New York in 2021 and will be curated by Shinji Hasegawa, the curator of contemporary art from Japan. The exhibit will include works by seventy-three artists, including Michael Newdow, who has a series “Southern Home in the Movies” at the Museum of Modern Art in New York; Joachim Neugroschel, who has a series “The Goblin of The Nile” at the Museum of Modern Art; and a selection of works by three Rio de Janeiro-based biennialists, Marina and María Rocha, María Luisa Filho, and Osías Llanes, among others.\n\n\nThe City of Minneapolis has agreed to pay $8 million to the heirs of Paul MacQuarrie, the former chief executive of the Minneapolis Police Department (MPD), who was killed by a rogue officer in 2016. The sum, which has been divided among thirty-six individuals, will be split equally between the city and the four officers who were charged with second-degree murder in the killing of George Floyd, a Black man who was killed by a white MPD officer during a struggle over a stolen 2017 Dodge Dakota, according", "The next Biennial should take place in the city in 2020. The event will remain closed until at least May 5.For the past five years, the museum has been transforming its surroundings, including adding new galleries and exhibitions spaces, expanding its collection, and preparing for its first-ever summer school in May 2020. The announcement of the renovation, expanded venue, and new school was made before the pandemic began, and the institution was preparing to reopen in mid-May.The April 25 announcement that the museum would plunge into a major renovation was met with anticipation and confusion from the public. During the refurbishment, the museum added new rooms for education and public programs, renovated the historically significant lobby, and added public spaces such as gardens and terraces. In addition, it added a community meeting room for visitors to socialize with colleagues and guests, added a restaurant, expanded the public design, and created space for a public fountain with a fountain-like roof.In a statement, the museum said: “The past five years have been transformative for the museum and our staff, and we are thrilled to have these past five years to celebrate the biennial with you. We hope that by reopening, you will return once more to visit us.”\n\n\n", "The next Biennial should be held in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of seventy-six works from the Dorothea Rockcastle Collection in New York. The works, which comprise a number of rare works from the Flemish master’s studio, are divided into two categories: “One-Way Vermeer” and “She-Ra, ” which were founded in the late nineteenth century and are now housed at the museum. The works were donated by Rockcastle to the institution in 1904 and have undergone extensive restoration and exhibition. Among the works that have recently entered the collection are a painting by Rockcastle of a figure in a saffron dress, a work that worked in conjunction with a silk screen, a drawing by Rockcastle of a female figure, and several other paintings.“The original works, which were acquired by the MFA in 2004, were on display in our current exhibition ‘The Flemish Vision’s Ephemeral History: ‘Flemish Art in the Late Century’’ (2019–20)” for which the artist created the big-screen version of her famous", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it is working with the Charles and Lucille King Family Foundation to expand the institution’s collection of modern and contemporary art by integrating more items from the King family collection into its exhibition spaces. The initiative will create more opportunities for the collection to be displayed on the museum’s campus and will help the institution better understand the cultural significance of the works that were previously in storage.“This is a defining moment for the King family, and we are thrilled that this important project will help them realize their ambitious vision of transforming the interior of the museum into an interdisciplinary platform for the study and appreciation of art of the twentieth century,” said Bruce Ivins, vice president of curatorial affairs. The King Family is seeking funds and the initiative is currently funded through a $5 million gift from the King Family’s eponymous foundation.The King Family’s vision for the museum reflects their commitment to multidisciplinary exploration of contemporary art, their philanthropic legacy, and their commitment to supporting local, regional, and national arts. They are raising funds to implement the Charles King Family Foundation’s initiative at Mo", "The next Biennial should be held in 2022; a subsequent one in 2025; and a final exhibition in 2026. The first is scheduled to open in the spring of 2020.\n\n\nThe Museum of Contemporary Art (MoCA), California, has appointed Florence, Italy–based artist and blogger mrvisi as its next executive director. The appointment was made by executive director Miriam Vassallo. Vassallo cited mrvisi’s “creative and innovative practice of combining color and social practice” as an example of mrvisi’s work. She also said that the new position will help mrvisi develop and expand its audience engagement programs.“Mrvisi’s commitment to experimentation and experimentation on behalf of the gallery, the museum, and the community has been a consistent theme of his work,” said Vassallo. “Throughout his career, he has demonstrated his mettle and ability to revitalize the artistic community through his vision and thought in interactions with artists, curators, and scholars. He is an extraordinary artist whose poetry, prose, and art, as well as his practice, attest to his extraordinary skill and vision in his craft.”The ninety-", "The next Biennial should be held in 2024 and will be held at the Greek island of Samos. The exhibition will consist of a selection of works dating from the late Neolithic through the Neolithic Revival, and include works that deal with religion, politics, and the environment.The 2018 exhibition featured work by more than 120 artists including Kathrin Bienstock, Armande Imhof, Hans Braun, Adriana Cossu, Thomas Dallmann, Claude Carrière, José Manuel Fabí, Kurt Eiche, Hassan Ghani, and Léa Hoare.“The new New Art Biennial is a step in the long-term development of our program, and one of the most important steps in strengthening the visual arts in France,” said Léonie Brouwers, director of the Biennial de l'Art Contemporain (BAC). “This is a new era for the Biennial de l'Art Contemporain, and we are confident that the exhibition will become a great success. We are prepared to present the work of the artists of tomorrow, and to introduce new", "The next Biennial should be held in 2020, and the theme of “Changing Worlds: Art and the Future of Man” should be restored, according to an announcement made by the museum on Wednesday. The biennial will be invited to return to the city of Buenos Aires, and will be hosted by Articulo 3, alongside the Populares de Buenos Aires, the Museo Nacional de Arte Contemporáneo, and much of Los Angeles.Contemporary art in Buenos Aires has been a subject of controversy since the late 1960s. The city’s former mayor, Cristina Kirchner, was forced out of power in 1983 over her failed attempt to privatize the national museum. The privatization bid was supported by wealthy industrialist Etienne Blum, who had previously invested in the city’s art through his company, the Blum Group.Blum Enterprises was a multibillion-dollar operation, and Kirchner’s administration was accused of shielding the company from creditors and cutting public funding. The privatization file was ultimately settled in 2015 for $249 million, and the Blum Group moved into liquidation.\n\n\nArt historian Richard Serra, the director of the St", "The next Biennial should take place at the new Museum of Contemporary Art (MoCA) in Los Angeles in 2022. When asked about the future of the museum, Friedman said: “I think that we are at a moment in our history where we are in a moment of great change. I think that the future of art is at the forefront of that moment.”The biennial’s first edition, “Theoretical Biennial: The Politics of Sound,” opened at MoCA in 1992. Featuring work by Juergen Teller, Vincent van Gogh, Jean-Michel Basquiat, Jacques-Louis David, and Abdulrahman Al-Saadi, the exhibition was inspired by the ongoing debates about the relationship between sound and the body and was organized by cofounder Steven Clark. Through an interactive installation by the Philadelphia-based artist Noël Carroll, “Kafka” (2018) plays within a world created by Daniel Buren in 1910s Paris, where the works of the exhibition are not actually based but are inspired by the work of American artists such as Edgar Degas, Ingvild DeBerard, and Richard Diebenkorn. \n\n\nThe museums where the", "The next Biennial should be held in February 2020 and will take place in the newly renovated Breguet-Baudelaire. The event will feature works by seventy artists from eighty-four countries and will be organized in three phases: Art, Science, and Technology (SCIENCE). The exhibition will be designed by the architect Tejal Shah and will be inaugurated with the exhibition “From Natural to Design: the Invention of the Biennial.” The project will also include the creation of a platform for new and classic works and the presentation of a special exhibition of works by the Eduardo da Vinci.\n\n\nCinema Paradiso has announced that it will suspend production and distribution of the upcoming twenty-second edition of its London event, “Cinema Paradiso: London 2021,” and will move the event to a different location, the Manchester Museum. The new venue will take up the story of the twentieth-century film industry and will be co-curated by British director Alexis Silver.“At a time when art and film are increasingly intertwined, it is particularly meaningful that the festival celebrates its fiftieth anniversary in 2020,” said director Tim Burton. “In", "The next Biennial should take place in 2021. On December 16, the Biennale will mark the occasion by presenting a new collection of works by the leading artists of seventeenth-century Europe.\n\n\nThe United Kingdom will mark the seventeenth anniversary of its withdrawal from the European Union with a new exhibition designed to reflect the country’s cultural landscape of that tumultuous June. The event, titled The Right Place, will be staged at the National Maritime Museum (MM), Birmingham, from March 16–March 20.The new show, which is centered around the theme “Art as a Tool of Resistance” and the image of a man in a British flag sitting in a dock, will be organized in the same way as the exhibition’s previous iteration, “British Union.” It will be based on the theme, will feature photography, painting, sculptures, installations, documentaries, and performances, and will also include artworks from the museum’s collection in various states of preservation.According to the UK’s Culture Secretary, Maria Boggs: “We will be looking to the next generation of British Union artists to deliver a new and exciting vision of what a British Union museum should be. It should be", "The next Biennial should be held at a location in the city that will bring visitors to the museum daily. The event will also include programming aimed at helping visitors return to the museum. The 2020 event will mark the fifteenth anniversary of the venue. Museum director Bech Sen will step down from the helm of the museum in March. The museum will also host its first-ever biennial on the life and work of the late Italian architect Max Hetzler in March 2020. “Together, we are approaching a new stage of our history,” Sen said. The institution will prepare for the opening of the exhibition by launching a digital platform that will allow visitors to preview the exhibition through the museum’s security system. The platform will also have a biennial calendar that can be viewed by visiting the museum on any day of the year. “The Biennial of Italy’s Architecture is a cultural house of yesterday, today, and tomorrow,” said Max Hetzler, who founded the company in 1954 and died in 1998. “Our vision is to create a space for architecture which has always been at the forefront of the future,” said designer Artsamon Gug", "The next Biennial should be held in March. When asked what she will do if the cancellation of the upcoming edition of the exhibition comes as a surprise, she replied: “I will find out what I can. I have no other choice.”\n\n\nThe Somerset House Museum in London has received a $7 million donation from a group of wealthy collectors, including Glenn Gould and Richard Branson, who are committed to preserving the institution’s collection through the 2020 exhibition season. The donation is made in support of the new Exhibition Trust, which will oversee the reopening of the museum’s collection in the next three years. “The trust will have the power to shift the museum’s exhibition program and create new opportunities for its artists, curators, performers, writers, and researchers, and will have the opportunity to invest in the museum’s artists and curators,” said Peter Häggström, director of the London museum. The trust’s board member, Wolfgang Deutsch, added: “Over the next three years the trust will be given the power to reshape the future of the Somerset House. The board will be asked to help shape a new programme for the exhibition", "The next Biennial should be held in 2020. \n\n\nThe National Gallery of Canada has appointed Peter Schäfer as its new director. Schäfer will be responsible for developing the visual art and culture of the United Kingdom. He will take up the post on January 21, 2020.“Peter has been instrumental in shaping the National Gallery of Canada into a global leader in art and design, and has shaped the gallery’s relationship with the city of Ottawa into one of the most important partners in Canada for higher education and research,” said museum director and CEO Camille Beaufils. “Peter’s vision for the National Gallery of Canada and its role in supporting our city and community are extremely important to me and I look forward to seeing how he will use our unique resources to advance the museum’s mission and strengthen the gallery’s relationships with the county of Ottawa and the city of London, as well as with institutions in other cities in the United Kingdom.”The appointment marks a major milestone for the gallery. It has been nearly twenty years since the museum opened, but it only recently received the designation of a UNESCO World Heritage site in 2008. The institution, which celebrates its sixtieth anniversary this year,", "The next Biennial should be held at a location outside of Toronto, with the aim of offering a more diverse selection of works, and perhaps expanding the scope of the exhibition. The invitation comes at a time when the city is under intense scrutiny over its handling of its opioid crisis—the number of overdose deaths in Scarborough, one of the city’s most deprived neighbourhoods, has nearly quadrupled since 2010, and the number of overdose deaths in Toronto has tripled since 2010.The Clay Institute for the Arts (CFA) in Stonebridge, New South Wales, Australia, has also adopted a new bylaw to address the opioid crisis. Under the new legislation, those convicted of drug offences will be sentenced to between four and eight years and those who have more than one charge will be eligible for parole. It also outlines a three-year grace period for people who have already completed their sentences, and will introduce a new $10,000 cash reward for information leading to the arrest and conviction of someone who makes or possesses more than $2 million.The new federal legislation also aims to deter the trafficking of opioids. It requires the Australian Federal Police to intensify its efforts to identify and disrupt the activities of those involved in the supply, transit, or demand of the drugs", "The next Biennial should focus on a combination of the exhibition of new works and media, the performance of new works, and a discussion of the contemporary international art scene. In the meantime, artist-run compilations of the same works, curated by different local groups, may be staged in the near future.While Biennials have been sometimes used as a tool for artists and activists, they have been more controversial than the new exhibition, since they often involve “indirect control” over the works housed in museums. During the protests in Hong Kong last year, for instance, protestors smashed artworks and vandalized buildings. While some have argued that the Hong Kong Art Museum staged the demonstrations, others have argued that museums have acted in self-defense by quashing pro-democracy protests.In an attempt to minimize the impact of the protests on Hong Kong, the museum has proposed moving some works out of the city. It has also enlisted the help of the Hong Kong-born artist Ai Weiwei and the Hong Kong–born artist Ng Han-Wai in creating a new exhibition dedicated to the protests.In an attempt to placate Hong Kong protesters, the museum wants to present more of the Hong Kong Art Museum’s collection in", "The next Biennial should take place in New York in 2022. The next edition of the Dublin Biennial will be staged in December 2021.  In addition, the 2019 and 2020 editions of the Venice Biennales will now be staged simultaneously, with the inaugural edition chosen by the museum in late September.  Other major events that will be organized in the next year include the Royal Exhibition of Fine Arts, the Scottish National Art Gallery’s Scottish National Biennial, the London Book Fair, and the Edinburgh Festival. In the coming weeks, the museum will announce the dates and locations of its newly expanded location in the city, which will be built in an area of the city known as the 'city of ideas.”The redevelopment of the nation’s capital is expected to cost more than $3 billion. The design of the new venue, which will be constructed on the site of the existing Museum of Modern Art, was entrusted to French firm Medtronic. The firm was given a five-year contract to design the museum, which will be completed in 2022, in September. The institution has also hired Scandinavian architect Joachim Nordin as the architect of the new pavilion. Nordin will be responsible for ", "The next Biennial should focus on “activism,” the three-monthly exhibition, which will open on November 11, 2020, before the end of the year. The theme of the event will be “Pangaea” and will be “Delicate Times: Western Art and Modernity in the Twentieth Century” (2019).A selection of artists from China, Europe, and the United States will be featured in the exhibition, which will be organized as an exhibition and will run concurrently with the upcoming twenty-fifth edition of the Biennale d’Art et Politique (2019), which is scheduled for May 25–June 11. The exhibition will aim to “explore the limits of cultural production,” and will draw from an archive of more than eighty thousand works and the collections of various institutions in the city.The inaugural exhibition “Pangaea” is located in a former textile factory in the industrial district of Xiamen, Fujian province, in the capital of Fujian, Xiamen. The exhibition will house forty paintings by thirty-five artists, including Alex Akhmetshin, Yichun Han, and Liao Feng, and will open to the public on", "The next Biennial should begin shortly and be completed by the middle of the year.\n\n\nThe next edition of the Kuka Art Congress will take place in Tokyo from May 5 to May 6, 2020. Titled “Art as a Tool for Change,” the biennial will be organized by the Japan Foundation (Jinja), the Tokyo Metropolitan Museum of Art (TMM), and the Kumazaki Museum of Fine Arts. The event will run concurrently with the 2020 edition of the Art Basel Hong Kong and will lend its name to a new street in the city.The 2020 iteration of the Kuka Art Congress will include artists from fifty countries and will showcase their new works in collaboration with the renowned curator Kiyomi Nara. The event will be organized in the same way that the Kuka Art Conference was last year—with a total of sixteen artists from fifty countries represented. “The new format of Kuka Art Congress is inspired by the Kuka Art Festival, which has been around for twenty years and is very much rooted in Japanese culture,” said Toshio Kiyomi, chair of the 2020 Kuka Art Congress and the director of the TMM. “The art of the 2020 edition will be for everyone and", "The next Biennial should be in 2022. The next edition, titled “Anew Oto,” will be held at the Kunsthalle Basel in Switzerland. Its next iteration, titled “Kunstmachung,” will take place in the Kunsthaus in Beijing in 2022. “The future of art is a matter of life and death,” said Germany’s culture minister, Monika Grütters, at a press conference. “Art has always been an extension of people’s lives. Our future is in its hands.”\n\n\nMore than 400 former interns at the National Museum of Fine Arts (NMA) in Washington, DC, have signed a petition demanding that the institution stop censoring free cultural expression and promote free speech following the May 25 inauguration of the newly elected president Donald Trump. The interns, which comprise a cross section of academic and professional backgrounds, have come under scrutiny for their concerns over the new administration’s stance on immigration, racial justice, and LGBTQ rights.“We, the current interns, are acutely aware that we are not part of a formal professional organization dedicated to the preservation of history,” the petition reads", "The next Biennial should be held in 2022.The Daily Telegraph reports that the museum has learned that the artworks, which were donated by the Charles and Lucille Best Foundation in 2009, had been damaged by a series of explosions at the site of the museum created in 2013.  The foundation has reported the loss of around $23,000 in revenue and is currently evaluating the possibility of filing a claim on behalf of the donors. In a statement to the Daily Telegraph, the foundation said: “The foundation is exploring all options to help these donors through this difficult and unprecedented situation. We stand by our support of the museum and are monitoring the situation closely.”The bomb damage to the building was caused by a hydrogen bomb, a type of bomb developed by Israel and used in conjunction with the 2006 Mavi Marmara crisis in the West Bank to disperse Palestinian protestors and activists. The Mavi Marmara, a five-man, two-woman, and two-woman-team that flotaled the Israeli flag in the West Bank during the 2010 Mavi Marmara Fundraiser, was set on fire and detonated by Israeli forces, causing extensive damage.“The foundation is only able to recover a portion of the lost funds,", "The next Biennial should take place in 2021 and will be hosted at the Biennial in Milan, Italy; the Museo das Artes in Madrid, Spain; and the Museum of Modern Art, New York. Source: Artforum Artforum: Artforum: Artforum: Artforum: Artforum: Artforum: Artforum: Artforum: Artforum: Artforum: Artforum: Artforum: Artforum:  Artforum: Artforum: Artforum: Artforum:  Artforum: Artforum: Artforum:  Artforum: Artforum: Artforum: Artforum: Artforum: Artforum: Artforum: Artforum: Artforum:  Artforum:  Artforum: Artforum: Artforum: Artforum: Artforum:  Artforum: Artforum: Artforum: Artforum:  Artforum: Artforum: Artforum:  Artforum: Artforum: Artforum: Artforum:  Artforum: Artforum: Artforum: ", "The next Biennial should be held at least three times a year.  The proposed changes are:\nBiennial Schedule (13–April): The event will be held on site at the museum through March 15, 2020.  The event should not be postponed or rescheduled.  The venue should be able to host the event once a year. The event should have an opening and closing reception at 9 AM, followed by a lecture or two by a curator.  The event should be free to the public and should be centered around the artist’s work. The biennial will be held at least three times a year.  The next Biennial Art Lecture (April 15–May 1): The event should be free to the public. The event should be assisted by a curator or two from the institution. The biennial will be based at the museum in conjunction with the institution’s historic site on the southeast corner of the campus. The first lecture will address the history of the museum and will be delivered by the curator and urban planner Maurizio María Otero, who also directs the Museo Nacional de Arte de São Paulo (MAS", "The next Biennial should take place in the United States. The next iteration of Art+Justice will also be held in the United States.\n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to close its doors to the public in 2021, in an effort to minimize its carbon footprint. The museum currently uses the energy of catalytic converters to produce approximately twenty thousand gallons of water a day, but in an effort to reduce its carbon footprint, the museum is preparing to phase out the fossil fuel-based power plant.According to MFA spokesperson Jennifer DeSimone, the museum is currently working towards reducing its overall carbon footprint by 40 percent through a variety of strategies, including the construction of more sustainable structures and the exhibition of more works by women, non-Western artists, and artists from underrepresented corners of the globe. “The museum is committed to working with local communities, regional partners, and the public to achieve meaningful and aggressive climate action,” DeSimone said, “while remaining true to its original mission as a world-class art museum.”In order to reduce its greenhouse gas emissions by 33 percent, MFA expects to burn through around two thirds of its annual production capacity by 2020, reducing the greenhouse gas", "The next Biennial should be held in 2022. The eleven artists who will be chosen for the award are Vijay K. Rajagopal, Akram Sadiq, Dusan Ochi, Ankit Panda, Shobha Ratnakumar, Janakiranjanan and Aapan Dasgupta. The eight awardees for the 2019 edition were Arif Qasim, Pankaj Pal Singh, M Nagarjuna, Nandini Sahai, Sushilea and V Srinivasan.The 2019 prize was established along with the Tryan Art Prize for art from India in recognition of the country’s contribution to art in the form of art and architecture. The awardees hail from the Bay of Bengal, Bengaluru, Baroda, Bhopal, Chennai, Kannur, Kolkata, Mumbai, New Delhi, Hyderabad and Rio de Janeiro.The contemporary art prize is administered by the European Community in partnership with the International Council of Modern Art. Winners are selected by a jury comprising Paceja Khadoj, the European Minister of Culture, and Amina A. Khan, the President of India. The 2019 prize will be presented at the Art", "The next Biennial should take place at the City Museum of Art, in Harlem. The 2019 edition of the event, which will mark the fiftieth anniversary of the French artist Georges Poledna and the first to feature the work of multiple artists, will be held at the Museum of Fine Arts in Paris.A decision on the future of the biennial was finalized last year, with the MCAFAM president, Daniel O. Frankel, first president of the French Academy of Fine Arts. The institution, which has been closed since December 2019 due to the pandemic, is now seeking the agreement of three of the five exhibition partners, with the remainder to decide by March 21.While the museum is concerned about the future of the exhibition space in its building, the museum’s holding company, the Paris-based company CAA Europe, has announced that it will sell the company the remainder of the business of the exhibition space. “I never expected an exhibition like this to be conceived and executed in such a way,” Frankel told the Art Newspaper. “The new venue will be created in the center of Paris, in the neighborhood of the Louvre, with the support of the local authorities, the city", "The next Biennial should be held in the third quarter of 2020. The twenty-sixth will take place in the second half of 2021. The twenty-eighth will be held in the third quarter of 2021.\n\n\nThe Art Newspaper reports that the Metropolitan Museum of Art (MoMA) in New York has announced that it will not be rescheduling any of its upcoming events, including its upcoming exhibition “Revolutions: Art and the Modern Middle East.” Instead, in a statement sent to the Art Newspaper, the institution said that it will work with the State Department on a new set of international guidelines for exhibiting art in the United States.“The museum is committed to advancing our collection policy and the international art exchange in the United States to ensure that MoMA’s exhibitions reflect the breadth and focus of our collections in New York, and that international exchange is possible between the museum and the City of New York,” director Daniel H. Weiss said in a statement. The institution also plans to move the permanent collection to a new venue at 875 Fifth Avenue in Manhattan.In response to the announcement, director Patrick DeLuca said: “While we are aware of the important role that MoMA plays in shaping our", "The next Biennial should begin as soon as possible and be a combination of lectures, exhibitions, workshops, and other programming. With the cooperation of the biennial, the City of Chicago will organize an open-air exhibition at its new headquarters in the fall of 2020.The new museum will be located in a building designed by the firm Mies van der Rohe and will be inaugurated by a public artwork, Giancarlo on the National Mall, which will carry a collection of Giancarlo’s early works. The work will be accompanied by a program of presentations by other artists from the biennial, including Angeli K. León and Lutz B. De Ligt, and will comprise a major exhibition of works by twenty-two artists that will open on March 23.De Ligt’s Calligraphy’s 2017 Survey: The Presumption of Power, 1988–19. The new museum will be inaugurated by a public art installation by artist-in-residence Nirvana Nara, which will take up the theme of “The Prejudice of Power” and will be inaugurated by a performance by the biennial’s", "The next Biennial should be called for May 2021, and an announcement from the institution should be made in the coming months. This is the first time the museum has been forced to cancel a major exhibition due to a health crisis. A letter published by the artist Jagoda Mankar and signed by more than ten hundred other artists and art workers in Iran also called for the cancellation of the exhibition. Museum director Mir Karimi, who was appointed by President Hassan Rouhani in December, announced that the exhibition would be staged in two phases, with the first in March and the second in September. The move drew harsh criticism from some cultural figures in the country, who called the move a violation of cultural freedom. Some cultural figures also questioned why the government would invest in a Canadian-built museum if it would not protect the artists and institutions that made Iran’s artistic scene possible.Karimi, in a letter published by the Iranian Writers’ Association, argued that the construction of the museum would only exacerbate the health crisis and called for the government to “repay the industrialists” and “payback the monoculture” of the country. He also questioned the association’s decision to host the", "The next Biennial should be held in 2021, with its first edition scheduled for the end of the year. However, due to the ongoing health crisis, the date has been moved to coincide with the first week of January, which is the opening of the Festival de Lyon. In an interview with Artforum, Frank de Boheme, the artistic director of the festival, said that the new date will allow the organizers to present a \"more ambitious program, which will have a direct impact on the exhibition process.”The announcement was made at the Biennial’s fourth edition, which was held in the city of Lyon. The installation of the new exhibition will take place in the city’s city hall, the city hall of Art, and the city of Lyon’s Museum of Contemporary Art. The first show of the new exhibition will take place in the Museum of Contemporary Art.\n\n\nThe National Gallery of Scotland has launched an online viewing room where visitors can see the work of one of its greatest artisans, John Donne, as well as hear his story, as told by director Ross Case.“I want to use this platform to introduce a new way of doing things,” Donne told the Art Newspaper.", "The next Biennial should take place in 2021–22.According to the Art Newspaper, the new exhibition will reprise the themes of the last two decades—from the 1990s to 2018—and will feature twenty-nine works by thirty-one artists. The full list of participating artists is as follows:Bibiana ConnerMerry BlumenfeldTerence BlumeTina BovisMerry CollinsJohn CollinsJoel ChiuChia-Yi ChenDeana-Lee CoxNancy DanielDanielle FitzgeraldSebastian HarropFrankie HolmesJohn HyamsGail HickmanHolly HolmstromHannah J. MartinHans-Peter MagnussenHans KjartanssonHans van der Leu-Jossel-Van-Deeke HenningssonHanslohrup MouwannenJosé Feliciano de la PezuelaJeremiah EdwardsJosé Lozano EspíndolaJosé Miguel MonteroJosé Noéz-Andrea PiresJosé Pierre LeclercJosé Rubén López RiveraJan-Pierre MeeuwisK and Kari RaverKathy RosenblumKarin Stefan", "The next Biennial should be held in 2020. Hoffman’s first show in the United States was “Alberto Burri: Through the Skin of Art” (2019). In the exhibition, a four-thousand-work collection comprising canvases, paintings, sculptures, prints, and photos, which was organized in two hundred and twenty-four folders, depicted the artist’s pre-Alberto Burri paintings. In addition to a collection of burro sculptures, the exhibition showcased the work of twenty-four artists who are descendants of the artist. The show’s curator, Michael Armitage, will serve as the inaugural chair of the biennial. The biennial will be held at the Museum of Modern Art in New York through December 21, 2020.\n\n\nTacita Dean, whose work captured the attention of many in the Chicago art world in the 1980s and ’90s and who went on to become a major force in the Windy City’s art world, has died at eighty years old. She was born in San Francisco, where she studied at the University of California, Berkeley, and the University of Chicago. She moved to Chicago with her family in 1951 and began working there in the", "The next Biennial should be staged in Beijing in the second half of 2022. \n\n\nThe Historical Society of Chicago (HSC) has appointed Hope DeLay, a curator and writer based in New York, as its next chair. In her new position, DeLay will be responsible for the archiving and dissemination of the collections of the HSC. She will assume her post in February.“HSC has been working for years to develop a formal policy that would allow the collection to remain open as a museum. We are now at a critical point in our history, at a point when the collection is undergoing a major expansion and is increasingly recognized as a valuable public asset,” said HSC president and CEO David Levin. “Hope brings an outstanding and proven curatorial track record, while cultivating the collection’s institutional reputation and generating new scholarship with a commitment to teaching and engaging the collections in order to craft a more informed future history.”Since its founding in 1935, the HSC has expanded its collection by more than two hundred thousand works. Through its extensive online presence, it now boasts thirteen thousand works, including works by Willem de Kooning, Anne Kent, Ivan Serpa, and Anne-Marie Curie, a", "The next Biennial should take place in 2022 and will be curated by Johanna Skjødrup (Sweden), Wolfgang Voigt (Germany), and Joël and Rainer Weiss (Germany).“The first Biennial was a great success, and now it is our turn to sustain it through our operations, our artists’ lives, and the memory of the great artists who have made possible this Istanbul Biennial,” said Alexander.The biennial, which comes at a critical juncture for the Turkish government and was organized by the Akkad Museum and the Fethullahg Museum in the capital of Ankara, will be staged in the former Şırnak Palace in the capital of Büyükara, which is currently undergoing a major renovation. The project, which is expected to be completed in 2021, will bring the museum and surrounding buildings in a new state of preservation.The renovation of the palace, which houses the Ottoman Empire’s collections and remains closed since 1923, was begun by the Berber designer Saadiyat Çelik. The renovation project, which also includes the renovation of the surrounding monuments, is being overseen by architect Hüseyin Şahin, who is", "The next Biennial should take place at the Metropolitan Museum of Art in New York, which has previously staged the biennial twice in the past. The Metropolitan Museum of Art has already staged the exhibition twice, in 2008 and 2011. The event will be curated by Elizabeth Alexander, who is currently an assistant curator at the museum, and will take place at the Met, the Chrysler Museum, and the Museum of Modern Art, the Fisk University Museum, and the Museum of Contemporary Art New York.\n\n\nThe Düsseldorf-based contemporary art publisher SLG Gallery, which was founded by Wolfgang Lübke and Georg Geustlin in 1997, has announced that it is closing its doors indefinitely. The publisher, which has locations in Düsseldorf and Frankfurt, was preparing to open its first Düsseldorf edition in March 2020, but the project was put on hold after a fire at the gallery in January 2021.In a statement posted on Instagram, the publishing house said: “The initial Düsseldorf edition was not only of a high quality but also an ambitious and innovative level, a collaboration between an international team of curators from different fields. The collaborative, interdisciplinary approach developed is", "The next Biennial should take place in the winter of 2021–2022. The exhibition of the artist’s work will be organized in cooperation with the Faculty of Arts, and will include the exhibition of his paintings and sculptures. The artist will collaborate with the Institute of Contemporary Arts, Berlin; the Museum of Modern Art, New York; the Museum of Modern Art, Tokyo; and the Museo de Arte Contemporáneo, Buenos Aires.“The Biennial has always been a project of the biennial, of the ICAB, and of the MFAF, and we have been able to transform the exhibition into a platform for the artist’s ongoing practice,” said Reinhardt. The panelists who were nominated for the award were: Melissa Chen, Emilio de la Torre, Kai Fong An, Paolo Gabrielli, Michael Masplund, Thomas Magid, and Peter Uden. A full list of the jury members can be found on the ICAB’s website.\n\n\nThe Canadian Museum of Fine Arts (CMFA) in Toronto has appointed Farah Al Qasimi, a former curator at the National", "The next Biennial should be held at the new site, with a view of the new museum complex and the city-built museum, in October 2021, and will be guided by artist's collective Koangmyong, whose first exhibition here is “A Star is Born (”).\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that several of the city’s arts and cultural institutions will receive a $150,000 grant from the Crown Fund in support of “the arts and culture of tomorrow.” The grants will go to Aramaic Gardens, the Bronx Museum of the Arts, and the Broadway Company, among other institutions. “NYC residents want more from their government,” said D.J. Crowley, director of the Department of Cultural Affairs. “The grant program is a way for the city to give back to our cultural institutions and communities, and to create new opportunities for vulnerable communities across the city. This year’s grant season is particularly important for arts and cultural institutions, whose ongoing investments in the city create new opportunities for the city to grow and for cultural producers of tomorrow to thrive.”The grants will go", "The next Biennial should be staged in 2020, with the first exhibition, “30 Years of Building a Biennial,” to be held in 2021.The book will be published by Thames & Hudson in April.\n\n\nTacita Dean, the director of the New York Institute of Technology (NYIT), has been appointed director of the Metropolitan Museum of Art (MMA). Dean has been leading the museum since 2010, when it was still known as the Metropolitan Museum of Art, and has overseen more than two hundred exhibitions since that time.She succeeds James G. Wilson, who departed the museum on June 12 to become the director of the Museum of Modern Art in New York, and will assume her responsibilities on August 1.“We are thrilled to welcome her to the Met,” said museum director Simon Gilbert. “Tacita represents a broad breadth of contemporary art practice, and her appointment is an exciting development for our mission to make the museum relevant, relevant, and relevant again.”Prior to joining the museum in 2010, Dean was a professor of art history and theory at Columbia University. She taught at Yale University from 1990 to 2002. During her tenure at the museum, she helped to launch the museum’s new", "The next Biennial should take place in 2020 and will consider the history of art from the dawn of time to the present. The theme of the first exhibition was 'The Future Is Present,” and the theme of the second exhibition is “Practicalities of Art.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Kelly Aschbacher as its new associate curator of photography. She will be responsible for representing the museum in its annual March exhibition “Museum of Modern Art Photography” at the Greenwich Village Museum of Art (VMMA).“Kelly is a native of New York and has been a curatorial assistant at the museum for four years, including the first three years of the show,” said director Christopher Le Brun. “Her new role is a natural extension of the curatorial efforts of her predecessors, who had a particular interest in twentieth-century photography.”Previously, Aschbacher worked as an adjunct art historian at the Museum of Modern Art and has held positions at the National Gallery of Art and the Metropolitan Museum of Art. During her tenure at VMMA, she curated a number of exhibitions, including “Photography and the Modern World: Modern Art from the", "The next Biennial should be held in January 2021. \n\n\nWangechi Mutu, the president of West Africa, has appointed three new members to the African Union (AU) advisory body, which advises African nations on international cooperation. The eleven members are: Omari Zubeldia, the secretary general of the International Union of Museums (UUM), Nabil Aili, the secretary of the Confederation of African Unity, and Alessandra Gobbi, the chair of the African Museum and Library Services Association. The three newly appointed members, Sinéad Ashley, Rachid Karrar, and Ndola Njideka, are charged with promoting the unity, sustainability, and conservation of African arts and heritage.The AU’s board of directors will meet this week to elect a chair and a vice chair.\n\n\nThe Paris-based NGO SOS Médicalis (SOSM), a network of regional and international artists who were detained in Egypt for more than a month in February due to their work “rescuing the Al-Aqsa Mosque in Jerusalem,” has called for a halt to the forced repatriation of Palestinian artworks, Palestinian heritage sites", "The next Biennial should be held in 2021.The next exhibition, titled “Elevation,” will open at the Museum of Modern Art in 2020. This will mark the second time the institution will stage an outdoor exhibition dedicated to the artist in the history of the museum, following the opening of his studio in New York in 1968. The inaugural exhibition, titled “Drawn to You,” will open in 2020.\n\n\nThe Metropolitan Museum of Art in New York has appointed Sara Cwynar as its next director and CEO. She will be responsible for growing the museum’s collection and organization and will take the helm from director Andrew Kreps in January.“Sara’s visionary leadership and curatorial approach will define and strengthen the Met’s expertise and mission as we continue to grow and evolve our collection, educate audiences about contemporary art through exhibitions and education initiatives, and promote the museum’s mission,” said Kreps.Commenting on her new role, Cwynar said: “I’m thrilled to return to the Met in 2017 to lead the museum’s collection and organization as we build on our focus on the creative and organizing of contemporary art and our commitment to the", "The next Biennial should be at no later than Spring 2021. The first edition, which occurred in the spring of 2021, will run from March 15 to March 19, with a special exhibition of works by artists from the Global South at the same time. The Festival will be a platform for the production and exhibition of new works by artists from Northern, Central, and Southern Africa.  The 2018 edition was curated by Máira Kadango, with the contributions of Antony Loewy, Antony Shively, and Barnaby Siyabula.The 2019 edition was curated by Monica C. Enjada and Walter R. Juma. The 2019 edition is on view through February 18 at the Musée d’Art Contemporain de Lyon.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the reopening of the Solomon R. Guggenheim Museum, a landmark cultural institution that dates to 1928 and houses more than three hundred works by artists including Robert Irwin, Richard Diebenkorn, and Paul Gauguin. The guidelines, which were issued by Mayor Bill de Blasio on May 6, 2020, outline the steps that must be taken to reopen the museum, including the", "The next Biennial should take place in 2020. Škino said: “The future of artistic production in Sweden lies with the artists who work in an open and creative way. The next edition will be an international platform that will bring together 70 artists from across the world and create a platform for new artistic efforts. The programme will be curated by Akiko Škino, Berit Wiklund, and Jönica Kivimä and will be led by a select group of artists, including Maarten Persson, Anna-Karin Olsson, Moschino Nießen, Per-Heinrich Rau, and Olga Simões.The show will receive funding from the Swedish Ministry of Culture and Arts, the Swedish government, the sister country of the Art Basel, and the Swedish Arts Foundation, and will take place in the city of Gothenburg.\n\n\n\n\n\n\nThis week, the New York City Department of Cultural Affairs (DCLA) announced that it plans to hold a number of exhibitions and other events to commemorate the city’s thirtieth anniversary this fall. Among the projects that will take place are a retrospective of the work of the same name that will examine the life of artist", "The next Biennial should be held in 2020. \n\n\nThe Museum of the African Diaspora (MoAD) in London has appointed the first Black curator of modern and contemporary art, Mira D. Ballenger, as its new executive director. Ballenger comes to the organization from the Metropolitan Museum of Art, where she has helmed the Edward Hopper–designed Contemporary Art Museum since March 2019. Ballenger will take up the post after curator Victoria Siddall resigns from the position.“Ballenger’s appointment marks a milestone in MoAD’s history,” said Mark Lynas, chair of the board. “Her history of contribution to the museum is rich, and her leadership qualities exceptional. We look forward to her leadership role in shaping MoAD’s future direction and to working with her to create a strong voice for contemporary art in the United Kingdom.”During her tenure, Ballenger has organized several exhibitions, including “The Binding of Al ˙Omar: A Renaissance Perspective” (2016); “Leo and Virginia Woolf: A Man-Centered Visual Art” (2018); and “Communications: From the African Diaspora to the Modern World", "The next Biennial should take place in the spring of 2022. The next iteration of the event will focus on the history and theory of modern and contemporary art form and will take place in the months of March and May. A new formal format for the biennial, which will be organized as a multi-venue exhibition, will be announced at a later date.\n\n\nAfter a jury comprising art critic Roger Telling, art historian Jim Cole, curator Mariaf Marques, and curator Hoa Nguyen concluded that the works of the first-ever exhibition of work by a woman, a manifestance, and a painter in Los Angeles, the city council voted unanimously to establish a commission to present a “feminine voice of contemporary art” in 2020. The first exhibition to address the topic was “A Girl in Paris,” which was staged by the Los Angeles–based nonprofit Women on Film, a visual arts center that was founded by artists such as Elizabeth Peyton, Joe and Jack Pons, and Laurie Anderson. Under a $10,000 grant from the Lewis Powell Foundation, the nonprofit curated the first show of work by a woman to be presented by a contemporary artist in the United States, and the commission was created by artist-activist Elisa", "The next Biennial should take place in 2020, but the festival’s current iteration, which doubled as a platform for artists and activists across Japan to collaborate, is being postponed. In a statement, the festival said: “The '21st' Biennial will not be staged this year. The decision was made after a thorough consideration of the current situation and the possibility of the exhibition being staged in late 2020. We believe the current situation is good enough to push on with the exhibition as planned, and are planning for its future as a show of contemporary art.”The biennial was inspired by the work of Japanese architect Koki Tanaka. His prefabricated buildings, which are filled with objects such as pots, shelves, and other utensils, often employs salvaged materials such as wood, copper, steel, and metal to create works of art. Artforum and other news outlets in the country have featured some of his minimalist architecture projects throughout the years. The exhibition will mark the 70th anniversary of the event.\n\n\nThe National Association of Broadcasters (NAB) in the United Kingdom has announced that it will no longer participate in the Royal Academy of Arts (RA) in London, the Royal Shakespeare Company (RSC), or", "The next Biennial should take place in 2020. \n\n\nMaya Aish (1942–1990) was one of the most pioneering and influential African-American artists of the twentieth century. Her work, which was influenced by her own childhood and by the avant-garde of the 1960s, takes a particular focus on the Black experience in America. Her work has recently been collected by numerous collectors and institutions, including the Shiloh Art Museum, the Brooklyn Museum, and the Metropolitan Museum of Art, and is currently on view in the American Paintings Museum.Aish’s work, which consists of a series of drawings and paintings that combine elements from Tablet, the Black Power movement, and Afrika Bambaataa, is considered one of the most important prefigurations of the Black Power movement. Her work was included in the 2011 Whitney Biennial, which celebrates the work of forty-nine artists, including Amara Abdurraqib, Robert Irwin, and Tarell Alvin McCraney. “It’s a very important vein for art,” said Amanda Dunn, chief curator of the Whitney Museum of American Art. “She was very much a part of the fabric of American art and seems", "The next Biennial should take place in 2019, and the first in 2020. The first event, called the Beyond the Binary, was held in February 2019.The theme of the next edition, “The Event,” is a combination of “events as they occur,” according to the organizers. “It is about how we as a society are connected to events, both personally and collectively. We are about to witness a moment of reckoning for our culture.” \n\n\nThe Zurich-based artist and educator Reinhold Messner has died at age seventy-eight at his home in Zurich. He was one of the founding members of the radical New York-based collective the V-Neck, which drew from postwar American art to explore the concepts of the digital, the body, and the body in the digital world.Messner, who was born in New York City in 1943, studied under the legendary American artist Norman Rockwell at the School of the Art Institute of Chicago (SAIC) in the 1940s. In his 1979 essay “Art in the Digital Age” for the Artforum, Artforum editor Steven Heller wrote that “Messner’s work is in a way a continuation of Rockwell�", "The next Biennial should focus on diversity in the arts across the city and will also include a review of the city’s relationship with the US Department of Homeland Security.\n\n\nThe City of New York has released a list of twenty-six artists who will participate in the upcoming Fifth Biennial of the Korean American Community, which will be held in the city from March 13 to March 20. Participating artists will be selected from a pool of twenty artists who are eighteen years old or younger and will be given a year to design and create a work for the event.The biennial, titled “Taking Back the House: American Art and Americanism in Korea” (The House We Live In), will draw thirty-six artists from twenty-nine countries and will be led by the Korean American Heritage Foundation (KAHF), which is affiliated with the Seoul Art Museum, and the Asian Art Museum in New York. The group will be composed of Kim Eun-kyeong (1923–2016), Kim Eun-kyeong-sung (1927–2016), Kim Eun-kyeong-su (1926–2016), Kim Eun-kyeong-su-ke, Kim Eun-ky", "The next Biennial should be held at the CKG, London, on February 25-March 3, 2020. The first iteration of the event, “Biennial of the Life and Death of Nelson Mandela,” was staged at the CKG in 2010 and consisted of lectures and screenings of documentaries and selected artworks from the artist’s extensive body of work.The event was scheduled to run from March 16 to March 19, 2020, but was pushed back due to the Covid-19 pandemic. The new date is now March 13–March 15, 2020. The 2019 edition, in which Mandela was interviewed by Udo Kittelmann, was also moved to March 8–March 10, 2020.\n\n\nOver the years, the estate of the late British architect K.C. Johnson, who devastated the landscape and spirit of Covid-19-ravaged Austin, Texas, with his high-flying, multilevel, open-air condominiums and terraces, has been consumed by the AIDS and cancer struggles of the world. In 2013, the estate settled more than $1 million in a wrongful-death suit against Johnson’s company, Johnson Creations, for defrauding the AIDS Coalition of", "The next Biennial should be held in the following year. It is anticipated that the new venue will be able to host fifty-two exhibitions per year. The 2019 edition will be held at the Wadsworth Atheneum, where it will be presented by Art Journalist Emily Hall and curated by John Currin. The exhibition will be based on the new project partners SHAPE, an incubator established by Art Basel, and WHITE PAPERS, a nonprofit organization that offers free archival research and legal aid to artists. The new museum will also host the 20th Biennial of American Art in 2021, the first event ever held at a museum that is not a public institution, and will host the 20th Jurassic Park at the Los Angeles County Museum of Art in 2022.\n\n\nThe City of New York has approved a new $2 billion renovation of Central Park that will add more than two thousand square feet of public space to the park, including more public seating, additional interpretive displays, additional public gathering spaces, additional bike storage, and additional public gathering tables. The plan, approved by Governor Andrew Cuomo on Friday, expands the park’s public realm and extends the park’s reach", "The next Biennial should be held at just the right time, in the right place, with the right people, in the right place at the right time, with the right institutions, and with the right materials. [The Biennial of Arts in Miami Beach will be held in April 2021.] \n\n\nThe institution with the largest collection of contemporary art in the United States, the New York Public Library, will merge with the California Institute of Technology in May to become a new California Institute of Technology (Caltech), which will add two new collections to its portfolio. The move is part of a $3 billion plan to reorganize the digital holdings of the two universities, which are currently working together to digitize and prepare for a new complex, the California Museum of Art, Los Angeles, and the San Francisco Museum of Modern Art (SFMoMA), which opened in 2017.The redesign of Caltech, which combines the two universities in a new campus located on the campus of the former Pacific Electric Company (PECO) in Santa Monica, California, is part of the university’s long-term plan to modernize its physical infrastructure and reduce its footprint. The plan—which also includes the construction of a new new building and the renovation", "The next Biennial should take place in the fall of 2020.\n\nThe museum will also introduce new programming and a larger and more accessible installation, which will be accompanied by a new book and a new museum-wide presentation of artist-made works, called Art and Objects of the Earth. The exhibition, which will run concurrently with the Museum of Fine Arts Los Angeles (MFA LA), is slated to open in January 2021.\n\n\nA group of American art experts has urged the United States Congress to establish an independent commission to study the potential transfer of cultural artifacts made by American foreign soldiers to Iran and other countries that use these artifacts in military operations. The experts—including scholars at the University of Pennsylvania, the University of California, and the University of California, Berkeley—have created the website Artnet to highlight and call out the ways in which American war statues can be put to military use.“The transfer of cultural objects from the United States to countries that use those objects in hostilities violates the international humanitarian law and the statutes defining the commissions and the offenses,” Caroline Schechter, a lawyer and arts campaigner who is one of the report’s signatories, told the Art Newspaper. She added that the commission should be able to hold", "The next Biennial should also examine the allegories of the fourteenth, fifteenth, and seventeenth centuries, and develop innovative new projects inspired by the contemporary moment.”The event will also highlight longstanding themes such as the power of images in representing and processing cultural and political histories. A number of exhibitions, including “20 Years of Art in the U.S.” (2019), “Alfred Stieglitz: Taking a Permanent Form” (2015), and “Aristoteles and the Birth of Western Art” (2013), will also include works by the artist and will open on October 15.\n\n\nThe Museum of Fine Arts (MoFA) in Boston has appointed Catherine Lusk as its next director and CEO. Lusk comes to the museum from the SculptureCenter in New Canaan, Connecticut, which she has led since 2012. In that time, she has transformed SculptureCenter into a world leader in sculpture donation and has added new works to its collection and collection programs. In the past, Lusk has been called a visionary leader and a trailblazer. As director of the SculptureCenter, she has organized more than a dozen exhibitions and has helped the museum raise more", "The next Biennial should be held in the spring of 2020. Lopez-Santana will serve as the first director of the new event, which was founded by Juanita Broder and Thomas J. McNamara to promote the work of women artists. The inaugural exhibition, “Paradiso,” will feature work by twelve artists, including Sun Duk-kyu, Jing Ling, and Megan Central, and will run from March 19 to March 21. Its next edition will take place in Japan from March 23 to March 25, 2020.\n\n\nArtCommune New York has named Amanda Todd as its next executive director. Todd comes to the organization from the New York–based nonprofit, the Amanda Todd Foundation, which has supported art in the Greater New York City area for more than twenty years. She succeeds Sara Zweck, who departed in the summer of 2020 to join the Bernstein Foundation in New York, and will assume her responsibilities in November 2021. “We are thrilled to welcome Amanda to ArtCommune,” said Mitch L. Greenberg, president of the organization. “The breadth and depth of her experience, as well as her enthusiasm for the work of artists", "The next Biennial should be held at the Museo de Arte Contemporáneo (MASC), Madrid; the final design of the exhibition will be decided by the Board of Directors of the Museum of Contemporary Art (MAS), Madrid. The museum will decide whether to proceed with the exhibition by February 16.In an open letter addressed to the board of directors of MAS, the Münster Art Foundation   said: “MASC is proud to be participating in the first-ever Biennial by the Museum of Contemporary Art, in a city, in a year, for the Museum of Contemporary Art. The exhibition will be a challenging and exhilarating journey through the culture of Spain, with the potential to introduce new ideas and the richness of its heritage.”The first edition of the exhibition, “Arts of the Past” (2019), featured work by sixty artists whose works were selected by a jury comprising Kainat Karayiar, who heads the governmental commission for the exhibition; Nuria Pérez, who is the board president; and architect Ricardo Espírito-Rodríguez. In the second edition of the exhibition, “Arts of the Present” (2019), the same jury", "The next Biennial should be held at the Noguchi Museum in Tokyo in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has announced that it intends to cancel the upcoming edition of the Art Basel Hong Kong fair, which was set to kick off next week, due to concerns over the coronavirus. In a statement provided to Artnet, the fair organizer said: “We are aware of the new risk factors for the coronavirus and are working closely with our partners to define the best possible strategy for the fair. With that in mind, we have decided to postpone the event.” The announcement follows the recent coronavirus scare in Europe, the United States, and Australia. According to the New York Times, more than 1,500 people in the United States have contracted the virus and the majority of cases are confined to one state. In the UK, where the coronavirus outbreak began in March, 176 people have died and more than 8,000 are infected. The coronavirus outbreak has also spread to Mexico and Canada, leading some health experts to fear that the virus is on the way to Europe, the US, and the UK.\n\n\nThe Museum of Contemporary Art (Mo", "The next Biennial should take place in 2020 and will end with a special exhibition of work by the Italian artist Paolo Baldessari.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is working with the Los Angeles County Museum of Art (LACMA) on an initiative designed to organize and showcase work by young contemporary artists. The program, called the LACMA/Museum Lab, will run from September 5 to the September 8. Titled “Theoretically,” the program will include a show by the Los Angeles–based artist Laima M. Arruda, a collaborative performance, a monograph, and a residency at the Museum of Contemporary Art. “We are thrilled to partner with LACMA to continue the work of teaching young artists the most intriguing possibilities for the museum,” said Nancy Grant, director of the museum. “LACMA has long had a robust program of contemporary art exhibitions and programming that has led the way in the field. It is especially notable for having an artist-led board of directors that has fostered the development of a strong aesthetic tradition that sets the museum apart from the pack. We are grateful to LACMA and to", "The next Biennial should be called a “new beginning” and will focus on “the potential and possibilities of the body in collaboration with its spiritual environment.” The rest of the Biennials will be organized as they see fit. The architect and philosopher   Günther von Brunner called the event “an invitation to re-create the body, to re-create the soul, to re-create the universe.” \n\n\n\n\n\nThe Tate’s board of directors has created three new roles for artists and collectors to play a role in future programming: curating exhibitions, developing curatorial projects, and working with the Tate’s staff.The appointments are part of Tate’s annual Autumn Statement, which the board described as “passionate, critical, and radically original.” Tate’s current chair, Deborah Biggs, who will retire in December after twenty-six years at the helm of the institution, will continue to serve as chair after her successor is appointed. The new roles will begin in January 2021 and will last for a total of four years.“Tate is a leading creative and cultural organisation, with a long-standing tradition of creative", "The next Biennial should be held in 2020. In a recent exhibition organized by the Polish artist Anna-Sophie Mörg and the German public, Bódzdziela and Wojciech, Poland, the exhibition presented work by more than sixty artists from twenty-four countries. This year’s edition, entitled “Longing for a World Without War: The Polish Persistence,” was held at the Gdańsk Museum in Gdańsk, Poland, and was nominated for the Polish pavilion. The biennial will also host a series of exhibitions, performances, and other events that will aim to raise awareness of the war’s involvement in the country and draw attention to the suffering of the civilian population.The biennial and the work of the entire team is dedicated to Dr. Bartosz Wojtas, who died earlier this month. The works in the exhibition were selected for the Polish pavilion by the jury that assembled at the museum. According to the Art Newspaper, he was one of the five selected for the biennial. The other finalists were Oświęcie Wojtas, Piłsza Wozni", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has welcomed three new members to its board of directors: mnemonic-maker Markus Pfäfflin, who has served on the museum’s board of trustees since 2015; collector and collector-designer Leo Tonioli, who recently announced his retirement; and architect Wolfgang Haenenschlager, a former director of the University of Applied Arts Berlin.“We are delighted that these three individuals have joined our board of directors and team, which has been expanding and reshaping over the last three years,” said board chair Ann Shaughnessy. “Markus Pfäfflin is a contemporary curator who has been involved in and influential in contemporary art for fifteen years; Leo Tonioli embodies the future of architecture and design in a way that is both original and compelling; and Wolfgang Haenenschlager represents a significant new phase for architecture and design.”The board also expanded its membership by appointing Valeria de Cisneros as president. Previously a director of the Santa Fe Museum of Art, she recently served as director of the University of Applied Arts Berlin. The board also elected Harvey Pad", "The next Biennial should be held in 2019, with the announcement of the winner confirmed in 2020. The inaugural exhibition, “Beautiful Bodies,” was held at the Museum of Modern Art in New York in 2017.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to begin accepting visitors by appointment only in 2021. The change means that visitors will only be able to visit the institution once a year. The institution estimates that it will save $1 million a year in maintenance costs by allowing visitors to enter in 2021.“The extension of the Guggenheim’s network into Los Angeles is a game changer for our museums, and for the region as a whole,” said Mark B. Goldwasser, chair of the board of trustees. “From the beginning, the Guggenheim has prioritized sustainability over accessibility. We have worked hard to establish a robust network of visitors, to create a more compelling program, and to offer more intimate and focused experiences, all while ensuring our sustainability goals. The decision to extend the Guggenheim’s reach into LA is a revolution in how we think about and experience our world.”The institution also announced", "The next Biennial should be held in 2022 and will be curated by the Danish curator Jan Egeland.  Each year, the award ceremony will take place in Oslo and the exhibition will be curated by the director of the Banyenæ Museum, Taka-Senjoug-Jirji in Finland. The award ceremony will be hosted on May 23 at the Banyenæ Museum and will feature the artist’s work for the first time.\n\n\nThe London-based arts nonprofit the London Film Festival (LFCF) has announced that it will suspend production at its London event, “The Big Bang,” in March 2019 due to concerns surrounding Covid-19, and has extended the deadline for exhibitors to March 31. The postponement, which was made to protect the health and safety of the festival’s crew, artists, and other participants, was made during a meeting with festival organizers on Thursday, March 21. “The team is deeply disappointed with this decision,” said Peter Schäfer, chair of the festival’s executive board. “We are working hard to come to an agreement that will protect the safety and well-being of our staff, the", "The next Biennial should open in 2020. The exhibition will then be accompanied by a new book, Making Place, which will explore the relationship between the European art world and the people of the city, and a new exhibition of work by the artist-designed works in the Exhibition.”The Biennial will also present a retrospective of Dorothea Rockburne’s work, “Making Place: Dorothea Rockburne” in 2019, and a new exhibition of works by the artist-designed Sergio Caballero. The exhibition will be followed by a series of lectures and an exhibition of the artist’s monographic works in 2020. \n\n\nThe Directorate General of Arts and Culture (DGAC) of the Italian Ministry of Culture, Fabio Potenzio, has announced that Meredith Chivers will be the next director of the Palazzo Reale di Cervino, a major contemporary art museum in Rome. Chivers will assume the helm of the institution, which was established in 1946, in January 2021. “Our museum is in a much better place than it was when the museum was founded,” said potenzio. “It has recovered from the damaging effects of the global health crisis", "The next Biennial should be an expression of the strength and vitality of our country’s arts and culture, which has been so sorely lacking for decades. It should also embody the vitality of our communities, and reflect the unique story of our country.”\n\n\nAllan Andrew Dyson, the first director of the National Galleries of Scotland, was appointed as director of the National Museum of Scotland. He was also appointed director of the Edinburgh Art Museum and the Scottish National Gallery by the former Scottish government, which took the helm of both institutions in January 2019.Previously, Dyson served as director of the New Museum, where he was responsible for developing new programming and overseeing the museum’s reopening in 2020. He previously worked as director of the University of Edinburgh’s Arts and Culture Centre and as director of the Tate’s. He will now assume his new responsibilities at the National Museum of Scotland, which opened in Edinburgh in 1888.“As a lifelong visitor to Scotland, I have long admired the National Gallery of Scotland and am delighted that this has become a reality,” said Dyson. “I am looking forward to working in the role of National Museums Scotland’s director and helping to shape the museum", "The next Biennial should be held in 2020. The first World Summit was held in Sakhnin, Ukraine, in 2010 and will be held in Prague next year. The National Museums of Art and History in London are planning to stage two exhibitions in 2017.  Museums in Shanghai and Chongqing, China, have partnered with the MCA to stage a new exhibition, “Maya Lectures on China” (2019), in 2021. The exhibition will accompany the exhibition of Maya Lin’s exhibition “Chinati: Pre-Alpine” (2017).\n\n\nThe Oklahoma City Museum of Art (OMA) in the United States is collaborating with the Seattle Art Museum to photograph the Mānoa River and its tributaries in order to create an archaeological exhibit that will highlight the city’s relationship with the Mānoa River and Mānoa Valley, which forms the center of the Mānoa Historic District.The project, “Between Two Worlds: The Mānoa River and Mānoa Valley” was commissioned by the Seattle Arts and Cultural Alliance (SAAC), a Seattle nonprofit that seeks to increase awareness of the region�", "The next Biennial should be called the “Centennial of African American Art” and will be held at the Museum of the African Diaspora (MAD) in Harlem, New York, from March 21 to March 23, 2019. The third event will focus on the art of the African Diaspora.The new museums will be founded on the same site as the Museum of Modern Art, which was moved to its new home in the Museum of Modern Art, and will work together in partnership with the museum. The  Museum of Modern Art’s first exhibition, “Painting in Black” (2018), on the first floor of the museum, adorned the museum’s facade with murals by artists ranging from Igor Stravinsky to Renzo Piano. The show is scheduled to reopen in 2022.The announcement of the new institutions was made in an invitation-only video for the upcoming event, titled “The Future Is Now.” The video, which premiered at the Fifty-eighth Venice Biennale, which runs through March 23, follows a recent video by artist Ali Yaghi, “As I Lay Dying” (2017), in which a young Yuriyev from Kazakhstan", "The next Biennial should start in early October and will be titled “Away From the Sun,” according to the   Art Newspaper. The exhibition will be curated by Pierluigi Battista, the director of the Lucchetti Museum of Art, and will be hosted by Vittoria Catellani, the artistic director of the Mina Art Museum Florence.The first show will be a new work by Italian artist Stefano Sforza, which was commissioned and housed in the Mina Art Museum Florence, and will open at the Museo di Biennale in January 2020. The other shows will be featured in the exhibition “Fresco 2016” (May 15–December 16), “Fresco: Space for the World” (January 23–February 27), “Stefano Sforza: The Year” (March 23–March 29), and “Stefano Sforza: Life, Present, and Future” (March 29–March 30).In the second exhibition, the artist will present his abstractly crafted SOLUTIONS series, which explores the interrelation of materials and forms, in the form of a woodcut inspired by", "The next Biennial should take place in February 2020, at the Museum of Contemporary Art Los Angeles, and is expected to be the final work in the series. The exhibition will be the first of five, with the exhibition of the first two to be held in January 2021 and the final work to be staged in March 2021.The installation of the first Biennial will be held in an area of the museum known as the Cultural Center, which was rebranded as the Museum of Contemporary Art between 2008 and 2011 and opened in January 2011. The museum’s new location in the city of Santa Ana, California, is located at 600 South Fifth Street in Los Angeles, and the first exhibition in the new venue, “611: A Retrospective of Art” will open on January 10. The exhibition will feature work by thirty-three international artists, including Raffaello Cattelan, Lutz Bacher, Vito Acconci, Yasuhiro Takemoto, and Arthur K. Lucas. The second Biennial will be held at the Contemporary Art Museum St. Louis in February 2020 and will feature work by thirty-six international artists, including Ann Garner, Eric Heisserer, John Heger, Terrie O’Donnell", "The next Biennial should take place in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has won the $250,000 David K. Gallen Art of the Party Award for Design. The honor comes with a $25,000 cash prize. This year’s iteration of the prize, which was established in 2017, was hosted at the Museum of Fine Arts in Boston and the Museum of Modern Art and was presented by the New York–based architectural firm Herzog & de Meuron.“The David K. Gallen Art of the Party Award for Design was initiated by the Gallen family in honor of David’s legacy and inspired by the Kastner Gallery in Brooklyn, where David is buried,” said MFA Director Christopher Bedford. The award is an extension of the Gallen Family’s longstanding commitment to the arts. The family’s holdings include works by Robert Irwin, Alighiero K for the Los Angeles Police Department, the City of New York, and many other prominent artists.The David K. Gallen Art of the Party Award for Art won design awards in the areas of photography, architecture, and theater last year. It also garnered a hefty $1 million for", "The next Biennial should be held in 2020, two years after the event, titled “Art and the Twenty-First Century.” Mr. Shinn, who received a Presidential Medal of Honor in 2009 and is currently the former director of the Museum of Modern Art in New York, said that he anticipates the exhibition will draw visitors from all over the world.\n\n\nThe Central Library of the City University of New York has announced it will engage in a series of public consultations with the community to better understand the needs and desires of New York’s art and design communities. The initiative will open with a review of the institution’s current offerings, which, according to the institution, is more than two hundred percent comprised of people who are not art school graduates.The library will then collaborate with artists, academics, and other organizations to further explore how the library can present more of a focus on the art of the future through programming and exhibition. The library will also offer free digital literacy and numeracy classes. In partnership with the Art Students’ Association, the Central Library will present a digital version of “Alberto Burri”—a program that teaches the art of architecture and design through the work of a group of Italian architects.", "The next Biennial should be held in 2020. \n\n\nAlexandre Bochereau, the French sculptor whose life and work could have been threatened by the military dictatorship in Paris, has died at age eighty-one, the Paris Match reports. The author of sculptures such as the Circle of Fifths, 1973, and the Eternal Jew, 1979, Bochereau was a humanist champion of the human spirit. In his book Avant-Garde at Work, published by the Gallery of Modern Art in New York, Bochereau discusses the importance of the human and the spiritual in his work, noting that the artist “becomes the center of life, the center of everything.” The work of the artist can be found in the collections of the Museum of Modern Art and the Musée d’Art Contemporain in Paris.“Alexandre Bochereau: The Three-dimensional Man,” 1986–2018, 2017. In the film adaptation of the work, which is scheduled to premiere at the Venice Biennale in March 2020, Bochereau plays a French anthropologist who is studying a group of twenty-one-to-fift-year-old", "The next Biennial should coincide with the 2020 Venice Architecture Biennale, which will take place in the summer of 2021. The next iteration of the Biennial will take place in the spring of 2022. In a release, the Contemporary Art Museum Stuttgart said: “We are delighted to collaborate with our partners at Parco and the city of Berlin. Together we will present not only a story of contemporary art in Berlin, but also a road map to future work by artists.”\n\n\nThe Pérez Art Museum Miami (PAMM), the arts hub of Palm Beach County, has received a gift of more than 1,500 works by thirty-eight artists from the Miami-based collector and philanthropist Howard Englund. The museum also received a notable addition to its collection, a rare eleven-thousand-work collection of eighteenth-century American painting, a major loan of the work of artist Victor Hugo Boss; and the collection of artist-in-residence Ruth Crewe.PAMM director James \"Big Daddy\" Feldman said: “We welcome these contributions to our remarkable collection and to the museum’s mission of showcasing the best art in the world. Howard Englund and Ruth Crewe are dedicated to advancing", "The next Biennial should be staged in 2021. The inaugural edition, which premiered at the Venice Biennale in 1967, was not successful and was cancelled the following year. \n\n\nThis January, the Museum of Fine Arts (MFA) in Boston, Massachusetts, will reopen to the public following a $250 million expansion. The $175 million overhaul includes the installation of a new series of galleries that will showcase works by young and established artists, as well as a re-creation of a nineteenth-century art museum that served as a focal point for artists.“We are thrilled to open to the public once more, following a $150 million renovation, as part of the Boston City Council’s long-term plan to revitalize City Hall,” said mayor Martin J. Walsh. “The expansion will help the MFA become a museum of civic engagement and inspiration for a city as diverse as Boston and as important as ours. We will continue to work with the city and the Boston Public Schools to develop new programming that reflects the city’s rich artistic heritage, while retaining the MFA’s historic core.”The MFA’s new location in Charlestown, Massachusetts, is adjacent to the city", "The next Biennial should be in the spring of 2021.The Biro Group’s board of directors has established a special fund for the renovation and conservation of the museum’s assets. The fund will receive a $125,000 donation from the Altíve Foundation and will be given to the institution as well as the National Museum in Lisbon. Funding will also be made available to the institutions for the reconstruction and restoration of the Museu de Arte de Lisbon (MAK), the National Museum in Lisbon, and the Museu de Arte de Portugal (MASP). The funds will also support the organization of a series of exhibitions and other programming in partnership with local, regional, and international artists and artists.“This is an unprecedented financial crisis for museums, but one that is largely outside the control of the banks, the regional administrations, and the central banks,” Daniela Ortega, spokesperson for the Biro Group, told the Art Newspaper. “The Biro Group takes the crisis very seriously, and we are working in close collaboration with our partners to develop strategies for how we can support the museums in the coming months and years. We are working with our partners to come up with a plan that will be sustainable", "The next Biennial should be held sometime in the spring of 2021. “The challenges we face in maintaining and renewing the biennial are enormous, and I especially appreciate the support of the entire board,” said Walker. Based on the biennial’s original proposal, the exhibition, “The Third Wave: Art and Politics in the New Art Movement” (2017), was staged at the Black Box Art Museum in Chicago. \n\n\nThe Institute of Contemporary Arts (ICA), the New York–based nonprofit that runs the nonprofit Brooklyn Museum, has been acquired by the International Consortium of Museums, which includes the SculptureCenter, the Brooklyn Museum, the Metropolitan Museum of Art, and the Whitney Museum of American Art in New York, New York. The holdings of the ICA will be transferred to the consortium for institutional use, and the museum will continue to operate under the ICA’s leadership. The purchase price was $2.8 billion. The consortium, consisting of the French modernist Léonane Bénétière, the Swiss artist Georges Apostu, the Toronto architect Frank Gehry, and the Hungarian architect Krasimir Kreme, chairman of the consortium, announced the acquisition", "The next Biennial should focus on the history of contemporary art, and should address how biennial exhibitions are being produced today and how they will be presented in the future. I believe that for the next exhibition, the best illustration of the work of the artist will be the work of the creator, and that will be the centerpiece. “After all, art is the spirit; the spirit is the greatest force.”\n\nThe National Gallery of Canada (NFC) in Ottawa has announced that the centenary celebration of its founding in 1952 will be marked with a memorial service that will take place over the course of several weeks in April. The event will celebrate the centenary of the institution’s founding, which is marked with a public opening ceremony and includes the installation of the National Gallery’s first permanent sculpture, “The Moral Landscape: The exhibition of the artist’s own works in the first exhibition of the new National Gallery’s program.”The exhibition will focus on the Indigenous experience within the boundaries of Canada’s national cultural heritage. The centenary penultimate exhibition will feature an exhibition entitled “The Place of Branches in Indigenous History”\u0097a collaboration between the National Gallery of Canada and", "The next Biennial should address issues of contemporaryity in a way that will reflect the ever-changing state of the art of the art and will offer a collaborative platform for the artists who participate. \n\n\nThe National Gallery of Art (NGA) in Washington, DC, is planning to close to the public, and its new president, Michael Munro, announced that the institution is preparing to reopen in the spring of 2021. Both the institution and its board of trustees said that the decision to begin reopening was not related to any potential for Covid-19, the novel coronavirus that has caused an unprecedented spike in the number of new cases across the United States.When the NGA reopened in April, it ushered in a major expansion plan that added more than 2,000 square feet of galleries, classrooms, and public spaces, expanded the program, and added more than one thousand works. The expansion included the addition of a new public art space, the National Gallery of Art with new exhibition spaces, the artist-in-residence program, and a new public courtyard that sits on the second floor of the former CNA building. In addition, the NGA reopened the museum on the National Mall, and it added more than three hundred galleries to serve", "The next Biennial should be held in 2020, but the timeline for the exhibition has yet to be decided.\n\nAccording to the Art Newspaper, in a letter dated March 24, 2020 from the Festival of the Arts, Brazil, which is directed by Paulo C.J. Oliveira, the exhibition will run from October 3 to October 7, 2020. The twenty-ninth edition of the biennial, which will be held at the Museu de Arte de São Paulo (MASP), Brazil, will take place in September 2020, and the twenty-eighth will be held at its new location in Porto Alegre, Rio de Janeiro, from September 28 to September 30.Opening the exhibition will be a presentation of the work of São Paulo-based artist Ricardo Aícar, who will represent Brazil in the upcoming edition of the competition, which will be staged in the city from September 15 to September 22. The biennial will feature a retrospective of the work of Mauricio Díaz, a Semmelweis–like artist who studied at the University of Washington in Seattle, and will consist of twelve works.\n\n\nNew York’s Museum of Modern Art (MoMA) has announced that it is preparing to welcome", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has commissioned artist Chris Noth, whose work explores themes of migration, memory, and migration routes, to create a new installation for its iconic space, the Canopy, on the third floor of the old Los Angeles County Museum of Art (LACMA), on Thursday, February 17.Noth will depict a tribal woman who is forced to leave her home and her people in order to seek refuge in a United States army base in the United States—the installation will be inspired by the 1967 film The Last of the Mohicans, which follows the survivors of a deadly plane crash in Vietnam as they attempt to cross the border into Mexico. Noth will use multiple techniques to portray the emotional and physical reactions of the participants to the relocation process.“Chris Noth has been a crucial collaborator in building the Canopy into one of the most compelling experiences of modern art,” said Michael Govan, director and CEO of the Los Angeles County Museum of Art. “With his powerful, hauntingly beautiful paintings, Noth has created a powerful visual metaphor for the themes and structures of the installation. We are extremely excited to see what he will", "The next Biennial should be in 2021 and will revisit the site of the former Victorian British Museum (VBM) in London in an attempt to strengthen the museum’s regional and international profile. In a statement, the exhibition said: “We are delighted that the Biennial Trust is supporting the revitalization of this vital site and have a strong history of work to be done to make it a world-class museum. We look forward to working with the Trust to ensure the museum is at the forefront of the next academic and cultural renaissance and to developing new experiences to draw audiences back to the museum.”\n\n\nThe Institute of Contemporary Art and Design (ICA) at the State University of New York, Cortland, in partnership with the City of New York, has appointed Paul Mpagi Sepuya, a senior curator and art historian and former director of the Albany Art Museum, as its next director. He succeeds Michele Bruguera, who has served as the ICA’s acting director for the past four years, and will assume his responsibilities on January 8, 2020.“Icass diaries are the perfect window into the ICA’s diverse and interdisciplinary exhibitions, which is why I", "The next Biennial should be held in the autumn of 2020. The exhibition should explore the history of Biennials and the dilemmas that arise from their construction and should aim to generate new ideas about the future of Contemporary Art.\n\n\nCleveland’s SculptureCenter has announced that it is reopening in August 2020 following a $30 million expansion. The newly renovated space was completed in June and is scheduled to open to the public in August 2021.“We are thrilled to welcome our new neighbors and to open our offices with a strong collection of contemporary work and to celebrate the seventeenth anniversary of the SculptureCenter,” said Richard Armstrong, the center’s founder and CEO. The expansion aims to create more of a cultural center for Cleveland’s arts and culture, while also fostering the collection and exhibition of works by Cleveland-based artists.The expansion includes a new indoor courtyard, a new landscaped outdoor terrace, and the construction of a new rooftop garden, which will provide additional public conveniences. The renovation also included the addition of the SculptureStation, a collaborative arts and culture center that will feature two new outdoor sculpture platforms, a new café, and a new retail space.“We", "The next Biennial should be held at the Museum of Modern Art, New York. “I’m interested in venues for reflection and reflection on the larger world, but also what happens within our own very own selves,” Patricia Flynn, a former director of the San Francisco Museum of Modern Art and a board member of the MacArthur Foundation, told the Los Angeles Times. “We need a time to reflect on our place in the world and to reflect back on the future.”  The L.A. County Museum of Art, Los Angeles, opened a new pavilion dedicated to the life and work of American filmmaker Stanley Kubrick, whose work is collected by the National Film Registry, and is hosting a Kubrick retrospective this fall. The Los Angeles Museum of Art (LA MoMA) has announced its representation of Dominique La2, a French filmmaker and filmmaker-activist who is best known for her work in the field of popular theater, and has received a prize from the L.A. County Museum of Art for the Best Short Film category. La2 will open with a retrospective of her work “Tina” at the museum on September 3. \n\n\n\n\n\n\n\n\n\nThe Los Angeles County Museum of", "The next Biennial should be held in the year 2020, with the possibility of the exhibition being staged in other cities around the world, according to the filmmaker.\n\n\nThe Spanish government has approved a bill that would give the public the right to take part in a referendum on independence from Spain. The measure, which was passed by the Senate on Wednesday, and is expected to be signed into law by President Mariano Rajoy, was condemned by the Catalan regional government as an infringement on their sovereign rights.According to the Spanish daily newspaper ABC, the bill creates a referendum commission made up of four members appointed by Rajoy and two by Catalan lawmakers. It also stipulates that the referendum be held within a year and that all necessary activities, including collecting signatures, must be carried out. Spain’s conservative government is currently facing an unprecedented secession crisis. In response to the Catalan parliament’s decision to hold the referendum, Rajoy called for a suspension of the legislative process and the Constitutional Court’s ruling that declared the vote illegal. He also declared that the government would assume the necessary measures to defend Spain against any further attempts by the Catalan government to hold a referendum.In a speech on Wednesday, Rajoy said: “The Spanish state has exercised", "The next Biennial should be held at the Museo de Arte Contemporáneo in Madrid in March 2021. The 2020 edition will take place at the Museum of Contemporary Art in Prague. The 2019 event will be hosted at the Kunsthalle Basel. The 2019 edition was organized by Museum Harald Szeemann in Frankfurt and Museum Hermitage in London. The exhibition won the Artistic Award at the Venice Biennale in 2017.\n\n\nThe Queens Museum in New York has received a $10 million donation from the C. Edward Koniker Foundation. The gift comes in support of the museum’s triennial “Unseen: Sculptors in Motion”, which premiered at least one work each year since 2010. The center boasts of more than 2,200 works by thirty-one artists, including Robert Frank, Gere Kavanaugh, and David K. Glover.Foundation president and CEO Michael Wertz said: “This is a remarkable year for the arts. The bronzes are back in the bank, the major prizes are on the line, and the big prizes are on the line. The museum’s artists’ contributions to the", "The next Biennial should be held in 2021. The museum plans to build a new exhibition center on the site of the old Biennial and has partnered with the Los Angeles County Museum of Art to bring three of the five existing contemporary art exhibits to life in a new installation, titled A History of Modern Life, at the museum.“I was honored to be chosen as director of the Biennial,” said David Adjay, director of the Los Angeles County Museum of Art and Biennial. “I have been honored to work with Maria and the board of trustees and to contribute to the museum’s mission at a critical time in its history. I am confident that the new Biennial will continue to deliver compelling exhibitions, programs, and experiences for visitors to the museum.”Adjay added that he is excited about the future of the museum and its future exhibition director, as the institution looks to become an important cultural and historical focal point in the city of Los Angeles. “I’m looking forward to working with Maria and her team,” Adjay said. “I am deeply indebted to the board of trustees and the staff at the museum for their vision and for their inspiring vision for the future", "The next Biennial should focus on “human rights, democracy, economic and political development, and global health.” The exhibition will be hosted by the Maritime Museum and Sculpture Garden in Copenhagen.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has created two new positions in the arts, one for a curatorial curatorial role and one for a program director. The museum announced today that Gwen Malawao, who has served as a curator at the institution since 2007, will be promoted to director of curatorial affairs and Phil Roscoe will be promoted to program director.“Gwen’s past work at MoCA has been deeply influential in shaping contemporary curatorial practice,” said Steve Spilker, chairman of MoCA. “Over the past eighteen years, she has been instrumental in identifying and cultivating the perfect balance between breadth and depth in our collection, and in building the museum’s reputation for world-class exhibitions. We were grateful for her dedication and confidence in her vision and excellence as we embarked on this next chapter of our history together.”With the appointment of Gwen, MoCA now has two new curators: Rachel Kushner in the department of painting; Gheorg", "The next Biennial should bring together around thirty artists and activists to examine, celebrate and confront the historical, social, and political legacy of the Nazi regime in Germany and to introduce new and original works in the course of a year. Inaugurating the exhibition will be a special exhibition dedicated to the artist Konrad Adenauer. The seventy-one-year-old Berlin-based American artist was one of the first to put a series of works by prolific German Expressionists and designers, including Helmut Newton and Arne Glimcher, in the exhibition.The exhibition will culminate with the exhibition “Leuchter Tod,” an exploration of the history of the eternal beauty of nature, and will present the work of forty-one artists, including Lars von Trier, Joachim Neugroschel, André Malo, and Wolfgang Oehlen, among others, in the exhibition “Friedrich Kanders,” which will open on January 8.\n\n\nThe heirs of the late British artist Geoffrey Campbell have filed a wrongful-death lawsuit against a New York–based private security company that allegedly failed to protect Campbell during his years-long battle with cancer. The wrongful-death suit was filed by Nicholas and", "The next Biennial should be held in 2020, but the decision has not been made public yet. The year for the next edition is not specified, although it will be in 2021.The museum has also been criticized for its handling of the coronavirus outbreak in the United States. In March, President Donald Trump signed a $8 billion emergency spending bill—the largest stimulus package in US history—which reiterated the museum’s commitment to engage with the public through events, museum tours, and other programs. The legislation also called for more direct federal funding for arts institutions, and suspended the appropriation of funds from the federal TARP stimulus package. That same month, the museum opened its new Black Museum, which will house the museum’s collection of over one hundred thousand works by African American artists.In an attempt to placate the warring factions of the Black Power movement, the museum pledged to work with, and received from, the Black Liberation Army (BLA), a group of radical Black artists and activists who were active in the uprising against US imperialism in the early 1980s. According to Artnet, the museum’s board chair", "The next Biennial should be a “best of show,” curator Sophie Rawson told the Art Newspaper. “It will be a first and perhaps a great success. We need to be clear that this is not a time to surrender our history to history, to forget that our history is a history of struggle, of exclusion, and of progress.”\n\n\nThe California African American Museum (CAAM) has appointed Jared S. McIver as its next executive director. He comes to the institution from the San Francisco Museum of Modern Art (SFMoMA), where he has served as senior curator since 2015. During his tenure, McIver helped organize the museum’s first exhibition devoted to the history of the African diaspora, “Race and History: African Art in the Bay Area” (2018), and established its first Black Curator’s Circle in the museum’s collection, “The Black Experience in the Museum: Art and Politics from the African Diaspora,” which launched in 2019 and is still ongoing.“Jared brings years of experience and a proven track record of success with the museum to CAAM,” said director Adam H. Altman. “", "The next Biennial should be held at least a year from now. “I am sure that this is an exceptional and exceptional time to be alive,” said the artist. “I hope that it will also be an exceptional and extraordinary biennial.” The next iteration of the biennial will take place in London in 2022. The final exhibition will be held in New York in 2021.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has appointed Stephanie Azzopardo as its next deputy director and chief curator. Azzopardo comes to the agency from the Museum of Modern Art (MoMA), where she has served as deputy director and chief curator since 2012. During her tenure at MoMA, she curated “The Perfect Storm,” a series of installations by artists working in the field of atmospheric art, and “NIRIN,” a show about the evolution of British modernism, and helped shape the design of the Biennial for the Arts.“Stephanie’s work has been recognized across the globe as a visionary and resourceful curator who has inspired and shaped the DCLA’s curatorial practice,” said director Daniel H. Weiss. �", "The next Biennial should take place in 2022. The museum will also be reopened in 2020 following a $2.5 million expansion.\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of fifty-five works by thirty-eight artists in an online auction organized by the organization Open Culture. The catalogues, which were donated by the institution and were on display at the gallery during the third exhibition of the Autumn/Winter 2019 season, were organized by a group of artists including the New York–based artist Rachael Ray, who is known for her immersive multimedia installations, which explore the interconnections of materials and ideas, and New Orleans–based artist Seth Lipsky, who created works that evoke the region’s wealth of cultural heritage and the city’s African American and Latino communities.The National Gallery of Art is currently working on a new digital platform that will bring together the works of thirty-eight artists for a single online viewing experience. The platform will also include a virtual exhibition hall, a research library, and a permanent website. The digital catalogue will be available for free online viewing from November 29 to December 1, 2019.\n\n\nThe United Kingdom’s cultural sector is facing a crisis of confidence amid", "The next Biennial should be held in the Fall of 2020.\n\n\nThe Redenbach Company in New York has announced that it will shutter its production facility in the city’s Catskills, New York, in August 2020, citing the economic impact the six-month closure will have on the local arts community. Production of Art, which traces its roots to the Museum of Modern Art (MoMA), has been ongoing since 1990.The Redenbach Company’s current model for the artist-run space is to establish two working partnerships: One to support artists and other to assist the manufacture of works by other artists. The company has been working with the Catskills Museum of Art (CMSA) and the Hudson Valley Museum of Art (HTVM) on the expansion of its collection and its exhibition space, and it opened a new exhibition space, the Redenbach Space, in the Catskills in 2017. In addition, the company has produced over one hundred works in the last fifteen years, and in 2018, it received a $25,000 donation from artist-in-residence Ann Corrigan.While the exhibition space has expanded significantly in the past decade, the need for new funding for the Redenbach Company has", "The next Biennial should take place in Monte-Carlo from April 25 to April 27, 2019. The exhibition will be hosted by the Italian architects Daretti and Fabbri, which is headed by Michele Fiorilli, and will be organized, curated, and led by Mary Anne Mavignano, director of the Fratelli Foundation for Art and Architecture in Rome.The theme of the exhibition is 'The Body, the Machine, and the Other: Art and Body in the Age of Mechanical Reproduction” and will comprise of thirteen pavilions, each of which will be a laboratory for the exhibition. The works of the forty-three applicants will be included in the catalogue, which will be presented by the Fabbri-led group Arts in Motion, and the exhibition will be held in Venice and will be held on September 3 to September 11. The invitation for the 2020 edition of the Biennial is supplied by the Italian artist Giampiero Cipolletta, who represented Italy at the Venice Biennale in 2017 and the Biennale di Savo.\n\n\nThe Museum of Fine Arts (MFA) in San Francisco has appointed Susan R. Olson as its next executive director", "The next Biennial should calculate the net energy and carbon emissions from the production of two liters of the same heavy commercial refuse, as we did with the BIRG-3, and should include a discussion of the ecological and ethical issues posed by the production of this refuse, and what can be done to mitigate them, including by reusing and recycling.As we are now confronting an unprecedented global crisis, we must recommit ourselves to the care and treatment of the biosphere. We must act collectively to address climate change, and we must act collectively to protect the biosphere and our planet. As we assert our rights to life and to the environment, we affirm our responsibility as citizens to act in solidarity with one another and in solidarity with the world at large. In this way, we become one people, one planet, one people.\n\n\nThe Venice Architecture Biennale has announced that it will now consist of just three exhibitions: “The Future of Architecture,” which will run in the theme “The Future of Architecture;” and “Art and Architecture: A Retrospective,” which will feature photos from the exhibition “If Architecture Were a Game,” which opened on April 11 and runs through November 21. The", "The next Biennial should be held in 2020.\n\nThe Art Newspaper spoke to the nine artists who will be featured in the second edition of the exhibition, which will feature twenty-one contemporary art works and one sculpture by twenty-seven artists. The exhibition, titled “The Future Is Present,” will open at the Nicolaus Realex gallery in Rome in January 2021 and will run until March 2021.The full list of participating artists is as follows: 1. A.P. Berrada (Argentina) 2. Ada Amanda (Brazil) 3. Adam Gall (New Zealand) 4. Adam Johnson (Timurina, Russia) 5. Alex Katz (New York) 6. Alex Horton (New York) 7. Alexis Jones (New York) 8. Alain Guiraud (France) 9. Monir Shah (New York) 10. A. Irigaray (Argentina) 11.A.J. López Rivera (Mexico) 12.A.J. Zouave (Belgium) 13.A.K. Keeling (New York) 14.Alex Marlow (New York) 15.Anastasia Naus (Australia", "The next Biennial should be presented on May 28, 2020 at the newly expanded and expanded studio. In the meantime, the exhibition will continue to be held at the former Delmonico Sculpture Garden, which is currently being renovated by the Los Angeles County Museum of Art (LACMA), on the campus of UCLA.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed John Sze, who is currently the director of the renowned Museum of Modern Art (MoMA), as its next director. Sze will take the helm from Richard Armstrong, who has helmed the institution for nearly twenty years, on March 31, 2020.“John’s proven track record of leadership, vision, and energy, and his ability to inspire and activate our audiences and communities make him well poised to further shape our upcoming exhibition and special initiatives,” said Guggenheim’s senior director of international partnerships, John Halpin. “The board was thrilled to confirm John as our next director, and we look forward to his leadership as we establish a new, bold, and innovative paradigm for art at the museum.”During his tenure at the institution, Sze has introduced new programming and exhibitions, expanded the museum", "The next Biennial should be in 2021, when the first iteration of the exhibition will reopen in Stockholm. The biennial will also include an exhibition of archival works that will comprise the first exhibition dedicated to art and design in the United States. The project will be led by artist-activists Lena and Rognlie B. Jensen, who have been working since 2006 on a digital platform that will assist visitors to the museum. The site of the exhibition is to be identified as the Biennial Pavilion. Völuspá (Völuspá Foto), an exhibition of new drawings by the artist-activists, will also be presented at the Biennial.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York is planning to shutter its Japanese department amid a backlash over the museum’s decision to screen a new exhibition of works by the artist Reiko Ando. The show, “Kinkaku no Hana (The Life and Death of a Mother),” will reopen in January 2020, but will feature works by lesser known artists such as Tatsuya Fujita and Yuki Kondo, who are often depicted as having sex with each other or with objects such as dolls.The exhibition was inspired by", "The next Biennial should take place in the autumn of 2021. The institution has issued an apology for its comments, and has apologized to the Indian and Chinese communities in the United States, India, and China, as well as to the Indian diaspora in the United States and India. In a statement issued by the Museum of Contemporary Art, Los Angeles (MCA), on October 21, the institution said it would begin a review of its exhibition program and exhibition-viewing experience with an agenda devoted to the art of the next Biennial. The museum said it will also collaborate with the Chinese community in the United States in order to help them understand the medium and its relevance in their cultural traditions and to share their thoughts and experiences through interactive art. The biennial, titled Beyond the Frame (BFT), will be hosted by the Museum of Contemporary Art, Los Angeles (MCA), in the fall of 2021 and will run from October 21 to December 12. The theme of BFT is about “the role of painting and sculpture in creating a new kind of space for the future.” The work of Kendra Benjamin, Raja Jatmohan, and Luzia Ho,", "The next Biennial should be held in 2020. Tacita and I are very much looking forward to this. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has released the list of ninety-seven museums that are participating in its redesign and expansion efforts. The updates to the city’s cultural landscape were made in response to the current economic crisis and the city’s growing population.In a statement, the DCLA said: “The goal of the redesign is to create a more inclusive, welcoming and engaging experience for visitors by providing more opportunities for cultural mobility, expanding the city’s artistic and cultural ecosystem. Design also addresses how the city can best serve its diverse communities through a shared mission. We believe the redesign will stimulate and support the development of the arts and create new opportunities for residents and visitors to engage with the city.”The redesign will involve the removal of thirty-six existing buildings and the construction of a new structure, the 1,400-space Museum of the City, that will extend the life of the city’s public art museums. The museum will also boast three new galleries that will showcase the work of emerging and established artists, including Annie Prouvé, Amanda Ross-", "The next Biennial should aim to: (1) recognize the importance of the collaboration between the artist and the local community, and (2) include an overview of the historical artist’s practices. We are also working on ways to support the work of the artist’s fellow artists and encourage their participation in the next Biennial.\n\n\nThe Mall of America (MoCA) in Atlanta, Georgia, has named Ute Eichhorn as its new deputy director. Eichhorn begins his new position in January 2020. He succeeds Thomas M. Friedman, who retired after twenty-three years at the helm of MoCA last month.Friedman first joined the institution in 2015 as director of the Georgia Museum of Art. After he departed, he was named director of the Musselshell Museum of Art and was promoted to deputy director in 2017. During his tenure, Friedman oversaw the acquisition of more than five hundred works, including works by Frank Stella, Frank O’Hara, and Ingmar Bergman, which are regularly on display in the new museum. Friedman also worked as a consultant for several local governments, including Atlanta, and served as chairman of the city’s revitalization commission.“I have been a huge supporter of", "The next Biennial should focus on the history of memory, art and its contemporary relation to the body, and should employ experimental and hybrid approaches. “We can do better,” said Sola. “The Art of Memory: History of Memory, Art and Memory,” will be presented by Liat Shahid and will take up the themes of memory, memory itself, and memory itself as a memory, using the relationship between memory and memory as a metaphor. The exhibition will include work by artists from the African continent, Asia, the Middle East, and the Americas.The first exhibition organized by the biennial will be the art of memory exhibition, which will feature works by eighty artists, including Koranji, Elviesa, Tarek Atoui, Dusan Tabet, Derek-Michael Hartigan, and Hildegarde J. Phelps. The second exhibition will be “Memory in Surroundings: Contemporary Art in Contemporary African Art,” curated by Umar Khalidi and will feature “Arts and the Body in the Nineteenth Century” by Dorothea Rockburne. The opening of the biennial was postponed due to the", "The next Biennial should take place in the spring of 2021.The announcement took place at the end of a week of exhibitions, seminars, talks, and other events organized by the museum in an attempt to compensate for the loss of revenue from the closure of the institution since the earthquake and tsunami struck on March 11. The museum, which has a long-standing relationship with the government of Japan, had planned to hold the exhibition “Tsunami and the Pacific,” the first of three planned, between June and September. The program is meant to highlight the history of the Pacific Ocean in order to prepare the public for the possibility of a third earthquake. The venue for the exhibition is the Yokohama Museum of Art, a former Japanese Embassy building that was transformed into a museum dedicated to the history of the Pacific Theater.The closure of the institution has led the government to begin the process of selling some of its holdings. On March 5, Prime Minister Shinzo Abe announced that the government would sell some three hundred artworks, including some of the works of postwar Japanese pop culture. A week later, the government also announced the sale of a number of works by contemporary artists, including Sergei Gromov, Annie Leonid, and Ermanno Merz. The", "The next Biennial should take place in 2020, and the 2020 theme should be “Empowerment.” The 2019 Biennial was “Building Bridges,” and the 2019 theme was “Building Bridges,” with the 2019 event taking place at FABRICS Operetta in Venice. The 2019 event was curated by Gina Bech, the director of Museu de Arte Contemporáneo, and was organized as part of a larger strategy to improve the exhibition-based programming at the museum. The partnership between the museum and the People’s Republic of China began in 2020, and the 2020 theme was “Building Bridges,” with the 2020 event taking place at the Cultural Revolution Museum in Beijing. The 2019 edition featured work by some sixty artists, including Carolee Schneemann, Billie Tsien, Anna Wintour, Joachim Zuiker, and Carly Simon, and featured work by the Taiwanese‐born, Hong Kong–based artist Reiko Nakajima. In the upcoming edition of the exhibition, planned for March 2021, the works by the participants will be presented in a different format. The 2019 edition of the", "The next Biennial should launch on March 13, 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received $2.4 million from the Cherry Blossom Foundation in support of the festival in which artists, curators, and other arts professionals are invited to create their own narratives with the assistance of a digital technology platform. The biennial, which is being funded by the Cherry Blossom Initiative for Arts and the Arts, will launch with an exhibition of “Unfinished Business: Art in the Age of AIDS” at the MFA in February 2020. The show was organized by Mina El-Saieh, the MFA’s chief curator and director of contemporary art, and will be presented by John L. Sullivan Gallery in partnership with the MFA.“The Cherry Blossom Foundation’s commitment to supporting the MFA is unwavering,” said MFA director Stephen Weiss. “This is a time of great change for art and the arts, and we are eager to work with the MFA to support the arts and the MFA’s curators on their important future projects.”The Foundation is also funding the", "The next Biennial should be held within a few years, and I believe that this can be achieved with the help of the dedicated staff and the new initiatives that we have put in place. This is how we can become the new Mecca of modern art.\n\n\nThe London-based nonprofit Creative Capital will support the UK’s arts and cultural sector with an investment of over £1 billion in support of cultural businesses and individuals as part of its plan to exit the European Union. The investment will be made through a series of loans, most of which will be for small to mid-sized businesses; some of which will be for artists; and a few of which will be for corporations.“The UK’s creative economy is one of the most important engines of economic recovery in the world,” said David Macpherson, president of Creative Capital and director of the London Biennial, at a press conference at the SSE Arena in London on Friday. “This will allow us to build on the positive trajectory set by the London Festival, the Edinburgh Fringe, the Tate Diaries, and the Royal Shakespeare Company in creating new jobs and opportunities for London’s creative workers, while ensuring the vital support of the arts for generations to come", "The next Biennial should focus on “representations and permutations of the self,” said Kees; “generating and consuming the self.”The 2019 edition will focus on “the self and its representations,” with a view to rethinking the relationship between art and the body.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles (LA MoCA), has hired Caroline Bendik as its temporary director and CEO.Bendik succeeds Anne-Marie Harrison, who was hired as interim director of curatorial affairs last month, and will assume her responsibilities at the center in January.“We welcome Caroline's leadership experience and expertise to MoCA. She has a proven track record of delivering high-quality, innovative exhibitions and services across multiple disciplines as well as a proven track record of building relationships with local, regional, and national artists and communities,” said curator and MoCA board chair Andrew Hauser and board president Carmel Baroni. “Caroline has demonstrated a clear passion for artists and her curatorial approach aligns well with MoCA’s mission. We are excited to see how she develops the unique leadership role for artists at the museum, and look forward to working", "The next Biennial should take place in 2021. \n\nThe Museum of Modern Art (MoMA) in New York has issued a statement regarding the recent controversy surrounding its new sculpture, Massive Synthesizer, which was installed in the museum on January 18, 2020, and which critics contend resembles a robotic version of the artist’s work, Tattoo, on the right. The institution’s director, Daniel H. Weiss, told the New York Times that the installation was meant to represent the digital economy and not the two-dimensional sculpture that it is.The sculpture, which is part of the multi-million-dollar overhaul of the museum’s grounds and interior, was meant to evoke the work of the artist, the late Benjamin Creme, by painting a rough sketch of his iconic sculpture, The Town and the City, which sits in a storage area next to a large metal sculpture of a cityscape. When Weiss was asked about the sculpture’s literary connection, he replied: “I’m not going to pretend that everything in this installation is related to the work that Benjamin Creme made.”What is controversial about the installation is its placement, which is at the center of a", "The next Biennial should take place in the autumn of 2021 and will invite a selection of contemporary art from around the world. In addition, it has released a list of seventy-seven artists whose work would be included in its collection. The artists chosen by the institution were chosen by a committee made up of representatives from twenty-two countries and six continents. The twenty-three artists chosen for the exhibition include twelve artists chosen by the United States, the United Kingdom, France...Read more ›“Art is the essence of life.”“Art should be the most powerful tool humanity has to address the real problems of our lives,” said Lawrence Abu Hamdan, the director of the Institute for Contemporary Art and the author of An Open Letter to Art. “We should not be content to wait for the artist to create the work or to wait for the artist to tell us what he wants. Instead, we should be inspired by his creativity and by his willingness to take risks, to push forward, to experiment, to push boundaries, to push his work and his vision to the next level.”Abu Hamdan, who represents African and African-American artists in the United States, said: “The next Biennial will invite", "The next Biennial should be held at the Museum of the History of Art in New York next year. \n\nIn a letter to the editor of the Art Newspaper on March 3, 1955, two hundred artists and creatives signed by the Los Angeles–based Cultural Action Group — including John Edmonds, David C. Driskell, Oscar Murillo, and Chris Lee—joined the effort to organize the next edition of the Los Angeles Biennial.“The Los Angeles Biennial will pose the most interesting and important questions in art history,” the letter reads. “The Los Angeles Biennial will be a vehicle for the creative activity of the city, which has never had a major organization devoted to the art of the city.” The letter concludes: “We hope that the collection of the Los Angeles Biennial will prove a source of inspiration to all who might aspire to organize one. It will be an enormous undertaking and we hope that you will join us. We wish you and your family members well.” The biennial’s director, Robert H. Gilbert, also expressed his appreciation for the work of the Los Angeles County Museum of Art and the Los Angeles Museum of Contemporary Art (LA MoCA) and its", "The next Biennial should consist of a show of the work of one hundred artists around the world; should be open to the public from December 16 to December 21, and should feature twenty new works.\n\n\nThe Italian architecture and design museum Milan has won the 2022 edition of the Herzog & de Meuron Prize for its design project in the city of Piedmont. Mira-Maria Bocconi, the museum’s director, and the director of the Piedmont Palazzo Reale, have jointly won the prestigious award, which comes with a prize of $1 million. The biennial was organized to commemorate the opening of the museum’s new building, the Piedmont Museum of Art, and will open in 2020.Bocconi, who has served as director of the Piedmont Museum of Art since 2013, was selected by the prestigious jury comprising architect Marcella Bellaventuri, Pilar Carbajal, and Svetlana Cherebovskaya, as well as architect Marisa Gimenez-Pereira, the director of Fondazione Piedmont. The jury chose Bocconi for her design for the Piedmont Museum of Art, which involves a new kind of", "The next Biennial should take place in 2021. The next two will be in 2023 and 2026. The next three will be in 2028 and 2033. The festival will also host a biennial of works by scholars and activists in 2018. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has received a gift of more than 1,900 works from the Chinese artist Li Shuangli, a self-taught sculptor whose work has been collected by MoCA since 2014. The museum opened a collection of his works in 2017 and has since transferred them to the institution for safekeeping.Li was born in Shanghai in 1936 and taught at Jinan Academy in Nanjing for two years before he began working in the 1970s as a freelance artist. In 1978, he joined the famous MFA in Los Angeles, where he would remain until 1983, when he began sharing his work with the MFA and collaborating with other artists. His art has been collected by the museum since 1984. The collection also includes works by artists such as Jackie Hon, Alan Bennett, and Ed Moses. \n\n\nThe Carnegie Museum of Art in Pittsburgh has appointed Leslie Pringle as its next executive director. Pringle will be", "The next Biennial should be held in the fall of 2021.\n\n\nThe Picasso Center in Barcelona will launch a new online platform, Picasso Museum, which will host more than 1,500 works by the artist. The new platform will be developed by the Picasso Foundation at the request of the artist’s heirs and will be launched on December 18, the day of the upcoming exhibition of his work in Guadalajara.For generations, Picasso enjoyed a close and popular relationship with the city of Barcelona, which has a population of around 80 million and is located on the coast from Spain’s mainland. To celebrate the centenary of the artist’s birth, the Picasso Museum will present a retrospective of his work in the city’s grand Pérez Museum on the same day as the annual event in Barcelona. The museum will also highlight the life and work of the artist in the city by launching the Picasso Museum Tour, which will take visitors around the museum from time to time, and a digital exhibition of works by the artist. The first show, “Picasso: The Contemporary Life” will open on May 6 and will run until June 7.The platform will include “Picasso", "The next Biennial should take place in the autumn of 2020, in the city of Barcelona, and will be the first of its kind in the world. The exhibition will be hosted by the University of Barcelona and curated by Issa Nabavi, who will take over from the late architect Andrés Pratley.“The new partnership between the Biennale and the Fondazione Prada represents the highest development of partnerships between museums and brands,” said María Berrada, director of the Fondazione Prada and the Biennale. “Together we will present a truly unique collection of the world’s most important works to the world.”During the exhibition, a new 15,000-piece display dedicated to the history of gender will be inaugurated, which will take the shape of a studio from the artist Cécile Baillets, who was known for her mottos: “Masculine and feminine, comforting and disturbing, will be revealed.”The museum will also present a new collection of sorts, comprised of the works of pioneers of modernism—Keir Varnham, Nada Oti, and Rayyane Ijaz, among others—which will", "The next Biennial should be held in 2021. #BiennialsHaveResolved - Ishizuka Kenichi, The Sense of an Ending, 2018. A moment of silence was held for the passing of artist Ishizuka Kenichi. The second Biennial will be held in 2020. Tessa Ghilard, The Flame of the Spring, 2019. Born in France, Ghilard now lives in New York. The third Biennial will be held in 2022.  François Bouillon, Bouillon Féminin, 2018. The fifteenth and final Biennials, in 2020 and 2022, respectively. Tadao Ando, G-, 2018. Aichette Alberts, B-C-D, 2020.  Originally scheduled for 2022, the exhibition has been moved to the end of the year. Max Ernst, 1900. Originally slated for 2020, the exhibition has been moved to the middle of the year. Petteri Bäckström, T-, 2019. Originally scheduled for 2019, the event has been moved to the end of June. Max Ernst, ", "The next Biennial should take place at the Museum of Contemporary Art, Los Angeles (Los Angeles Biennial); there have been no new pledges from institutions that would be affected by the coronavirus. Earlier this week, the museum announced that it would not reopen, and also stated that it expects to lose $10 million from March 15 to March 18, depending on if the museum reopens.The Los Angeles County Museum of Art (LACMA), which has not had a new pledge from the county for several weeks now, has announced that it expects to lose a total of $25 million from March 15 to March 19. The institution also said that it is working on identifying the costs of the coronavirus.\n\n\nThe Royal Academy of Arts (RA) in London has issued an apology to the academy for failing to address the coronavirus outbreak at a timely point. In a statement issued on Friday, the academy said: “We need to be clearer about what the future holds for our cultural sector and what we need to do to protect jobs and make the most of the current period.”The statement continued: “We are listening to all suggestions and are working hard to try to align our programming with the schedule of the ALA", "The next Biennial should kick off in 2021 and will consist of four exhibitions, each themed around a different theme of the last five years. The theme this year will be “Sustainability and the Body.” The first exhibition will be “The Body: The Art of Restoration and Healing.” The second will be “The Body Politics: The Politics of Body,” and the third will be “In Defense of the Body,” and will present work by artists such as Tilda Swinton and Glynis Waugh. The opening of the third exhibition will be “The Body Art Museum,” which will be hosted by the Bellagio Hotel and Gardens in New York City, and will be open from September 28 to November 27. The full list of participating artists is as follows:·Sylvia Andujar, Buenos Aires, August 26→September 13·Kirsten Alstad, London, September 14·Michael Carey, New York, September 19·Charlie Ackermann, New York, September 21·Natalie Lawson, New York, September 22·Laura Berger, New York, September 24·Alexandra Beliava, New York, September 24·Kathrin B", "The next Biennial should be held in 2022. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced that Angelica Heredia, who moved to the United States from Mexico in 1989, will be the next director of the institution. The announcement was made in conjunction with the opening of the MoCA’s inaugural year of the Museum of Contemporary Art (MoCA) “40/40,” which inaugurated the institution in 2014 and opened to the public in 2016, and coincided with the opening of “Para Thisra,” a solo exhibition of art that was organized by artist Rula Ann, who had been incarcerated since 1993, at the Santa Rita Jail in Santa Ana, California.The inaugural exhibition, titled “Angelica Heredia: Twenty Years of Art,” focused on the artist’s contribution to the Los Angeles County Museum of Art (LACMA), which she led from 2006 to 2013. Paired with works by artists such as Carlos Serpa, Javier Téllez, and Adrienne Edwards, the exhibition opened to the public in 2013. The following year, “Angelica Heredia: Erotica,” followed three years", "The next Biennial should be in 2021, and another in 2022. The last was held at the Grand Palazzo, in Venice, in 2016.The winner of the 2019 Pulitzer Prize, for photography, was John Alexander, who took a portrait of the Taj Mahal in New Delhi. The winner of the 2019 Picture Award was Konrad Fischer, who won for photography's description of a large tree with a single pointed trunk.The biennial’s director, Joachim Bonsu, said: “We are very happy for the fact that our work is now being recognized as a cultural treasure. The Pulitzer Prize is a great recognition of our work and our dedication to this art in general and of our models and the concrete in particular. The Picture Award is an important recognition of the work of our models and their contributions to the treatment of landscapes.”\n\n\nThe Noguchi Museum in New York has appointed David C. Noguchi as its next executive director. Noguchi, a professor of painting and printmaking at the Art Institute of Chicago and a longtime member of the museum’s team, is currently the director of the studio of the Italian artist and collector Piero Manzoni. Manzoni’s latest exhibition", "The next Biennial should be held within six months. The biennial will consist of a series of exhibitions that will invite both traditional and contemporary techniques and arts. The themes will be chosen by the Independent Biennial Art Foundation (IBAF), a not-for-profit organization based in the city of Zurich; the Wentz-Buchenwald Exhibition Center (BEC), a not-for-profit, not-for-profit institution located in the city of Berlin; and the Fondazione Prada, an artistic space in Venice.“This is an absolutely unprecedented moment for us,” said Florence Preciado, president of IBAF. “Over the last four years, we have worked hard to present the biennial as a natural extension of Italy’s Summer Festival, which celebrates the summer and the Italian calendar. We have worked with the institution to ensure that the events in the show are arranged as naturally as possible, and have worked closely with Biennale director Maria Brugnara to present a series of exhibitions inspired by the theme of the inaugural exhibition. At the same time, we have been closely monitoring the exhibition to ensure that it is in harmony with the current political situation. We hope that this", "The next Biennial should be held in the spring of 2021. The third will be held in the spring of 2022. The fourth is currently underway.The first and second editions of the Biennials were held in San Francisco’s Castro Theatre (where the first show, “The Ground Beneath Our Feet,” opened in June), and the third was led by a group of artists in New York’s Hudson Yards, which sits on the southern edge of the boroughs. The event will also host the first exhibition devoted to environmental artists in the United States. Among the artists chosen for the 2019 edition of the event are Carrie Mae Weems, Jodi Throckmorton, Kim Gordon, and Dinesh Karthik. “The Ground Beneath Our Feet” is about a group of artists who live and work in the rugged Andes of Peru. The works were exhibited and performed by various groups of artists and groups that have participated in the Biennials over the past decade, including the Fabundo Cesar Foundation, the Golden Earrings Pyramids, and the Joint Foundation for the Arts. About the 2020 edition of the biennial, the organizers said: “2016 was a very challenging year", "The next Biennial should deliver the first and last performances of the new works until the end of January 2021. In order to speed up the transition to the new exhibition platform, the forthcoming exhibition will be held in the winter months. The revamp of the gallery will be led by a dedicated curator and architect, Ryan N. Galloway, who previously worked as an art curator and architect in New York and London. The biennial will also focus on the role of media and technology in the body and will include a review of the exhibition “4:47: Live,” a show of works by artists who have been dedicated to the use and installation of their bodies.\n\n\nDara Eddington, the British artist who was a leading member of the psychedelic-music collective The Orbán, has died at the age of eighty-six at her home in London. The cause of death was pneumonia. Born in London in 1943, Eddington began her artistic career as an avant-garde jazz singer in the 1960s. Her music fused elements of psychedelic experiences and the mystical and created a form of dance that would evolve into a hybrid of electronic and acoustic music. Her work has been collected by the London and New York after", "The next Biennial should be held sometime in 2021. The announcement of the event comes on the heels of the November 2016 release of the film Sara and Isolde: The Promise. In the film, which was shot on location in the forms of a life-size, nine-foot-tall statue of the pair, the work is based on a true story of a woman who was commissioned to make an artist-designed sculpture for the museum.The work, which the museum says is a tribute to both Sara and Isolde, was completed by Sanna Gudmundfest. The Swedish director hailed the work as a manifestation of the couple’s “true love” and said: “The duo created a living, breathing work, which is very much in the spirit of the past and in the spirit of the future.” Following a request by the museum, the artist-designed sculpture was moved to the collection. The museum will unveil the work in the fall of 2020.\n\n\nThe French Ministry of Culture and Sport has appointed Joseph Renaud as its new representative in the cultural sector. He is responsible for integrating activities and exhibitions within France’s National Assembly, as well as for developing policies and", "The next Biennial should consider the history of the institution and the role that the museum plays in advancing its collections, and should include an overview of its intellectual and professional history.”The program will be hosted at the museum until at least May 19.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has announced that it will reopen on August 29, following a temporary closure due to Covid-19, following a five-day event that examines the history of art through the eyes of the Museum’s nearly 150,000-piece collection. The reinstallation of the museum will also introduce new programming focused on the Met’s collection and exhibitions and will focus on the exhibition of works by artists that have been in storage or exhibition for more than a decade, including Iris M. Evans, John Gallagher, and Peter Sellars.The opening of the museum coincides with the opening of its new $500 million Robert Giard–designed building in downtown Manhattan, which celebrates the 40th anniversary of the foundation’s inaugural exhibition. The new 7,300-square-foot space includes a staging area for shows by artists such as David H. Koch, Robert Pirs, and John Crowley, as well as an online exhibition that will", "The next Biennial should be announced soon. We look forward to presenting our work and to supporting your work as we continue to grow and evolve our new digital platform.\n\n\nThe Fermanagh Museum of Art (FMA) in Northern Ireland has commissioned artist Richard Ayoade to create a new series of works on paper for the institution. The commission is part of a new initiative launched by the institution in support of the arts and culture in the north of Ireland. The initiative was launched following the furloughs and layoffs of many arts and cultural workers in the region.“In this global context, with the overproduction of digital content and the decreasing budgetary support for arts and culture, FMA has chosen to create a new platform, a new platform for our artist and our commission work,” said Richard Ayoade. “As a result we have created a series of new works on paper, in an effort to engage with the cultural landscape of FMA as an institution in an effort to create a new kind of work for the museum.”The works, which are scheduled to be presented at the South Bank Centre for Contemporary Art in Belfast in April 2020, are comprised of two narratives, both of which are centered around a group of artists", "The next Biennial should be held in 2020. “The biennial is the antithesis of a high-tech conference. It is a celebration of the creativity and vision that has defined the Biennial. The 20th edition will take place in the city of Bristol, England, with an exhibition of the works of 12 international and established artists curated by the artists themselves. With the opening of a new exhibition on contemporary art at the Somerset House, the event will continue to draw a global audience through a series of new programming that will bring together artists from the UK, Europe, and around the world. The 2019 edition was staged by the legendary British director Jo Johnson at the Oxford University Art Gallery.”\n\n\nThe Pulitzer Prize–winning artist and activist Killian Bell, who was one of the founders of the Black Power movement and led protests against police violence, has died at age eighty-two at his home in New York. Bell, who was born in New York City in 1941, was raised in nearby Bessie Lee. His father, Fred Bell, was an automobile dealer and a community leader in Bessie Lee, where Bell was born. His mother, Gertrude Bell, was a homemaker and was a devout Christian. Bell", "The next Biennial should be held at the Centre Pompidou in Paris in 2020. \n\n\nItalian artist Gio Ponti, whose work turns the mundane into monumental, has announced his retirement from the art world. The seventy-two-year-old, who was nominated for the Prix Marcel Duchamp in 1983, has been working on a new painting and sculpture program for the museum since 2019, and at the time of his death, he was working on a new installation.Born in Rome in 1941, Ponti moved to Turin with his family when he was only six years old. He studied at the Turin Academy of Fine Arts, the Turin College of Art, the University of California, Los Angeles, the University of Nusa Nazionale, and the Venice Academy of Fine Arts; he also studied at the Institute of Italian Modern Art and the Museum of Modern Art. He received a prize from the institute for his work in 1963, and the museum granted him a lifetime achievement award in 1977. The artist has painted several monumental works, such as his monumental The Lamentations of Cézanne (1967), his monumental The Picture of the Picture (1967), and his monumental The Closet (1971), in the last", "The next Biennial should be held in 2021. The 2019 exhibition was held in the Netherlands and focused on work by under-recognized artists. \n\n\nThe Centre Pompidou in Paris, France, announced today that it intends to reopen by the end of 2020 after an extensive renovation project that began in October. The modernized museum will boast of an exhibition pavilion that will better display the works of the Centre Pompidou’s collection and will be equipped with a more modern and intimate space for educational and cultural activities. The renovation project also includes the installation of new works by contemporary artists, including Mark di Suvero and Mihai Focock, and the restoration of the building’s original facade and interior.The renovation of the Pompidou was completed in conjunction with the renovation of the Centre Pompidou. The renovation project, which began in 2016, involved the use of more than 4,500 materials and took seven years to complete, including the recovery of the building’s original foundations. The Centre Pompidou will be inaugurated as the new building of the Centre Pompidou, which will be inaugurated during a public celebration on August 9. \n\n\nThe European Court of"]