["The next Biennial should take place in the Fall of 2021. As part of the agreement, the final work of the exhibition will be unveiled in the Spring of 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Chicago has welcomed two new members to its board of directors. The institution announced today that John Suter and Thomas J. Walsh have joined the board of trustees. The announcement follows the launch of the museum’s “Art of the Disconnect: Art and the Body” series, which will focus on the interconnected histories of art and bodies and will draw from both contemporary and historic approaches to sculpture.“It is a true honor to welcome these two exceptional individuals to the board of trustees of MoCA,” said Annie E. Bergen, chair of the board. “Joining MoCA means joining a great collection of works, and to be a part of the extraordinary legacy of the museum.”Prior to joining the museum in 2011, Suter was the founding artistic director of the Albright-Knox Art Museum in Buffalo, New York, and was chief curator of the collection of Leila Koester at the Brooklyn Museum. Walsh is an internationally acclaimed curator and scholar whose work spans sculpture,", "The next Biennial should be held in 2020 and will be presented by the Bangkok Art and Design Museum (BAM). The 2019 edition was the last one staged by the Bangkok Art and Design Museum.\n\n\nThe Royal Academy of Arts (RA) in London announced today that the thirty-nine-year-old painter Peter Oehlen has been elected as its new director. Oehlen will take up the post on August 3.“Peter is a gifted and talented communicator who is dedicated to bringing together the very best in contemporary art and architecture,” said RA chairman Maria Balshaw. “His vision and ability to draw from the heart of contemporary art and architecture to create new and compelling work makes him a truly exciting choice to lead the RA as it continues to expand and challenge our relationships with artists, architects, and architects’ bodies.”Peter, who first rose to prominence in the UK in the early 1980s, first joined the academy in 1987 as a visiting lecturer and then as an assistant professor. He has taught at the academy since 2008 and is a tenured senior curator at the London gallery Fairfield and the London-based studio Hogarth & Spaulding.Peter’s curatorial projects include The Big", "The next Biennial should take place in the city in 2024. \n\n\nThe Museum of Contemporary Art (MoCA), California, has appointed Andrew Schoelkopf as its next director. He succeeds Helen Stoltz, who retired in March 2019 after twelve years at the museum.“Andrew is a gifted curator whose strong curatorial instincts and expertise for contemporary art have made him a champion of artists and their work across generations, and a leader in the field,” said Susan Egeran, chair of the board of trustees. “His ability to expand the mission of MoCA is an ideal fit for our curatorial priorities and the museum’s institutional DNA. We are proud to welcome him to the museum and look forward to his leadership in bringing the museum back to life.”Schoelkopf comes to MoCA from the Museum of Modern Art, where he has served as a curator of contemporary art since 2003. During his tenure at the institution, he organized exhibitions such as “Tit Confessional: The Works of Peter Paul Rubens” (2012) and “Peter Andre: The Works of Peter Andre” (2017), and worked with academics to produce educational programming to inform", "The next Biennial should take place in 2021–22.\n\n\nThe São Paulo Bienal (SPB) and the National Museum of Fine Arts in Rio de Janeiro have announced that they are preparing to collaborate once again to present the Brazilian National Biennial (BNB). The new exhibition, “A Conceptual Conception of Life,” will open on December 14 and run until November 29. The exhibit is a response to the ongoing crisis in Brazil, which has seen dozens of deaths as the country battles a new series of coronavirus cases. The exhibition will feature new work by sixty artists, including Alessandro Nistor, Saul Ortiz, Nara Zoroya, Jair Bolsonaro, and Isabella Rossellini.The first edition of the show was held at the Museu de Arte de São Paulo in December 2015. Fourteen artists were chosen to represent Brazil at the newly created National Museum of Fine Arts, and the participants are: Alida Alves, Colette Bienal, María Bravo, María Conceição, Alejandra de Ip , Katia Farias, Anna Grazia, Lari Cui, and Rigeze Pimentel.The show will", "The next Biennial should be held in 2021. The construction of the museum is being overseen by Christo, who previously helmed the institution from March 2019 to November 2021, and Isamu Noguchi, who will be inducted into the museum on May 22.Art Basel Hong Kong has announced that it will not renew the lease of the space in Lissang that was previously used by the fairs Hong Kong Art Museum and Art Asia (HAWTHORM) and Art Asia (AB) from the multinational digital marketplace site Artnet. Its website lists the space as abandoned and says that it is still undergoing a renovation.The Hong Kong Art Museum and Art Asia will continue its exhibition program under the new management, which is led by Aline Moll, until January 22, 2021. This means that the Hong Kong Art Museum and Art Asia will not reopen to the public in January 2021. “A complete reopening of the Hong Kong Art Museum and Art Asia in 2021 would be the ideal outcome, and we are committed to that,” said Christo. “With the new management, we have talented and committed team, and I look forward to working with the new team and new exhibits.”  The Hong Kong", "The next Biennial should be in 2021. The ten-person committee, which was formed by the museum in cooperation with the Park Institute, comprising Christophe Broderick, Jacques Preciou, Paul Mpagi Sepuya and Raymond Verjai, will announce the shortlisted artists at a later date.The biennial will be staged in collaboration with the newly renovated Bureau du Midi de Paris, the previously defunct French Ministry of Culture. The institution plans to create two new works, titled Paris in the Summer and Paris in the Night, that will also be on view in 2020. \n\nA group of artists and intellectuals have launched an initiative to bring more attention to the plight of people in China’s Guilin Province, a region of the country’s interior that has been marginalized since the 2009 earthquake and tsunami. The organizers of the event, called Art in the Time of Guilin, have created a website and Facebook page specifically for the exhibition.“We are creating this platform to present local artists and intellectuals on the Guilin–Yiai River region, and to help them realize their visions in the future,” said Oskar Engström, head of", "The next Biennial should be a show of the work of artists from the panoramic world, from Africa to Latin America, from Asia to the Americas. It will be an opportunity to see the work of artists that have been silenced, to see the work of artists that are underrepresented and to celebrate the work of artists who are underrepresented.  The forthcoming edition will be the first of the new exhibition format.Commenting on the Biennial, Bernardo Costa, the director of the Los Angeles County Museum of Art, said: “The first Biennial was a reflection of our time, and the importance of art for regeneration and renewal. We hope that, in designing a new Biennial, the artists, the curators, and the staff of the LA County Museum of Art, as well as the community at large, create a new and exciting platform to engage with art and to receive the full range of its power.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (LACMA) has appointed Mike Bostock as its next director and CEO. Bostock currently serves as chair of the board and a cofounder of the company that owns the estate, which includes Wallach and Gebbia,", "The next Biennial should be presented at the Smithsonian American Art Museum in 2021.\n\n\nThe National Gallery of Scotland (NGA) is planning to add more than one thousand works by twenty-five artists to its collection in an attempt to engage with contemporary life in the country. Among the works scheduled to be added are works by four South Asian artists, including Ghatakshi Vazir, Nandini Verma, and Rakesh Dhaliwal, and will be presented in the first exhibition of the collection, “Atlas: A Study in Modern Art”, in December 2020.Inaugurating the exhibition will be “The Creation of the Modern World: A Study of the Creation of Modernity”, a collection of eight works by English artist Richard Linklater. The show, which will be shown at the NGA in January 2021, will also feature work by the French, the German, and the Italian artists Jules and Laura Miro. Linklater’s work, which was created in 1988, is the subject of a documentary project by the National Geographic Society, titled “Beyond the Sculpture: Richard Linklater.”In addition to the NGA, the National Portrait Gallery and the", "The next Biennial should take place sometime in the 2020s. “The current biennial has become a vehicle for the exhibition of work by artists who have not yet achieved recognition, and has become a tool for the exhibition of people who have made important contributions to our community,” said curator and curator of contemporary art Anna-Sophie Coney.\n\n\nThe National Gallery of Art in Washington, DC, announced today that it is launching an online-only exhibition titled “Unseen: New York in the 1980s and 1990s. The show will feature work by thirty artists and will be on view from March 19 to March 21, 2020. The exhibition is part of the National Gallery’s ongoing effort to digitize and catalogue its holdings of art history, and is part of a new initiative that will also include the designation of a trustee.The program will launch with a public tour of the National Gallery of Art’s collection in the summer of 2020 and culminate with a presentation of a selection of the work of thirty-two artists. The artists selected will be announced in the fall. The tour will feature new works commissioned by artists such as David Salle, Alighiero Polizzo, Simone Leigh, and Stephen", "The next Biennial should be held in the spring of 2020.\n\n\nThe city of Birmingham’s city council approved a $15 million fund Tuesday to compensate the victims of the arson and theft that took place at the former site of the Alabama-Birmingham International Airport (ABBI) on May 25, 2020. “When we consider the number of buildings that were damaged, the number of vehicles involved in the incident, and the critical injuries that were sustained, there simply must be a nexus between the arsonist and the perpetrator of this crime,” Councilman Quinton Ross, chair of the council’s cultural and recreation committee, said in a statement. “This act was a hate crime. We have worked hard to rebuild bridges with our neighbors, and we will continue to do so.”The fund, which will be administered by the Historic Preservation Advisory Council (HPA), will provide $1.2 million for damage to Birmingham’s African American Museum (AAM), the Birmingham Art Museum (BAM), and the Atlanta Museum of Art, and will be administered by the city’s Housing Authority. The fund will also provide $400,000 for damage to the city’s historic African American", "The next Biennial should take place at the National Geographic Society’s headquarters in Washington, DC, in 2021.  The council also voted last week to establish a new commission of multidisciplinary artists on the future of art in the digital age, chaired by Joan Miró, the director of the National Geographic Society. “The future of art is digital,” said Council president and CEO Stephanie Newkirk. “This is a digital world that is rapidly evolving, and with it, our vision for the future of art. We are grateful to the thousands of artists, scientists, and other cultural workers who have participated in the past years of the biennial process, and especially to Joel and to the National Geographic Society, whose generosity and commitment has made the event possible.”The new biennial’s inaugural edition, “BE/11: A Space for Survival” (2016), explored the prospect of an emergency fund for art in an era when most art institutions are shut down and many arts professionals are facing layoffs. The 2019 edition, “BE/10: A Space for Beauty” , was organized as part of a wider campaign to raise awareness of the crisis facing the arts and culture sector. ", "The next Biennial should coincide with the opening of the Biennale: some have proposed that the title should be “The Bénédicte de Rochat,” or “The Édouard Vuillard Years,” to acknowledge both the impact of the work of the late American architect on the region and the 20th century.The gallery will also sign a contract with the US-based nonprofit the Open Society Foundations to create a new collection of avant-garde German Expressionism, Art Nouveau, and Manet paintings. With the support of the foundation, the working team is working to establish the collection and create a platform for exhibitions and other programming that will be curated by the artists. The exhibition will also include the first major venture into the collection of Duane Poulin, who is best known for his paintings of early American soldiers in action and the American Civil War. The works will be moved to the Museum of Fine Arts in Boston and will be on display through November 30. The exhibition will also include an exhibition of works by the late German Expressionist Georges Apostel and his wife, Marta Pfeifer, as well as artworks by artists such as Viktor and Wolfgang", "The next Biennial should organize a collaborative exhibition between scholars from different disciplines, and present a project that will promote the work and the work of the artists.\n\n\nThe Public Art Collections of the Italian State and its institutions are vandalized to the extent that they cannot be operated by the institutional staff and are therefore damaged or destroyed. According to the Art Newspaper, the State-owned Rossoneri museum Trebbia in Milan is trying to compensate the museums for the lost revenue from the sale of works by the artist Lucio Fontana, who was convicted of murder in the case last year.The institution has already allocated $20 million to repair the damage to the Museo delle Papesino in the city of Reggio Emilia and has allocated $10 million for the restoration of the Museo Stedelijk Museum in Amsterdam. However, the institution will need to increase its funding for the rehabilitation of the national collection by $15 million and will likely raise another $15 million if it can raise the remaining funds from the North Kaliningrad region and the Republic of Poland, which together account for 90 percent of the collection.\n\n\nThe Christie’s auction house has announced that it plans to suspend sales of works by auteurs Carolee", "The next Biennial should take place sometime next year.\n\n\nThe Phillips Center has launched a new digital platform that will provide audiences with an alternative to the museum’s traditional in-person viewing rooms. Called the Phillips Experience, the platform will allow the public to interact with the works on display through real-time online viewing rooms and will include a variety of curated exhibitions curated by a team of curators and art historians.In an effort to combat the declining fortunes of the museum, which has been closed since November 27 due to Covid-19, the center announced on Wednesday it is reorganizing its exhibition catalogues and offering more curated exhibitions. The changes will take place in phases, with the first phase expected to run from March 20 to March 23.“This is an unprecedented and challenging time for the Phillips’ Center,” said center director and CEO Jennifer Keim. “The museum has been exceptionally supportive of the organization in every way possible. We are excited to see where the experience will take us next.”The museum will also offer visitors a new digital experience, the Phillips Experience Bus, that will transport visitors from the museum to any of the participating venues through a fully interactive portal. The experience will include live music, performances,", "The next Biennial should be held in 2021.\n\n\nA delegation of thirty-two artists and academics from thirteen countries including the United States, France, Italy, Germany, Spain, and the United Kingdom has endorsed the Rome Architecture Biennial’s plan to hold a conference in the city in 2021. The initiative, which was introduced by sculptor Florence Mariner, the artistic director of the International Centre for Architecture (ICA), and architect Tod Williams, was backed by the British artist Piers B. Haldane and the Dutch architect Hans-Ulrich Vermeer, who spearheaded the preservation campaign for the exhibition, “Rome: Architecture as Monument,” in 1983.The seventy-four-page proposal outlines the exhibition’s vision of a “revolution in architecture,” in reference to the Italian architect Cesare Prada’s intention to alter the architectural foundations of Rome and recreate the city in the artist’s image.“The Rome Biennial has been given the mandate to commission a new exhibition which will bring together contemporary architecture from around the world, and to aim to present the architecture of the twentieth century,” the proposal reads. “The construction of the exhibition will take place", "The next Biennial should be held in 2022, and the last in 2022.  In a letter to Guardian publishers from Diana Al-Khalili, the head of the Sifa Foundation, the twenty-third iteration of the exhibition will not be canceled, but its date will be shifted to a date in 2021.Al-Khalili wrote: “A key objective of the exhibition has been to create a platform for the reconstruction and reopening of the Palestinian village of al-Quds, which is home to the ancient city of Palmyra. This is part of a global campaign that aims to bring the world to consciousness that the past is not forgotten, but is a powerful tool for building a better future.”The museum will also reduce the size of the building in order to be more accessible to the international art market. Last year, the institution was forced to move the exhibition from the Al-Aqsa Mosque complex to a second location in the city. The museum has also said that it will divert 10 percent of its anticipated $65 million budget for the rebuilding of the complex from the UNESCO World Heritage Site. If the museum is forced to close due to the ongoing offensive by the Israeli military on Gaza, the institution will likely be forced to", "The next Biennial should be held in the spring of 2021.\n\n\nKirsten Lin, a Chinese American artist, has won the Prix Légerière de Paris. Lin, who lives and works in Barcelona, Spain, was honored at the 75th edition of the venue, which is located in the former principal residences of the late French president Nicolas Sarkozy and the late architect Albert H. Laplace. She was chosen by a jury of five artists and designers and literary experts.The jury comprised Yuxing Wang, a professor at the University of California, Los Angeles; Sophie Garaé, the artistic director of the Architectural Alliance of France; and Leonid Raznay, the husband of the architect Garaé, who was the architect of the building of the Museum of Modern Art in New York.“The jury that chose Kirsten Lin is a team of remarkable people, including: Abby Davis, the curator of modern art at the Museum of Modern Art; Nancy Lee, the curator of modern art at the Architectural Alliance of France; Eden Abou-Rahme, the artistic director of the Asian Contemporary Art Center in New Delhi; André Bors", "The next Biennial should be held at least once every other year, until the twenty-fifth.  The 2019 Exhibition will be held at the Institute of Contemporary Art in Paris. L'Art et légende” is a series of exhibitions organized by the Institute of Contemporary Art in Paris and curated by Jacques Pereira. The first show, “L'Art et légende” (2019), will be held at the Museum of Modern Art (MoMA). The second, “Étaïs ” (2019), will be at the Musée du Création (France). The third, “La Biennial des Arts et Lettres” (2019), will be at the Musée National Picasso (France), the Musée d’Arles (France), and the Musée d’Art Contemporain (France), and will be presented by the Institut Universitaire de Lyon (France), the Musée d’Art Contemporain (France), and the Musée d’Art Contemporain (France).The Twenty-Second Biennial, “Avignon: Apicomare-Trait et Image,”", "The next Biennial should be held in the fall of 2022. The venue, which is currently hosting the first exhibition of work in the art museum’s history, has denied the proposals, citing the need to preserve the institution’s artistic experience.However, the museum has since been granted a temporary closure due to COVID-19. The institution’s programming is expected to resume sometime this fall.\n\n\nFrieze announced today that the Copenhagen Postmark Prize for arts and culture will be awarded this fall following a three-month awards ceremony on January 27. The five-year prize, which recognizes artists and institutions that have demonstrated creativity and vision in their exhibitions, lectures, workshops, exhibitions, and publications, is one of the longest-running prizes in the country, dating back to 2010, and was established by the Danish Postmark Association to honor Kristina Kounell, a curator and artist who died in 2017. The other nominees for the prize were Tere Roo, Kim Kuk, and Ivar Bentók.The theme of this year’s prize was “Beauty and the Beast,” with the support of the Art Newspaper. The judges were Katja Nilsen, Fabian Kleiman,", "The next Biennial should be held in Tokyo and will invite twenty artists from fourteen countries to China. Organizers said that the theme will be “Polarization: Collapsing Global Power,” a reference to an exhibition at the Museum of Modern Art in the United States that explored the book and film art of the 1970s and 1980s.  Artist Essayist Tania Bruguera’s exhibition “No More Pictures,” a Vietnam War protest, will be included in the 2021 edition. The 2021 edition is slated to open on February 7, 2022, at the Museum of Modern Art in New York. \n\n\nThe Museum of Modern Art (MoMA) in New York has issued an apology for inviting photographer Perrotin Palmarini to photograph its newly renovated Sobeys Gallery, which is slated to open in the spring of 2022. The invitation was made at the end of a series titled “The Art of Photography,” which took the artist to explore his own medium through a series of photographs that depict the human face.In the interview conducted by Marc Glimcher, with Palmarini, and presented by the five-time Prix de Triomphe winner in partnership", "The next Biennial should arrive in 2020, but no official date has been set.\n\n\nA group of artists and activists have launched a petition against the sale of works by the artist Felicity Hammond, who was one of the first to set up the UK’s first online auction houses, and to protest the closure of the auction house. Hammond’s works were recently included in a major exhibition at the Modern Art Museum (MoM) in London, and the artist was invited to contribute an interactive work to the exhibition. However, MoM has since pulled the work from the show, and the artist has yet to receive a cent from the auction.Meanwhile, the Institute of Contemporary Arts (ICA), London, has called for an end to the exhibition “Madame Butterfly,” which it said resulted from a “displacement of ideas by a single woman.” In a statement, the ICA said: “We strongly believe that the procedure of the auction house, which was not in accordance with the guidelines of the ICA, had a serious adverse effect on the exhibition. The exhibition is now closed. As a result, the ICA will not be able to produce the work in the catalogue in the", "The next Biennial should host an exhibition of work on race and the American South. The opening will take place at the newly renovated New Orleans Museum of Art.“Themes of history and of justice are central to the diverse histories that shape our cultural heritage,” said Naima J. Keith, chair of the museum’s board. “The opening of this exhibition marks the third time that the Biennial has been celebrated by the museum. The first two occasions were in the 1930s and 1940s. The museum will provide a platform for the work of many great artists and will present the second edition of the exhibition on March 15 and the third edition of the exhibition on March 22.”The exhibition “Toward a European-American History of the Americas,” curated by German-born artist Bernhard Riester, will open on May 23. The show will feature more than eighty works by fifty artists and will feature a reconstruction of the first European encounter with the Americas, a reconstruction of the voyages of Christopher Columbus, a reconstruction of the Spanish-American War, and a reconstruction of the American Revolution.The Biennial’s inaugural season, which was staged by the museum in partnership with the New Orleans Museum of", "The next Biennial should aim to develop a coherent vision of the afterlife in a way that can be understood by both spectators and those who are present. Previewed by the artist and curator Benedikt Fischer, the exhibition will focus on how art can serve as a vehicle to change the way we think about and experience the afterlife. The exhibition will also examine the relationship between art and spirituality and will feature a number of works by artists whose work explores the afterlife, including Kiki Smith, Ed Ruscha, and Robert Rauschenberg. The third edition of Biennale Los Angeles will be held at Hollywood Studios from March 25 to March 27. The biennial’s theme, Walking on Water, will take a philosophical, not a religious, approach to the afterlife. The show will include works by artists such as Paul Gauguin, Ed Ruscha, and Ed Moses and will focus on the relationship between living and afterlife. \n\n\nThe Toledo Museum of Art (TMA) in Ohio has announced it has received a gift of more than 1,500 photographs by American photographer Joshua Helmer. The donation includes works by thirty-six artists, including John Akomfrah, Mary Ellen Mark, Robert Irwin and Lori Maes, and includes more", "The next Biennial should be in 2020.\n\n\nThe French modernist artist Michelangelo Antonioni has died at age eighty-eight at his home in the city of Venice. The cause of death was cerebral hemorrhage, which was confirmed by a twenty-two-year-old Austrian student who took the Austrian state-sponsored Pompidou to court to secure a full autopsy. The court ruled in favor of the Pompidou in a landmark ruling published in Le Monde on July 3.The court ruled that, contrary to Antonioni’s wishes, the autopsy was not conducted to avoid a full and thorough examination of the student’s body. Instead, it concluded with a ruling that sent the Pompidou, which had denied the autopsy was conducted, to the Art Newspaper for refusing to pay an estimated $600,000 in damages.The court also dismissed the case against the Pompidou for its alleged “inadequate care of the body” and found the Pompidou, which had already paid the student $111,000 in damages, to be the victim of a “warlike” attack from the student’s parents.“On the basis of the Pomp", "The next Biennial should also include a series of public performances and performances-based projects, such as the 'Garden at Logar, Pakistan’s first city-based museum dedicated to history and culture.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has launched a crowdfunding campaign for its next edition, which will take place in 2020. The event will be held at the museum from September 7 to September 10, 2020.The initiative, called the Metronomic, is a collaboration between the museum and the nonprofit the Wyomissing Foundation, which will share the costs of staging the exhibition with the Met. The funding will go toward commissioning, designing, and managing the exhibition.“The Metronomic is a partnership between the museum and the Wyomissing Foundation, a leading organization dedicated to supporting artists and creative projects in New York City,” said Mark Weinberg, the museum’s director and chief curator. “In partnership with the museum, the Wyomissing Foundation will develop and present an exhibition that addresses the themes of our time: a world in which people are more connected, more mobile, and more connected by way of technology. The partnership will allow the museum to engage audiences worldwide in", "The next Biennial should also focus on reimagining the Black Lives Matter movement through a Black perspective by addressing the legacy of the movement and how it relates to contemporary issues of race and a Black perspective by being responsive to the Black experience.  The event will aim to address the contemporary issues of racial justice and the legacy of Black people in a manner that is both historically accurate and contemporary. \n\n\nThe National Museum of African Art (NMA) in Washington, DC, has received a gift of more than twenty thousand photographs by Maurice Barlow. Barlow, the creator of the iconic black-and-white panoramas whose mesmerizing drapes and popular paintings give furs and other textiles their distinctive colors, passed away on December 2 at the age of eighty-nine. Known for creating immersive, three-dimensional environments that inhabit the imaginations of both his subjects and his audience, Barlow also pioneered the formation of the term 'molecular compositional image' and the image-making process.Born in Chicago in 1931, Barlow moved to the Seaboard in the 1940s. He studied under Louis Kahn at the University of Pennsylvania and John Cage at the University of Chicago. He eventually moved back to his birthplace, which he", "The next Biennial should take place in 2022.\n\nChristo, who has been a curator at the museum since its founding in 1925, said that the museum is currently considering whether to open a second location in the city, as it did in its new home in the Arts District, where it is still under construction. The plans were first reported by the Denver Post.The institution hopes to launch in time for the 2020 Rio de Janeiro Olympics, which will coincide with the opening of its new building in the Arts District.\n\n\nThe Official Artists’ Legacy Foundation in London is planning to collaborate with Tate, the National Galleries of Scotland, and the Tate’s parent organization, the British Film Institute (BFI), on a series of exhibitions that will be guided by the legacy of Wilfred Owen. The first exhibition, “Owen: The Legacy,” will open at Tate Modern in London on September 11, 2020 and will feature works by thirty-six of the institution’s current alumni, including Heather of the Waves, Evelyne Atget, and Jennifer Leveritt. Other shows that will be hosted by the foundation in the coming months include “Owen: The Legacy” and “Wilfred Owen: The", "The next Biennial should be held in the autumn of 2020, before the end of the Fifth International, and will be inaugurated by the exhibition of the work of artist and designer Philip Johnson. “What is most important about the Biennial is that it is an open platform for dialogue and reflection,” said Diana Babu, the director of the Centre for Contemporary Art at the History of Modern Art in London. “I look forward to the organisers’ view of the exhibition, its exhibition programme, and the work of the biennial artists. I am especially delighted to see that this will be the first time that the work of Johnson’s own collection is presented in this country. Johnson will be receiving a commission from the studio  and a gift of the works from the family of Kenneth Johnson, the founder of the company Johnson Paints, and the artist Alvin Johnson.”\n\n\n\n\n\nJoan Mitchell, the executive director of the National Center for the Lesbian and Gay Community (NCLCG), Washington, DC, was recently appointed the next director of the National Museum of Women in the Arts (MoMA). Mitchell will be in her first full-time position at the institution", "The next Biennial should begin in 2020. For the past two decades, the biennial has been a platform to review and celebrate the work of artists under the biennial umbrella, and has featured work by over 150 artists.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that it will host the twenty-fifth edition of the London Art Biennale, which has been canceled due to Covid-19, in 2021. The event was originally scheduled to take place in March, but will now take place from September 9 to October 24. The event will be hosted at the Institute of Contemporary Arts (ICA) by Tate Modern and the Harriet Wilson Foundation, and will be hosted in partnership with the Institute of Contemporary Arts (ICA), which is dedicated to the study of contemporary art.The 2020 edition of the event, titled “London,” will feature fifty works by seventy-five artists, and will be hosted at Tate Modern from September 16 to September 21, 2020. The 2020 event is part of the Tate’s yearlong celebration of its 150th anniversary. The event will be organized in collaboration with the Institute of Contemporary Arts (ICA), which is also dedicated to the study of contemporary art and the art of visual art.C", "The next Biennial should take place in 2019, according to the organisers. The first edition, held in January 2019, featured work by forty-nine artists, including John Akomfrah, Mark di Suvero, and Kiki Smith. The 2019 edition will be held at the museum in March.\n\n\nThe nineteenth edition of the Unseen biennial, curated by Kiki Smith, is now open to the public. The event, which took place in New York from May 20 to May 22, 2019, will run from September 24 to September 27 and will feature seventy-seven works by seventy-nine artists.“The exhibition was intended as a vehicle for Kiki Smith’s artist-centered practice, but it has grown into a way of thinking about and reflecting on the most complex and consequential issues of our time,” said exhibition curator Sohrab Mohebbi-Khela, who curated the inaugural edition in April 2019. The exhibition also introduced many new works by artists whose work has yet to be exhibited.“The fifty-third edition will return to the Brooklyn Museum in September 2020, and the fifty-fifth will begin in October 2020.”The inaugural edition of the World Artist’s", "The next Biennial should be announced in 2020. Guggenheim Museum, New York: Originally scheduled for 2022, the museum has yet to announce an opening date for the exhibition. Museum of Contemporary Art, Chicago: Originally scheduled for 2022, the institution has yet to announce an opening date for the exhibition. Museum of Natural History, Athens: Originally scheduled for 2021, the museum has yet to announce an opening date for the exhibition. Museum of Modern Art, Kansas City, Missouri: Originally scheduled for 2019, the museum has yet to announce an opening date for the exhibition. Museum of Modern Art, New York: Originally scheduled for 2019, the institution has yet to announce an opening date for the exhibition.\n\nThe Carnegie Museum of Art in Pittsburgh and the Metropolitan Museum of Art in New York announced today that the first exhibition of work by Sylvia Hill and Richard Adler, “The Shadows,” will open on the Met in 2021. The first show of the artist’s work on the Met, which has been temporarily closed since mid-March due to Covid-19, will be a solo exhibition at the museum in February 2022. The show, which will include", "The next Biennial should take place in 2020.A Nairobi-born, New York–based artist, who currently resides in Toronto, is working with the institution to create a new work, titled The Last Infant, in commemoration of the twentieth anniversary of the Omotesando Earthquake and the World Health Organization’s declaration that there is a pressing need for emergency relief. The work, which will be a collaboration between the artist and the museum, will be held in the museum’s collection. The artist will create a new nursery, a place for young children to play, to be located in a building adjacent to the Omotesando Museum. The artist’s work will also be featured in the museum’s exhibition “Anthropocene: The Lasting Picture,” which will be on view until November 23.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, is reopening next week following an extensive $500 million expansion, adding a new generation of sculptures and installations by renowned contemporary artists such as Robert Irwin, Alison Knowles, and Charles Made. The theater of the absurd, made large-scale in the Hirshhorn’s courtyard in partnership with the artists", "The next Biennial should be in the summer of 2020. The Biennial will also be held at an open-air museum in the city of Bursa, in the capital of Russia, in the autumn of 2020. The exhibition will feature the works of twenty-six artists, including Olga Galindez, Aleksandr Sivkovski, Dmitriy Vershbow, and Daniel Zuker.\n\n\nThe United Kingdom announced on Tuesday that it is preparing to leave the European Union and become an independent state within the European Union, the United States, or the European Economic Area (EEA), following a Brexit vote that will have wide-ranging implications for the rest of the world. According to The Guardian, the government is planning to hold an in-person referendum on June 8 that will result in a Brexit-backing government.The announcement follows weeks of chaos caused by Brexit and the subsequent political crisis surrounding Prime Minister Boris Johnson’s departure, which resulted in the resignation of three-quarters of the UK’s cabinet and led to the suspension of the legislature. Since the UK’s departure, the stocks and bonds of British companies and banks have tanked, and the British economy has been in a tailspin", "The next Biennial should be organized as follows: Friday, March 19, 2019, to Monday, March 21, 2020. Let’s hope that this biennial can serve as a fruitful occasion to re-examine the forgotten past, to re-examine contemporary art, and to re-examine the vital and spark-like potentials of art.”\n\n\nThe National Gallery of Art in Washington, DC, is planning to tear down its former home on Pennsylvania Avenue and build a new museum, billed as a center for contemporary art, on the site. It is also working with SculptureCenter, the nonprofit arm of the National Council on the Arts, to create a public programming platform for pieces that have yet to be exhibited at the institution.In addition to building a new exhibition space, the gallery is working with SculptureCenter to create a public plaza in front of the building to accommodate larger events, and is planning to begin the construction of the museum’s new campus in 2019. The redesign aims to create a more welcoming and engaging environment for visitors to the National Gallery of Art, while also increasing the collection’s reach and its exhibition capacity. The new building will boast an area for educational programs,", "The next Biennial should be held in the spring of 2021. Commenting on the event, Kim said: “The exhibition of British artists is an essential step in our country’s journey to become a global leader in art and culture. The exhibition will be a dramatic reopening of our community and will showcase new and exciting work, drawing on the legacy of British artists.”\n\n\nThe New Museum in New York is attracting new visitors with a new initiative that aims to introduce theater to the institution’s audiences through a combination of live performance, virtual reality, and interactive projects. The new program, called New Play, will begin with a virtual reality performance in the fall of 2020 and will culminate in the staging of the first New York play in the city since 1988.“New York is a great city of theater,” said New Museum director James D. Higgins. “New Play is a new way to engage and energize our audiences through immersive and collaborative virtual environments. We know the importance of theater for the heart and soul of the city, and the impact it can have in shaping the world as we know it. We are thrilled to work with the world to explore new ways to engage with New York in 2020.�", "The next Biennial should be held in the fall of 2020.  That would make the event the fourth cycle of the fair to take place in the country, following the Biennial Los Angeles & Tokyo in 2020, the inaugural Biennial Berlin in 2021, and the second Biennial Tokyo in 2022.  Originally scheduled to kick off in September 2019, the event was pushed back to September 2021 due to the Covid-19 pandemic.In a statement, the fair said: “The new year is of great concern for us as we face a challenging and unprecedented global threat. We are fully focused on ensuring the successful closing of the forthcoming edition of the Fair London, and the future of the fair and the fair business in general.”\n\n\nThe Museum of the City of New York (MoCA) has received a gift of more than three hundred photographs by Pablo Picasso, including a work from the artist’s hometown of Milan (1903–1912), a gift commemorating the fifty-eighth anniversary of the Birth of the American Republic, and a painting from the artist’s studio in the artist’s hometown of Milan (1912–2016).The gift comes from the artist’s son, Angelo", "The next Biennial should be the first to open in the capital city. The institution will be housed in the museum’s new building, the new museum Georges Pompidou (Geneva). The exhibition, which will highlight the works of artists who were active in the first half of the nineteenth century, will feature works by David Adjay, Jean-Luc Moulène, Hans Hofmann, Charles Fiedler, Jean-Luc Huchel, Arts and Architecture and Art, and Barbara Fleuro. The show will also open the museum’s new building, the Biennial Museum, which will welcome visitors from October 15 to December 18. The venue was chosen for its historical significance and its proximity to the Louvre. It is currently being restored and is expected to open in 2021. The National Gallery of Canada, which recently announced plans to move to a new 24,000-square-foot building in the city of Port-au-Prince, also chose the Violet Valley, where it will likely stage its next exhibition. The institution will unveil the first designs for the new venue in 2020.\n\n\nThe Presidential Commission on the Status of Women (PCW) has", "The next Biennial should focus on the spatial accessibility of X-rays and on the physical embodiment of the image. “The next Biennial should focus on the spatial accessibility of X-rays and on the physical embodiment of the image,” the exhibition organisers wrote. The exhibition will feature work from seventy-four contemporary artists.The 2020 edition of the exhibition will take place at the X-ray Center in Xian, Beijing, from September 14 to September 21, 2020.\n\n\nThe museum of Egyptian art in Cairo has appointed Ibrahim B. Al-Assaad as its new curator of rare and contemporary art. He will be responsible for training, equipping, and integrating the institution’s collection and exhibitions. Al-ASSaad comes to the museum from the ID Sadaqart Center for the Arts, where he has been the curator of photography and prints since 2018. He previously served as a curator at the Museum of Modern Art in Cairo from 2014 to 2018.“Ibrahim is a gifted and dedicated curator who has been putting in the work to make the ID Sadaqart Center for the Arts a unique and vibrant center for photography and prints for many years. He has created a unique environment for the exhibition of works", "The next Biennial should be held in 2020. The biennial will include two iterations of the exhibition, beginning with a selection of works by twenty-three artists in 2018 and 2019, and ending with the exhibition of work by twenty-three artists in 2020. “This year we have selected twenty-three artists for the Biennial 2020, and this is the only year we will be able to showcase their work at the same time,” said Markus Bacher, the artistic director of the Biennale. “The new date will make us a little bit more flexible and will allow us to expose our work to the widest possible audience, especially in the most important countries.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for museums that are slated to reopen following the reopening of the Brooklyn Museum and the Bronx Museum of the Arts.The guidelines, which were drafted by the department in consultation with the city-backed think tank the Manhattan Institute for Technology (MIT), recommend that institutions stay within their operating budgets by avoiding the construction of new structures; encourage the use of existing infrastructure; and consider the possibility of converting some of the museums into permanent collections. The guidelines", "The next Biennial should be held in 2020. Represented by Jean-Paul Sartre, Jean-Luc Moulène, Pierre-Auguste Renoir, and Pierre-Auguste Walke, the exhibition will feature the work of twenty-six contemporary artists, including Alejandro Campanas, Agnes Martin, Gere Kavanaugh, Hans Hof and Martin Heidegger. The exhibition will be divided into three parts, which will run from September 29 to October 12, 2020, and September 27 to October 24, 2020. The first part of the tour will take place in February 2021. The second part of the tour will take place in April 2021. The third part of the tour will be released in June 2021.\n\n\nA group of artists and activists that is protesting the 2018 reopening of the European Commission–controlled Tate Britain in London are demanding that the institution pause the work of any works that have not yet been removed from the grounds of Tate Britain. The exhibition, which will kick off on October 29, will be a “moment of national rebirth” and will also feature works by artists such as Damien Hirst, Gere Kavanaugh, and Jonathan Pryce. “Tate is asking us", "The next Biennial should be able to host a major exhibition about life in the city in 2021, according to Mayor Jacob Frey, who noted that the museum’s current programming “does not provide the public with a good history of the city.”The plan was made more ambitious after the city invested $2 billion into the museum, which is located in the former New York City Department of Cultural Affairs building on the northwest corner of Fifteenth Street and West Twenty-Fourth Street. The $1.3 billion raised by the city in 2017 also included the construction of a new fifty-five-acre campus. The project, dubbed the City Center Initiative, also involved the construction of new public art installations and the redesign of the city’s historic Core Gallery.Since the city’s decision to shutter the institution in October 2019, the museum has been heavily criticized by local residents, who claim that the closure has negatively impacted their quality of life. The museum has also been sued by the city of Detroit, who is trying to take possession of the property in an attempt to make repairs with the help of eminent domain, and has been the focus of a number of state and federal investigations.\n\n\nThe Metropolitan Museum of Art in New York has appointed Kate", "The next Biennial should take place in 2021, and the first Biennials will take place in 2022. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of more than one thousand artworks from the Los Angeles County Museum of Art (LACC). The gift includes works by artists such as David C. Driskell, Michael H. Turner, and Barbara Palmer.“We are extremely grateful to the LACC for this extraordinary gift,” said museum director Michael Govan. “Its collection is unparalleled in its scope and breadth, and its artistic practice reflects the breadth and depth of our community. It also creates new possibilities for the collection.”The gift includes a collection of more than one thousand works from the Los Angeles County Museum of Art (LACC), a collection of more than one thousand works from the Los Angeles County Museum of Art (LACC), and David C. Driskell. The works, which were organized by artist, collector, educator, and curator Mark DeSousa, will be included in the museum’s exhibition “Beyond Borders: Los Angeles” (2019–20), which will open on December 23, and will be on display for", "The next Biennial should be held at least once every two years, with a new, curated selection of works curated by the same group of curators who curated the previous exhibition. “Our biggest challenge in the coming years will be to find space to organize an exhibition of work that is not constrained by geography and time,” said architect Joachim Neugroschel, chair of the board of trustees, after the biennial’s 2019 edition. “The current exhibition programme in the Biennial Museum is too wide, and the new exhibition programming is not the best way forward. We are still in the phase of development, and so we are also working on how to change the programme. Will it be at the museum or at the gallery? Will it be in the building or at the gallery? We will have to see. But we will continue to work on it together.”\n\n\nThe National Geographic Society’s plans to postpone a major exhibition devoted to the history of the Earth, based on a United States Geological Survey discovery in 1903, have been put on hold after the organization received a $100 million donation from the fossil-fuel and shipping magnate and his wife, Myra, in a landmark legal settlement announced on", "The next Biennial should take place in 2021, and the dates will be announced soon thereafter. The first edition was held in June 2019. The biennial will also present a retrospective of the exhibition “Incorporating Art and Technology: From Art and Technology to the Future .” The exhibition will feature new works by thirty-four artists, including Peter Sellars, Chase Adelman, Tadao Ando, Rodolphe Bontol, Wayne Koestenbaum, and Frank Gehry, and will run at the Museo de Arte Contemporáneo María de Los Angeles (MASO), Marfa, in the city of Los Angeles, from March 6 to March 8, 2020.The institution will be located at 1650 North Santa Fe Avenue, in the Santa Fe enclave of the Far West Side of Chicago, and will host a classical-music-focused exhibition, “Conversations and Conversations” (2017), and “Ateliers: The Making of—” (2019), among other programming. The latter two venues were curated by Michael Oosterhout, director of the Museum of Contemporary Art Chicago.Commenting on the upcoming exhibition, the College Art Association (C", "The next Biennial should be held in 2022. Its next edition will be hosted by the Kunsthalle Basel in Switzerland, where the first exhibition was held in 2013.Günther Förg, the president of the Federal Office for Culture and Sports, and Jürgen Klomb, chairman of the Künstlerhaus and Museum Bonn, have called the right to cancel a show “excessively hard to cancel.” In a statement, the Führerbürger Kunsthalle Basel said: “The declaration of the first edition of the Biennial is a great step forward for the future of the Biennial Festival. We are therefore thrilled to be able to announce the date and its location, and to welcome the new participants to the exhibition. We hope that the Künstlerhaus and Museum Bonn will become the first to welcome the new participants to the festival.” The event’s artistic director, Jakob von Kriminal, added: “What is most important is that this exhibition, given the monumental literary legacy of Franz Kafka and the cultural importance of the exhibition, fulfils the necessary legal and ethical requirements for the Festival. In this way, it", "The next Biennial should be the first to address the full extent of the structural violence that oppresses black trans people, whether it be institutional racism, police brutality, mass incarceration, war, and climate change. “We are aware that many people are feeling excluded from this exhibition, especially those who are not able to travel to the museum, and from participating in the show,” said Sarah Efstathiou, the head of the exhibition. “But this is an opportunity for the art world and the artists who work in it, in order to re-imagine and reimagine the exhibitions that we will create in the future.” The inaugural exhibition, “Black, Trans, POC,” will continue on September 22–27.\n\n\nThe Solomon R. Guggenheim Museum and the Brooklyn Museum in New York announced today that Shari Ann Constance, a curator and educator who focused on movement and performance, art, and civic engagement, has been appointed its next associate curator. Constance comes to the institution from the Ad Hoc Group on Exhibitions (HEG), which she established in 2015 to focus on how art and artmaking intersects with social justice movements and public policy. HEG was", "The next Biennial should be held in 2021, according to a statement from the organizers. The exhibition will be hosted by the Art Gallery of New York and the Museum of Modern Art and will be organized as follows: Art’s Future: Design & Futurism (2016–17) Viewing Room Art’s Future: Disruption—Art and the Future in a Time of Crisis (2017) Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing RoomViewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room Viewing Room View", "The next Biennial should be held in January 2021.In a letter addressed to the board of trustees of the Museum of Modern Art, the Los Angeles County Museum of Art and the San José Museum of Art, the architects wrote: “The current layout of the museum is both challenging and intuitive. The new structure aims to address both the structural and the functional requirements of a museum, while still keeping the museum in its original setting and incorporating the best of contemporary art.” In addition, the letter said that the museum should not be scaled back in any way. The letter also criticizes the city of Los Angeles’s plans for a new stadium for the city’s Major League Soccer team, as well as its development of a large-scale memorial for the victims of the 2011 tsunami in Japan.Called the Los Angeles Plan, the blueprint was released by Mayor Eric Garcetti in December 2019, two months after the city council voted to approve $1.5 billion for the stadium and for the museum. The project is expected to be completed by 2022.\n\n\nThe Metropolitan Museum of Art has received a $2.5 million donation from philanthropists Bill and Melinda Gates. The Gadsden–based organization, which also provided $1", "The next Biennial should be completed by the year 2020.The full list of participating artists is as follows:Erev SaveriErev Saveri (Switzerland)Erev Saveri (Switzerland)Erev Saveri (Switzerland)Olivier HuygheErev Wiradjik (Germany)Erev Wiradjik (Germany)Erev Wiradjik (Germany)Papel GabrielÇelbert Henrique (Brazil)Fernando Pireira (Brazil)Fernando Pireira (Brazil)Fernando Pireira (Brazil)Fernando Pireira (Brazil)Fernando Pireira (Brazil)Fernando Pireira (Brazil)Fernando Pireira (Brazil)Fernando Pireira (Brazil)Erick Balsom and Raimond DragongésÈ’s tribute to the artist and their legacy, which was organized in conjunction with the Biennial, Feminine (2017–18) at the Museo de Arte Contemporáneo Brasileiro (MASB), Rio de Janeiro, and the 2013–14 Heresies series, which was staged at", "The next Biennial should be held in 2020, the director of the Institute of Contemporary Art, Hammer Museum, said. The museum also plans to relocate the museum’s collection to a new space on the second floor of the building.The museum has faced a number of challenges in the past, including a fire that damaged the museum in 2016. The fire was contained by the Museum of Modern Art, which moved the collection to its own building. In order to reopen, the museum will have to relocate some of its holdings, including the works of Jean-Luc LaPiviere, Michelangelo’s The Creation of Adam, and the Ark of the Covenant. The museum will also have to redesign its exterior in order to make room for the installation of the new works by the artists. The renovation of the museum will begin in the fall.\n\n\nCanadian artist Jason Mantha, a Canadian citizen and Canadian citizen-in-residence who is currently incarcerated in the United States, has been released from prison in the United States following a seventeen-month hunger strike in protest of his wrongful conviction. Mantha’s lawyers had requested his release on April 27. After Mantha’s release, his lawyers received an outpouring", "The next Biennial should take place sometime next year. For the first time, the event will be open to the public, and organizers are also working on developing a digital platform and a series of exhibitions based on an online platform. The Biennial of American Painting will be staged at the San Francisco Museum of Modern Art (SFMoMA), and will analyze the impact of American art in Europe and the United States on the continent. “This new exhibition will focus on how the United States and Europe have changed and are still changing within the continent,” said Artforum’s director, Drew Karpitzky. “The series Menards: American Art, 1890–1985, will provide a unique look at how American art has been impacted by the global crisis, and will bring together several hundred contemporary artists, including Mitchell, Donaldson, and Waldo, whose work is currently exhibited in the exhibition ‘American Art’ at the Palazzo Nazionale d’Arte Moderna in Venice.”The biennial will also include an open-ended fiction exhibition, a “full-length fiction reading and writing workshop” as well as a “interdisciplinary talk about the future of the", "The next Biennial should take place in the United States in 2021. \n\n\nThe Museum of Modern Art (MoMA) in New York has launched an initiative to encourage the installation of more works by underrepresented artists, including women and non-binary artists, in its collection. Underrepresented artists are a diverse group of artists who have a physical or conceptual representation in a museum. The initiative, dubbed the 'Art of Embossing, is a collaborative effort between the museum and the artists to create an exhibition that represents the best of contemporary art, and to engage with contemporary issues of representation and the art world.”The initiative was launched after MoMA’s acquisition of a work by artist and educator Shih Chien-Yi, who has since been included in twelve exhibition-level programs at the museum. She was selected from a shortlist that included Mark di Suvero, Yinka Shonibare, and Molly Crabapple. The first work to be showcased in the exhibition was a bronze sculpture by the artist Mary Anne Bronner, which she created in 2012. The work, titled Embarrassment, was inspired by a scene in which a naked woman is caught masturbating by her husband in front of a mirror. It was created", "The next Biennial should be held at the Museum of Modern Art in New York and will be organized as follows: The exhibition will consist of forty-five works, selected from a full catalogue, each curated by a curator from the contemporary art sub-discipline of writing and art history. The exhibition is titled “Sensate: Biennial.”The exhibition will feature biennial submissions by artists such as Martin Bethenny for the exhibition “Sensate” (2019) and “This Is Not a Biennial” (2019), as well as recent collaborations between artists from the contemporary art sub-discipline and contemporary art history and will also include a presentation of the work of Rosa Mendieta for “This Is Not a Biennial” and a special presentation of work by Kazimir Malevich for “This Is Not a Biennial” The full list of participating artists is as follows:Artists:Michelangelo Antonioni (Italy), Anna-Sophie Ooi (France), Jocelyn Long (UK), Chris Spalding (US), Adolfo Soriano (Italy), Geraisto Trini (Italy), Marisa Tognoni (Italy), Michaela Tro", "The next Biennial should be held at a location that will be designated by the city and is expected to be completed by the year 2021. The museum will be housed in a former sugar mill and will host more than twenty thousand artworks and other works by thirty-eight artists in addition to the award program.The Biennial has faced numerous setbacks in recent years. The organization contracted with the Metropolitan Museum of Art in New York to organize the inaugural event in 2014. The partnership was plagued by a series of delays, including a fire in the warehouse where the exhibition was taking place and a coronavirus outbreak in China that killed six people in the country (the number of those infected in the United States is unknown). The museum eventually awarded the Biennial a $2 million grant, but the number was later reduced to $1.5 million and the events were moved to a different location. The artworks that were relocated include Von Karman’s Wu Shanzhuan: Peace and Life (September 3, 2019), which is set in the Zhuang Autonomous District in Wuhan; and the Biennial’s first exhibition of work by artist Emily Hall, which opened at the Albright-Knox Art Museum in", "The next Biennial should be held in the spring of 2020. The design of the exhibition will be based on images, texts, videos, and art. The exhibition would consist of twelve rotating exhibitions, including the first in the country, entitled Art during the Global Meltdown, which will be staged at the Renaissance museum until December.  The institution has already commissioned a work by artist Nadezhda Guseva, who is based in Moscow, for the exhibition. The following year, artist Laura Owens will join the curator for a project at the Museum of Fine Arts in New York. In the latter half of 2020, the museum will host an exhibition dedicated to the artist Jane Birkin in the form of a two-week residency. The opening of the biennial will also coincide with the opening of the museum’s new exhibition “Reflections on the Stages of Change,” which will offer a retrospective of the artist’s career.\n\n\nThe Museum of Contemporary Art (MoCA) in Seoul announced today that artist Kim Seo-kyung will receive the institution’s Lifetime Achievement Award in recognition of his work as part of the institution’s “Year of the Storm,", "The next Biennial should focus on the complex interconnections between history and art and should begin with a theme of beauty: a theme that is relevant to the current political moment.”\n\n\nThe United Kingdom is planning to leave the European Union, but not before the country reaches a new agreement with the bloc—specifically an agreement that would allow the UK to leave the European Economic Area (EEA), but also to leave the European Union’s single market. British Prime Minister Boris Johnson told Parliament that the government is still consulting on the terms of the Brexit deal, but that the government is “committed to working with the European Union in full—not as a bridge, not as a way, not as a compromise.” The government intends to begin negotiating the terms of Britain’s departure with the European Commission in March.Under the terms of the deal, which was hammered out in March, Britain will leave the single market, but will stay in the EEA, and will start negotiating a new trade deal with the bloc in March. The government expects to have a deal by June.Johnson said that the government has worked with the European Commission on a number of key pieces of the Brexit bill, including a new trade deal that will", "The next Biennial should be held in the fall of 2020, with the exhibition slated for the spring of 2021. The next edition of the exhibition will also mark the ten-year anniversary of the city of Biagio. Its inaugural year was also marked by the restoration of a medieval church in the city of Ivoriano, which is also located near the site where the exhibition will be staged.The new five-storey building of the museum, dubbed the Peinado Palace, will also boast of a café, a library, and an event space. Designed by architect Sandro Tichela, the Palazzo Peinado was inaugurated in 2004 and has stood empty for the past two years. The project was part of a larger plan to transform the city of Rome and its surrounding area, including the archaeological site of the Parthenon and the Pantheon. The restoration of the Parthenon and the Pantheon is one of the highlights of the project.The new building will also house a research library, a museum dedicated to the history of modern art, a research library with special exhibitions and educational programs, and an archive dedicated to the Italian Renaissance. The restoration of the Parthenon and the Pantheon was completed in collaboration with the local", "The next Biennial should be called off, and the event should be moved to a different location. The Museum of Contemporary Art Chicago has not yet commented on the change of plans.\n\n\nA group of artists and collectors are suing the Metropolitan Museum of Art in New York City over the sale of works by Pablo Picasso in a lawsuit that was filed last November. After the works were removed from the museum in March 2018, a spokesperson for the institution told Artnet that the museum was taking the matter under review.The artists, who are representing themselves and have not yet been identified, claim that Amy Sherrill, a curator at the Whitney Museum of American Art, sold the works without their knowledge or consent. “The Whitney sold these works without our knowledge or consent,” the artist’s lawyer, Richard Levine, said. “The works are now in the collections of dozens of museums and thousands of collectors. We are confident that Amy and her team will present legitimate defenses to these unfair and deceptive acts.”In a separate complaint filed last month, a different group of collectors signed a similar statement of claim. The statement of claim claims that the Metropolitan Museum did not remove the works from the institution until March 22 and that the works are currently in", "The next Biennial should give the institution a new beginning in its history, which celebrates fifty years of covering the arts in the capital city of the Russian Federation. It is currently in the construction phase and will begin hosting programming in 2020.The construction of the museum is expected to begin in 2021. Its actual opening date is still under consideration, but the museum likely won't open until 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York City has received a gift of more than five hundred works by several African American and African American-led artists, including Jacqueline Hill, Willa Cather, and Adrian Piper, from a wealthy benefactor who called himself a descendant of a distant relative of the late Abraham Lincoln. The donation includes several works by black artists, including John McAllister, Jerry Gray, and Yolanda Foster. Hill, who was named the recipient of this year’s Turner Prize at the Fifty-Ninth Venice Biennale in June, was among four artists who were presented with the honor last month. The other two recipients were McAllister, who won the $25,000 Turner Prize for his final work, and Foster, who was nominated for the prestigious Ralph Waldo Davis Award for his work ", "The next Biennial should take place in 2020 and will include a selection of work in the form of a video game within a fictional city. Both the museum and the game will be located in the Biennial Canal, a massive project designed by the French architect Bernard Bau and built in 1978.The project has faced many challenges before it was approved by the city of Lyon, which commissioned the museum in 1978, but it has successfully navigated many of them. For example, in 2013, the city erected a large sculpture of the Los Angeles riots in a courtyard outside of the building, and in 2020, the city will be able to organize a special exhibition for the institution.In December of 2016, the museum announced that it would close in early March. The closing is in line with the city’s plan to construct a new citywide transit system called the Metro. In addition to the museum, the Marciano family, whose expansive real estate empire includes high-end restaurants and bars, is proposing the renovation and expansion of the old Alcanar de Lyon. “This is an ambitious project,” Marciano said in a statement. “We will reach the milestone of the new museum in March. We will also present the first exhibition of", "The next Biennial should take place in 2021, and the first in 2022. The newly constructed exhibition hall will be inaugurated by a solo exhibition by the French artist Marc Huyghe in February 2020. The 2016 edition of the exhibition, entitled An Open Letter to Art, inaugurated the exploration of themes such as the relationship between art and language, the nature of creativity, and the role of art in changing the world. The Biennial will be based in the museum of the French Ministry of Culture in Paris and will consist of fifteen exhibition halls arranged in a triad fashion, each hall comprising three levels and connected by a series of elevators. The central hub will be a twenty-four-car parking garage, which will feature a movie theater, a sports complex, and a café where visitors will be able to meet the artists and receive studio time.The manufacture of the exhibition, which is scheduled to run from March 18 to March 22, 2020, was inspired by the Children’s Place in New York, which recently announced the opening of a new exhibition with the exhibition of artist photographs in mid-May. The show will feature twenty photographs in an effort to highlight the work of twenty-eight young artists, including Do Amaya", "The next Biennial should be held in a location that is physically close to the exhibition’s venue, in order to be able to hold the exhibition, and to get the best possible view of the works at the exhibition.”To demonstrate how the new structure will open up new opportunities for expression at the institution, the curator of the upcoming exhibition, Anna Gerber, will present an exhibition of new works by the artist Banksy, who has been missing since the attacks on the US embassy in Cairo in December. Commenting on the new exhibition, Gerber said: “This is an opportunity for us to recommit to the art of the exhibition and to reconsider the whole exhibition in terms of the journey of the work in the exhibition. This is a moment of great uncertainty for all of us, and it is challenging us to be more creative.” The announcement of the Biennial has drawn harsh criticism from politicians, who have called for its cancellation. On Friday, New York Governor Andrew Cuomo declared: “I’m not going to stand for a week of violence against a single American citizen.” He continued criticizing the United States for its reluctance to cancel the exhibition, which he said “poses a threat to Israel’", "The next Biennial should not be held in 2021 but should be in 2022, and the and the next should be between 2021 and 2022.”According to the Art Newspaper, the new exhibition space, which will be located in the City of London, will invite artists from the United States, Europe, and the Greater Middle East. The space will also host the Biennial of Australian and New Zealand artists, and will host biennial events and other programming. The venue will host a reception for twenty-four artists on July 21, 2022, and the event will run through October 22, 2022, when the twenty-fourth Biennial of Australian and New Zealand will also be held.\n\n\nThe Museum of Chicago’s collection has been restructured to better reflect its latest needs and its historical focus. The museum now plans to organize thirty shows next year, up from twenty-two in 2021, and to present more contemporary work, but with a smaller display space. The move, which will also affect the museum’s collection and collection programs, is part of a $1 billion overhaul of the city’s Museum of Chicago.“The future of the institution is at stake,” said Mark Goldman, director of the museum. �", "The next Biennial should be held in the spring of 2021. The schedule for the subsequent two years will be announced in 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the use of city-owned artworks in the redevelopment of historic buildings in the financial district. The guidelines outline a three-pronged solution that involves the removal of two buildings located within the city’s Battery Park, which has been the site of several high-profile protests against police violence; the construction of a new civic-scale public art project in the area, which has housed several notable cultural institutions, including the Museum of Modern Art and the Museum of Modern Art (MoMA), and the conversion of an existing industrial site into a creative-retail’s enclave known as the Battery Park.The development is part of a broader cultural strategy that aims to reshape the financial district through the rehabilitation and expansion of public spaces and the relocation of cultural institutions. Under the leadership of NYC’s Cultural Institutions Alliance (NCHA), the cultural sector is being encouraged to partner with local, state, and federal government officials in order to spur the dismantling of institutional racism and economic inequality. The plan also aims to create", "The next Biennial should take place in the mid-2020s, when the museum is considering moving to the new building and resuming the exhibition program it operates since 1996. The museum is currently working on a new building and is expecting to open a new exhibition space in the fall.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Sharon Lacey as its next director and CEO. Lacey began her career in the arts as a curator at the Museum of Contemporary Art (MoCA), where she served as chief curator from 2006 to 2015, and has held positions at the Peabody Essex Museum, the New Museum, and the Metropolitan Museum of Art.“Sharon Lacey’s achievements as a curator and as a person, from her early years as a young curatorial assistant in the early 1980s to her current role as senior curator, make her an ideal leader for the Museum of Contemporary Art, Los Angeles,” said Peter W. Lee, chair of the museum’s board of trustees. “She is dedicated to bringing the museum’s collection and exhibitions to life and to fostering the Museum’s relationship with its community. We’re confident she will continue to shape the", "The next Biennial should aim to engage with the city’s history, and to foster a sense of community through the exhibition and exhibition of works by local and international artists. It should also consider creating a platform for local artists to present their work; an artistic and conceptual history of the city as a whole; and the process of preservation and restoration. “Our Vision for the City is to create a place where the best works of art of our time are presented by the city’s artists, and we are working toward that goal with the Museum of Art. The biennial will include a range of contemporary art from across the city’s history, as well as a selection of work by/from the Los Angeles County Museum of Art (LACMA), which opened in 1977 and closed in 1993. The museum will also present work by artists who have had exhibitions in LACMA in the past, such as David Salle, John Smith, and Wolfgang Trapp.“I want to thank the LACMA board and staff for their visionary leadership in bringing this project to fruition. LACMA is now the most visited museum in the city, and it is experiencing a period of unprecedented growth. We are confident that this exhibition will become", "The next Biennial should include three groups of artists from different locations in the world: contemporary artists from the US and Europe, the US, and the UK, and a global vision of artist-exploration. The theme should be “The Future Is Now: Attitudes Towards the Future.”The pavilion will also include a new panel discussion on the power of art in transforming public policies and a new program of archiving and community programming, and will be inaugurated by a special exhibition of work by the late Palestinian artist Walid Raad, entitled al-Mana, at the American Museum of Natural History in New York.The exhibition will also feature new works by the late Pakistani artist Umar Khalidi and the late Brazilian artist Renan Tabet.“Themes of art and people are central to our lives,” said cochair of the biennial and artist laureate Stephen Friedman. “By incorporating these themes within our own histories, the exhibition will celebrate our shared history of resistance against colonial violence and the resilience of artists to challenge the colonial gaze. The exhibition is a chance to bring together artists and activists from Africa, Central and South America, and the Middle East to amplify their voices. We are grateful to the biennial", "The next Biennial should take place in 2021 and the twenty-seventh in 2023. The exhibition will be hosted by the Paris-based company Artforum (the Paris Salon für Artforum), along with the Museum of Modern Art and the Jewish Museum in Jerusalem; the National Museum of Fine Arts in Athens and the Museo de Arte Contemporáneo in Madrid; and the Musée d’Art Contemporáneo in Lyon. “The project of the biennial is not to establish a new institution, but to discover how the interrelationships between art and life can be reconstructed in a contemporary way,” said artist Thierry Caiéré, who will also present the exhibition. The exhibition will highlight the efforts made by the artists for their conceptualization of the concepts of the Modern and Contemporary and will be organized in the context of the ongoing biennial, which is comprised of six main exhibitions: “The Modern Experience” (2019); “The Contemporary” (2020); “The Modern Past” (2021); “The Contemporary” and “Present Moment” (2023) and “History in Art” (2019", "The next Biennial should take place in 2021, and the date for the first edition was set for February 28, 2021. The pavilion will be inaugurated by a dedication ceremony attended by the president and the president of the Republic, Xi Jinping. The exhibition will feature approximately eighty works, including Zhongguo, Borodino, and Bourke.The new theme for the biennial, the 'Sixteen Contemporary Art Parisians', is 'Life, Death, and Death Crises.” The exhibition will discuss issues of life and death in the painting and sculpture of paintings and sculptures, and the installation of sculpture in a contemporary context. Biennials are a new term devised by Artforum in 2006 to describe the twenty-fourth International Biennials, held in Berlin, in 2007. The biennial will be curated by Zhang Yiqian, the director of the Contemporary Asian Art Museum Beijing; Liu Yaping, the director of the Clydesdale Museum of Art in London; and Guo-Han Huang, the head of the Shanghai Group.\n\n\nFrench daily Le Monde has published an article on Wednesday that outlined why the French government is refusing to recognize the newly", "The next Biennial should focus on the legacy of Eleanor Roosevelt, particularly her legacy as a leading American feminist poet, and should include a selection of new works by women artists. The announcement of the new fiscal year comes on the heels of the biennial’s anniversary, March 7–March 8, 2020. The 2019 edition, titled Promises, featured Diane Arbus, Jasper Johns, and Holly Willoughby. The 2019 edition also featured the work of artist-in-residence Nilda Palmié, a collaboration between the artists who will work together in 2020. The 2020 edition will be curated by Emma White (formerly Daniel Couture) and will be the first by Ruth Hudson-Jackson. The 2019 event was organized by the City of Miami Beach and the Biennial Foundation, a nonprofit, whose mission is to foster the work of women artists by providing grants, organizing exhibitions, and promoting the collection of works by American and international artists in Miami Beach.The 2019 edition of Promises, which was curated by Emmy Rossum, featured George Hrab, Sally Mann, and Natalie Abraham. The 2019 event also featured the work of Rasha B. Far", "The next Biennial should focus on how the central role of the art world in shaping our contemporary world has profoundly impacted on the way we perceive our own mortality, and how artworks can serve as a powerful counterweight to the disease and death industries.”\n\n\nArt Matters, the San Francisco–based nonprofit that supports art conservation, has announced that it will suspend fundraising in the Bay Area in order to support efforts to save the Bay Bridge. The organization’s board chair, Kiki Smith, said the organization is now considering whether to end its annual global conservation auction and whether it should remain open.Smith said that while the auction does not have a financial impact on the Bay Bridge, it will continue to be suspended so that the funds can be made available for conservation work in the region. If the auction is canceled, then conservation work in the Bay Area will continue, but only with the restrictions set by the state.“We are considering what this means for the future of the auction and its value to our global community,” Smith said. “We hope that in the coming weeks and months, the auction will resume and will continue to be a valuable resource to San Francisco and the Bay Area.”\n\n\nEarlier this month, the", "The next Biennial should be on the Vatican City’s Grand Canal, Italy; the Venetian town of San Marino; and Bridgetown, England. The third, which will take place in 2020, will be in Helsinki. The next edition of the Tokyo Triennale will take place between March 28 and March 31. The next edition of the Venice Biennale will be in Venice, Italy, and will take place between March 28 and March 31. The venue will also be relocated; the 2019 edition was held in the city, and this year’s edition in Rome was staged on the fourth floor of the Italian Embassy, in collaboration with the Italian city government, and was also filmed in the capital city.\n\n\nThe Great British Bake Off, which has faced a major funding crisis since its launch in the UK in the summer of 2018, has launched a new online competition aimed at helping the industry recover from the coronavirus pandemic.The show, which was already suspended from March 25 to March 28 due to Covid-19, was relaunched on March 29 with a completely revamped format. There are now three basic categories: cooking, baking, and filmmaking. Each category will focus on a different theme, such as", "The next Biennial should be held in the city next year, and this year’s will take place in March. However, earlier this year, the organizers of the exhibition canceled the event, citing the ongoing health crisis. In a letter addressed to the public, the organizers wrote: “We deeply regret the cancellation of our first Biennial, performed by our audience, the Venice Architecture Biennale, which took place in March 2019. We hope that this year’s installment will be a good example to inspire others to participate in the March and April events.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is recommending that the city of Los Angeles adopt a minimum of four hundred acres as the site of its next major renovation. The institution will present the project, “Rebuildable Urbanity,” at the same time that the city reopens the recently closed Griffith Observatory.“We have always believed that the city of Los Angeles could be transformed into a world-class cultural destination with the help of a strong and dedicated creative and philanthropic community,” said Mark Ridley, director of the museum and president of the Metropolitan Museum of Art. “We are confident that this bold new initiative will bring its", "The next Biennial should be staged in December 2022. The biannual, which was established in 2007 and is organized by the Republica Museo de Arte Contemporáneo, has been tasked with rethinking the history of the Italian city of Venice. The exhibition\u0097which will focus on the city’s rich cultural heritage, including its many art galleries\u0097was selected by a committee chaired by Guenther Raben and consisting of Jodi Ann Meehan, Art Historica di Roma, Andrea Pinter, and Giancarlo Sesto. The institution will also include a retrospective of the work of Francesco Rosati, a director at the Asti museum in Rome; a presentation of work by the Italian artist Arturo Tosatti; and a presentation of works by the artist and activist Silvio Bock.Founded in 1975 in Rome, the biennial was launched by Giulia Battista, a former director of the Palazzo Crocetti in Milan, and took place in the city every four years. The first exhibition was held in 1976, the second in 1978, and the last in 1983. The biennial’s previous iteration, in 2003 and 2013, included the works of forty", "The next Biennial should be held in 2020.\n\n\nIn the first European capital-organized art auction held by the Vienna-based auction house Haus der Kunst, a group of artists sold works by twenty-two artists under the banner of the exhibition Kunstverein Berlin. The show, titled Prometheus (Prometheus Katy and Mari), will run from May 26 to May 29, 2020 in the city’s Kreuzberg district. Kunstverein Berlin founders Alexander Frangi and Wojciech Kaczynski announced the exhibition’s inaugural winners on Instagram last week, and the first works to be auctioned included paintings by Russian artists Masha Gessen, Anna Landers, and Karel Pfeiffer. Signed by the founders, the artists were honored for their works at a ceremony held in the Kreuzberg exhibition space on March 31.\n\n\nThe Seven Seas Contemporary Art Museum (SACM) in Venice is planning to open a new exhibition, “The Magician and the Thief—” in 2022. The show will present the work of artists such as Donatella Amat, David Hockney, and William Kentridge, and will be", "The next Biennial should be in 2020. “The next edition will be a celebration of the life and work of Pablo Picasso, ” said Richard Armstrong, director and CEO of the Biennale de Lyon, France. “The exhibition will explore the work of a diverse group of artists and will include works by individuals and their immediate and extended families. The exhibition will also include a number of new works that will reflect on the theme of the exhibition: ‘Life and Death’ and ‘Love and Death.”Laurent Mesnage, president of the Biennale of New York and a member of the committee that selected the next editions of the Biennale de Lyon and the Biennale de Tournai, said: “The artist of the next edition is a central figure in the history of contemporary art for many generations of collectors. The biennial will embrace this artist in new ways, exploring his relationship with artists who came before him and his influence on the development of the art world in general. We look forward to working with Laurent to create an exhibition that reflects his artistic legacy.”\n\n\nThe Metropolitan Museum of Art in New York has added four new works to its collection with", "The next Biennial should be organized with the view to exhibiting the works in the exhibition. This is a great opportunity to influence the exhibition in an artistic way. It is also a necessary step towards launching the exhibition. It is my conviction that the exhibition should be determined by the work on display. The intention is to obtain from the artists in the exhibition a sense of their own identity, for whom the Biennial is a significant step. To do this, we must first of all present them from within their own institutions, in a way that they can express their own particular individual views and their own historic projects in the exhibition, and then we must invite them to make contributions to the future exhibitions.\n\n\nAs the House of Commons votes on a bill that would make it easier for British arts and cultural groups to sue the government, the organization representing Britain’s largest arts institutions said it fears the move will stifle creativity and creativity-generating activities across the UK. The Intellectual Property and Technology (IPT) Bill, which has been called discriminatory and a tool for authoritarian powers, has been called unconstitutional by three quarters of the House of Lords, and will be voted on by the Commons on Thursday, December 4.The legislation, which will also give British companies", "The next Biennial should be held at the largest museum in the capital, the State Museum of Fine Arts, Mumbai.The exhibition, titled \"The Red Hind of Death: Avant-Garde Painters in the Age of Japanese Modernism” will run from March 21 to March 23 and will feature more than 300 works by seventy-three artists, including Mariha Haider, Ahmad Khan, Karen Armstrong, Mariko Panayiotou, and Catherine O’Leary. Commenting on the exhibition, Vito Acconci, director of the State Museum, said: “We are delighted to be able to present The Red Hind of Death: Avant-Garde Painters” at Mumbai’s State Museum. The exhibition will celebrate the biennial’s fifty-fourth edition, which will be held in March 2021, and will also present the first behind-the-scenes look at the exhibition.The biennial was organized by the State Museum’s department of art, science and technology, and curatorial affairs and was announced in a March 9, 2019 press release. The tour of the museum will include a discussion with the creators of", "The next Biennial should take place in the fall. The artists selected for the event will be announced in the spring.\n\n\nThe National Gallery of Scotland has appointed Sara Bruschel-Ford as its new director. The thirty-nine-year-old is the founder of the experimental art museum, which has locations in several countries, including Paris, Amsterdam, and New York. Bruschel-Ford will take the helm from director Leon Black, who retired in March 2019 following a ten-year tenure. Commenting on her appointment, Bruschel-Ford said: “I am incredibly excited about the future of the National Gallery and its artists and am keen to ensure they continue to inspire and challenge me as I move into the role of director. They have a unique aesthetic, historical, and scientific legacy that should be further developed. I look forward to working with the talented team and to working closely with the artists and their teams in Scotland.”During her tenure at the museum, Bruschel-Ford won the Helen Cammock Award for Excellence in Contemporary Art for her work in the exhibition “The Life and Death of God: Art and the Death of God” (2019). She also has her first book", "The next Biennial should be held in 2020, and the first in 2021. For a full list of dates and to reserve a place in the biennial, visit the artist’s website. On the same day that a group of artists staged a protest for the release of Ai Weiwei’s elephant in Beijing, China’s State Administration of Cultural Heritage–Beijing (SABC), held an exhibition commemorating the centenary of the death of Mao Zedong. The exhibition includes a collection of works by fifty-six artists, including Ai Weiwei, Leontie Cunningham, and Kai Nao, and features works by eighty-eight contemporary Chinese artists, including Zhuang Ke, Qiu Xincun, Yu Shihua, and Zhang Yilun. The artist-run museum, the birthplace of nineteen-century Chinese master Li Di, inaugurated its new pavilion in Beijing in April, taking over the former Zorcín Building, which was converted into a museum in 2017, and its new platform in August. During the first full week of the exhibition, the museum showed sixty artworks from the collection in Beijing and at least eighty works from the collection in Guangzhou. The show was organized in collaboration with the", "The next Biennial should be held at the Castle of Versailles in Paris in 2021, with a design by the artist Jules-Anne Delaunay. The theme of the exhibition should be “Spaces of Life.”\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that all new programming related to the life and work of Pablo Picasso will be presented in a biennial retrospective titled “Pablo Picasso: The New Age,” which will be held in the museum’s former home in the SoHo neighborhood of Manhattan from March 19 to March 21, 2021. “The show will also include a discussion with artist and collector Alan Goldfarb, whose art is housed in MoMA’s collection, and will examine the exhibition as a pivotal moment in the artist’s career,” the institution said in a statement. The biennial follows the 2015 retrospective “The New Art of Pablo Picasso” at the Brooklyn Museum and the 2016 exhibition “Pablo Picasso: Live and Breathe,” which took place at the Museum of Modern Art in New York. Both exhibitions were organized by MoMA director Marc Straus and were supported by the", "The next Biennial should take place in Moscow or Saint Petersburg in 2021, followed by the United States and Europe in 2022, with options for the rest of the world to choose from. HODINKI, SingaporeHODINKI, Singapore (1859) won the Venice Biennale in 1966 for its exhibition “The Circle,” which featured “two hundred or more people, mounted or iced, in harmony with nature” and became the venue for the 1963 demonstration “American Art and the Environment” at the Museum of Modern Art in New York. The museum acquired the site in 2000, when it shifted from a five-story exhibition space to a three-story, 53,000-square-foot building. The construction of the new exhibition space was financed by the Singapore-born, American artist Lou Barlow, who moved to Singapore in the '60s and eventually won a MacArthur’s in 1979.Artforum has announced its list of thirty-five artists for the 2019 edition of the Venice Biennale, which will run from March 15 to March 17. The exhibition will offer a “simple and direct approach to art,” with a focus on current issues. The themes of the", "The next Biennial should take place in the spring of 2022. “The exhibition will feature a selection from the collection of the contemporary art institution, which comprises approximately forty works by forty-eight artists and their supporters, and will be organized in a way that will allow the artists an opportunity to present their work on display to the public,” the museum said. The Biennial will be hosted at the Museo de Arte Contemporáneo, which is housed in the Museo de Arte de São Paulo, the Museo de Arte de São Paulo, the Museo de Arte de São Paulo, and the Museo de Arte de São Paulo.The selection will take the form of a biennial exhibition that will be divided into two parts: a platform for presenting work and a platform for dialogue. The platform for dialogue will be located near the stage and will be inaugurated by the artist Miró Caras, whose work is currently on view in the exhibition “HELP,” which is sponsored by the Carlos Slim Foundation. The platform for presenters will be located in the gallery, which will be inaugurated by Kunsthalle B. M. G.\n\nThe Museum of", "The next Biennial should take place at the Museum of Modern Art in New York in 2021. The decision to move the exhibition was made following discussions with the city, the board, and the trustees of the foundation, who were briefed on the status of the business by the curators of the forthcoming exhibition. Artforum has reached out to the MCA for comment.  The press release announcing the news of the upcoming exhibition is as follows: The 2019 Artforum Biennial is now in its twelfth year at the Museum of Modern Art, which is celebrating its fiftieth anniversary this year. The sixty-third edition of the exhibition, titled “Artforum: Firsts” represents the first time the museum has staged a show devoted to the history of the art of the artist’s studio and was organized by director Christopher Wool, curator of the forthcoming exhibition “Long March: The Art of Ruth Adair” (2019), and curator of the collection of Sarah Lawson (2019).“Inaugurating the fifteenth edition of the Biennial is the presentation of a season of photography on the twentieth floor of the Museum of Modern Art in a first-of-its-kind exhibition that celebrates the history of", "The next Biennial should be held in 2021, said director Adam D. Weinberg.“This is an exciting time to be a custodian of an exhibition at the Museum of Modern Art. Our vision is to use the biennial to continue shaping the art collection, the exhibitions, and the programming for the biennial, and to continue to expand the exhibition experience for visitors to the Museum of Modern Art and the surrounding area.”The biennial will take place in between the Museum of Modern Art’s existing buildings, in the former Carousel Plant, and the soon-to-be-built Hartsfield-Jackson International Airport. The exhibition will be hosted by the Museum of Modern Art and the Hartsfield-Jackson Art Museum, and will feature works by artists such as Ed Moses, Lilianna Moscoso, and Tangerine Swallow. The 2017 event was also honored as a MacArthur Fellow.The 2017 exhibition was curated by Jonathan Gold, who also curated the biennial “Abandon All Hope,” which opened in 2015 and ran through 2016. The exhibition was at the Hartsfield-Jackson Art Museum until it closed in March 2019.\n\n\nThe Brooklyn Museum, which closed for two weeks in March", "The next Biennial should be held at the Museum of Modern Art, Washington, DC, in 2021. \n\n\nItaly has signed a $2.5 billion aid package for the country’s prisons, a new five-year plan that will also see the construction of new units for the European Union’s external border control agency Frontex, and is planning to open the first Italian prison in the United States. The new programs were announced by Italian prime minister Dario Franceschini in Rome on November 27.While the prison is currently being constructed in Florence, the construction of the new buildings to house prisoners will begin once Frontex pilot projects are completed. The first, a large-scale construction project in Livorno, will involve the demolition of two existing buildings, the Casa del Fino and the Casa di Rivoli, as well as the renovation of the area. The second, a smaller construction project in the Tuscan city of Palaisepe, will involve the demolition of a church and the construction of a new prison complex.Frontex director-general Dimitri de Castro said: “The construction of the new Italian prison is my priority, and I’m working hard to keep the inmates in Italy safely housed", "The next Biennial should be a great success. I am looking forward to taking to the sea once more. My wife and I are so proud of the work we have done and the artists we have worked with. I hope you agree with our decision to leave this project unfinished.\n\n\nHiroshi Kawamoto, the former director of the Kodak Museum in Rochester, New York, has died at age eighty-one after a twenty-six-year tenure at the institution.A master of the arts and a tireless advocate for the creation of new art, Kawamoto made a name for himself as an advocate for artists, including Doris Gordon, Robert Irwin, and Susan Isgro, as well as for the creative process in general. He was also a champion of the working artist, whose practice he helped develop.In the documentary film Black Hawk Down (2013), a documentary about the war criminal Jeffrey Dahmer, Vincent Fremont, who was convicted of twenty-six murders, states: “Kawamoto was a friend of mine. He was a lover of art and thought enormously about it. It was only natural that he would engage in art.”He was also instrumental in the acquisition of forty works by artists such as John Currin,", "The next Biennial should be held in the year 2023. “We are acutely aware that the twenty-third edition of the Museum’s Biennial, ‘Between the Sun and the Moon, ‘The Wind and the Shade,’ is a landmark event in the Museum’s history. We are actively striving to ensure that the exhibition, along with its exhibition, will continue to feature cutting-edge work by leading contemporary artists.”\n\n\nThe graves of three African American artists whose works were displayed in the Museum’s exhibition “Black American Art: Art and Politics from the Sixteenth to the Twenty-First Century” will be moved from their tombs to a new location in Harlem, where the works will be showcased in the museum’s newest exhibition, “Between the Sun and the Moon,” for the first time in the museum’s history. Titled “African American Art in the Twentieth Century,” the exhibition will highlight work by the three original curators of the show, Tony Ray, Rachel Wilke, and Tia Thomas, as well as essays by their successors—Bey Darlington, Laura Wheeler, and Vivian Tan—as well as", "The next Biennial should have a theme that is centred around the human body and the body’s relationship to the environment, encouraging a re-thinking of the environment and the body in general. It should also include a section on the human body’s role in dangerous situations such as climate change.”The 2019 edition of the exhibition, titled Lunar Manifesto, will open at the National Museum on January 11. The 2022 edition, titled Lunar Legacy, is scheduled to open in 2022.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has awarded a $10,000 prize to an artist for his or her “unseen, unmeasured, and unlistenable” depiction of the Chicago theater shooting in December 2015. The work, titled The Theatre of Tragedy,” is a reconstruction of the events of the day, January 16, 2015, and depicts the attack on the audience and the playwright Kurt Russell as depicted by the artist in the relevant locations.“The Met is excited to present its award to Shalom Halsey,” Shalom Arafat, and Cheryl Fisk, who have collectively won more", "The next Biennial should be held in 2020 and will be presented by the German-born artist Janus-Graf. \n\n\nThe New Museum in New York is planning to move twenty-two of its historic works, including the Bechdel Signing, the Art of the Deal, and the Pina Bauschade, from its current home in the historic Tilden Mansion in Chelsea, New York, to the new Museum of Modern Art (MoMA), which will be built amidst the city’s Hudson Yards development. The move, which will also involve the relocation of the museum’s current collection, has the support of the City Council and the board of trustees. The works will be moved by train from New York to Manhattan, and will arrive in Manhattan by September 23. The works, which were signed during the late 1930s, were salvaged from the mansion in 2014 from the collection of William S. Burroughs.“The building of the museum is an important step in the trajectory of the museum’s history and development. We are now in the process of reopening and rethinking the collection, and the building of MoMA ensures that the work of the museum continues to be vibrantly relevant to", "The next Biennial should be in 2020, and the dates will be announced in the coming months. The exhibition will take up themes such as the African diaspora, the contemporary, the natural, and social justice. “This year’s exhibition welcomes the first African artists to present at the new museum, and the first African artists to present in the United States,” said Namana Makhachev, chair of the biennial’s organizing committee. “The exhibition also brings together biennial artists from a wide range of cultures and regions and the first time we have had a combined exhibition of art and culture from Central and South America.”The 2019 event, “The Painters in my Life,” was curated by Comiso Paz, Andrea Pappas, and Sultana Saar.\n\n\nThe Los Angeles County Museum of Art (LACMA) is planning to abandon its long-standing policy of not offering free admission to nonmembers as a way of combating the coronavirus. In a memo sent to staff last week, LACMA director Jeannette Allen said that the move is in “tact since the onset of Covid-19. . . .", "The next Biennial should be held at the University of Tartu in December 2021, with a new show to be held in March 2022. The second, Diana Al Shishani’s Biennial at the African Museum of Modern Art in Lagos in January 2020, will direct them both from the same location in February 2022.17\n\nThe British Museum in Cairo and the National Gallery in London are planning to collaborate with the Egyptian Museum of Art in order to launch a new book exhibition about the late Egyptian president, Gamal Abdel Nasser. The exhibition, “Imagining Egypt: Gamal Abdel Nasser and the Making of Modernism” will arrive in June 2021 and will be led by Khaled al-Aswany, who was appointed director of the National Gallery of Art in London by Prime Minister Boris Johnson in January 2019. Aswany will serve as the first director of the museum in more than sixty years. “Gamal al Nasser is essential in creating the museum’s current architectural and institutional landscape,” said Aswany. “And so, in a remarkably timely moment, we’re launching a new series of exhibitions and book tours, bringing together important", "The next Biennial should take place in the coming months. The programme will be a joint project between the Visual Arts and Culture Foundation (VAFC), the European Commission and the Art Market House and will run from March 25 to March 29, 2020 in the city of Biem. “We are delighted to announce that the 2019 edition of the Biennial will be the last,” said Bjorn de Haan, director of the Foundation for Contemporary Art. “The Fifth Biennial of the Visual Arts in Copenhagen is still planned for 2020. The themes for the next edition of the Biennial are ‘affairs and transitions.’ ‘Lifting the Veil: Visualities of Transformation ” will run from March 13 to March 20, 2020. The 2020 edition is currently on view until February 23, 2020. Artforum will update this story as more information becomes available.\n\n\nThe National Gallery of Canada has announced that it is planning to close all of its locations across the country, beginning in January 2021, and reopening in March of 2022. Its closure, which is expected to last for around six months, will coincide with a reopening of its two main locations in Ottawa and Winnipeg. The institutions plan to", "The next Biennial should be a celebration of the roots and the future of art as we know it. It should be a global event, a time to reflect upon our place in the world, and a time to recommence our work in solidarity with one another and with the world. I encourage everyone to be inspired by the works of artists and institutions that have recently and will be again in the future.”\n\n\nThe National Geographic Society, which was trying to block the launch of a new documentary film series about polar bears by suing the American-born director of HBO, has lost its latest legal battle. The US District Court for the District of Columbia Northern District has dismissed a complaint brought by the American group PETA, which had asked for the first edition of the documentary to be held in early 2018. The court found that the National Geographic Society had failed to show that it intended to move forward with the “premiere” of the documentary due to pressure from the company. In its ruling, US District Judge William Alsup said: “I’m dismayed that National Geographic has failed in this case, which was truly a principled stand for the preservation of polar bears.” Alsup also dismissed the suit brought by P", "The next Biennial should be in 2020 and will consist of a selection of eighty photographs and forty-two films. The exhibition will run concurrently with the first and will be organized in a slightly modified format.The exhibition will feature approximately one hundred works by seventy-nine artists and collectors and will be organized in twenty-four formats. The first presented exhibition will be “Sharon Cole” (2019). The second will be “Alfred Stieglitz” (2019). The third will be “Diana Al-Hadid: The Exhibition of the Exhibitionists” (2019). The fourth will be “Diana Al-Hadid: The Exhibition of the Exhibitionists” (2019). The fifth will be “Alan Parsons: After the Composition of the World” (2019). The sixth will be “Sylvia Plath: The Larchmont Sculpture Garden” (2019). The seventh will be “Anselm Kiefer: The Color of Time” (2019). The eighth will be “Pablo Picasso: The Color of Shadows” (2019). The ninth will be “Gertrude Stein: The Colors of Darkness”", "The next Biennial should be held in March 2021. The museum will unveil its redesign in May 2020, with the new exhibition Space Odyssey opening on March 23, 2021. \n\n\nFor the first time, the National Museum of Scotland will be able to host a solo exhibition of work by a single artist, in a move that will allow the institution to become a major international cultural destination. The National Galleries of Scotland (NGM) will stage six solo exhibitions of work by artist Daniel H. Evans, in a move that will also introduce a new fifteen-year-old exhibition. In a statement, the National Museum of Scotland said: “We are delighted to undertake the project. The new exhibitions bring the National Museum into the contemporary art conversation in a meaningful way; showing how artists work in collaboration with one another and the museum’s collection of art by the most important, and most prolific, artists from the twentieth century.”\n\n\nThe Chinese artist Wang Xianbo, a pioneer of the folk art genre who experimented with a wide range of materials to create works that are now celebrated for their conceptual complexity, has died at the age of eighty-one. He was born in Beijing in 1932 and moved to the city with", "The next Biennial should be more diverse, more inclusive, and more technologically advanced, creating opportunities for artists and researchers of all disciplines.”The 2020 edition will feature works by over sixty artists and will be staged at the University of Cambridge, the University of Exeter, and the Museum of Arts in London.\n\n\nThe Las Vegas Art Museum (LVM) has received a gift of three new works by the late artist David Kander—including a series of three photographs by the Greek American artist Kyp Malone—from the estate of the late American blues singer Billie Holiday. The museum will also receive a number of works by the artist’s two sons, Richard Kander and John Kander, and will present these works in a retrospective dedicated to the artist at a later date.The gift is one of several Kander works that were acquired for the museum by his daughter, Nancy Kander. The other works are The Room, 2003, which is a series of photographs by Kander, a former Beat artist; Honeymoon, 1986, a new series of photographs by the artist’s son, John; and The Tree in the Sky, 1986, a photograph of a tree in a forest.“As our family", "The next Biennial should take place in 2020 at the Museo de Arte Contemporáneo BIC, in the city of Madrid, and will continue with a retrospective at the Museum of Modern Art, which is located just five minutes from the Biennial. \n\n\nThe Metropolitan Museum of Art (MoMA) in New York has acquired Artist’s Loan Fund, an organization that helps artists in need. The institution has allocated $8 million to the organization since it was founded by artist-in-residence Daniel H. Weiss in 1994. “This is a moment of great change for the museum, and it is our mission to support artists at risk of losing their livelihoods to foreclosure, homelessness, and the dangers that stem from opioid addiction,” said Weiss. “MoMA is fortunate to have a long history of collaboration and collaboration with courageous artists. We are deeply grateful that the museum is willing to take this step in honoring their legacy.”Since its inception, Artist’s Loan Fund has provided direct financial assistance to twenty-seven artists. Among the artists whose works were chosen for the loan fund are Raymond Boghossian, David Childs, Vinnie Clark, Jhumpa Lah", "The next Biennial should take place in 2020. \n\n\nMuseum of Modern Art (MoMA) in New York has announced that it is launching a $1 million fund that will establish an endowment for the institution. The initiative, which was inspired by the need for funds to ensure the museum’s long-term sustainability, was inspired by a letter from the organization’s board of directors, which declared that MoMA was “at risk of being rendered obsolete by the pandemic.”The fund will provide $1 million to MoMA, which is grappling with the consequences of its relocation to the lower East Side, and will provide $500,000 for the institution to begin the process of selling off its major artworks, including the Bruce Neustadter Collection and the Ninety-Ninth Street Collection. The institution is also working on the design and construction of a new museum building that will host the private exhibition space, the Brooklyn Museum, and the collection of the late American photographer and theorist Robert Frank. The William C. and Mary (W.C.M.) Museum of Art in Virginia is working on a new kind of public space that will connect the university’s campus with its adjoining campus, the", "The next Biennial should go ahead as planned, but will be postponed until at least September. “We have been working for several months to develop a biennial for artists and will continue to do so in an open and transparent way,” Artforum said. “This year’s exhibition, ’s opening at the Grand Palais, and the celebration of the fifteenth anniversary of the festival are an exciting time for the festival, for the artistic community and the city of Paris, and for Belgium.”The biennial will also introduce new offers of free admission for museum-goers under the age of thirty; a new monthly pass for museumgoers under forty-five; and additional financial support to the art-world sector. With the exhibition “Theater of Operations: The Gulf Wars” still on view, the biennial will also be open to the public during the fall. \n\n\nCREATE, the Los Angeles–based nonprofit that supports contemporary artists and their projects through grants, fellowships, and professional development, has announced that it plans to suspend its annual $250,000 award program “because of the worsening crisis in Puerto Rico and the United States,” CREATE president and", "The next Biennial should be organized alongside the seventh edition, which will take place in October 2021. One of the main goals of the 2021 Biennial will be to give a new voice to the work of the maker community, and to promote the work of indigenous artists and artists whose work is currently underrepresented in the United States, Europe, and the United Kingdom. Herman H. Holleman, the director of the Museum of Science, Technology, and Society, Philadelphia, said: “The 2019 exhibition featured the work of thirty-seven artists, including Naho, Matisse, and Picasso, and of course featured the work of artists of color. The exhibit was also a watershed in gaining a larger audience's awareness of the history and authenticity of the work of the nineteenth-century. We are proud to present such a distinguished selection of work in the 2019 edition.”\n\n\nThe Württemberg-based arts organization Artbournamennig (AB), which has been involved with the preservation of medieval and early modern art ever since it was founded by Gerhard Ebsen in 1978, has been gifted a new 125-year lease of life by Günther Neuer, the visionary founder of the modern German", "The next Biennial should be held in the fall of 2020. According to Artforum, the next edition will be held at the Museo de Arte Contemporáneo in Madrid. The thirty-fifth edition of the Art Basel show will take place at the Forum in Zurich in February 2021. The twenty-second edition of the ICA Berlin will be held at the Berlin Artplaza in June 2021. The final edition of the Byelorussia Biennale will be staged at the Kunsthalle Basel in September 2022. Artists from twenty-nine countries will gather in Berlin for a twenty-seven-episode event that will feature more than three thousand works by twenty-two international artists.  The series, titled Art in a Day, aims to bring together images and sounds and ersatz worlds in a way that engages with contemporary issues of a day and a time.  For the exhibition, the Los Angeles–based artist George Lucas will create the image of a mountain range in the distance. Lucas was inspired to create the piece after he and his brother were driving through a mountain valley in California, and while the brothers listened to the nearby radio, they saw a CNN news report", "The next Biennial should be on September 22-23. The programme will be curated by Kees van der Rohe, director of the Kunsthalle Basel, and will take place at the Museum of Contemporary Art (MCA), New York. The biennial will encompass a series of exhibitions organized in conjunction with the biennial, the continuing exhibition of work by artists whose works were previously shown, and a Nordic festival.The biennial will also include the exhibition “The Future Is Other People” (2019), which was inspired by the artist Barbara Kruger, whose art has been featured in the Biennial of the Ghetto (2017); “The Ordeal of Holger Hueschiker” (2019), a combination show of personal and public works; and “Heller and Meyer Art in Berlin from the 1990s” (2019), a retrospective of the artist’s work from the 1950s.Among the works curated for the biennial are the “We Are All In The Same Boat,” a public sculpture by Hennie Ghent and Øyvind Kranemann, and the “Allorizon,” a painting by the Dutch-born artist Paul Gauguin", "The next Biennial should begin in June and be open to the public. The next Art Biennial will be held at the Haus der Kunst in Berlin in May. The third Biennial will be held at the Max Beckmann Gallery in Munich in September. All three Art Biennials will feature work by award-winning artists, and the first will feature a selection of fifty works by the finalists.A selection of the artists who were selected for the prize exhibition will also be presented at the inaugural Art Biennial, in 2019, which was hosted at the Max Beckmann Gallery in Munich.The exhibition—which was created by a committee comprising Nancy Fiskbauer, Daneil Alighier, Yoshihisa Kimura, and Hiroaki Inada—will be located in the new venue of the Haus der Kunst in Berlin, which opened on the same day as the first exhibition.The new venue will be developed by the Aarhus University of Technology (AuTu) in Denmark, and will be housed in a new building designed by the architects Kjetil Hjort and Olafur Eliassen, each of whom worked on the previous Biennial. The building will also", "The next Biennial should be held in 2022.\n\nThe Ministry of Culture has released a new set of guidelines that outline how the public can help prevent the spread of Covid-19. “In case of an emergency involving the spread of the virus, the Ministry of Culture will provide health care, shelter, and medical support to those who need it,” reads a statement on the ministry’s website. The guidelines are being developed in response to the coronavirus pandemic and have been published in conjunction with the restrictions on travel, trade, and travel between countries and regions.The guidelines outline a number of ways in which people can help prevent the spread of Covid-19, including:• Keeping a safe distance between yourself and others. If you are in a group of individuals with a common interest, avoid social gatherings where people will be exposed to the virus.• Making emergency contact only with a friend or relative who has the flu or who has recently traveled to or from the United States. If you or a loved one has recently traveled to or from the US and you need to contact them, keep their details as short as possible. If you must contact them, ask them to relay your location and advise you how to contact them", "The next Biennial should be staged in December 2022. The first British pavilion at the 2030 event will be hosted by the institution in March 2020. Biennial director Sarah Roesler said: “I look forward to working with the London-based curatorial team and the talented artists whose talented work we are so proud to present at this exciting and challenging time.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Kate Beckins, the chief curator of modern and contemporary art at the institution, as its next director. She succeeds Anne Lee, who retired in March 2019 after seventeen years at the helm of the museum. Beckins had been on the board of directors of MoMA since 2013. “I’m thrilled to welcome Kate to MoMA,” said director Matthew Teitelbaum. “Her remarkable career has taken her from the curatorial team to the museum, from the gallery to the museum, and to New York. Her commitment and talent for bringing contemporary art to life has been unequaled. We are honored to work with her and look forward to supporting her in this new role.”She succeeds Susie B. Kaplan, who retired in 2018 after twenty-", "The next Biennial should take place in 2021. A result of the loss of an already-unscheduled exhibition, the 2020 edition will be canceled “due to the current global health crisis,” a statement from the biennial said. In a letter to the public, the organizers wrote: “We are aware that a decision regarding exhibiting the exhibition has been postponed. The next exhibition will be held in 2021.” \n\n\nThe Whitney Museum of American Art in New York has announced that the seventy-fourth edition of the Whitney Biennial, “The Human Experience: From the Visual to the Audio,” will take place in November. The exhibition will be hosted by Warren Kanders. The biennial is organized as part of the Whitney’s urban renewal project, “The Human Experience.” The fifty-ninth edition of the biennial is currently on view through February 23.The biennial is a collaboration between Kanders and his partner, the Swiss artist Marcel Schäfer, and will present twenty-five artists, including Pierre-Auguste Renoir, Paul Gauguin, Louise Bourgeois, and Robert Irwin. The exhibition will take up questions of life and death, honor and sadness", "The next Biennial should follow in 2021. The Los Angeles-based artist, who is based in New York City, brought his work to a halt to be included in the show. He said that he was disappointed that the show’s directors, Marc Glimcher and Noah Horowitz, didn’t intervene before the performance was canceled. “What happened was I was doing a show in New York in 2016, and they cut the show from the show,” he told the Art Newspaper. “The point of the show is to create this kind of crisis in the public’s consciousness. I felt that they were trying to increase the tension in the show. It was like they’ve been waiting for the right moment to do this.”During a Q&A with the public at the museum on Monday night, Horowitz said that the show was never meant to be a “compassion show.” He also said that he changed the theme of the exhibition in order to make the show “more urgent,” a move Glimcher and Horowitz vehemently denied. “We never said we wanted to make a show about love, we said we wanted to make a show about art,", "The next Biennial should, in theory, take place in 2020. The first, in October 2019, featured work by fifty-four artists\u0097including Sara Benitez, Evelyn G. Halsey, and Elena Mariko. The second, in December 2019, was an all-women’s panel\u0097which was chaired by Laura Mulvey. The biennial has since held twenty-four editions.\n\n\nThe Centre Pompidou in Paris announced today that the museum will reopen to the public on Wednesday, February 21, 2020, at 5 PM. The reopening coincides with the opening of the Centre Pompidou, a new art museum in the city of Charleroi, in Père Lachaise. The Centre Pompidou is the first experimental arts center in France to open. The museum will be divided into three parts. The first half will showcase the works of twenty-five artists, including Nada Al-Taher, Régine Garrigue, Julia St-Pierre, Antoine Fuqua, and Douglas Ahern. The second part of the museum will present works by thirty-six contemporary artists, including Olli-Malaysian, Marie Cocte", "The next Biennial should be held in the spring of 2021.  The redevelopment of the Guggenheim on Manhattan’s West Side, which was announced in May 2018, has also been delayed.  The building of the Museum of Modern Art in New York City has been the subject of a $125 million expansion project that was supposed to be completed by 2020, but was pushed back two more years due to the Covid-19 pandemic. The renovation of the Metropolitan Museum of Art in New York City is scheduled to start in March 2022 and will be completed by October 2022.  In an attempt to mitigate the financial toll of the Covid-19 pandemic, the Metropolitan Museum of Art has committed to reducing the hours of its ten staff members by 30 percent and has also scaled back the number of exhibitions it plans to stage, focusing instead on producing in-house programming.The Metropolitan Museum of Art did not respond to requests for comment regarding the possibility of a 2019 opening date, but a museum spokesperson told Curbed that the institution will continue to experiment with new and innovative programming in an attempt to find its ideal balance between art and science and has no plans to change its increasingly popular programing or exhibition schedule. \n\n\nCultural", "The next Biennial should focus on the structural and temporal connections between the various stages of the exhibition, and its process of institutionalization.” The 2020 event will take place at the KOKO Building in Tokyo.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Elizabeth Anne Carter as its new deputy director. Carter comes to the institution from the Museum of the Moving Image in Los Angeles, where she has been the deputy director of the Los Angeles County Museum of Art (LACMA) for the past three years.“Elizabeth brings a wealth of experience and insight to our staff, our exhibitions, and our mission,” said Beth Nolan, the museum’s director and CEO. “Her new role will allow her to continue to advance the work of our highly recognized artists, and to build on the museum’s enduring legacy.”  While at LACMA, Carter was instrumental in advancing the careers of artists such as Robert Irwin, Michael o’Connell, and Cécile B. Evans, and was instrumental in the acquisition of works by artists such as Pierre-Auguste Renoir, Henri Rousseau, and Paul Gauguin.Commenting on her new", "The next Biennial should be staged in 2021, with the exhibition marking the tenth anniversary of its founding.\n\n\nFUNimation announced today that it will no longer receive any funding from the Kochi-based media and entertainment giant DMK. According to The Guardian, the move has resulted from the company’s decision to withdraw its sponsorship deal with the DMK, which has been held since 2012. FUNimation has been working with DMK for several years to improve the quality of its programming, including in producing original Asian animation, and to organize programming in collaboration with the DMK in Tokyo and Hong Kong. The partnership has been fraught with controversy. After the show Monster, 2013, was canceled after the organizers were contacted by a DMK employee who claimed that the venue was discriminating against attendees based on their gender. The protest resulted in an uproar from the attendees who accused the organizers of trying to push out marginalized artists. Previously, FUNimation had sponsored a number of shows with DMK. Among these were Final Fantasy XV, The Devil Is a Part-Timer, The World God Only Knows, and The World God Only Rises. The company apologized to the association for the cancellations and pledged to work with them", "The next Biennial should start in June and will feature performances and installations by ninety-one artists and collectives. The biennial’s inaugural exhibition “Suspension: the black obelisk” will open at the Manon de Beauvoir Museum in Paris on June 8 and run until June 12. The new French pavilion will be inaugurated with “Les Pyramids du Cinéma” (The Pyramids on the Clouds) by the late French artist Etienne Huf du Cinéma, which will be on view for twenty-four hours a day. The institution is also renegotiating its existing contract with the Egyptian artist Naguib Mahfouz, who has worked at the museum for forty-five years, and is seeking new funding from the government.  The institution will also be reconfigured to include a larger and more diverse collection of artworks. The building is currently home to the museum’s main exhibition hall, which is currently closed until May 31, and the library, “Neue Staatssache Kinder Kunstststātische Berlin.”The renovation, which was started in 2018 but only recently completed, involved constructing the museum�", "The next Biennial should be held in the year 2021, according to the art historian and scholar Tobias Wolff. “The question then becomes: how can we be in a position to observe a biennial in 2021, if we do not want to?” In an interview with the Art Newspaper, Wolff explained that the initial plan to hold a biennial in 2021 would have been to hold a design exhibition in the year 2021. He said: “I only had a year or two left on my contract. I was offered a salary of around $140,000, but I declined. I wanted to stay at the University of the Arts.”The Arts Council has since said that it had no comment on the matter and that the 2019 event will be replayed.\n\n\nThe Metropolitan Museum of Art in New York has released the schedule for the seventh edition of the Met Galerie, which was originally scheduled for March 19–March 21. Set to take place at the Met between March 17 and March 20, 2019, the event will be held in a renovated and expanded Met Center, which is currently undergoing a $175 million expansion that will bring it online for the first time in March 2020.The fifth edition of the Galerie", "The next Biennial should now take place at GIAA, the Biennial of Arts, and the Biennial of Design. We will continue to update this page as more information becomes available.\n\n\nArtforum has learned that Kohn Gallery, the New York–based contemporary art museum founded by architect and philanthropist Richard Kahn, is the target of a legal complaint filed by Sotheby’s over a sale of a work by the artist Bradley Cooper. The complaint, which was filed by attorney Steven T. Jones, accuses Kohn of fraudulently inducing a twenty-five-foot-long work by Cooper, who was discovered dead in his apartment on February 9, 2019, at his home in the Greenwich Village neighborhood of New York, of more than six hundred dollars at an auction in March.“We have been cooperating with the authorities and have obtained a copy of the Sotheby’s official statement of facts in support of the investigation,” Kohn gallery said in a statement. “We are cooperating with the ongoing investigation by the New York attorney general’s office, and have already made arrangements for the works to be returned. We are confident that, under these circumstances, Kohn Gallery will be vindicated.", "The next Biennial should be in 2019. The next exhibition should be in 2021. And so it shall go on, until the last vestige of the '60s and the last act of its ilk - the last exhibition of its ilk.Art historian Don McManus, who founded the Los Angeles–based noncollecting museum Art in America\u0097which was soon to become the site of the American Film Institute\u0097has died at age seventy-eight at his home in New York.Born in 1961 in Los Angeles, the son of a wealthy real estate developer, McManus was drawn to the arts by his father, who was a successful artist himself. Upon graduating from the University of California, Berkeley, McManus moved to Los Angeles, where his parents owned a successful art gallery. After graduating from the Art Institute of Chicago in 1970, McManus moved to Arizona, where his father owned a successful woodworking business and where his mother worked as a homemaker. In 1988, McManus and his brother moved to Los Angeles and began the McManus Brothers Center there, a nonprofit arts and cultural organization that supports artist residency programs in Los Angeles and provides grants and other funding to support residency programs in other areas of the", "The next Biennial should be held in 2022.\n\n\nThe Art Newspaper reports that the Seattle Art Museum (SAM) is planning to merge with the Seattle Art Museum (SAM) and shutter its historic Edens Hall in 2021. This will mark the end of a two-decade run for the institution, which has faced numerous changes since its founding in 1972. The announcement of the merger was made on Wednesday, January 17. The news comes on the heels of Artnet reporting that the Seattle Art Museum (SAM) will move to a new facility in the city’s Capitol Hill neighborhood in 2021, and that the Seattle Performing Arts Center (SPAC) will begin preparations for its reopening in 2022.The announcement sparked outrage from some local arts groups; many of whom want the Seattle-based institution to stay closed until at least the spring of 2022. The Seattle Arts Alliance (SA), which is led by the Greater Seattle Chamber of Commerce, called the merger an “unacceptable departure from the mission of the Seattle Art Museum.” The February 28 announcement by director Max Schoonmaker that the institution would be shuttered on March 16 was considered a “no” by the board of directors of the Greater Seattle Cultural Alliance", "The next Biennial should be held in the spring of 2022. This is not an invitation to reprise the performance, but a call for a new project, a new version of the show. The question is not whether an exhibition should be staged, but how it should be staged. The exhibition should strive to make a new contribution to contemporary art and cultural life. It should include a new, original project, an exhibition which reflects the spirit of the project and which is not tied to another institution. And it should be organized as an experience for the audience.”A show at the Biennale will be staged in the Sambrek–Vila de Arezzo, in the Uruguayan capital, in May 2022. It will also be hosted by the Museu de Arte del Centro in Madrid, and the Museu de Arte de São Paulo, the Museu de Arte de São Paulo, and the Museu de Arte de São Paulo, the Museu de Arte de São Paulo, and the Museu de Arte de São Paulo.\n\n\nTwo weeks after a man fatally shot fourteen people at a Planned Parenthood in Colorado Springs, Colorado, state legislators introduced a bill that would revoke", "The next Biennial should be organized in December, 2019. The exhibition is slated to run for three years and will introduce 200 new works by eighty artists from twenty-four countries.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is collaborating with the Museum of the City of New York (MOCAD), which is currently undergoing a $1.5 billion expansion, in an effort to increase the number of people visiting the institution. The collaboration aims to bring more people to MOCAD, which is located at 280 East Twenty-Second Street, and will include the installation of new works by thirty-seven artists and the launch of an online platform dedicated to the works of the Whitney Museum of American Art.“This new digital platform will allow visitors to MOCAD to keep in touch with the artists who have inspired them, and will include an archive of more than 200,000 works across twenty-two locations,” said Marc Glimcher, the museum’s director. “The program will include project-based and collaborative programming that will help the museum become a destination for visiting artists and will highlight the work of the Whitney’s curatorial team, collaborators, and staff.”Glim", "The next Biennial should take place in 2020.\n\n\nThe Allen Memorial Art Museum in Atlanta is planning to close after more than twenty years of hosting more than three hundred exhibitions annually. The Midsummer Classic, which is slated to run from March 26 to March 31, 2020, is being moved to the beginning of the month, and the mid-March show The Art and Memory, featuring work by fifty-six artists, is being canceled.Over the years, the museum has hosted more than twenty-five hundred exhibitions, and has developed a reputation for presenting works that are thoughtfully arranged and presented. The museum is also known for promoting artists whose work is nationally or internationally relevant. For the upcoming season, the museum will be experimenting with a new online exhibition format that will stream several hundred works simultaneously.“This is an incredibly challenging time to be closing a museum,” museum director Amy Trotman Allen said in a statement. “We are planning on returning to the Art in Memory series, which has been a core of the institution for more than twenty years, and will continue to honor the memory of the Midsummer Collection with a great display of works from the Midsummer Show, which was a landmark in the Museum’s history", "The next Biennial should begin this month and run until November.\n\n\nThe South Korean government has approved construction of a new exhibition center in Seoul that will focus on the country’s rich and influential modern art, video, and theater. Called the National Museum of Contemporary Art, the exhibition space will be located in the capital’s Lee Paekgut district and will be inaugurated with an exhibition of work by the Seoul Biennial, titled “Theater of Operations” (Theater of Operations, Seoul, 2018).The display, which will feature roughly 120 works by seventy-five artists, will be organized in a twenty-four-hour cycle. When the space’s inaugural season runs out in October 2020, it will be complemented by “Theater of Production,” a seventy-nine-minute video, which will follow a group exhibition of contemporary art from the 2003 Seoul Biennial as well as a special exhibition of modern and contemporary art from the United States. The 2019 Seoul Biennial, “Theater of Production,” opened on October 3, 2019, and concluded with an exhibition of work by artists from Peru and New Zealand.\n\n\nThe Hirshhorn Museum in Washington, DC, has", "The next Biennial should take place from March 5–March 10, 2020.  An open call for proposals will run from March 15–March 16. A jury comprised of Artforum writers Craig Bennett and Jaime Castrotta, plus Artforum editor-in-chief Tom Bowman will choose the winning design from the shortlist.\n\n\nArtist and collector Peter Dreher has been appointed the next chief executive of the British Museum, the London institution that is currently closed because of Covid-19. He will be responsible for running the museum, which is currently undergoing a massive expansion that is expected to recover its £5 million budget this month, and will take up the post on March 13.“Peter has been a tireless advocate of artists’ work and has been instrumental in shaping the policy and strategy of the museum,” director Maria Balshaw said in a statement. “His vision for the museum is to build on the work of John Aldridge and Nara Schlegel’s pioneering pioneering feminist and LGBTQ-oriented exploration of the performance and performance-based work of the late British artist and performance-artist Ursula & Ursula, and his willingness to push the limits of what is", "The next Biennial should be held in 2021. The next Sundance Film Festival should be held in 2022. The next Pérez Art Museum in Mexico City, which has been closed since March 13, will open in 2024. The next Alberto Conti Modern Art Museum in Buenos Aires, which opened in 1981 and has a budget of $30 million, is scheduled to open in 2024. And the next Art Basel and Art Dubai will be held at the same location as the current event.“The future of art is at stake,” said Javier Álvarez-Santiago, director of the Museo de Arte Contemporáneo Buenos Aires. “We have made great strides in transforming the environment for projects that engage the physical landscape, but there is much work to be done.”\n\n\n\n\n\nThe National Endowment for the Arts (NEA) announced today that it is temporarily suspending its production of the biennial Artizan, which was scheduled to run from March 6–March 10, 2020. The agency is concerned about a number of issues related to the coronavirus and its response to the epidemic, which has been likened to a pandemic.“The agency is", "The next Biennial should begin shortly after the archaeological site is reopened, with a view to the reconstruction of the museum, in early 2021. \n\n\nThe Metropolitan Museum of Art in New York has launched a fundraising initiative to help the families of two men who were killed on Sunday, November 13, when a New York City Transit Authority (C/NYC) train slammed into a crowd on a bridge over the Hudson River, injuring more than 100 people and bringing the death toll to three.The Met, which is facing a $50 million deficit, announced the adoption of a new set of safety and performance standards that will require all new construction to be inspected by a third party, but will offer no new safety initiatives beyond patching up the tracks and improving signage. The standards also outline how vehicles and construction equipment must be maintained in an emergency situation. The standards, which were developed by the city of New York and implemented by the New York–based engineering consulting firm, DSW Architects, and were developed in consultation with the families of Paul and Wenjian Liu, a Chinese American couple who were killed when their car plunged into a crowd on the bridge, which spans the East River and connects West New York with Chinatown, on Sunday, November 12", "The next Biennial should be at least a year away. In the meantime, the museum is reopening in March 2019 and will have a new exhibition, “Culture and Art,” in March 2020.The Biennial will be held at the museum’s new site in the heart of downtown St. Paul, which was completed in 2018 and opened to the public in March 2019. The former DuSable Lab, which housed the company’s famous collection of moving-image art, will offer visitors an alternative venue for viewing and learning about the works of the former DuSable staff. The museum also revealed that it plans to add three new galleries to the museum’s collection: one from the collections of the DuSable Foundation in St. Louis, one from the Metropolitan Museum of Art in New York, and one from the private collections of the artists who designed the primary buildings of the museum. The new galleries will be built in the museum’s former campus on the Northwest corner of First and Nicollet Avenues, as well as in a former Tischendorf-designed building on the ground floor of the current museum.The project, which was conceived as a way to preserve the works of DuSable’", "The next Biennial should take place in the year 2021, the exhibition’s director, Simona De Sousa, told the Art Newspaper. If the venue is still in the works when the exhibition opens on October 27, 2019, the first show will likely be a 'show of the years 2020–2021.”In order to protect the theme park, the museum will remove some of the works that were selected for the biennial and will postpone the opening of the exhibition by two months. De Sousa also revealed that the museum is considering moving the show, “toward the end of this year,” but that the decision has not yet been made.Following the announcement, the museum’s board of directors, which comprises seven members, and MoMA, which has more than 2,900 employees, issued a joint statement on the exhibition’s cancellation. “The decision to cancel this exhibition was made in order to avoid the exhibition being rendered inoperable by a serious illness that has made its presentation and reopening impossible,” the board said. “We are confident that the exhibition will be restored, and will continue to be presented in the year 2021. We wish MoMA and", "The next Biennial should begin as scheduled, but reprise the themes of the first part. We will continue to actively solicit voices and ideas, and will continue to push for diverse and inclusive public art to reflect the communities we serve.  The biennial will also host a number of exhibitions, including an exhibition of work by artist Jesse Gutierrez, 'The Wound Shed,” which will open at the Pérez Art Museum in Mexico City next month. The exhibition will feature a selection of works by the international group of Mexican artists known as the Pueblo Naturale (Pueblo de Noces), which includes artists such as Carlos Iglesias, Carlos Otero, and Mario Tama. The Pueblo Naturale will organize a biennial of contemporary art in the United States next year. The series will conclude with an exhibition of work by the Pueblo Naturale’s Mexican members.\n\n\nThe annual Art Basel Hong Kong expo has announced that the first half of its 2020 edition will take place in a warehouse in downtown Hong Kong, with the second half taking place in Hong Kong’s Hong Kong Art Museum. The exhibition will be hosted by director Klaus Biesenbach and", "The next Biennial should be in 2022, and the first will be in 2023. One of the reasons why the museum is so important to the city is that it is the only institution in the country that focuses entirely on the life and work of Pablo Picasso, a painting that is considered a masterpiece of the 20th century. The museum also houses a collection of Sylvia Plumb’s work, which garnered much attention in the early 1950s and is now on display in the William James’s Theater of the Oppressed (W. James and the W.J. Bridge Museum), and an exhibit of work by Albert Camus, a man whom the artist known as the Father of Modern Art (1972–2005) admired and admired.The inaugural event—on September 3—is free to the public, and will feature works by forty artists, including Michael Alwyn, Tanya Barnes, Techi&Stanley, Amy Chesliner, Sara Cwynar, Cindy Sherman, Etana Kennedy, Ethan McInerney, Steven Nelson, A.J. Pape, Jody Rogac, Carolyn Robinson, A."]