["The next Biennial should be held at the Centre Pompidou in Paris, followed by an exhibition at the Palais de Tokyo in Paris, and then the Louvre.\n\n\nThe Academy of Fine Art (AFAM) in Milan has canceled a planned exhibition in the city due to the coronavirus and has instead commissioned the art of the season, a selection of the year 2019. The exhibition, titled “Alfonso Almeida: The Last Days of the West,” will open at the Fondazione Ferrari in Milan on August 27 and will include works by a group of twenty artists, including Manfred Bode, Giorgio Catellani, and Lucio Fontana, as well as the work of various artists from Africa, Asia, and Latin America.The commission was made by Fabien Ferré, of the Fondazione Ferré, and Barbosa Medina, of the Fondazione Cagli in Rome. The project was born from the late Italian artist Alfonso Almeida, who, in addition to living in the city of Milan, has been a patron of the arts for over fifty years. Two of his works—“Patriarch of the Monuments”", "The next Biennial should begin on September 4 and conclude with a performance by the Singapore Art Gallery.\n\n\nThe Museums Association (MA), a United Kingdom–based organization which represents more than 1,200 museums, including the British Museum, the National Museum of Scotland, and the Tate’s London outpost, announced that it plans to scrap its 2020 event—which would have featured work by forty artists and collectors representing twenty-eight countries—after the February 21 Lévy Goriot–Alès Summit, which was organized by the City of London’s Department of Culture and Media. The event was meant to mark the official opening of London’s Embankment, a $150 million arts complex, and was expected to run through March 15.The announcement follows the London Assembly’s March 15 vote to condemn the event, which was also led by Conservative Party mayor Sadiq Kahn. The news follows a wave of protests, strikes, and resignations from British museums in the wake of the April 7 suicide bombing of the Manchester Arena, which killed twenty-seven people and injured more than 200.British Museum director Hartwig Fischer said: “We have been clear that we cannot have a large-scale event like the Lé", "The next Biennial should be staged in 2021, when the exhibition will be staged in a massive renovation of the Roman Forum and the Pantheon in central Rome. The show, titled “Knight in the Sky”\u0097the first exhibition on the new project, which is being financed by an alliance of local, state, and federal governments, will open in March 2021.The restoration project, organized by architect Orazio Caruso, was commissioned by the city of Rome, the Ponti family, the Roma Institute for Art, the Institute of Architecture, the Institute of Fine Arts, and the Centro de Cultura e Contemporáneo Venezia (CCVA), Rome, for its twenty-fifth edition, which opened in September 2015, and will aim to undo the damage caused by the redevelopment of the former Copacabana, the second-largest building in the city.“The restoration project will also include the reopening of the old museum and the expansion of the museum, which will be equipped with modern and contemporary exhibitions, curatorial and educational activities, and a public space in the center of the city,” said Antonella Catellani, the papal ambassador to Italy. The construction", "The next Biennial should be held in the fall of 2022.\n\nThe institution will begin accepting visitors at 8 AM on Monday, March 6. The exhibition will remain open until March 27, 2022. Viewing rooms will remain closed through the end of March. The biennial will then open to the public for an extended run of sixty days. The exhibition will perform a number of special activities including a special exhibition of work by artists such as Hélène Devillers, Île-Marie Dei, Leonor Varejão, and Jodi Lynne. The biennial will run until June 25, 2022. The biennial, titled Future Situations, was created by Alejandro Cesarco, director of Architecture in the City, in partnership with architect and collector Francesco Cipolletta, and professor Günther Hübner from the University of the Tübingen, part of the Künstlerhaus, and the the Potsdamer Straße.The exhibition will present a selection of works from the collection of the artist Lothar von Richthofen, which resides in the collections of the Künstlerhaus,", "The next Biennial should be held in the spring of 2022. The Festival of Nations will draw from that sample and develop a new and original theme, based on the theme of the past five years, titled A Final History. The institution will host a biennial of contemporary art in the summer of 2022. The biennial will also include a new exhibition, titled This Is Not a Biennial, which will present work by thirty-six artists over a period of twenty days. Originally scheduled for 2019, the event was rescheduled for 2020, and the first three days of the event are currently being devoted to the theme. The exhibition will feature works by forty-five artists.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed Jorge Estevez as its next director. He is the twenty-third director of the museum and succeeds Lonnie G. Watkins, who was appointed last month and who guided the institution through its first major restructuring since it opened in 1979. “Jorge is a leader and a visionary leader, a strategist, a communicator, an innovator, a committed collector, and an excellent teacher,” said Lonnie G. Watkins Jr., the board president of", "The next Biennial should consist of an exhibition of the exhibitions of the previous one. I have always been interested in art history exhibitions, and exhibitions of art history. That was the start of the exhibition, and I think it still is the start of the exhibition. The exhibition and the exhibition, which is what matters to me most, are the same. I had the opportunity to make a very important exhibition at the Centre for Asian Art in London. I won the Prix d'Art Moderne in 1976, and I have been a guest at the Centre for Asian Art ever since.  The next one should be a celebration of the Centenary of the publication of Volume II of the Japanese Exhibition Series. I am sure that at the end of this exhibition there will be some who will say that, despite the curatorial and artistic achievements of its present generation, there is still much to learn. I would like to think that there is more than enough. The next Biennial should be a tribute to the many artworks that have made the Centre for Asian Art such a special institution.  I am convinced that when the Centre for Asian Art is re-opened someday, its people and its collections will be united again.  We must", "The next Biennial should take place in the autumn of 2020. The next Colony, which is currently in its thirteenth edition, was held in January of 2021. The next Dublin Biennial, which was opened by Culture Minister Alan White in March of 2021, was canceled. The next Manchester Biennial, which was supposed to be held in September of 2021, was postponed. And the next São Paulo Biennial, which was supposed to take place in October of 2021, was canceled.The list goes on. The list is in continuous motion. The list has no end in sight. No one knows exactly how long it will take the biennial’s participants—the curators, the governments of the participating countries, or the participating institutions—to come to an agreement, and no one knows when they will be able to conclude their exhibition. There will undoubtedly be much pain and frustration, and an enormous amount of uncertainty and shock and sadness. But there will also be agreement.There will never be a better time to be an artist in the world.\n\n\nThe Museum of Fine Arts (MFA) was granted a major expansion today that will add more than 1,000 square feet of exhibition space for the museum’s upcoming", "The next Biennial should be held in 2020.\n\n\nA delegation of artists, including Pierre-Auguste Klimt, Julien Ghebaly, and Jean-Luc Ha, has condemned the French government’s refusal to recognize the territorial integrity of the newly proclaimed autonomous Kurdish region in northern Iraq. In a letter dated November 14, the artists requested that France suspend all hostilities with Iraq until the French president, Emmanuel Macron, signs an international declaration declaring the Kurds’ independence from France.“The Kurdish region is a fundamental part of the history of France. It is in the interests of France, its foreign and domestic policies, and of the rest of the world that the Kurds be recognized as an independent state,” reads the letter, which was published by the Artists’ Association of France. “France does not want an independent Kurdistan, but one that is recognized as such by the rest of the world. An independent Kurdistan would be a threat to international peace and security. France does not want an independent Kurdistan, but one that is recognized as such by the rest of the world. An independent Kurdistan would be a threat to international peace and security. France does not want an independent Kurdistan, but one that is recognized as such", "The next Biennial should focus primarily on the history of art in a modern and progressive way, and should be a worldwide celebration of the creative, intellectual, and material achievements of contemporary artists.\n\nAs the deadline for the 2020 edition of the Venice Architecture Biennale approaches, many institutions in the region are turning to innovative, locally sourced, and non-standardized designs to address environmental concerns. Simone Patriarca, the deputy director of the Museum of Modern Art in Paris, was quoted as saying: “At least in this case [we] choose not to change the future.” In the summer of 2019, the city of Rome created a new bridge over the River Arno to connect the Marina del Triennale with the city of Cagli, Italy, and transformed the former St Peter's Basilica into a museum dedicated to the art of the Italian Riviera. In his plan for the future of the basilica, Alberto Burgin, the city’s mayor, said: “The entire structure is to be reborn. It’s a network of tunnels.” In the city of Milan, Mayor Sergio Mattarella announced plans to convert two former factories into public spaces, including a rooftop garden and", "The next Biennial should begin in 2020. In an interview with Artforum, Alexander L. Pasternak, director of the Ohio Institute of Art, Ohio, said the new biennial, “will be completely different from the biennial of the previous decade. It will be a new kind of venue, with a different mission, and a different collection. Its curator will be a new person, and the show will require a new kind of performance.”The festival, which has been held in Columbus since 1955, will be titled “Spring/Fall/Winter” and will consist of a series of exhibitions, performances, lectures, and other events that will be staged at various locations across the city and region. The 2020 event will take place at the Ohio Museum of Art (OMA), the Ohio Arts Center, and the Ohio State University campus in Columbus.\n\n\n\n\n\nThe National Museum of Fine Arts in Atlanta (NMFA) has appointed Stan Wise as its next director and CEO. Wise comes to the institution from the Cleveland Museum of Art, where he previously served as director of curatorial affairs and chief curator.“As a museum director, Stan has been instrumental in transforming our collection and our mission,” said director and", "The next Biennial should take place in 2020, when Art Biennials will hold its first edition, in partnership with the Italian Foundation Centro de Arts Colectivo (CACCO), in the city of Reggio Emilia. The event will focus on the history of art from all over the world, with a particular focus on the development of new advanced technologies, including artificial intelligence, 3D printing, and bio-mechanisms.The competition panel comprised: biennial director Joanna Tavares, director of the Taylor Estate; Roberto Cicutto, director of the Art Institute of Chicago; and Biennale deputy director Carlo Delfina.\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles has received a $100,000 donation from the Los Angeles–based nonprofit the Alex and Edith MacGill Family Foundation. The gift was made in recognition of the MacGill Family Foundation’s longtime support of the MFA. The MacGill Family Foundation has established a $50,000 prize each year for the best work by artists whose careers are intertwined with the art of cinema. This year’s award was presented by Alex Gartenfeld, director of the Los Angeles County Museum of Art; Edith", "The next Biennial should be held in 2021.  New York: Museum of Modern Art (MoMA) presents the Third Biennial, titled After the Storm. The show opens on September 22 with Melancholia: The new work, which is the first to feature the work of a female artist, will be on view in the exhibition from September 29 to October 7. The festival will also feature the first show of the artist’s work in San Francisco since 1978, and the first exhibition of the artist’s work in New York since 1985. The show will also feature work from a wide range of artists from the United States and around the world, including Joachim Neugroschel, who includes a work by Carl Hiaasen, Mme Maria Olschbaur, Helene Abraham, and Tia Ghose. The full list of participating artists is as follows: Artist Biennials  (tie nst th)Artist Biennials (tie nst th)Artist Biennials (tie nst th)Artist Biennials (tie nst", "The next Biennial should be held in the fall of 2020, in the same location and at the same time as the current exhibition. The exhibition will focus on the study of the artworks of the twentieth century, and will examine the ways in which the exhibition will be adapted to the changing needs of contemporary life. “The contemporary situation demands a new and ambitious narrative, a narrative that considers the relationship between art, culture and the future,” said Sánchez. “The whole story of Biennial One is at stake: how a group of curators, artists, activists, writers and researchers, under the direction of a great curator, managed to present the exhibition of twenty-six works within only twelve months.”Inaugurating the twenty-third Biennial and presenting the art of 1990, the exhibition will include the work of a group of curators and artists whose conceptually and historically significant exhibition was the titular “Centre Report” (1990), a joint project between the Biennial, the Central Library, the Museo de Arte de Madrid, and the National Library of Art. Among the works in the collection are the curiosities’ twentieth-century exhibitions of the Indian artist Sanjee", "The next Biennial should take place in 2020 and the last in 2022. The revival of the Biennial was confirmed by the Brazilian Minister of Culture and Sport, Joao Ucayilla, who stated: “The biennial is going through a period of transformation and I am convinced that the next edition will be a great success.” The new space will be inaugurated by an exhibition of work by the curators of the seventeenth iteration; the newly commissioned work, The Future is Other People, will open November 24 and run until March 17. \n\n\nThe Tate is preparing to host a major exhibition of works by the late British artist Lynne Tillman in 2020. Titled “Lynne Tillman: A Vision of the Future” and co-curated by David Bostock and John Bradley, the exhibition will feature new works as well as works from past exhibitions and will be staged at various locations across London, including Tate Modern, London, Tate Galleries, Tate Modern, the National Portrait Gallery, and Tate Modern.The Tate said that it is “comfortable in saying that this will be a landmark exhibition,” marking the centenary of the artist’s death. It will also", "The next Biennial should have been held in 2025. “We are acutely aware of the impact of the pandemic on the local communities, and are committed to reopening all institutions, especially those that have a high risk of disruption, so that they can re-emerge with fresh ideas,” said Florentino Pérez, director of the Canal-de-Souci Foundation. “We are working on the implementation of the new programmes in order to help our institutions. We are engaged in a number of different ways, including through our grant programmes, our events, our publications, our exhibition programs, and our online learning tools.”Diana Al-Hadid, chair of the trustees of the Foundation for Contemporary Art, had this to say about the work of the upcoming biennial: “We are deeply grateful to the organizers of the sixty-third edition of the Deutsche Bank Taipei Biennale for their incredible work in support of the project. The biennial brings together artists in the best possible way. The artists who were selected for the exhibition are united by a shared interest in the biennial and its themes. The artists who participated in the exhibition are united by a profound respect for the whole of the exhibition and", "The next Biennial should be held in the spring of 2020. \n1939–1948: Art in the Age of Stalin\nThe exhibition “The New Bureaucracy” is currently on display in the Soviet Union’s Museum of Modern Art in Moscow, which was closed in March of 1949. In the years leading up to the event, the Russian artist and consumer movement was in a state of rapid transformation. In March, the year of his birth, Stalin’s sculpture The Night Watchman, 1939, was staged at the Museum of Modern Art, leading to protests from opponents of the regime. Two months later, the painter Aleksandr Solzhenitsyn wrote an open letter to the former leader of the Soviet Union, Joseph Stalin, denouncing the exhibition’s “defacement of Marxism” and the “anti-Leninist activities of the Moscow Art Congress.”A catalogue of the works on display in the exhibition, titled “Stalin’s Art of the Soviet Union” (Stalin and Capital), was published by the party journal Artforum.The exhibition, which focused on the Russian Soviet Union from 1939 to 1947, was organized in accordance with the “", "The next Biennial should have introduced more nuanced and relevant explorations of the world and its people, and should have renewed the promise of the human body’s relation to the landscape and the cosmos.”\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of more than 1,400 works from artist Tunga Seo, a Korean American who immigrated to the United States in 1963. The museum acquired the works from her sister, a native Los Angeles native named Kieo Seo, who was commissioned to paint a masterpiece for the museum in 1977.Born in Seoul in 1937, Tunga Seo began her artistic career as a child prodigy by producing works that were, in a way, out of this world. Her practice revolves around the concept of “porous bodies”\u0097a concept that has been adopted by hundreds of artists in the country over the decades\u0097and the artist’s relationship to the Korean American community.“Tunga Seo was born in a small rural town on the West Coast of California, in 1947, and raised by her mother in a cosmopolitan coastal city in LA\u0097her childhood embraced the cultural and social aspects of the United", "The next Biennial should aim to present a work that embraces a new vision of the present and the future; to enact a new conception of reality; to explore the relationship between art and politics, economics, and art, technology, and technology, and to present a work that will be considered as an ambition of the greatest importance. The fifty artists who are participating in the 2019 Biennial\u0097and who will be chosen by a jury comprising Arts Minister Monir Shah and former director general Jitender Gupta\u0097have been invited to submit works for the exhibition.\n\n\nThe Miriam and Ira D. Wallach Art Gallery in New York has announced that Jennifer Hale has been named its new artistic director. Hale, who has been involved in the museum’s curatorial practice since 2000, has curated twenty-five shows since joining the gallery in 2007. She most recently served as artistic director of the Aaron Siskind–designed exhibition “Dirty Work: Painting, Text, and Memory” (2019). She will assume her responsibilities on January 24, 2020 and will begin her tenure on March 12.“Jennifer has been a transformative force in the gallery’s curatorial practice,” says David Barr, the gallery’s", "The next Biennial should look at the place of art in our society, by artists, and entrepreneurs. It should also focus on the processes by which art changes the world, and on the ways in which art can inform and stimulate our lives and our world.  The 2020 edition of the Biennial will comprise the works of eighty-two artists, led by artists of colour. The program will also include a symposium on art and social movements.  The exhibition will be organized in partnership with the Central Library of the University of Sydney, and the National Gallery of Australia.\n\n\nThe Smithsonian’s National Museum of African Art (NMA) in Washington, DC, has launched a new digital platform, AfricanaUp, that aims to provide an online portal for the exhibition “African Art: From Black Power to Black Liberation”—a four-year production that will run from March 19 through March 22, 2020. The platform will feature the work of seventy-two artists, many of whom are African American, and will also include a “Lincoln’s Body: The Oral History of a Black Man,” a film by artist-activist Nari Ward, and an audio work by artist-activist Brown", "The next Biennial should be held sometime between May and October, 2020. The date for the event has yet to be announced.The project currently faces a legal battle after the city of Poznan filed a lawsuit against the state of the Polish Republic over the display of the work, titled Museum of Polish Art, in the capital, Warsaw. The lawsuit claims the work is a violation of the country’s national state memorial, the 'Museum of Polish Art, Warsaw,' which was vandalized in December 2017. The city also wants the work removed from public view. Matti Jońska, the Deputy Mayor of Warsaw, said: “We mustn’t forget that in a city of such size and potential, the museum of Polish Art, Warsaw, is the heart of the city and is the capital of the Polish Republic.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of twenty-seven works by two-dozen artists from the Los Angeles–based nonprofit the Los Angeles Foundation for the Arts (LAFA), which is affiliated with the Museum of Modern Art. The works, which were donated by five families and are currently on display in “Power of", "The next Biennial should be held in the autumn. The second will be held in 2020.The third will be held in 2022. The fourth will be held in 2023. The fifth will be held in 2027. The sixth will be staged in 2049.The seventh will be staged in 2056. The eighth will be staged in 2067. The ninth will be staged in 2073.  The tenth will be staged in 2083. The eleventh will be staged in 2085. The twelfth, thirteenth, and fourteenth editions will be held in the autumn and winter of 2022 and 2020. The thirteenth will be staged in 2021. The fifteenth will be staged in 2021. The museum has appointed Mary E. James as the new chairman of the board of trustees. James is an independent curator and educator who has been affiliated with Biennale San Remo since 1999 and has taught at the institution for fifteen years. She is currently a lecturer in art history at the University of St Andrews, where she studies the work of Vincent van Gogh, Gabriel Bouilha, and Hans Christian Andersen.Commenting on her appointment, James said:  �", "The next Biennial should be in 2021.  The 2015 contest, which was organized by the deCordova Museum and held in partnership with the Los Angeles County Museum of Art—which was forced to move the exhibition due to Covid-19—wasn’t that successful. The next iteration of the annual event will be held at the Museum of Contemporary Art (MoCA), the Museum of Contemporary Photography (MoP), and the Brooklyn Museum.  The 2019 edition featured works by forty-three artists, including Dominic Baker, Mark di Suvero, Carrie Mae Weems, Andrew Loogiel, and Ramón Pilar, and was organized by photographer Vito Acconci. The 2019 winner of the Nobel Prize in literature, Hildegarde Du Maurier, will receive the award for literature in 2021.\n\n\nArtist-run schools in the Philippines are being accused of widespread human-rights abuses in the ongoing anti-terror crackdown, brought on by President Rodrigo Duterte. Schools that have not been accredited by the government are being blamed for a resurgence in crime. While the schools have denied any wrongdoing, the local government is demanding that they shut their doors and pay a steep penalty, which many fear will be insur", "The next Biennial should take place in November 2021. The 2020 iteration of the event, titled Art and Dignity, was held at the Panorama Gallery in San Francisco in March, and featured work by contemporary artists such as Sharon George, Rirkrit Tiravanija, and Dylan Kleeblatt.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has announced that Alice Black, who was widely known across the United States as the maitre d’âtre (director of exhibitions), has been named the next director of the museum. Black, who has served at the institution for more than thirty years, began her career as a curatorial assistant in 2004. She eventually became director of the show “The Color of Water,” a collaboration between artist and activist Julie Mehretu, and is credited with being the catalyst for the creation of a new residency program comprising six residencies for emerging artists.During her tenure at MoCA, Black helped organize numerous exhibitions, including “Talking Color,” “Before and After Color,” and “Making the Color Pane,” and she spearheaded the construction of the museum’s first performance venue in Greenwich Village, the MoCA Theater", "The next Biennial should take place in Hong Kong sometime between September and December. For the second iteration, it will take place in the United Kingdom between March and November.  If the first edition of BALTIC BIENNIAL:1521 is any indication, the United Kingdom has decided to stand in the way of the decision of the host country to join the EU and has threatened to leave the single market if the UK does not make up its mind by June 30. British Prime Minister Boris Johnson stated that leaving the EU would mean leaving the United Kingdom’s place in the bloc, and he warned that if the UK voted to leave the bloc it would lose access to the single market and the EU’s single market. Johnson also stated that if the UK votes to leave the bloc that it will immediately send troops to the EU to help secure its borders and prevent any refugees from entering the country.Johnson added that the British Government would not accept any orders from Brussels, and that the UK would not negotiate a new trade deal with the bloc until it had voted to leave the EU. “We will make our own deal,” Johnson said. He also claimed that the decision to leave the bloc is not a", "The next Biennial should have a budget of £60,000 and would be held in March 2020. The planning committee decided to postpone the event for two reasons: the exhibition venue was not ready by the May 22 deadline, and a show of the first five exhibitions would have taken place the week of May 23–May 29. “We made the decision not to move forward with the exhibition and our artists’ participation in the exhibition because we felt that this was the most important show of our programme for the coming year,” said David Wall, chair of the commission. Wall added that the decision to hold the show in March was made in order to give the artists three months to prepare for the event.\n\n\nThe National Leisure and Cultural Heritage Museum (NLM) in Washington, DC, is developing a new digital platform that will allow visitors to more easily explore the collections, exhibitions, programs, and educational programming of the institution and the region. The platform, www.NLM.com, will be free for the public to use for one week only in March 2020 and will debut with the opening of a two-hour exhibition on May 3. Launched by the National Gallery of Art (NGA), the show will", "The next Biennial should be in 2021, at which time the exhibition will extend its current season. The next edition of the biennial will take place at the Prado from March 18 to March 20, 2021. In the meantime, the exhibition will continue to show works of contemporary art.  The new year will mark the centenary of the downfall of the Soviet Union.\n\n\nThe Metropolitan Museum of Art in New York has appointed Diana Hofman, the recently retired deputy director of the museum who led the institution from 2011 to 2017, as its next director. Hofman succeeds John Collins, who departed the Met in March of 2018 to head the Museum of Fine Arts, and will take the helm of the museum in September.“Diana is an ideal choice to lead the Met through this difficult period, as we face a new digital reality, and new challenges to our mission,” said Collins. “Her deep experience in leading museums through these uncertain times will be a valuable asset to the institution during this crucial phase of its history.”The Met has faced numerous setbacks during the transition to digital, which began with the addition of the digital platform for the museum’s David Burton exhibit, “The Empty Man.”", "The next Biennial should take place in 2021, and the first exhibition of the new collection will open in the autumn. The museum has already launched a number of grant programs to support artists and institutions. Last year, the museum received $1.2 million for the acquisition of works by artists such as Elyn and Dorothy Edwards, and $800,000 for the preservation of a collection of works by the American Pakistani artist Jayaprakash.\n\n\nThe J. Paul Getty Trust, which has been leading the charge for more than a decade to save a crumbling collection of more than four thousand African American artworks by the late Frederick Law Olmsted, has announced that it will donate them to the Smithsonian Institution in Washington, DC. The works, dating from the end of the nineteenth century to the early 1960s, are part of a larger effort to bring black cultural heritage to the United States, which was founded by Anglo-Saxon immigrants in 1820.“The Trust’s black cultural heritage program has been a central and ongoing mission of the Getty in recent years, and we are thrilled to support its efforts to preserve and present important artworks by artists of color,” said Michael L. Getty, director of the Getty. After the Getty", "The next Biennial should take place in June 2021, according to the organizers. The next iteration of the moderating show, which launched in 2002 and has been staged in Paris, Berlin, and New York, will take place in November 2022.\n\n\nThe American poet, novelist, and playwright James Patterson (1867–1973) was the first American to win the Nobel Prize in Literature. The honor is given annually to a poet or playwright who has made an outstanding contribution to literature.A prolific writer, Patterson was a prolific poet. He wrote seven novels, including his famous The Time Traveler, which won the 1939 Pulitzer Prize; his third-season play The Daring Fireflies, in 1942; and his final novel, The Adventures of Tintin, 1964. In addition to his work, he served as president of the University of California, Berkeley, and as a professor of American literature. The literary prizes were established in 1967 to further the mission of the University of Minnesota’s literary program after Patterson’s death.The academy’s board of trustees said that Patterson was “one of the great living American poets and novelsists.” He was inducted into the Nobel Memorial Prize in Literature in 2007. His", "The next Biennial should be held at the UAE’s AlUla AlUluf Research Center in AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla, AlUla,", "The next Biennial should open in 2021 and will take up the theme “Belonging, Identity, and the Body,” a theme that has been explored in recent years in relation to various subjects such as art, religion, and bodies. The art of the biennial will be based on a collection of over seventy artists, selected through an open call. The biennial will also feature a two-week residency program in a studio owned by the artist. The first residency, which runs from June 8 to June 10, 2020, will cost $6,800, with the option of extending the program to September 13–29, 2020.The residency program will be led by the artist and biennial curator, Sohrab Mohebbi, and will consist of a series of lectures, performances, and workshops. The first talks about the art of “Belonging”, a theme that has been around since the 1980s, and the second examines the art of the body, a theme that has been ongoing since the 1920s. The biennial will also include a lecture series by the artist and a selection of works by her contemporary, Ali Baba, and an award ceremony. The full list of participating artists is as follows:A", "The next Biennial should be held in 2020.\n\n\nThe Vitra Art Museum in New York is preparing to reopen in 2021 following a $100 million expansion. The renovation of the institution, which was completed in 2015, added new galleries, studios, and classrooms, and added an addition to the museum’s central building. The renovation was completed in partnership with the Rockefeller Brothers Fund and the Metropolitan Museum of Art, but the full project is being overseen by Vitra’s executive director, Pilar Constélletto, and her team.“The Vitra team’s goal in coming years is to continue to create new, experimental works inspired by and informed by the museum’s collection and collections, as well as by the structure of New York City,” said museum director Peter W. Dolan. “We’re already seeing that happening in the new museum. We’re certainly not done yet.”The renovation of the museum—named after the Italian word for “angel”—was completed in partnership with architect Adrian Smith, who designed the building that houses the museum. The $11 billion project involved the rehabilitation of the existing structure, which has been a museum since it opened in", "The next Biennial should be set up with an election of the prize winners and should then decide whether or not to award the prizes. The challenge now is to find a way to restart the exhibition. The institution has been trying to find a solution to the exhibition since last November, when the first exhibition, Spirited Away, opened at the museum. The move meant that the Sci-Hub, which was established in 2013, had to move to a new space in the building, and the exhibition moved from its normal location in the basement of the institution to a new location in the new building. The new exhibition, titled “Art and the Water: A Retrospective of Sagemus” (Art and the Museum of Contemporary Art), was organized by Kaya Hamada, Art Basel Hong Kong, and Art in the City, and will open on August 29.\n\n\nNina Turner, a former curator and writer based in New York who frequently collaborated with artists like Frank Stella, Robert Irwin, and Joan Miró, has been appointed director of the Peter Jackson Art Gallery at Columbia University. Turner will take up the post in January 2021. She succeeds Michael Hart, who will resign in March 2020 following a", "The next Biennial should be a special time for the entire city of Barcelona, the region, and the world. The exhibition will display the work of twenty-eight artists, including Halil Altındere (Germany), Nabil Ottawi (Turkey), Nicolas Vuillard (France), Pilar Rocha (Spain), Yelena Shishkina (Russia) and Sara Cwynar (Australia).\n\n\nThe museum has received a $2 million donation from the Laurentian Foundation for the Arts (LFA). The gift includes a $1.25 million gift for the development of the museum’s collection of African, Asian, and Latin American art and the LFA’s acquisition of forty-two works from the collection of the Detroit Institute of Arts, including Dexter Atkins’s The Miseducation of La La Land, Jeremiah Johnson’s Django’s The Serenade of Shiloh, and Julia LaBate’s The Laughter of the Innocent.LFA also announced that it received a $1.5 million gift from the Morgantown Foundation for the Arts, which was established in 2016 to promote the", "The next Biennial should be held in 2022. With the recent appointment of Josée Bénétière as the new artistic director of the Montréal Biennial de l'Art, biennial organizers are eager to showcase their collaborative approach in the pursuit of greater understanding and appreciation of their medium. \n\n\nThe Kern Museum of Art in San Francisco is launching a new digital-only platform that will allow visitors to view its collection online. The platform, called KMASS, will allow the public to view the works of the Kern Museum of Art in real time. “We have been trying to create a platform that could give people the ability to see our collections in real time, to see works in their collections at their location, and to participate fully in the development of our collections,” said Kern director and CEO Mark Kern. “With this project we are aiming to make it possible for people to experience our collection in the most effective and accessible way possible.”The platform will offer weekly updates on the museum’s curatorial and conservation work. The updates will be posted as well as the most recent and most recent images from the works, which are currently on display in “the gallery.” The", "The next Biennial should also focus on creating new opportunities for collaboration between local artists and museums and how art can activate social issues. “We are constantly reinventing the future of art through our collections, exhibitions, and programs,” said John Smedley, director of the Museums Association. “This is a critical moment for global art, for the art movement, and for the culture of the future. We have a responsibility to create a more just and inclusive future for art and culture. We must continue to work together to shape the future through art—and for the betterment of the world.”The 2019 edition of the Biennale will be staged at the Berthold Oostal, in the Hague; at the Kunsthalle Basel, in Basel; at the Kunsthalle Münster, in Munich; at the Museum of Modern Art, New York; and at the Museum of Modern Art, New York. The 2020 edition will be staged at the Fraunhofer Center of the Austrian Academy of Art and will be accompanied by the eighth and final International edition of the Biennale, to take place in September.\n\n\nCanadian artist Sean Kelly—who, in recent years, has been a subject", "The next Biennial should be held in 2022. Artforum has contacted the architects for a statement.\n\n\nTacita Dean, the British artist whose spiraling geometric collage paintings often eschewed allegory and allegro to weave abstractions that are as vivid with their own particular quirkiness as their varied forms, died on January 29. She was ninety-seven years old.Born in London in 1933, the son of a soldier, Dean grew up in the city, where her family were born. She left England at age twelve to study at the Royal Academy of Art, London, but soon found herself drawn to the artist-owned space in the suburbs. Dean returned to her hometown and to her father, who sold the family home. She attended the Royal Academy of Art, at age sixteen, where she learned to weave fabric from the school's student wing. Dean moved to New York in 1947, where she pursued a career as an artist-at-large. She met her future husband, Vito Acconci, and they had three children. In 1948, Dean moved back to London, and in 1951, the year after she met Wissam Ben Ali, Dean married Ben Ali. The couple had four sons and three daughters,", "The next Biennial should focus on: How do we create new understandings of the body and the world, as a means of generating new knowledge. “The mission of the Biennial is to produce a forum where the collections of the most distinguished names in art history can be showcased in their entirety, to expand the scope and depth of the institutional knowledge base, and to make possible the theoretical and practical reflections of the art of the future,” said Constantine Panzano, director of the Palazzo Mosso, in a statement. The fifty-ninth edition of the Frankfurt Biennale, which kicked off last April and runs through October, will also be held in the city of Frankfurt. Full-year programming will be announced soon.\n\n\nThe Toronto-based collector and philanthropist Wanda Sykes is bringing a new and ambitious project to the city of Toronto: the Wanda Museum of Art. The $450 million institution, which will soon boast an exhibition space designed by the Toronto-based firm Tanya and Ira Katz, will commission a new work by Toronto native and Vancouver-based artist Nana Pascual to create a virtual reality experience at the museum. The show will debut in 2021 and will focus on the", "The next Biennial should take place in the city region of Barcelona in 2019. The next edition will also include a residency program, which will introduce new artists to the region, and will be presented in conjunction with the upcoming FIFA World Youth Championship.\n\n\nThe Solomon R. Guggenheim Museum in New York has named Meghana, India’s first international curator of Indian art, as its first director. Meghana, who began her career as a curatorial assistant in the institution’s curatorial department, will take the helm from curator and curator of Indian art and art history, Pradeep Ghatak, who has worked at the museum for more than twenty-five years.Known for her research and for her own curatorial projects, which span both contemporary and classical Indian art, Meghana was also appointed the director of the National Gallery of Art in Seoul in 2014. She succeeds Ghatak, who will assume his post in March.Meghana’s first major retrospective, “Tahiya,” which opened at the institution in 1994, was followed by “Tibetan Art and Modernism,” which came out in 1997. She also curated the retrospective “Gop", "The next Biennial should be held in 2020. \nHassan Rouhani, the current president of Iran, has announced that the country will suspend all military activity in solidarity with the people of Southwestern Iran, including Muscat, the capital of the United Arab Emirates, and of Bahrain, which is a U.S. ally. In a statement, the Iranian president said: “I congratulate President Hassan Rouhani on his reelection and welcome his appointment as the next president of Iran!”The announcement comes amid the ongoing political crisis in the Islamic Republic, which has been beset by mounting political unrest as a result of the reopening of Western-backed businesses and by widespread shortages of food and fuel. The country’s oil exports have been severely impacted by the global economic crisis, and hundreds of thousands of people are now estimated to be living in poverty. As a result of the political crisis, the International Monetary Fund (IMF) cut Iran’s preliminary aid deal by $5 billion, and the U.S. Treasury Department added four more years to the date for the deal, which was struck in December 2019.The decision to suspend military activity has forced Iran to suspend some major events, including the Islamic Republic’s annual carnival", "The next Biennial should be held in 2021. “We are grateful to the artists, curators, and other organizers who helped us shape the future of the exhibition and its platform,” said Málaga City Mayor Dario Franceschini. The biennial, which was born out of a desire to organize another exhibition in the city, will continue with the same staff and the same programming until “at least 2022.”\n\n\nThe African diaspora has filed a complaint with the United Nations after Paris’s sole Muslim museum closed its doors on Friday, June 14, citing the threat of a terrorist attack. The Museum of Islamic Art (MoI), located in a rambling nineteenth-century building in the ritzy, Art Deco suburb of Saint-Rémy-de-Provence, is located a stone’s throw from the Louvre and the Centre Pompidou, the Louvre’s former home.The institution, which had recently expanded the Tisserand-inspired Louvre diaspora center into a 14,000-square-foot museum dedicated to African art, issued the warning in a letter addressed to UN Secretary-General Antonio Guterres.", "The next Biennial should take place in 2021, when the exhibition will still be led by curator Luiza Sola. The Grand Conservator will become the next director of the Museo de Arte Contemporáneo, and the biennial will continue to be presented by the museum as long as the museum is open.The new museum’s first exhibition of work by a woman, the newly commissioned exhibition “Gina Donoghoe: Motherless,” will be staged at the Museo Arte Moderno in November. The exhibition will feature twelve works by women whose deaths were not related to the single cause of death, asphyxia, and, until now, had not been exhibited before.The Biennial of Australian Artists and Authors (BAC) will now take place at the National Gallery of Australia until 2022. The inaugural exhibition, “A Mormon Women’s View of the Gospel,” will be followed by “The Swedish Woman’s Years,” a selection of works by Swedish women artists from early 1900 to the present. The biennial will also feature “A Mormon Woman’s History” and “A Mormon Woman’s Vision,” a selection of", "The next Biennial should be hosted, as are the Biennials 35 and 37, in 2020. The next edition of the Oakland Art Museum will take place at the same location in 2021. \n\n\nThe Museum of Art in the Arts (MoA) in New York announced today that it is launching a new two-year biennial on economic and social justice, art, and culture, titled   The End of the Affair. The exhibition will be organized as follows: September 3–June 10, 2020.The theme of the biennial is “Equality Continues to Remain a Positive Issue,” a declaration by the late Italian designer Lisandro Alighieri, a supporter of the Black Power movement, that was made in his famous circular opus, “The Zero Hour,” in February 1981. Alighieri’s work is celebrated in museums worldwide, including the Museo das Beaux Arts in Madrid, the National Gallery in London, and the Metropolitan Museum of Art. Alighieri’s work is included in collections of the Italian, French, German, and Italian embassies in Cairo and Sofia.\n\n\nThe catalogue entry for the final exhibition of the Eurosky Biennial", "The next Biennial should take place at the Grand Salon in Paris in 2022. \n\n\nYale Art Gallery is planning to open its new location in Portland, Oregon, later this month. The new two-story space will be located in the former location of the Portland Art Museum, where the institution currently has a museum devoted to the works of American painter John Cage.Established in 1996, the gallery will be located at 900 Southeast Tenth Avenue. It will feature exhibitions by artists such as Charles Ray, Antoine Laurent, and Peter Zumthor, among many others. The gallery will also host classes on how to create abstract works with material and the history of modern art, and will offer studio hours for visual artists and art students.The new exhibition space will invite visitors to experience art through a modern lens through a series of exhibitions, seminars, and public residencies. The first exhibition, “Future Present” will present works from the forthcoming “Adrian Piper: Expressionism in Art” at the Contemporary Art Museum St. Louis. The event will include a reception for one hundred guests of the gallery, which will extend the events to a second exhibition in early 2021. The first show, “Gillian Wearing: An Exhibition of", "The next Biennial should take place in at least 2020, and will consist of fifteen exhibitions divided around a theme theme‐year. The theme is “Purity through History: ‘Inside the UMB Biennial’s Collection,” which will be followed by the first exhibition dedicated to the collection of the UMB Art Museum, “The Art of the Cleanup,” and “The Art of Memory.”Inaugurating the new venue will be a series of presentations dedicated to the collections of the DePaul Art Institute and the Art of the Face. The show will be organized around themes that “involve the historical, cultural, and personal histories of artists, institutions, and people,” including a discussion of how the collection and interpretation of art is intertwined with the history of memory.The UMB Art Museum will also feature two exhibitions that were previously unannounced: “The Untold Story: Contemporary Art in the United States” and “John Akomfrah: An Untold Story.” Both shows will be held in the museum’s new 700,000-square-foot John Akomfrah Center for Contemporary Art. The center, which will be inaugurated by", "The next Biennial should be held in 2022.  The 2019 and 2020 editions, and the two earlier staged in 2019, included a number of works by New York–based artists, including artworks by Laura Owens, Saddam Ben Ali, and Abdul Hadi, as well as works by urban and rural South Asian and African artists. The museum will announce its selections for the 2019 and 2020 editions, which will reopen in 2021, on September 14, respectively. The 2020 exhibition, titled Art of the Gathering, will highlight work by artists in one-on-one interviews with the artist. The next exhibition, titled Avant-Genève, will take place in May 2020. It will be presented by the French artist Bruno Tonier, the German artist Wolfgang Osse, and the Italian artist Paolo Baratta. Panorama will premiere the work of the Korean artist Moon Ji-sung in November 2020.The 2020 biennial will comprise the works of seventy-six artists, including Hsin-Chien Huang, Kim Seo-kyo, Kim Tai-Kyung, Kim Tae-kyung, Dakota Šišić, David Albert,", "The next Biennial should focus on the sustainability of ideas in art and cultural production; the exhibition of work by twenty-five artists; and the exhibition of works by famous and lesser-known artists. It should also explore the possibility of a participatory, artist-led, and curator-led future.The 2020 edition of the Exhibition is currently on view until August 29.\n\n\nThe New York Jewish Museum has introduced a new digital platform that will help visitors navigate its collections, display exhibitions, and presentations through the years of the American Holocaust through the use of augmented reality. Called the Jerusalem Document Archive, the platform will provide users with a curated timeline of documentaries and exhibitions, including a twenty-year retrospective of Croatian artist Jozef Kupka’s work “In the Shadow of the Sun” (2017), which was organized in partnership with the Gilbert and George Lucas Museum of Art in Los Angeles, and will also include a “Beyond the Infinite” exhibition for three hundred cities worldwide.“The Jerusalem Document Archive is an ambitious venture launched by the New York Jewish Museum in partnership with the Gilbert and George Lucas Museum of Art in collaboration with the Jewish Museum in New York and the American Jewish Museum in Los Angeles, and is meant", "The next Biennial should be its 200th anniversary and will be curated by the Los Angeles–based artist Barbara Brogden. The show will take up themes such as self-actualization, consciousness, and the existence of a Creator. The exhibition will begin with a presentation of works by Brogden’s husband and will conclude with a performance by the artist and the artist’s son, Angel, who will be paired with Brogden. The festival’s inaugural edition was held at the Los Angeles County Museum of Art (LACMA) in 2013.\n\n\nThe United States is facing a health crisis caused by the coronavirus, which has infected more than 200,000 people and caused several states to shut down. The number of cases has surged as people are forced to travel long distances to avoid hospitals and doctors are turning to underground markets and illegal drugs to survive.The coronavirus is spread mostly by close contact—especially if the person has recently traveled with a sick relative or friend—and people who are infected with the virus are contagious for up to six weeks. While the incubation period for the virus is three weeks, it can be spread through close contact and can cause severe respiratory distress and death. While the number of", "The next Biennial should focus on the history of contemporary art and its digital connection with the past. The next edition of the Art & Architecture Biennial will be held in September 2020. The curator will be Emmanuel Bastiat, a professor at the University of Pennsylvania; Rougmar Paalen, the director of the Copenhagen Art Museum; and Brian Enos, the chief curator at the National Gallery of Art. The museum has released a statement about the upcoming event: The Copenhagen Art Museum is delighted to announce that it will host the next installment of the Art and Architecture Biennial in September 2020. The museum will be hosting the exhibition, “Art and Architecture” from August to October 2020, and will host a retrospective of the work of the artist Paul Gauguin in November 2020. The exhibition will be organized in partnership with the National Gallery of Art, the Danish National Museum, and the National Museum for Light Art.The theme for the exhibition will be 'Off the Grid” and will be inspired by “Manifest Destiny: Art and the Artifice of Life” (2018) which was staged at the Kunsthalle Basel. The exhibition will feature the work of artists such as Marcel Klim", "The next Biennial should take place in 2020 and would feature approximately sixty works by forty artists from the contemporary art world. \n\nThe Museum of Contemporary Art (MoCA), Pasadena, California, announced today that it is planning to open a new MoCA–Pasadena branch of its museum of Modern Art, which will be located in the former Fisherman’s Wharf on West Fourth Street, in 2020. The $10 million MoCA–Pasadena branch will be a companion exhibition space to the museum’s modern art museum, which opened in the building’s former home in 2005.The grand opening of the new facility will take place sometime in 2020. The new branch will be led by curator and curator of contemporary art, Daniel Berlanga, and will focus on “cultures of resistance,” a theme that has been a core theme of MoCA’s programming over the past fifteen years. Berlanga began his career at MoCA as the group curator of “endless movement.” Berlanga has curated exhibitions at the museum, including “Presenting Modern Art: An Exhibition of Contemporary Art,” which opened in 2007 and “The Contemporary", "The next Biennial should be comprised of seventy artists, including four each from the United States and United Kingdom and one each from China, India, Poland, and Russia. The project will be hosted at the Museums of Imperial Beijing and the Moscow State Museum of Art.“The project is a response to the current political climate in China and its impact on the international art world’s relationship with China’s cultural institutions,” Liu told the Art Newspaper. “It will be jointly organized by the Museum of Modern Art Beijing and the Museum of Modern Art Moscow and will be presented as a combination of art and politics.”The biennial will feature three newly commissioned works by contemporary artists from China\u0097Saara and Huang Yue\u0097as well as thirty works by artists who have had exhibitions at the Chinese Academy of Fine Art, the Beijing Art Museum, or the Beijing History Museum.\n\n\nNew York’s Metropolitan Museum of Art will remove a statue of Edward Colston, the American photographer and diarist who experimented with massage and drugs and whose work made a name for his body in postwar and contemporary art circles. On Friday, the museum’s board chairman, Daniel H. Weiss, announced that the museum will", "The next Biennial should be in the spring of 2020. \n\nFollowing the Paris climate talks – for which more than 190 nations committed to reducing greenhouse gas emissions – Los Angeles County (LA County) supervisor Mark Ridley announced that the city is planning on pulling the plug on its annual February biennial, which currently draws an estimated 70,000 visitors. “We must act now to protect the health and well-being of our residents, children, and city’s economy,” Ridley wrote on the city’s’s blog, “as we head into an unprecedented global crisis.”Speaking to the Los Angeles Times, Ridley explained that the city decided to cancel the event, which was slated to take place in February, because of concerns surrounding Covid-19 and the coronavirus. “We need to act now,” Ridley said. “We’ve got an obligation as a city to our residents and to our community to do everything we can to help them through this difficult moment.” Following the announcement, Ridley said that the city’s environmental department is still reviewing the biennial’s September 29 cancellation, which was reportedly prompted by fears over the virus.Ridley claimed", "The next Biennial should also aim to develop a new 'DIY' format for addressing the challenges and opportunities presented by the entire exhibition program, which is already undergoing a major redesign and will be inaugurated by a new exhibition, “Labyrinth,” an amalgamation of two existing collections, “Theatre of Exchanges” and “Labyrinth: A Contemporary Journey,” which will be housed in a biennial-sized building in the city. The newly restructured exhibition will consist of one show per biennial.“We have been working towards the development of a new platform for the exhibition program for some time,” said Gregory D. Anderson, the curator in charge of the Biennial. “In the past, the Biennial was conceived as a vehicle for the publication of new works by artists and was devoid of any form of digital content and would-be artists. I am thrilled to be working with Nancy, Anthony, Tschagen and Pape to see this new vision of the Biennial evolve into a new platform for art and artmaking.”\n\nThe Swedish artist and curator Eva Finkelpearl, a staunch advocate for women’s rights who collaborated with and inspired countless artists and", "The next Biennial should focus on the question of how art historians, curators, and architects, whether from Switzerland, Italy, Russia, Japan, Mexico, or Argentina, might engage with the legacy of the nineteenth-century. The first exhibition, “Between the World and Me,” will take up the topic in the September 20–October 6 exhibition, “Between the World and Me: Art & Politics,” at the Catalan Cultural Palace.  The first edition of the exhibition will be hosted by the Catalan Government in Madrid and curated by the Santiago de Colorado (CAC) and the Dİstanbul-based architects Faltimena, who will be accompanied on the tour by the chief curator of the Catalan Cultural Heritage Foundation and a curatorial team led by the architect Jorge Vicente. The exhibition will also feature works by contemporary artists in Spain that were first exhibited in the country.\n\n\nArtist and scholar Neerja Gupta has been selected as the next chair of the Indian Institute of Technology (IIT) in Bombay. Gupta, who was previously the inaugural director of the Sarvodaya Mathura Art Gallery, was given the position in recognition of her contribution to education, scholarship, and conservation in the field of art and", "The next Biennial should be held in the summer of 2021. However, due to the ongoing threat of the Covid-19 pandemic and the consequent cancellation of the 2020 edition, the event has been postponed, and a new edition of the exhibition will open in the fall of 2021. The 2019 edition, titled Art in Transition, focused on contemporary art from the twentieth century through to the twenty-first century and featured work by 120 artists. \n\n\nThe Art Newspaper reports that the Italian government is now threatening to introduce new sanctions against foreign galleries that fail to compensate Italian workers whose employment was lost as a result of the ongoing construction and austerity measures taken by the government, including the closure of several museums and the reopening of other public spaces. The move comes amid a growing campaign by art workers and other cultural workers to draw attention to the government’s handling of the Covid-19 crisis, which has already seen the closure of two historic sites and forced several closures, including at the Marina del Rey Art Museum and the Palazzo Ferraris. After Massimo Cattelan, the president of the Democratic Party and president of the Chamber of Deputies, declared that the government should consider imposing sanctions against", "The next Biennial should take place in 2021.\n\n\nAhead of the US pavilion at the Fifty-Ninth Venice Biennale, which will officially open on March 15, a group of artists and curators have launched a petition. Led by the Theater of Operations Collective, a nomadic group of artists who are based in the US and Europe, the group writes: “US war crimes and mass incarceration are rooted in a system that oppresses and exploits Black and indigenous communities. We call for an end to police violence, racial discrimination, and racist policies. We call for a genuine reinvestment of racial justice resources into Black communities.”The letter, titled “US at War with Black and Indigenous Communities,” was published by two dozen artists and activists, including Anselm Salcedo, the former director of the Association of Independent Visual Artists (AIVA), which is based in the New York City borough of Brooklyn; Angela Shiner, an independent curator and writer based in Minneapolis; and Mpagi Sepuya and Mpagi Tudela, artists who were imprisoned for nonviolent offenses in England and Wales between 1973 and 2009.\n\n\nThe Metropolitan Museum of Art in New York has announced that it will reopen", "The next Biennial should be a celebration of the twenty-fifth anniversary of the exhibition Biennial: Avant-Garde History’s thirty-second edition this September. The next edition will be held at the Georgia O’Keeffe Museum, located in the heart of Atlanta, Georgia, with exhibition spaces in New York, Los Angeles, and New Orleans. While the exhibition’s curator, George A. Lucas, will continue to work closely with the artist and will provide extraordinary exhibitions and lectures that explore the history of the art produced in the event. \n\n\nThe estate of the late British architect Kno’lmaz, a leading member of the British Group of the Guggenheim’s Foundation for Contemporary Art (GBCA), in the United States, has settled a lawsuit with the British Museum over a donation of works by the artist’s widow. The estate, which had been attempting to sell the pieces since 2013, filed a countersuit in the New York Supreme Court on March 22, claiming that the sale of the art should be blocked because of the wrongful death claims.The estate had challenged the gift as part of a long-standing lawsuit that it had filed in the", "The next Biennial should be held in February 2019.\n\n\nNew York Times bestselling author, art historian, and curator Cristina Sargent-Davis, whose voluminous, award-winning scholarly writing and exhibition-making—which spans sociology, anthropology, history, philosophy, and politics—is now a professor at Columbia University.Born and raised in New York, Davis first entered the literary world at seventeen, when she discovered the American painter Rosemarie Trockel. Though she was not the first to notice the painter’s connection to the “60s, her first book was an African American art historian’s declaration of a ‘historical imperative.’ “I have been reading and writing about art since I was six years old,” she said. “I thought I was reading about history; that’s what history was.” In her forthcoming book,  The History of Art: From Icon to Present (Mellon University Press, 2019), Davis traces the history of art from its earliest origins to its present-day, drawing from a wide variety of sources, including archival research, literary and artistic criticism, and art historians and scholars, anthropologists, artists, collectors", "The next Biennial should take place at the Italian city of Bellenuna, Italy. The event will be curated by my long-time collaborator Michele Carnevale, director of the Museo de Arte Contemporáneo d'Italia (MASI), Maurizio Cattelan, and the late Italian architect Giuseppe Piro.The work will be housed in an exhibition organized by the Museo de Arte Contemporáneo d'Italia (MASI), a consortium of artists and architects, and the Museo de Bellenuna, an autonomous organization. “I’m looking forward to the installation of the work, which is a symbol of the artistic commitment of the artists and designers involved in the exhibition, and to the work being presented in an exhibition organized by the Museo Dallì’s co-organizers in the special mission of supporting the work of our artists,” said Carnevale.The inaugural exhibition will be staged in the city of Bellenuna, Italy, which has been working to secure a permanent home for its collection of Renaissance sculpture since the late 1970s. In 2009, the group of curators, who hail from the Milan-based", "The next Biennial should be held in the fall of 2021. The fifteenth was held in the spring of 2022.The exhibition, titled “Beyond the Frame: Art and the Making of Modern Life,” will be held in the new 100,000-square-foot, biennial-style Radisson Blu Hotel, which opened in the central location of the museum in October of last year. The hotel was designed by Glasgow-based firm Glynn Liddell and will offer three- and four-star accommodations, as well as a restaurant, a bookstore, and other spaces for the public.According to the Guardian, there are currently about 3,500 works in the collection of the museum, and it estimates that it will be able to bring the total number of works in the collection up to 8,000 in the next few years. The exhibition, which is organized as part of the Amadou Grand Biennial, was co-organized by the artist-run NGO Amadou and the biennial-oriented NGO the Tauranga Foundation. The completion of the project marked a milestone in the museum’s history. The museum is currently constructing a new building to house the collection, but the collection will be moved to the", "The next Biennial should be held in 2021, the year of the twenty-ninth edition of the Biennial.The statement concluded: “We must be vigilant in protecting the future of the Biennial. We must act now, to preserve its legacy and to secure its long-term future. We must act in partnership with all our partners, including the artists, to ensure that the fair continues to thrive and that it remains at the heart of London’s culture scene. We must act now to ensure that the fair continues to be vibrant and relevant to the local community. We must act to secure the future of Biennale London and the future of our fairs. We must act in solidarity with other leading arts and cultural institutions and arts professionals, including the Royal Shakespeare Company, the National Portrait Gallery and the Tate, who are campaigning relentlessly for an early end date for the 2019 edition.”The full list of participating galleries is as follows:Adele Bank, London: “Adele Bank presents an ambitious and ambitious exhibition with a future-forward vision for how art can move beyond the present and into the future. The exhibition ’s first project, ” the History of the Future,” combines contemporary art with", "The next Biennial should be held in 2020.  The year 2020 is the current date of the upcoming exhibition, Langmann–Osvaldo, due to open in June. The show will draw an international group of artists and will feature work by seventy artists from thirty-seven countries.  The 2019 event was held at the National Museum of Fine Arts in Beijing.\n\n\nThe archival holdings of the British Museum in London, which were transferred to the National Gallery in London in 2017 under controversial legislation that allowed the transfer of cultural objects between the institutions, have been moved online in a move that will safeguard the future of the institution as it prepares to reopen. British Museum director Maria Balshaw announced the news in a statement on Wednesday, and the museum’s board chairman, David Hudson, called it “transformative” and “inspiring.”Balshaw said: “The institution will reopen as part of a new, bold and ambitious plan that will deliver for our future visitors, our visitors and our community. . . . The board is delighted to see that the transfer of these vast holdings will not compromise on the museum’s mission in any way, shape or form.” The museum", "The next Biennial should take place in the summer of 2021. The theme for the first edition, “Italian Modernism,” will be “The Elements of Modernism: An International Anthology,” and the exhibition, “Italian Art of the 1960s” will take place at the Institute of Contemporary Art. The next edition of the Biennial will be held at the Institut d’Art Contemporain (IAC) in Paris in the fall of 2021.\n\n\nThe Leverhulme Gallery has announced that Carla Mann has been appointed as its new artistic director. Mann will be the first artist to lead the gallery in twenty-four years and will take up the post at its new location in London on November 1. Mann joins the gallery from the Royal Academy of Arts, where she has served as a senior curator since 2015 and will take up the post in the summer of 2020.Commenting on her new role, Mann said: “I’m thrilled to be working with the Leverhulme team again and to be a part of the extraordinary history of the gallery and the wider art world. In my new role, I’m dedicated to supporting the Leverhulme team and", "The next Biennial should take place at the Library of Congress in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York is preparing to reopen next week after it was temporarily closed due to the Covid-19 pandemic. The institution, which had been scheduled to reopen on October 23, will instead re-open with a new set of exhibitions and a selection of works that were on display during the museum’s temporary closure.According to the New York Times, the reopening date of the institution for several weeks had been pushed back to sometime between November and February. MoMA director Daniel H. Weiss told the New York Times that the postponement was made over the course of a week, and that the exhibition hall will reopen on Friday, November 28, at 10 AM.“As we have said all along, our primary focus is on rebuilding our relationships with our audiences and our artists,” Weiss said. “We will continue to present thoughtful, thought-provoking, and provocative exhibitions that draw from the museum’s extensive collection. We will continue to explore the ways in which art can serve as a powerful healing and preventative to combat the ravages of Covid-19.” In a statement on", "The next Biennial should be assembled in 2020. For artist-in-residence Marc-Olivier Gaillard, the real draw of the exhibition is its new setting: “In the midst of our global crisis, the exhibition is situated in the city where all of Paris can find a home. The opening of this exhibition represents the promise of a new kind of political, cultural and social entity, one that takes a position on our current moment in partnership with the city of Paris.” The biennial will be hosted by the Musee de la Musique des Beaux-Arts in Paris, which is located in the city’s old city. The venue has staged other significant exhibitions in recent years, most recently at the Beaux-Arts and the Museum of Modern Art. The Beaux-Arts drew an audience of more than 3 million people last year, and the museum exhibited around 1,500 works from the exhibition.The exhibition will feature new work by thirty-five artists, including Bahria Alves, Aline Fattouille, Clementine Bénétière, André Bianchi, Mierle Naim, and Pia Camil, as well as works by artists from the H", "The next Biennial should take place in Rio de Janeiro in 2022.  The fifteenth iteration of the festival will be held in the Bahamas in 2023. The fourth edition of the event will take place in the United States in 2021.\n\n\n\n\n\n\nMerry James O'Connell, the longtime director of the Rhode Island School of Design (RISD), has announced that she plans to resign from her position on August 31 and return to her hometown of Newport, Rhode Island, on September 16. “I’ve been a part of the Rhode Island School of Design community for twenty-four years. I’ve led the charge to expand the curriculum and add more field trips, and pushed for more collaboration between students and faculty,” said O'Connell, who is ninety-four years old. “The past six years have been a total joy and have been an exploration of ideas and art and people, and the possibilities of making art.”During this time, the school has undergone a $100 million renovation and has added more than three hundred new projects to its collection. This has brought the total number of projects on the campus up to 20, including nearly two hundred works by artist-in-", "The next Biennial should focus on the toolkit and processes that have made the exhibition possible. The following three biennials—The Art of the Embarrassment, The Art of Surprise, and The Art of Conversation—will focus on the historical and theoretical background that underpins the exhibition, with a particular attention to the history of the exhibition and an attempt to create a new canon of works. 'IWOMAN, LASALLE, & THE DREAMING WOMAN: A PERFORMANCE ARTISTIC EXPERIENCE” is scheduled to open in September 2020.\n\n\nNew York’s Metropolitan Museum of Art has hired Anthony Bechtold as its new deputy director for exhibitions and collections. Bechtold, who has been working as a curator at the institution for over a decade, has been tapped to lead the museum until a successor is appointed.“Anthony brings more than five decades of experience in museum management and curating as well as an excellent record of achievement in presenting exceptional exhibitions and collections, and has the ability and conviction to ensure that the Met’s exhibitions and collections continue to thrive and prosper,” said director Daniel H. Weiss. “I have long admired his ability to imagine new ways", "The next Biennial should be held in 2021.  The 2019 Biennial was organized as a project of the museum, the Massachusetts Institute of Technology (MIT), and the Massachusetts Bay Transportation Authority (MBTA). The exhibition was inspired by the biennial of the American painter James Cuno, whose work is included in the upcoming exhibition “Lincoln” (2019).“I wanted to build a platform to meet the biennial and to connect my work to the work of the past in a way that would open up new conversations and new ways of looking at the work of the biennial,” Francis told the New York Times. The exhibition is being organized by the same team that organized the Arts and Design Museum’s inaugural exhibition “In the Mirror: Contemporary Art from the Biennial of Richard Diebenkorn,” which opened November 19–December 1, 2019 and ran until June 30, 2020.The theme of the 2020 event is “Feminine Intelligence,” a reference to the work of the feminist scholar Ada Nescient and the work of the work of the Italian sculptor Maurizio Cattelani, who both won the International Femme Art Prize in 2002. The exhibition", "The next Biennial should focus on how artists are rethinking the ways they consume art, a theme that will be revisited in the following years. \n\n\nThe Association of Independent Curators (AIC), an organization that represents more than 60,000 visual art professionals in the United Kingdom, has released a new survey on the state of the art at the Metropolitan Museum of Art (MMA), highlighting the difficulties of working within a political climate in which controversy, intimidation, and violence are rampant.According to the AIC, which is supported by the Tate and the National Lottery, the survey, titled \"To the Met, to the Met, and Back again, is compelling and inspiring. “In this polarized climate, where art can be turned against itself, art can be turned against its own audience, and art can be turned against itself again, the AIC’s survey suggests that a new kind of politics of art can emerge, one that addresses the roots and development of violence against art and the connections between art and violence,” said Richard Black, director of Tate Britain and director of the Tate.Black added: “The AIC’s work in this regard is deeply inspiring.", "The next Biennial should be held in at least 5 years. “From a cultural point of view, this is an unprecedented situation,” Michael Lee, director of the David G. Griffin and Richard G. Breslin Center for Art, told the Art Newspaper.A statement issued by the center reads: “The Griffin Museum of Art and the G.K. Chesterton Foundation have been collaborating on a variety of projects together for more than twenty years. These collaborations are an attempt to bring together the most recent work of art from the two museums and to bring both museums into one location. The gift of this work will not only deepen the intimacy of the two museums, but will also significantly increase the potential audience for both exhibitions.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed John P. Walters as its new executive director. He succeeds Mary Anne P. Oehler, who has helmed the museum since 1998, and will take up his new post in January 2021.Under P.J. Walters’s leadership, the museum experienced a period of significant growth. Its attendance increased by over eight hundred percent during the seven-year tenure of its first director, Richard Armstrong; its gross arts and culture revenue", "The next Biennial should be held in 2020. The museum will launch a “subscription service” for the event, which will offer VIP access to performances, lectures, and screenings. It will also be the first major opera venue in the city.In a statement, the city said that the announcement was made in the spirit of cooperation between the city and the Biennials, as a way of acknowledging the collaboration between the two institutions. It said that the announcement was made on behalf of the city and the museum in order to honor the upcoming twenty-fifth edition of the Berlin Biennials, which will take place in the Zeistiner Strasse on April 22–April 27. \n\n\nAs the first major exhibition devoted to the life and work of Pablo Picasso closed on May 31, the Museum of Modern Art (MoMA) in New York announced that it is preparing to open a new collection dedicated to the artist’s childhood in the spring of 2021. Titled Pablo: The Life of an Artist, the exhibition is being organized by the Picasso Museum and will run until November 26, 2021. The exhibition will feature 230 works by the Argentine avant-garde artist a cappella, including works made for a public exhibition", "The next Biennial should take place in 2021. “The University is going to be transformed by this experience,” said curator and director Domenick Girotte. “The Museum is committed to becoming a laboratory for what it means to be a contemporary artist, and the future of Art.”\n\n\nThe Windmill Museum in North Hampton, New York, has announced that it is preparing to open its first arts space in the city of Norfolk, Virginia, in the fall of 2020. The institution is also expanding its footprint, increasing the museum’s exhibition space by 10 percent, and launching a new online platform to support the public’s creative interests.In a statement, the museum said: “Like many cultural institutions across the United States, the Windmill Museum is in the process of assessing the potential for the new location in Hampton Roads that is currently under construction, and the potential for the new location in Norfolk, which is currently under construction. The museum is collaborating with local government and state officials and will share more information as it works through the planning and construction process. We are excited to see how the community responds to the Windmill Museum in Norfolk as we begin our grand opening in the fall of 2020.�", "The next Biennial should take place in 2021 and the platform will be open to the public in 2021. The first iteration of the exhibition will focus on two primary themes – love and death and will include more than 120 artworkworks.Artists in the exhibition include Dusan Makhlouf, who created the works 'Murakami' and 'Maya Rûmân.  The show will also feature work by a selection of artists who have previously been excluded from the UK’s prestigious Art Biennial, including Nicolas Ray and Nnedi Okwui Enwezor. The inaugural Biennial was established by the late sculptor Mark Duggan in 2009 in a bid to promote wider appreciation of Māori artists. In the exhibition’s first iteration, Elyn Parrish, the director of the Māori Art Gallery, and her staff created the works of Mark Duggan. An exhibition of works by James McEnery and James Beaty was also staged at the gallery.\n\n\nThe British pavilion at this year’s Venice Biennale has been awarded by the Venice Foundation to the artist and activist Sohrab Mohebbi. The acquisition, made through", "The next Biennial should focus on the challenges of growth and development across art and technology and should strive to engage with those most affected by the crisis, including artists, creatives, academics, and policy-makers. In addition, it should consider how artists and scholars can work together to develop solutions to the environmental crisis.”\n\n\nThe Seattle Art Museum (SAM) has received a gift of twenty-six works from the artist-in-residence and photographer-at-large Piet Mondrian, who passed away on February 6 at the age of seventy-two. The works, which were given to the institution by the collector and her daughter, are works by forty-nine artists, including Susan Phillips, Fata Olu Olu, and Arsht Henningsson.“Mondrian’s work in the collection reflects her strong and ongoing commitment to social justice and the importance of local, state, and federal policies to address racial and economic inequities,” said deputy director Brooke Ballard. “Our hearts go out to the artists whose works are in this collection—we know that their lives were full of joy, promise, and hope. We hope that this gift will help them to understand that this is an important year", "The next Biennial should be on the streets of Sweden and will introduce a new exhibition of works by the leading contemporary artists in the country. The show will focus on popular images from the 40 years of the Biennial, called “Beyond the Frame” (2018–19).The biennial, which will be located in a former factory on the street of Nygatan in Gothenburg, will run from March 20 to March 21, 2020. The exhibition will include works by forty-two artists of all disciplines, including painter Lars-Lód, sculptor Janna and Rupa Gebber, playwright and director Janna Lundgren, and filmmaker Lårdi Lissoni.\n\n\nThe Museum of Contemporary Art (MoCA), Boston, and the Orchard Street Armory in Manhattan have joined forces to create a new public space in Cambridge, Massachusetts, that will bring urban life and art to the city’s historic Massachusetts Station.The joint venture will create an outdoor plaza in the city’s historic South Station, which is currently under construction, and will place approximately twenty artworks, including works by Erik Satie, Mark di Suvero, and John Gabriel, in the center of the historic station. The", "The next Biennial should have been held in 2022, but was postponed due to the Covid-19 pandemic, and, in March, the eighth edition of the biennial, “Awards of Excellence,” was held. The exhibition, which featured work by seventy-seven artists and collectors, was organized under the aegis of the biennial’s artistic director, Mona Hatoum.\n\n\nThe New Zealand Museum of Art (NZMO) has received a $200,000 donation from Wellington-based artist Phil Plunkett. The donation was made in recognition of a “revolutionary” year for the institution, with the NZMO’s 2019/20 fall exhibition “Jasper Johns: The Rainbow Serpent” receiving a major international award for art. The Art Newspaper’s exclusive report on the event said the institution received three hundred awards in the first three months of the year.The donation brings the total number of awards to the museum’s endowment, which includes A.M. Paxton, Theealand, and Diana, as well as the Australian Pavilion & Gallery, the Australian Council,", "The next Biennial should be announced soon. The following is a list of the this year’s Art of the Gathering, which exhibits works that examine all aspects of life from the artist’s perspective. \n\n\nThe Metropolitan Museum of Art in New York has unveiled its plans for the development of a new master plan to revitalize America’s urban fabric. The plan, titled The New Urbanist, rejects the current iteration of the city’s historic core by creating a new park\u0097Redhook, an outdoor venue that will draw visitors by train, subway, or car. It also outlines how the museum will incorporate local, national, and international art, which will be curated by a rotating cast of curators.“The museum is committed to rethinking the experience of being in the city,” director and CEO Daniel H. Weiss said in a statement. “This is an idea so central to New York’s DNA: to be in tune with the people around you, around the world, and around the world in tune with New York. . . . We are taking the idea of Redhook to the people, and to the", "The next Biennial should be in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has announced that it will begin welcoming visitors back to the institution in ten years. The decision was made in an announcement made on Wednesday during the institution’s annual gala. In a statement on Saturday the museum said: “This is a landmark milestone for the museum. It is the first time in its fifty-year history that we have completed the restoration of the entire building, with the exception of the entryway, and in the last ten years.”The institution also noted that the renovation of the original brick and stone décor and interior of the museum, which was built in 1924 and reopened in 1997, was completed in 2017 and will open to the public in 2022. \n\n\nThe Royal Academy of Arts (RA) in London has received a record $142 million from the sale of five works by Canadian artist Lawrence Abu Hamdan, including his monumental “Tin House,” a twenty-one-thousand-work set on a large scale in the city of Toronto, and “The Age of Innocence,” a portrait of Canadian intelligence officer Bruce Rorschach.The", "The next Biennial should be held in 2021–22. The auction house will announce the winners of the first two editions of the competition, entitled “Presentation: The Chet N. Dukan Biennial” and “Presentation 3: Ming Wong’s Queer Art” on June 18 and June 21, respectively.Following the biennial, the auction house will stage “Proposition 3: Restitution” and “Wang Wei’s Revolutions,” which will open on August 31 and August 29, respectively. Next year’s exhibition “Wang Wei: Low Power” will mark the first time the artist was granted a solo exhibition in China.\n\n\nThe Museums Association (MA), which represents more than 1,400 UK cultural institutions, including the British Film Institute (BFI), the National Galleries of Scotland, the National Galleries of Ireland, the National Poetry Library, and the National Poetry Solvers, has demanded that the government address the “unprecedented situation” caused by the coronavirus. The group is demanding that the British Museum and the Tate stop promotional activities and move online, and that the", "The next Biennial should have a new venue and a new theme: the exhibition of world art’s cultural legacy. The theme should be “How does art shape our world today?” The new exhibition will take place in the Museum of Modern Art; the Museum of Contemporary Art Shanghai; and the Museum of Contemporary Art Berlin.The first show dedicated to the work of the late Italian designer Mario Cipollini will open in the fall. Called “Inter alia,” the exhibition—which will involve the construction of a new building and a reconstruction of a courtyard in Venice—will be curated by Giacomo Bocconi and will be on view in the museum from November 25 to March 7, 2020.“I am very excited about the prospect of the exhibition of Mona Hatoum’s work in the first show dedicated to the work of the twentieth century,” Pier Paolo Pirandolo, director of the Museo d’Arte Contemporanea in Rome. Hatoum died in 1997.Pirandolo said: “The exhibition of Hatoum’s work, for me, is a milestone of Italian art history. I can’t think of", "The next Biennial should be at least two years after the exhibition, on the theme of “From the Garden to the Sea,” in order to allow the “living organism” of the work to remain intact.The new exhibition, titled “from the garden to the sea,” is curated by Hoor Al Qasimi and is scheduled to run until April 29. The full list of participating artists is as follows:Art Gallery Dubai (AGRD)Al Ain Gallery in the United States (AD)Al Ain Gallery, USA (AD)Al Ain Gallery, USA (AD)Artists Capital, London (AC)Adrienne Arsht, New York (AC)Amanda Ball, New York (AC)Kamala Baru, New York (AC)Artists Capital, London (AC)Binyamin Batur, New York (AC)Bibi Bavel, New York (AC)Bibi Baudry, New York (AC)Bibi Baudry, New York (AC)Bibi Baudry, New York (AC)Bibi Baudry, New York (AC)Bibi Baudry, New York (AC)Bibi Baudry,", "The next Biennial should be held in 2022. At the time of publication, the ten finalists had not yet been announced.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it will open two new spaces in the city. The museum will be inaugurated by a virtual tour of the institution, “Feminine” (2019), and will have an exhibit dedicated to the brand new $1.3 billion Metropolitan Museum of Art, which is currently under construction in the former factory district in Chinatown. The museum will also have a café, a library, and a performance space. “We are thrilled to open the new museums in our hometowns, and we look forward to welcoming you to the new museums,” said MoMA director Thomas L. Friedman. In a statement, Friedman said: “The museum of modern art is a singular institution symbolizing the intellectual, artistic and financial achievements of a select few, whose impact can be felt throughout the world. We are honored to welcome back these women, and to celebrate their achievements on this spectacular new stage, the Museum of Modern Art, and the Met.”\n\n\nThe Alabama Institute of Art (AIA), the University of Alabama at", "The next Biennial should be held in 2022. Nelson added: “The Museum is grateful to all our collaborators who have contributed to the last two Biennials, and we look forward to continuing the work of the previous two.”\n\n\nThe Kaya Foundation in the United States is launching a new initiative to support artists and cultural workers in China who are facing threats and attacks from the country’s state-backed enterprises. The initiative, which serves as a pilot project for new federal legislation that aimed to curtail the country’s industrial abuses, has received the support of more than one hundred cultural and labor leaders and activists in the United States, and is slated to launch this week.“The Kaya Foundation works with artists and cultural workers across the city and region of Beijing to ensure a deep and wide-ranging public policy response to the threats they face from China’s state enterprises,” said Kaya director and CEO David Klipper. “The new federal legislation addresses many of the urgent and pressing issues raised by the Kaya Foundation’s work, and we are eager to work with the new Congress and administration to ensure the Kaya Foundation’s voices are heard and our programs and programs managed", "The next Biennial should take place in 2020, and if the convention is successful, it will become the first institution to host a exhibition devoted to the life and work of the late Swiss artist Franz Kline. Kline, whose work explored the relationship between the artist, the body, the environment, and the human being, died last month at the age of eighty-two. \n\nThe London-based arts organization the J. Paul Getty Trust announced today that it will divide its $1.3 billion endowment into 154 smaller individual investments that will deliver annual returns of 3 percent on average. Each fund will consist of two funds, one for art and one for architecture. Each fund will hold one sculpture, one installation, or one performance every other year. “Over the past decade, the trustees have been working to develop a strategy for the future of the trust,” said Deborah Corrigan, chair of the trust. “It has been an enormous challenge to take a specialist museum like the Getty and create a plan that would deliver returns that would be sustainable and that would deliver long-term results. The result is a new series of investments that will deliver an average annual return of 3 percent for the next decade.”The investments", "The next Biennial should be held in 2020. “The Biennial is a vibrant, multifaceted project,” said Catherine Hampton, director of the Museum. “What we are able to do now will help to define what is possible in the future. We are inspired by the work of the artists whose work we will see at the Museum and want to support their work in enriching the lives of future generations.”She added: “The Biennial is a long-term project that can extend into the future. We welcome all artists to the Museum and look forward to continuing to shape the program in our own way.”\n\n\nThe Bergen Tate’s board has voted to sell more than one hundred works by American painter and sculptor Richard Anuszkiewicz, who was one of the first African American artists to win the Nobel Prize. The controversial decision, made in June 2019, followed weeks of protests from African American legislators and led some to question whether the museum board had intentionally kept its hands off of the auction house to secure the $25,000 prize.“We are aware that many people are disappointed by the decision and we would like to make a sincere apology for distancing ourselves from this important", "The next Biennial should take place in 2020. The next iteration of the Art Biennial is currently scheduled for the end of December 2020. Following is a list of organizations and individuals that have endorsed the newly created and proposed 2020 events: Art Basel, Artforum, Artforum Japan, Artforum Korea, Artforum China, Artforum Hong Kong, Artforum London, Artforum New York, Artforum Shanghai, Artforum Milan, Artforum Milan, Artforum New York, Artforum New York, Artforum New York, Artforum Shanghai, ArchitectureCenter, Artnews, Art+Art, Art + Art Tokyo, Art+Art Seoul, Art + Art New York, Art + Art Tokyo, Art + Art Seoul, Art + Art New York, Art + Art Seoul, ASIMO, Art + Art Tokyo, Art + Art Seoul, Art + Art New York, Art + Art Tokyo, Art + Art Seoul, Art + Art Seoul, ART + Art Japan, Art + Art Tokyo, Art + Art Tokyo, Art + Art Tokyo, Art + Art Tokyo, Art + Art Tokyo, Art + Art Tokyo, Art + Art Shanghai, Art + Art Shanghai, Art + Art Shanghai,", "The next Biennial should be held in 2020. Source: Art of Life\n Founded in 1989, the Taormina Biennial is an international initiative of artists and collectors who have staged exhibitions around the world in the last twenty years. Hosted by the Italian architect Stefano Bonetti, the Venice Biennale was one of the first global events organized by the Italian government. It was also one of the first events organized by an Italian artist, and one of the very first events organized by an Italian artist-photographer, in his home country.Although the event has been held annually since 1997, it has never been staged by an Italian artist. It was first held in 1972 by the French architect Bernard Boudin, who also organized a retrospective of his work for the first time in Italy in 1976. \n\n\nThe National Gallery in London has appointed Sylvie Baril and Lizon Baril as the new board members of its advisory board. Both are board members of the biennial’s London-based arm, the National Gardeners’ Association (NGA), and will serve two-year terms. “The board is thrilled to welcome these two accomplished young women to the National Gallery, and we look forward to", "The next Biennial should focus on “art and the environment”\u0097a recurring theme in the works of the late artist. A selection of his works will then be displayed in a “live art” exhibition at the museum. The event will be curated by Vanessa Constantinescu of the Museum of Contemporary Art, Venice. The tour will run from September 5–September 7.\n\n\nEddie Arroyave, a Chicago-based artist who has worked in sculptures, painting, and installation since the 1980s, has died at age fifty-two at his home in Manhattan. His work is currently displayed in the collections of the Museum of Modern Art (MoMA), the Metropolitan Museum of Art, and the Walker Art Center. The Museum of Modern Art, which was asked to take over collection management in 2017, confirmed the artist’s passing: The death of Arroyave, whose work has been exhibited at numerous institutions, is a great loss to Chicago. His legacy will live on in the work of many future generations of artists.“Eddie Arroyave was a natural artist, a man of infinite talents,” Amy Sherald, the director of the Walker Art Center, told the", "The next Biennial should be held at the Museo de Arte Contemporáneo in Madrid in 2021. “We want to back up the work of the previous editions, including the best exhibition of the current era, ‘Gus Duarte’s ‘Harmonica: Theart of the Future.” \n\n\nThe Museum of Fine Arts (MoFA) in Boston has announced that it is preparing to welcome visitors back to the institution, which was forced to close in March due to the coronavirus, by mid-August. After a temporary closure due to Covid-19, the museum reopened in March. In a statement on its website, the institution said:“We are working hard to finalize the safety and sustainability plans necessary to protect the health and safety of our guests, staff, partners, and visitors, and the health and safety of our community.”The museum will begin by reopening on August 29, following a four-week period of closure, and then will begin a phased rollout of new social distancing measures, including the introduction of a point-to-point system for visitors, new public art installations, and a redesigned upper level. The changes will be implemented in", "The next Biennial should be held at the end of March 2020. In order to ensure a fair with an inclusive and diverse audience, the show will be divided into sections and will be held in numerous locations. The exhibition will also include a residency program, a curatorial team, and a residency center. The show will be organized under the theme Autobiennial Mundi, a reference to the work of celebrated Italian artist Marcelo Cipolletta, who passed away in January 2019. In the exhibition, Bassi will present exhibitions from his collection, including “The Shape of Things to Come” (2018–19), “The Odyssey” (2019), and “Sunday in the Life of Christ” (2017), and will present the work of contemporary artists such as Jack Black, Nari Ward, Anna Atkins, and Delicate Nari Ward. Bassi, who grew up in the Venice district of Piedmont, Italy, said: “The new program will present a unique point of view of art and art history from the contemporary artist and will be a new perspective for a lot of people. It will be a celebration of the work of the artists who are currently", "The next Biennial should take place in the spring of 2021, and will draw up to 3,000 artists. The theme of the event will be “Dangerous Liaisons: Art and the Berlin Airlift” and will be a collaborative effort between the NY and CT art worlds. The annual open-air art fair will also be extended to March 3, 2020. A fee of $2 million will be given to institutions conducting exhibitions in the local area. Last year, the fair attracted thirty-three galleries from thirty-eight countries. The first round of artists announced for the biennial were Edward Hopper, Pablo Picasso, and Tadao Ando. The second round, which opened on March 3, featured twenty-two artists from twenty-six countries. The biennial’s inaugural stage will be held in the newly renovated German Embassy in the US’s capital city from March 9 to March 13. The Berlin-based NGO Artforum will stage a two-day preview of the biennial on March 20.\n\n\nThe University of Chicago’s School of the Art Institute of Chicago (SAIC) will soon begin accepting new orders for its new $250,000, three-story", "The next Biennial should be in 2020, at the end of the seventeenth century. “The project will still be at the heart of Biennial, with the new exhibition cycle and the exhibition format,” said Alexander Wirz, director of the Künstlerhaus Münster.  In order to reduce costs and to ensure the exhibition stays within the walls of the Museum, it will be moved to a different exhibition space, which will be located in the underground courtyard. The exhibition will resume in twenty-three years on September 4, 2022, with the reinstallation of the exhibition in the Museum, with the exception of the five-month period of the exhibition between January 24 and April 24, 2020. The new collaboration, called “Eternal Allusion,” will feature twenty-four works by twenty-four artists. Scholars from eighteen countries will also receive the honor of presenting the exhibition in thirty-six years.The first show to be presented in the new 132-year-old museum is an exhibition of work by American artist, theorist, and mathematician, Frank Stella, which will open on March 19, 2020. The exhibition will be followed by “Bertrand Goldberg’s ‘", "The next Biennial should take place in 2020.”The new partnership between the museum and the Williams Foundation will not only include the partnership of the biennial with the museum at large, but will also include two exhibitions. The first exhibition will focus on the history of the contemporary art in the collection. The second will be on photography and the collection. The partnerships have been announced at a time when the British Museum is facing mounting criticism over its exhibition “Monopol: The Exhibition and the Lobby.” The exhibition, which is on view until January 5, 2020, was organized by Terrie and William Gibson and Sam Shepard and was criticized by dozens of critics, including Graeme F. Jones, who said that the Museum of Modern Art “takes the very lucrative business of the exhibition to heart.”In response to the controversy, Museum director Maria Balshaw wrote in a letter to the Art Newspaper: “We are pleased to announce the partnership with the William and Mary Williams Foundation, and look forward to presenting the next Biennial at the institution in 2020.”\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles announced today that it is planning to move the two-century-old institution", "The next Biennial should focus on the history of the visual arts and science in Morocco, and should invite M.I.T. graduates to present their own works. The new exhibit area will be curated by J. Robert Oppenheim and will be inaugurated by a lecture by historian and theorist Manuel Álvarez Rodríguez-Villalba.\n\n\nThe New Museum in New York has appointed Marie Peck as its new director and CEO. Peck will take the helm of the institution in January 2020. She succeeds Jill Dorsky, who has served as the interim director of the museum since March 2019.“Marie is an ideal leader to guide our museum through this terrible crisis and to build on the current leadership’s global vision,” said Peter W. Larson, the new director of the New Museum and the board chair of the Rockefeller Foundation.Commenting on her new role, Peck said: “I’m excited to be joining the New Museum’s distinguished history of pioneering exhibitions and thoughtful curating. The museum’s vision is to take the art and science of the Americas and bring them together and into our lives. This is an opportunity to expand our relationship with our indigenous partners in the Americas", "The next Biennial should take place in 2021, and the first in 2024. The next edition will be hosted at the Museo de Arte Contemporáneo (MAS), Madrid, and will be curated by Miguel Sola.”Sola’s first show at the museum was a retrospective of the work of Richard Diebenkorn at the museum in 1998. A retrospective of the artist’s work at Fondazione Marcia in 2000, and a monographic “uncategorized” show at the museum in 2010. He also curated an exhibition of the artist’s work at the Museo de Arte Contemporáneo in 2002 and an exhibition of the artist’s work at the Museo de Arte Contemporáneo in 2007.In an essay published in the May 2005 issue of Artforum, Sola wrote: “I do not know if there are any artists who have achieved such a grandiose and imaginative articulation of their own symbolic world, a world in which the various levels of abstraction are so intimately linked. . . . The best way to explore this idea is to model the various symbolic modes as the processes that have made them possible.", "The next Biennial should consist of an exhibition of works on paper, Â’s art,” said the artist. “In reality, the real thing is a distant memory, and the future is only a shadow of the past.”\n\n\nA private collection of works by the Dutch-born, Chicago-based artist Jan-Peter de Kooymans, whose vast array of experimental conceptual sculptures\u0097including Revolution from the Chair, 1987, a cube with alternating forms of geometric shapes; Roots of a Tree, 1996, a tent-shaped work made from shredded paper\u0097has been sold at Christie’s for $110,000. This is the second time the piece has been moved: The first time, in 2009, the works were sold by the artist in a gallery in the city of Amsterdam. The new listing is for the new exhibition of the artist’s work at the Art Institute of Chicago (AIC) in May 2020.The auction house announced the winner of the auction in a post on Twitter, which revealed that the artist, who has lived in New York since 1981, had been awarded a treasure trove of works\u0097Gregorian Chanticleer, 2008,", "The next Biennial should focus on the long-term future of the museum and the institution. We invite people to experience the museum through our exhibitions, our educational programs, our events, and our special projects. We will continue to experiment with new materials and new technologies and continue to make works based on our collection. We are eager to hear from the public and are actively developing ways for people to connect with our collections.”The exhibition will be inaugurated with the exhibition “Chronological Modernity” (2019), which highlights the work of nine artists whose work examines the relationship between art and history: Anton Kern, Roy Lichtenstein, Hélio Oiticica, Paul Gauguin, and Mario Turin.The exhibition will continue with the exhibition “Mid Year” (2019), highlighting work by the twentieth-century American artists John Cage, Andy Warhol, and Robert Irwin. The exhibition will also include “Collected Histories: American Art and the Movement,” an exhibition of twenty-five works by artists of the late nineteenth and early twentieth centuries, and “In Memory of Merritt,” an exhibition of twenty-six works by African American artists in commemoration of their centenary. The", "The next Biennial should open in 2020 and will have been designed by the London-based firm Monaghan + de Villiers along with the architect Marc and the artist Alice Pidgeon.The museum will include a collection of more than 600 works by forty-seven artists and collectors in the exhibition, which will run on the first floor of the museum. The exhibition will also feature a new version of the Triple C—a triptych, a combination of three of the worksthemes in the museum. The project was inspired by the Museum of Modern Art’s acquisition of the works of the prolific French conceptual artist Georges Apostu. The museum will present the works in a new exhibition, “Beyond the Curiosities,” in 2017.\n\n\nThe National Museum of Scotland has appointed Kate Mackintosh as its new director. She will be based in London and will take up the post on January 5, 2020.“Kate has been a brilliant and integral part of the National Museum’s history, and will continue to be a driving force in shaping our future vision,” said president Frank Green. She succeeds Olivier Blain, who has led the institution for twenty-five years and will remain involved in the portfolio", "The next Biennial should take place in the spring of 2021, and is expected to open to the public in the spring of 2022. The institution will also be the site of a new exhibition dedicated to the life and work of Pablo Picasso.The auction house would not confirm or deny the authenticity of the works in question, but an auction listing on the auction house’s website, which was shared with the New York Times, listed a number of works that appear to be works that were likely snapped by the auction house.The works, which are valued at between $500,000 and $1 million, were sold at an auction held on Friday, November 3, 2017. The pieces were on display in the exhibition “Pablo Picasso: Selected Works” (2019), which was organized by the Contemporary Arts Center in Los Angeles. The works were acquired by the auction house from several collectors, including Andrea Lind, a German collector and art dealer who had them for seven years; Bernard Marzio, a collector who had them from Picasso’s widow, Clara; and German collector Peter König, who had them for a total of twenty-five years. For the first two weeks of the auction, the works were on display in", "The next Biennial should be held in March 2020. The exhibition will focus on the contributions of artists and thinkers from South Asia and be organized in collaboration with the National Gallery. European Union (EU) Enlargement Commissioner Jyrki Katainen said in a statement: “This year marks a new phase for European art and I see great possibilities for the future exhibition as the theme of a new century. This is a time of great uncertainty for the world and I thank each and every one of you for being here.”\n\n\nThe Feltrinelli Art Museum has received a gift of fifty-four works from the Italian dealer and collector Piero Feltrinelli, a leading dealer of modern and contemporary art in Italy. The works, which were purchased by the museum last September, were acquired by Feltrinelli on behalf of his son, Piero Feltrinelli II, who was awarded a commission by his father in 2012. The works have been added to the collection and are currently on display in the museum’s permanent collection, which is currently undergoing a renovation that will begin this fall.The Feltrinelli family is known throughout Italy for its extensive and ambitious acquisition program, which has included the acquisition of works by", "The next Biennial should be held at least once a year. The second will be held in the spring of 2020 and will consist of six exhibitions: Art as a Social Process: Aparitas and the museum, Art as Medicine: The Future of Medicine in the Museum, Art as Art: The Future of Art, Art as Medicine: What Remains of Art, Art as an Idea: The Future of Ideas in the Museum. The third will be in March 2020 and will consist of twelve exhibitions: Art as Medicine: The Future of Medicine in the Museum, Art as Medicine: The Future of Art, Art as Medicine: What Remains of Art, Art as an Idea: The Future of Ideas in the Museum. Art as a Social Process: Art as Medicine, Art as Art: The Future of Art, Art as Medicine: What Remains of Art, Art as an Idea: The Future of Ideas in the Museum.  Art as Medicine, Art as Art: The Future of Art, Art as Medicine: What Remains of Art, Art as an Idea: The Future of Ideas in the Museum. Art as Medicine, Art as Art: The", "The next Biennial should take place at least once a year and will be held in the city from March 4 to March 6, 2021. The 2020 edition will consist of thirty-five exhibitions including the exhibition “The Seasons of the Earth,” which will form the centerpiece of the inaugural exhibition, and will showcase the artist’s works in a celebration that will take place across the city from March 3 to March 6.The thirty-six-year-old artist was commissioned by London’s Tate to create the public art project Tertiary,” which would gather twenty-five works by artists from around the world. The project was scrapped when the Tate closed due to the Covid-19 pandemic.\n\n\nThe California Department of Cultural Affairs (CalArts) has announced that it is creating a $150 million fund to support arts and culture in California in the aftermath of the Covid-19 pandemic. The fund will be used to establish an endowment for CalArts’s Wilshire Boulevard outpost, which will occupy a 150,000-square-foot former Sears warehouse next to the Los Angeles County Museum of Art (LACMA) beginning in 2020, and will be managed by CalAr", "The next Biennial should have a premiere presentation of the exhibition “The Body & The Art of Art: Drawing From Life” and will take place at the Centre Pompidou in Paris from January 6 to January 7, 2020. The exhibition will present what will be called “The Body and the Art of Art: Drawing From Life” and will open at the Centre Pompidou on January 4, 2020. The fourth edition of the Tokyo Triennale, titled “Tokyo: the Best of May/June 2020” was announced on March 21 and will open at the Centre Pompidou in Paris in May.\n\n\nThe Museum of the City of New York (MoCA) has announced that the institution will welcome an additional 11,000 visitors to its new green-glass edifice, which opened to the public in May and has since become a landmark for urbanites and art lovers alike. The museum also announced that the museum’s existing brick building on West Twenty-Fourth Street will soon be transformed into a new public gathering place that will attract 11,000 visitors in 2020.MoCA director Matthew Teitelbaum said: “The new space will provide a great platform for the transformation of Mo", "The next Biennial should be completed by the end of the year and will be the longest exhibition of three artists in the Museum’s history. The series will run concurrently with the two previous biennials, “Behind the Scenes” (2009) and “Behind the Scenes” (2013). The exhibition will be curated by Allen Questlove, who served as the Museum’s associate curator of modern and contemporary art for nearly twenty years and is currently the founding director of the New York–based nonprofit the Contemporary Arts Center. Additionally, Biennial 3 is expected to feature work from Katsu Naito, Koji Hasegawa, and Yuko Oizumi. Contestants participating in the exhibition include Ariana Alvarez, Hao Chen, Arash Fayez, Daniel Halperin, Nima Tandon, Fernando Sánchez, Lily Tan, Laura Virgínia, Omar Veiga, Mia Wilson, and Yeesha Mendoza. \n\n\nOn Monday, the Los Angeles County Museum of Art (LACMA), the Museum of Contemporary Art (LA MoCA), and the Art", "The next Biennial should be held in the spring of 2020 and is being organized by the Museum of the City of New York and the Museum of Modern Art (MoMA) in New York City. Curated by Marc-Olivier Balsom of the Balsom, a duo that includes South African artist and curator Kimberley Fungwa, the exhibition will showcase work by seventy-five artists, including Hamza Walker, Masaoka Hiro, Hae-Song Lee, Hsu-Min Lee, and B. M. White, and will focus on the intersection of art and history, futuristicism and history, and the laboratory and the urban environment.The ten-day event will be for the public, with additional hiking, biking, and hiking excursions for the visiting public. The Biennial will remain open through March 22, 2020, in order to provide an opportunity for visitors to rejoin the artists and their communities in New York and the greater New York area.The announcement of the new dates for the biennial brought about a wave of enthusiasm from the thousands of people expected to participate in the event, many of whom were concerned about how the exhibition would be received by their families, communities, and coworkers. The public has since expressed", "The next Biennial should focus on the history and theory of the artist’s work, the medium, and the performance, and should include an exploration of the work and performance of Bob Dylan and Joan Jett. Its organizers have suggested that the thirteen-year mark be inserted between the two events. \n\n\nThe Metropolitan Museum of Art in New York has unveiled a new initiative that will allow museumgoers to donate artworks to the institution for free. Led by the artist-run museum, the program will make it possible for museums to raise funds for the Met by selling works on the museum’s website.The free online auction initiative, which will debut in 2020, will center around four themes: the Met, art, art that is art, and art that is art. For the first time, the auctions will feature works by artists who are not affiliated with the museum or the artists themselves. The auctions will be live-streamed on the museum’s website.“Like many museums, the Met is struggling with an uncertain future,” said David Katz, the museum’s director. “We are excited to show how art can inspire and change our lives and our communities through great art. We will make it possible for", "The next Biennial should be a lot closer to home for these people. It has been two decades since they have had a full-time representative to the US House of Representatives. Even if this year is a success, it will still be only the second full Congress since 9/11. To help them, Congress established the   Peace Corps, which provides direct aid, training, and other support to people in need. The program was launched to a modest extent by the Bill and Melinda Gates Foundation, the Larry and Melinda Gates Foundation, and the Kate and Jerry Raft Foundation. Since its inception, the Peace Corps has deployed more than fifty thousand people across the world and has delivered $9.5 billion in aid. The Peace Corps hopes to extend its network of approximately sixty affiliates to fifty cities across the United States by 2020. The organization anticipates that this year’s biennial will result in an increase in applications for aid from a very broad and diverse population. The biennial will be held in March 2019 and will feature works by forty artists, including John Akomfrah, Nari Ward, and Michael Krasnovski, and will feature a selection of twenty-seven works by thirty-one artists. The", "The next Biennial should take place in 2020, when the Museum of Contemporary Art Miami (MASM) will welcome the first permanent audience of the institution. The inaugural exhibition “Ammian” was organized by Ali-al-Rasheed, the deputy director and chief curator of the city’s Art Museum, and Peter Janov, the director of the Museum of Modern Art in New York. The exhibition will present an amalgamation of modern and contemporary paintings, drawings, and sculptures. The first biennial’s collection, which includes works by Jean-Michel Basquiat, Robert Irwin, and Joan Miró, will be presented at the Museum of Contemporary Art Miami in October.Ibrahim Hooper will serve as the executive director of the megastructure, which will host 18,000 exhibition days per year, from June 2020 to March 2021. According to Artnews, the megastructure will be equipped with an energy-saving solar-powered roof and will feature a 1,500-person capacity on-site gallery, which will be cofounded by Kandis Ribery and Manuela Scheire. The partnership between the institution and the CAA will provide the museum with a new venue for exhibitions,", "The next Biennial should be held in 2021, with the first meeting to take place in 2022. The panel\u0097which comprises academics, artists, and writers and includes Wu Hong, the director of the Beijing Institute of Contemporary Art; Fuyuan Wang, a senior curator at the CNA; Zhang Yaxuan, a curator at the CNA; and Ranma Sinha, an artist and curator at the CNA\u0097was asked to advise on whether the time had come for a new biennial in the summer of 2019.According to the Art Newspaper, the five-day event will include a residency program for young South Korean artists; an exhibition of new work by artists from China, Korea, Japan, Vietnam, Cambodia, and India; a performance series, a book signing event, and a discussion with Wu Hong; and a \"discussion stage\" of thirty people.Each year, the CNA hosts an exhibition of contemporary art in Seoul. The theme this year, “My Life Changed:” was chosen from a pool of twenty-three ideas. The artists selected for the residency program are: Kwon Byun, Kim Ki Sook, Kim Eun-sung, Lee Seo-kyong, Kim Tae-", "The next Biennial should focus on the history of urban planning, the digital revolution, and the influence of the digital landscape on design in a contemporary or post-modern city. “The History of Modern City Planning: From Its Origins to Its Present by Diare\n\nThe biennial will mark the twentieth anniversary of the first exhibition dedicated to the history of modern city planning at the Museum of Contemporary Art (MoCA) in New York. The show, “The History of Modern Cities,” will feature works by forty-eight artists, including Ray Dalio, Thomas Henry Abbott, Peter Bequelin, Naima J. Keith, James Lovelock, Peter Suggs, and Robert Irwin.The theme for this year’s exhibition was “The Future of Work,” and the seventy-third Biennial will take up a question posed by biennial participants “What do we want the future to look like?” The exhibition will present a collection of new photographs, sculptures, videos, and sculptures by forty-three contemporary artists and will focus on how the work of artists, as well as of their movements, will be intertwined with the history of art in the coming years.The exhibition will also present a", "The next Biennial should be held in the spring of 2020, and the seventh in the fall of 2020. The new dates are:February 25–March 7, 2020May 23–May 26, 2020June 13–June 16, 2020August 25–August 27, 2020The new exhibition will be a combination of film, video, sculpture, performance, and installation. The theme will be “Power of the Past” and will take the form of a series of interviews between artists and historians. The works will be curated by Juergen Teller, director of the Museum Freie Kunstverein Stuttgart and a former curator of Nazi Germany. The biennial will include five shortlisted artists.The program is funded by the Kaufmann Foundation for Humanities and Letters, as well as sponsors which include the Foundation for Contemporary Art, the Foundation for the Visual Arts, the Heinrich Böllischer Kunstverein Stuttgart, and the Künstler Kunsthalle Basel. The biennial is part of a larger plan to establish a new collection of art in the city of Cologne, which is home to the Museum of Modern Art and the Künstler Museums. The city has committed to building a", "The next Biennial should be held in 2022. The first festival, which took place in February 2019, was canceled due to the Covid-19 pandemic. The second festival, which was supposed to take place in June 2020, was canceled due to a fire at the event space, the Bay Area Museum of Art (BAMPFA). The third festival, which was supposed to take place in September 2020, was rescheduled for October 2021. Last year, Roscoe and Rosy, the owners of the museum, gave $10 million to the museum in order to help get it through the cancellation. The show will also look at the history of AIDS and will feature works by and about artists whose work has been previously shown in exhibitions or have not yet been presented in a Biennial. The budget for the show, which will cost $100 million, was significantly less than the $140 million that was allocated for the museum after the Covid-19 pandemic. The New York Times reports that the exhibition will likely be the last held in the museum, which sits on the second floor of the Spery Gallery in Manhattan and is a short walk from the Museum of Modern Art. The announcement of the new biennial comes on", "The next Biennial should act as a platform for a new generation of artists to engage with the exhibition, and the bodies of modern and contemporary art, through a project-based, collaborative approach.”\n\n\nNew York’s Museum of Modern Art (MoMA) is preparing to welcome visitors back to the institution following a temporary closure due to the Covid-19 pandemic. The reopening is slated for March 13, 2020, and will coincide with the Museum of Modern Art’s March on Washington.Following a review of security plans by MoMA, which is located at 775 Fifth Avenue, the institution announced that it will reopen as scheduled, with some alterations, on March 14. The reopening will also see some temporary closures in place, including the installation of a new sculpture by artist Rowan Solomon.The institution is currently closed because of Covid-19, which has made its way into five other states—California, Florida, Georgia, Maryland, New York, and Texas—and has only just begun to spread to other cities. As a result, MoMA has been working with local health officials, including those in New York City, to make sure visitors are accounted for and that screening rooms and other public locations remain closed through March", "The next Biennial should be held in 2021 and will expand upon the theme of “culture as a tool for social change” and incorporate the exhibition of art from contemporary artists and new generations of artists. The ten artists to be selected for the pavilion are: Omar Suleiman, Haidar al-Deen, Mihaly Csikszentmihalyi, Zulfiqar Sakhai, Rintoul, Alex Scriven, Karel van den Bos, and Vittorio Transtras. The first edition of the show was held in Istanbul in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed artist Katsu Naito as its next director. He is the first Asian American to lead the institution since Masayoshi Ozawa, who retired in 2018, took over the helm in February. Naito succeeds Matthias Gebbia, who was appointed director of the Metropolitan Museum of Art in New York in February 2019, and will take up the post in March.“In order to grow our roles as an institution in the city, we felt it was necessary to have a leader who is a little bit older, a little bit more experienced, and a little", "The next Biennial should be staged at the new museum on the campus of the University of Oxford (O.U.) in 2021. It will be led by curator of modern art, artist and curator of contemporary art, Lulu Craig, and will be organized with the support of the Ospreys.A jury comprising Craig, Iwan M. Birkett, and Joanne Toivatt-Keller will choose the seventy-five artists that will be featured in the exhibition. Those selected will be chosen from a shortlist of artists submitted by the public in a public vote organized by Craig. The exhibition will be on view in the exhibition spaces of the O.U. in November 2021.An open call for nominations is now open. For more information, visit the exhibition’s website.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it is canceling the first edition of the Biennial, “Award Show,” which was set to take place at the Los Angeles County Museum of Art (LACMA) in May 2019.“We are deeply concerned by the recent events surrounding the Biennial and by the evolving rhetoric around the concept of the biennial rather than focusing on the platform upon which", "The next Biennial should take place in 2022. \n [Update: August 15, 1 PM]Rebecca Soltan, the head of the Biennale, has issued the following statement: We are very pleased with the outcome of this year’s event, and are, in fact, looking forward to the next iteration of the Biennale in Dublin. \n\n\nThe Australian Museum of Fine Arts (A.M.A.) in Melbourne is working to move the exhibition “Return,” a show featuring American and Australian artists who are currently incarcerated, to its new home in the city’s Artspace at the end of August. The institution is still discussing the move with the Department of Social Development (DSD), but plans to move the exhibition to the Artspace, which is currently undergoing a major renovation, by the end of the month.The move will also involve the opening of a new online viewing room, called the Midge Gallery, which will showcase the work of twenty-six artists. The show will be presented by curator and author Veerarth Nath, whose first book is The Dark Side of the Moon: The American Prison Industry (New York: Palgrave, 2015).“The", "The next Biennial should be held in 2020. “The concept of the exhibition is a response to the current global crisis,” said Jean-Pierre Galanin, president of the Grand Prix de l'Art et l'Histoire. “It should be a space for reflection, a place for reflection, a place for reflection.”\n\n\nThe Qingdao Art Biennial released the first photos taken by the artist-run television network and its Shanghai studio, W秀括會, to the public on Monday. Titled 明日朝 (Day by Day), the program, which airs on the independent Shanghai network 讓视讝, features photographs of thirty birds that appear in the studio and the actress Miao Hua, who portrays the character Zhang Yaxu in the film  Xiu Xiu Xiu.The program was inspired by the artist Zhao Yilin, who is best known for creating works that showcase his interdisciplinary style, often using photography to reflect on the human condition. The collaboration between the artist and the Townshend Museum of Art in Beijing (TMWA) was meant to give the public a glimpse into the studio", "The next Biennial should be in the autumn of 2021. For the past twelve years, the museum has staged the fifth edition of the event, which is held in the same building as the Kelner Art Museum, in partnership with the Los Angeles Public Library System.The 2020 exhibition will be choreographed by a team comprised of B. J. Cooper, director of the university’s Department of Art, Design, and Journalism; Joanne Achenbach, artistic director of the museum; and artist Luke Dash, a visionary and talented Los Angeles native who currently serves as a member of the Los Angeles County Arts Commission.“The need for a new architecture- and design-oriented biennial has never been more urgent,” said biennial cochair Richard Armstrong. “The Los Angeles County Museum of Art is joining forces with the LACMA Museum of Art, the LA Architecture Foundation, and the Art Institute of Chicago to create a series of buildings and spaces that reflect the urban fabric of Los Angeles.”The exhibition’s inaugural edition, “The Architecture of Life,” was staged in 2004, and was organized by the architects Herzog & de Meuron. The exhibition included the works of Charles A. Birnbaum,", "The next Biennial should be held in the autumn of 2020. The show will include an extended exhibition of works on paper, which will be organized in conjunction with the biennial, and will be the first time that Biennials have been staged in Milan and Venice.\n\n\nNow that the United States and Europe have lifted sanctions against Russia over its military incursions into Ukraine, the European Union announced today that it plans to open more than 1,000 new economic zones in Ukraine in the coming months. The initiative, which aims to spur economic and trade ties between the two countries, was prompted by Trump’s November 8 presidential victory and the subsequent strengthening of the government in Kiev. The plan was part of a $4.8 billion package of sanctions against Russia that was approved by the EU, US, and UN Security Council in March.The package also includes a travel ban and asset freeze bill that will isolate Russia for a minimum of two years and a set of trade restrictions that will severely crimp the Russian economy. The sanctions were designed to punish Russia for annexing the Crimean peninsula from Ukraine in March and for supporting separatist rebels in eastern Ukraine, which has since turned the conflict in eastern Ukraine into a full-scale civil war.The EU and US plan to", "The next Biennial should be held in 2021 . . . in collaboration with the commissioners of both the 2017 and 2020 Biennials, and the art and architecture historians from both the exhibitions. I am eager to collaborate with the commission.”\n\n\nThe Metropolitan Museum of Art in New York is planning to double the size of its collection by moving several hundred works by American artists into storage facilities and opening them to the public through the institution’s new underground parking structure. This is part of a plan to conserve as much of the landmark 1970s building’s original neoclassical design as possible and is intended to reduce the museum’s environmental impact by replanting more of the building’s original landscaping.The plan is part of a $3 billion overhaul of the museum, which is currently undergoing a $400 million facelift. The redesign aims to improve visitor experience, conserve the museum’s collection, and integrate the museum into the city. The overhaul will also increase the museum’s capacity by promoting more public activities and increasing the museum’s reach. The renovation is slated to complete by 2021.The renovation will also include the redesign of the museum’s surrounding urban setting, including the entrance, the elev", "The next Biennial should be held in 2021. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than twenty-five works by twenty-six artists in exchange for their work, which was originally slated to be included in its upcoming exhibition “The Field of Vision: American Art After the New Deal,” but was postponed due to the Covid-19 pandemic. The work was originally part of a larger exhibition that was to be held at the museum in late March. The exhibition, titled “The Future is Present: Art and Politics in the New New Deal,” took place at the institution from March 19 through March 21, 2020.The donation includes three paintings by artists who were selected for their work for the show: Audre Lorde, Robert Irwin, and Evelyn Waugh. The three works are titled The Future is Present, a comparison of the United States and Russia, and The Machine and the People, a work about a future without people. The works will be presented in the exhibition “The Future is Present: Art and Politics in the New New New Deal,” which will be on view until February 22. \n\n\nThe Museum of", "The next Biennial should take place in Dubai in 2021.\n\n\nIn a major blow to the global movement of art, the Supreme Court of Canada has ruled that the lawfulness of the sale of artworks is in jeopardy following a legal challenge by a group of artists who were backed into a legal case by a small group of dealers in Montreal.The case, brought by the Montreal Museum of Fine Arts (MMA), involved some one hundred works by a collection of works by the influential British American artist David H. Koch, who died in 1993, and involved a dispute about whether the works could be considered a 'monetization of life and death—a likeness of the artist—and therefore, in violation of the Canadian Human Rights Act.“The court found no evidence that the museum had established a credible risk of any kind of abuse or exploitation of the work or that there was any reason to believe the museum would be harmed by the sale of the works,” said Justice Jean-Jacques Felix, who ruled in favor of the museum.A spokesperson for the Supreme Court says that the court will consider whether the Supreme Court’s decision was correct and will remand the case for a hearing that could last two weeks.\n\n\nThe museum has", "The next Biennial should be held in the autumn of 2020. “I look forward to working with the galleries and audiences of the exhibition, which are already powerful enablers for the exhibition,” said the curators Flores and Ooi. “In the current climate, in which biennial projects are often framed as a means to combat climate change, the exhibition ‘In the Path of Life’s challenge is to show that life is full of meaning, nourishment, and joy, and that we can become more, not less, connected to the world around us.” \n\n\nThe British Museum announced today that it is planning to move the exhibition “Tropical Peace: The Evolution of an Island,” which has been held in Qatar since 2009, to London in 2021. The move follows the museum’s decision to shutter the institution, which has previously staged works by artists such as Jiraudina Narsia, John Murteau, and Robert Irwin, in 2022 and 2019.The institution will also receive $1.1 million from the sale of the art, which has been sold for a total of $7 million, in support of renovating the museum�", "The next Biennial should commence in March 2020 and will be led by illustrator and designer Patricia Salo, curator of modern and contemporary art, and curator of art history. Salo will also curate a special exhibition of works by Iván García-Álvarez-Montano, an American avant-garde artist, and be presented with the Grand Prize for Contemporary Art at the inaugural event, which will be held at the LACMA Museum in Los Angeles in September 2020.  The full list of participants is as follows:United StatesA.A.W.A.W.N.A. (American Women Artwork)International (Art Committee)Art Archives InternationalArt Gallery International (AGI)ArtforumArtforum’s Color Viewing RoomArtforum’s Gallery1Artforum’s Media & WebArtforum’s Performing ArtsArtforum’s Official HomeArtforum’s Official WebSiteArtforum’s Official BlogArtforum’s Official WebsiteArtforum’s Official BlogArtforum’s Official WebsiteArtforum’s Official BlogArtforum’s Official BlogArtforum’s Official Blog Artforum’s Official Blog", "The next Biennial should focus on our present moment; on what we might like to be; on how to live our lives. In the next edition we should be able to say that we are not alone. We should be able to share in the wonders and wonders of this world.\n\n\nAn exhibition at the São Paulo Bienal staged by Brazilian artist Luis Maurizio Pozuelo and the family of the late artist and designer Juliana Mendes-Chengues, a Brazilian-born, the wife of the late Brazilian artist Alfredo Cesar, was canceled this week after it was revealed that the event would not proceed.Founded in 2004, the show\u0097which featured works by forty-six Brazilians, including Luiz Paulo, Luiz Henrique de Souza, and Marcela Lopes, and featured work by sixty-seven artists from eighteen countries\u0097was created to celebrate the legacy of the late artist and designer Juliana Mendes-Chengues.The exhibition was slated to take place in late April and was supposed to run for twelve weeks. However, due to the ongoing health crisis in Brazil, the opening of the show was pushed back to May and the cancellation of the show has proven to be a", "The next Biennial should also include an exhibition of work by shortlisted artist Kilian Johnson, a leader of the Black Lives Matter movement, and a program that will include readings, performances, lectures, workshops, and performances. The sequel, “Beyond the Frame: Reframing the Body,” will be held in October 2020. Artforum is currently accepting nominations for its 2020 biennial. Expect the next edition of the award to debut in January 2021.\n\n\nThe British artist Jenny Waldman, whose body of work combines sculptural abstraction, surrealism, surrealist-inflected performance, and meditative imagery, died on January 25 at age eighty-eight. Waldman’s work—which often grapples with questions of mental health, memory, and the body—has been collected by the Museum of Modern Art in New York since the 1970s; this is the first time she was the subject of a major retrospective. In 2013, Artforum was awarded a Platinum Lion at the Venice Biennale for the first time.“The Body in Art, ” edited by Jody Rogerson and Joan Jonas, was awarded a 2017 Venice Documenta, an exhibition that", "The next Biennial should be held in 2021, and the date of our inaugural edition will be taken into consideration.\n\n\nThe Museum of Islamic Art (Museum Al-Madina) in Tehran, which is currently closed due to the pandemic, has released the following statement regarding the coronavirus:In a statement published on Wednesday, the institution said: “The museum is currently preparing for the coronavirus and is working hard to implement preventive measures to minimize the risk of illness and death. We are in touch with the relevant authorities to make sure that we are doing all that we can to protect the health of our guests, staff, and visitors.”The statement continues by saying that the museum is taking all necessary measures to prevent the circulation of the virus and that the museum is closely monitoring the developments in the health of all affected countries.\n\n\nThe Metropolitan Museum of Art in New York has received a gift of twenty-six works by Maurice Brevard. The works, which are part of a series that includes works by renowned artists such as Robert Irwin, Robert Louis Stevenson, and Edward Hopper, were donated by Lorenzo and Beverly Adams, the longtime owners and organizers of the famed private museum. The museum also received a stunning twenty-second-", "The next Biennial should take place in 2021 and will be co-organized by the Haus der Kunst, the Institute for Biennial Research, and the Institut für Kunstkräfte. Its theme will be “Art and Society in the Eighteenth Century,” and will focus on the period from the fall of the Berlin Wall in 1989 to the beginning of the second season of the Biennale, which will be held in the city of Cologne in 2021. The exhibition will be organized as a collection, with works in various stages of development, including a celebration of the exhibition “The Death of Art: From the Fifth to the Eightieth Century” (2019–2020). The show will also include a retrospective of the work of Mannfred and Marion Biennale Steiner and will present the work of the artist-in-residence, Michael Oehlen. Enlisting the help of the artist-in-residence, Peer Schirmer, the interviewees will be asked to discuss the exhibition, which was organized by the Institute of Contemporary Art and Dietrich Eckart-Holst, the nonprofit organization that organizes the Biennale, and will work together to produce a grand finale.The exhibition", "The next Biennial should be held in August 2021. The museum will be redeveloped and expanded as part of the long-term plans of the Museum of Contemporary Art (MoCA), New York, to open a new, fully functional building on Madison Avenue in the fall of 2021.  \n\n\nArt historian, curator, and educator David Breslin, a renowned critic who taught at the Philadelphia School of Art and at the University of Chicago, died on January 4, 2021. He was seventy-four years old.Breslin was born in New York City in 1941. He attended the University of Pennsylvania, where he studied with Frank Stella, before transferring to the University of California, Berkeley, in 1952. He began his career as a critic at the Philadelphia Inquirer and continued his career as a master of the history of art curator at the Museum of Modern Art, where he was head of the American Moderns section from 1976 to 1982. He also served as head of the Center for Australian Modernism, where he oversaw exhibitions and publications in both 1950 and 1955.In 1967, Breslin began his writing and lecturing operations at the Museum of Modern Art, where he devised a system that allowed artists to share information about their"]