["The next Biennial should focus on creating a new kind of public space to hold exhibitions and events, which can be a platform for discussing the art and people that live and work here’s world. “One of the challenges for the Biennial is that it is an international organization, and it is a very large organization,” Paulo Leal, president of the newly created National Museum of Contemporary Art, told The Art Newspaper.During the 2017 event, which took place at the Miriam and Ira D. Wallach Art Museum in Westport, Connecticut, the museum received almost 3,500 full-time and part-time visitors, and the gallery sold more than 3,000 works. The museum also announced the opening of the Uncas Faculty Gallery, an annual free public event that will run March 26–March 28, 2020. The gallery will be located in the Henri Bulté–designed building on the first floor of the museum, which was converted into a space for education programs and residencies for students attending the school. Originally scheduled for February 2019, the exhibition was pushed back to March 21–March 23, 2020, following an emergency fund set up by the city of Hartford. The city also set up a special fund for art", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to shift its programming in an effort to reduce overcrowding at the museum. According to the Los Angeles Times, the museum’s board of directors voted to suspend the institution’s annual gala on September 28 and move the event online. The decision was made after the museum held an emergency committee meeting on September 27 and found that the gala was not meeting its obligations under s. 8(f) of the Americans with Disabilities Act (ADA), which prohibits discrimination on the basis of disability.“The board has taken the appropriate action necessary to protect the health and safety of our staff, guests, and the public,” said board chair Larry Hanna. “We will continue to monitor the events in real time as we implement changes, and feedback from the public will help shape the future programming.” The committee, which comprises Hanna, curator and arts advisor Alice Corrigan, and board president Victor Davis Hanson, voted unanimously to approve the move. On Wednesday, the board unanimously voted to rescind the decision.The museum has faced mounting pressure to address its overcrowding crisis since the coronavirus was first reported in", "The next Biennial should take place in Tokyo in the autumn of 2021, and it will be hosted by the Tokyo Metropolitan Museum of Art (the museum) and the Sapporo International Film Festival (the festival). The upcoming edition of the Biennial is comprising events that include the exhibition “Conceptual Art: Theory, Performance, and the Arts ” at the University Museum of Contemporary Art, Tokyo (UMTA) in the autumn of 2020, and the first public retrospective of the work of Ilse Reimer, the German curator whose work is currently on view in the exhibition “From Model Art to Science: A Super-Conceptual History.”The inaugural edition of the Biennial was held at the Museum to the Museum Shanghai in the fall of 2018, and the inaugural edition of the exhibition “Ishigami Takashi” was held at the Museum to the Museum Tokyo in November 2018.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Tanya Bonakdar as its new deputy director. Bonakdar comes to the institution from the Museum of Modern Art, which she also leads. She succeeds James A. Farley, who has served at the museum for", "The next Biennial should take place at a location that can sustainably support a creative community of over 300,000 people, and should be organized with the help of a group of experts. The theme should be “constant change,” and the exhibition should be centered around artistic experimentation, the artist−public, and a vision of the future. “Awareness is a powerful force for change,” said Simon Leder, the executive director of the Metropolitan Museum of Art.The 2020 theme, “Art and Technology,” is inspired by the 16th-century philosopher Immanuel Kant’s famous statement: “Man is not a machine, but a complex machine, in a complex machine something is created by a complex operation, something is reduced to the machine, things are made by a complex operation, so that, for the first time, the whole of art is made by a machine.” The work of a team of international artists, designers, art historians, and technologists will comprise the centerpiece of the exhibition.Artists and technologists who participated in the workshop include Daniel Groth and Thomas M. Martin; Günther F. Nießenreich and Wolfgang Reitgen;", "The next Biennial should be held sometime between the years of 2020 and 2021. The International Council of Museums (ICOM) is organizing a series of exhibitions, symposia, and other events at its headquarters in London that will focus on the latest advances in art history, housed in museums and centerpieces across the United Kingdom.The exhibition, titled “A History,” will feature more than 120 works by 150 artists and will be organized in a time-based format. The inaugural exhibition was held in 2017 and included work by 35 artists. “The theme of the exhibition is the history of the art from the Tudor to the present day, and the influence of artists and architects on art history,” a statement from the exhibition said. The fourth Biennial, titled “Universal History” will be held in 2021 and will feature work by twenty-eight artists.\n\n\nAhead of a major exhibition of work by American artist and theorist William S. Burroughs at the Museum of Modern Art (MoMA) in New York next month, a group of artists and activists are urging the institution to postpone the event, which is slated to run from March 19 to March 20, 2020. The demonstrators are concerned that the", "The next Biennial should aim to achieve a dual objectives of advancing the art of the Spanish Americas in the same way that the Biennials of Paris and Barcelona have done, but with a stronger institutional focus on research and a greater emphasis on the intersections of art and geography as well as on the evolution of ideas about art and politics.”\n\n\nThe National Art Museum in Washington, DC, has added three new works by African American artists to its collection. Stephanie Alhadeff, who was born in Washington, DC, and raised in Harlem, New York, and Kansas City, Missouri, now represents Mississippi. The museum is the first institution in the country to host three works by Alhadeff, who was commissioned by the city of Jackson, Mississippi, for its New Orleans branch. Alhadeff, a native of North Charleston, South Carolina, was chosen for her work The Painted Ladies, 1953, and The Painted Town, 1953, both of which were created on a small scale. Her work Astrid Steinbach, 1967, and Astrid Sternberger, 1979, both from the Deep South, are also currently exhibition-listed.The museum also unveiled three new works", "The next Biennial should be held in 2021. Commenting on the upcoming event, Konrad Bader, director of the museum in Zurich, said: “The theme of the Art of the Real will be the evolution, in time, of the process of creation, and we will strive to present it in such a way that it can continue to function as a source of inspiration and inspiration for students.”\n\n\nThe Museum of Contemporary Art (MoCA), California, announced today that it received a gift of over seventy works from the Los Angeles–based artist Kiki Smith. She is the founder of the eponymous artist-run space, the LACMA Renaissance, and is currently a cofounder of the Los Angeles–based nonprofit Contemporary Artists United.“I’ve long believed that the best way to promote the arts in America is to support artists directly,” said Smith, who established the nonprofit in 2003 to foster collaborative projects between artists and museums. “The gift of seventy works by Kiki Smith is a clear signal that I’m still true to this vision.”Smith is one of several LA–based artists who have donated works to the museum. The works were recently featured in “Tit", "The next Biennial should be held in 2020. The biennial will consist of twelve hundred works, which will be curated by the artist-in-residence, the artist-in-chief, and the artist-subject. Among the works that will be on display throughout the exhibition are work by the artist-in-residence, a selection of his paintings and prints, and two works by Christina Aguilar. The biennial will also be an exploration into the relationship between the artist and the West and will showcase the work of seventy-two other artists.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Andrew J. Courtley as the new executive director of the institution. Courtley comes to MoMA from the Metropolitan Museum of Art, where he has served as its associate curator of contemporary art since 2011. He succeeds Ann Corrigan, who departed in the spring of 2021 to lead the Los Angeles County Museum of Art (LACMA), where she would remain for the next three years.“We have known Andrew for years, and he has been a leader and champion of contemporary art in New York for more than a decade,” said Ann Corrigan. “He has been", "The next Biennial should be ready to go by March 19. The museum will also begin welcoming visitors from March 18 through March 20. At its inaugural event in Nanjing, China, in March 1989, the art traveled to Paris and was exhibited at the Museum of Modern Art (MoMA), New York, and the Museum of Modern Art in London. The gallery will hold the first exhibition of work by the Shanghai-based artist Kai Han in the United States in 2020. “The current exhibition is a great success that has provided a platform for artists to present their work in the Chinese city of Nanjing,” Angela Chauvin, the director of the Nanjing Art Museum, told the Art Newspaper. “In addition, the exhibition has given a lot of artists a platform and a platform to make their works in the city, and [has] touched a nerve both with the foreign and Chinese art communities.”The exhibition will be held at the Nanjing Art Museum until at least June 1, 2020. The Biennial’s inaugural exhibition, “Jinxiang Xiāo” (2017), comprised ninety works by seventy artists, including the Chinese artist Xue Qing, whose work is based on an ironic", "The next Biennial should take place in the autumn of 2021 and will be hosted at the newly renovated Museum of Contemporary Art (MoCA), the former home of the Chicago Architecture Biennial. Set to open in 2022, the exhibition will include work by seventy-nine artists and publishers, including Andy Warhol, David Adjay, Kelsey Johnson, David Lynch, Stephen Fry, and Cindy Sherman.The exhibition’s inaugural iteration, “Awareness and Audacity,” was held at the Whitney Museum of American Art, New York, in 2016. The following year, the Minneapolis City Council approved the purchase of seventy-three works by thirty-eight artists and other cultural institutions.The Biennial’s first edition, “From Gas to Snow,” exceeded its initial goal of $150,000 by more than two hundred percent. In order to secure the funds for the event, the Biennial hired Nila Ihab, who manages the annual Federico Solmi–designed Biennial for Women; Angela Palma, who curated the inaugural edition of the Biannual Art+Bicycle Show; and Laura Siff, the former director of the Robert De Niro Theater in Harlem.", "The next Biennial should organize a panel discussion with artists and experts to address the current state of contemporary art and the future of art. “We are now witnessing the first phase of the radical transformation of the exhibition, which is the change of the main format,” said Sixto Faria, director of the Corriera Museum of Art in Milan. “The LACMA Biennial will play a key role in realizing this vision. The project of creating a new platform for art and exploration of art will be the signature project of the exhibition.”The platform will be housed in a two-story, twenty-fourth-century Italianate Revival brick building, which will be built in a country-owned, reasonably restored, colonial-era industrial site in the city of Corriera, in northern Italy; will be inaugurated by a solo exhibition of work by Milan-based artist María Azar; and will consist of a series of self-portraits, photographs, and sculptures by the forty-three-year-old teacher and artist, Elena Spallana, one of the leading figures in the city’s burgeoning art-world scene.The inaugural exhibition will feature work by fifty-five artists, including Frank Geh", "The next Biennial should focus on the transformation of San Francisco into an energy hub that is recognized as embodying the spirit of the city and is attached to its future. We will also explore the history of the city and its influence on the city during the twentieth century.\n\n\nThe New York City Department of Cultural Affairs (DCLA) is revamping its historic district plan, which has guided architectural design for more than a century, to include more public art and cultural attractions and to increase the city’s tax base by more than $1 trillion over the next decade. “As we continue to reimagine the future of New York City, the DCLA has always employed a balance between accessibility and affordability to help shape local, regional, and national art and cultural experiences,” said cultural affairs commissioner Timothy Rub, who added that the plan will now reflect the changing needs of New York City residents.Rub said that the plan will address overcrowding problems, foster community engagement, and serve as a blueprint for how the city will move forward with the advent of the New York–Queens Rail, a new subway line that will connect Long Island City, Queens, to Manhattan, through an extension of the Blue, Green, Orange, and Purple Lines", "The next Biennial should be held in 2022. \n\n\nTobias Wikström, who helped turn the Milne-Palais de Tokyo into a Museum of Modern Art (MoMA) in New York, has died at age ninety-two. The Danish artist, who was born in Copenhagen in 1940, also helmed the renovation of the Uffizi in Milan and launched several other successful commissions.Born in Nuremberg in 1948, Wikström studied art history at the University of Copenhagen and the Academy of Fine Arts in Vienna before moving to the United States, where he studied with Alfred Siskind at the University of Chicago. In the early 1960s, he moved to New York, where he found the city was ripe for a museum. In 1964, the same year that MoMA constructed the Pavilion, Wikström created the first abstract installation at the Uffizi, a series of films that explore the relationship between philosophy, cinema, the arts, and the self. A trip to the museum was the catalyst for the creation of the Museum of Modern Art (MoMA), which opened in 1967 and moved to the fifteenth-floor viewing platform in 1997, and the Museum of Modern Art (MoMA)", "The next Biennial should focus on making the greatest contribution of its art to the public good through a long-term vision; a long-term plan for the purchase of the art and its collection; and the selection of the most outstanding specimens in the Biennial. The programme should encompass a tribute to the past and a celebration of the past, as well as a reflection on the future of art and architecture. “I am honored to be able to begin this new chapter with an open and inviting exhibition,” Lorenzo Albanese, director of the Milan Biennale, said in a statement. “We will be able to celebrate the art of the twenty-first century, the artists who are shaping it, and to discover the future through their work. I believe that this year will be an occasion for the twenty-first-century to speak as clearly and as clearly as it did in the twenty-first century to another twenty-first-century.”The competition committee, chaired by Bruno Borthwick of the London-based firm Borthwick & Partners, which will be responsible for selecting the twenty finalists from a pool of five, consists of five curators, three artists, two architects, one curator and a curator. Each representative will", "The next Biennial should be up and running by April 2020. The first Biennial of Brazilian Art (1948–1950) will open in April 2020 and last for twenty-four weeks. The next Biennial of Chinese Art (1953–1959) will be held in March 2020 and will run from March 21 to March 28. The next Biennial of Indian Painting will be held in February 2020 and will run from February 27 to February 28. The next Biennial of Indian Sculpture will be held in January 2020 and will be held from January 21 to January 27. The next Biennial of Indian Architecture will be held in March 2020 and will run from March 16 to March 20.\n\n\nThe Hueys Foundation has received a gift of twelve new works from artist Stanley Donwood. The donation includes works by Tanya Cooper-Ho, Zina Saro-Wiwa, Peter Chu, and Robert Rauschenberg. A selection of the works will be presented at a biennial of the artist's art at the National Gallery in London next month.“Stanley Donwood has been a generous supporter of the Hueys Foundation for many years, and we are hugely proud to be able to present his gift to them this", "The next Biennial should be held at the Museum of Modern Art, as the previous two iterations were staged at the Metropolitan Museum of Art in New York and the Museum of Modern Art in New York, respectively (2015 and 2017), with the exception of the 2017 edition, which was held at the gallery’s Manhattan location. The event will also have a live performance by the New York-based, New York–based art collective Metamorphose, as well as a free preview day on Thursday, March 14. The 2019 iteration will also be a farewell exhibition, with the last show being the eighteenth-anniversary exhibition of the Metropolitan Museum of Art in New York.\n\n\nGlobal New York has announced the fifty-third edition of the annual NYC Art + Creative Exchange, which will celebrate artists from around the world and will take place at Art+Cup, an ambitious new space, located on 39 West Twenty-Fourth Street, in Midtown Manhattan from March 16 to March 21. Named after the venue’s iconic glass pyramid, the triennial will also include a series of installations, performances, lectures, workshops, tours, and residencies.“The recent wave of cancellations and postponements around the world has made these dates seem distant", "The next Biennial should be held at an opportune time for the UK as we re-emerge from a major COVID-19 outbreak in Wales. The exhibition should be an opportunity to show the work of the artists in a way that is appropriate for their respective audiences. I look forward to working with you and the team to deliver a memorable exhibition for the UK in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Amy S. Armendar, who currently serves as chief curator of contemporary art at the gallery, as its next director. Armendar will take the helm from Sarah Loyer, who was promoted to director of photography at the institution in January 2019.“After an extensive and thoughtful search, Amy concluded that she is the right person for the role of director of MoCA,” said Gloria E. Caccia, who has served as interim director of MoCA since May 2019. “I’m passionate about the collaboration and collaborative nature of MoCA’s collection; the visual impact of our work in the city; the impact of our works in the public sphere.”Armendar will begin her new role on July 1. She succeeds Margaret L. Bassett, who", "The next Biennial should be held in 2022, a year before the Olympic Games. The commission’s second edition will be held in 2023.  The commission’s third edition will be held in 2026. The commission’s fourth edition will be held in 2029. The commission’s fifth edition will be held in 2031. The commission’s sixth edition will be held in 2035. The commission’s seventh edition will be held in 2037. The commission’s eighth edition will be held in 2041. The commission’s ninth edition will be held in 2047. The commission’s tenth edition will be held in 2048. The commission’s eleventh edition will be held in 2052. The commission’s twelfth edition will be held in 2055. The commission’s twelfth edition will be held in 2056. The commission’s thirteenth edition will be held in 2059. The commission’s fifteenth edition will be held in 2065. The commission’s fifteenth and thirteenth editions will be held in 2069 and 2077", "The next Biennial should take place in 2020 and will be a mix of public and private exhibitions, the installation of works on the premises, and the exhibition of the new works. Art historian and curator Stewart Lee, who curated the 1967 exhibition “Speech and Art” (1967–68), said: “This is a magnificent opportunity to return to the original exhibition in a wonderful setting.” The 2017 exhibition “The Painted House: The Art of Wind & Rain”—a collaboration between the museums of the University of California and the National Museum of China—opened in Beijing last week. The show, which featured works by artists such as Alfred Sisley, Maira B. Cooper, and Thomas Cline, was organized in partnership with the National Museum of China and the National Museum of Modern Art in Beijing.\n\n\nThe Museum of Contemporary Art Los Angeles (MCA) has announced that it is planning to open a permanent collection space in the city, which recently hosted the first major retrospective of the iconic early 20th century American painting The Structures on March 21. The museum will introduce a new form of retailing in the city, the Museum Place, in an attempt to capitalize on the rapidly", "The next Biennial should focus on the history of art in the gallery, and the next on the digital art world, and the last on the history of art in the museum. For the first time in its twenty-year history, the weekend will feature an exhibition of work by new works by emerging and established artists. The 2018 event was organized by the parent organization of the Festival, the Berlin-based Foundation for Contemporary Art (Bund), as part of the Bauhaus/Frankfurt program. The event will be held at the Bauhaus in Karlsruhe in the city of Baden-Baden from March 22 to March 26. “We are delighted that the Berlin-Bund will be represented in the novel and the museum, which represents a new chapter in the history of art in the city of Berlin,” said Hans Joachim, director of the Bauhaus.\n\n\nThe British artist Richard Asser, whose surrealist sculptures combine painterly sensibility and scientific rigor, has died at the age of eighty-three. In his own words, Asser “presents a lucid and unambiguous view of the world as it is, and as it should be.” He was", "The next Biennial should take place in 2020 and will focus on the history of the museum from the Portuguese colonialist era to the outbreak of World War II. “In the beginning, the museum was the most important institution in the city, a monument to Portugal. But when the war broke out, things changed.” The museum closed in 1942 and didn’t reopen until after the outbreak of Korean War II. The museum’s collection comprises more than 4,500 items dating from the nineteenth century to the 1950s.\n\n\nThe Baltimore Museum of Art (BMA) is pushing back against plans to tear down the museum’s permanent collection of nearly two hundred nineteenth- and early-century works by American sculptors in an effort to save the building that houses the institution’s permanent collection. On Thursday, the museum received a cease-fire ultimatum from the Baltimore City Council, which said it would remove the 17th-century American landscape work The Mound and the Mural and the Mural of the Future, both of which were created by artist Frank Gehry, from the building’s grounds in an attempt to protect the collection.The caving in of architectural regulations by the city is one of a", "The next Biennial should be held in 2020.\n\n\nUnseen, the London-based New York gallery founded in 1987 to promote the work of contemporary artists, has announced its representation of American artist Matt Hull-Reeder. The artist, who is best known for his cirque and video art, was selected from a shortlist that included Sarah Sze , Michel Assante, Sheri Baron, Agnes Martin Scorsese, Larry Stilson, and Austin Wintory. The biennial will be held at the Art Institute of Chicago (IAC) in Chicago and will include twenty-three works.The exhibition, which will be hosted by the American artist Matt Hull-Reeder, will mark the first time the artist has appeared at the Biennial. The exhibition will also include photography works by his contemporaries Abel Lazard and Ed Moses, as well as works by artists from abroad. The show will be curated by artist-in-residence Elissa Gorchovitz.“Hull-Reeder poses a challenging question: Is it possible to communicate real life through art? I am thrilled to welcome Hull-Reeder to the project,” said Gorchovitz. “His", "The next Biennial should take place in the spring of 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) has sent a letter to the City Council reopening the museum in late March, following a delay of two months due to Covid-19. The letter, which was obtained by the Los Angeles Times, reiterates a request for the city to divert some of its annual funding of more than $10 million to offset the financial impact of the coronavirus, which was first reported on September 11, and says that opening in March would \"seriously compromise the health and safety of Los Angeles County residents.”Although the letter does not call for the city to cancel the March event, it does say that the museum would be able to present an alternative in March, and that the city would receive its full monies from March 19 to March 28.“We acknowledge that February 28 is no longer feasible,” the letter reads. “However, as we have stated previously, we believe that the best way to permanently and effectively address this crisis is to open in March. We believe that this is the best possible time to reevaluate our programs, our staffing levels, and our operations, and we believe that this is the", "The next Biennial should take place in 2021, and will be dedicated to the life and work of artist and writer H. G. Wodehouse.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is moving forward with its planned reopening, following a major overhaul of its building, designed by the same firm that designed the contemporary art museum in New York, despite its ongoing failure to make its opening date. The museum will reopen in the spring of 2021, and will host two exhibitions a year.“We are thrilled to be reopening, as we knew it would be,” said Mark Rubenstein, the director of the museum. “The museum’s current building, with its contemporary art collection, will continue to thrive and flourish as a major cultural destination in Los Angeles for years to come. We are confident that we will be able to open soon and continue to present a wide array of contemporary art exhibitions and events in the spring.”The renovation of the museum included the construction of a new waiting area, a new public art garden, the construction of a new auditorium, the redesign of the museum’s courtyard, and the addition of more than 400 rooms to its current collection, which comprises works by", "The next Biennial should be held at the Art Institute of Chicago, which recently announced its intention to move forward with a redesign and construction of its new building with a new design, a new funding source, and a new collection; the museum should also be open to the public for free during the construction of the new building.The institution currently has a permanent collection of some 330,000 works, which it began collecting in the 1970s. It also has a 2,500-piece collection of ancient Egyptian art, including the works of Tutankhamun and the Red Pyramid. The museum is planning to construct a new exhibition space for its collection in the city, known as the Gallery, to allow for the exhibition of the works in the new building. Art Basel is attempting to open a new chapter at the Boston Art Museum in 2021. The news comes amid reports that the institution will be expanded to host two exhibitions a year, bringing the museum closer to the Boston-New York metropolitan area, which has a significant presence of American art.Commenting on the partnership, Biennial director Elena Cossu told the Art Newspaper: “The future of art in America, and all of its museums, is at stake. We are excited that the young curators", "The next Biennial should take place in 2020. For the past decade, the three-day exhibition has been held at the SculptureCenter in Manhattan. “Our vision for the Biennial was to remain true to the original mission to honor the best of contemporary art,” said Russell. “The new Biennial will continue to advance the rich legacy of the museum. The new Museum will be an essential destination for visitors from all over the world. And a worthy successor to the Grand Central as a cultural and cultural hub in the heart of Manhattan.”The SculptureCenter will continue to operate under its current management, which was appointed by the current mayor, Michael Bloomberg, and the current governor, Andrew Cuomo. It will also continue to host free public programming and will be able to use the proceeds from the sales of works for its current exhibitions.\n\n\nThe National Gallery of Art in Washington, DC, is facing a lawsuit from a group of artists whose works were featured in the museum’s “Blue Period” exhibition. The exhibition, which was organized by the nonprofit National Artists’ Association (NPA), and featuring works by thirty-seven artists in its “Blue Period” section, was held at", "The next Biennial should have a new ground-breaking exhibition that will open in 2021. A special exhibition of the work of a select group of artists will be staged, with the theme \"Theater of Resistance.”\n\n\nThe Museum of Fine Arts (MFA) in Miami Beach has announced that it is raising funds for collections that are on indefinite loan to the institution. The bulk of the funds will go to the collection of Carlos Marcellino, who is best known for his pioneering mural work, The Hurts, which spans five stories and is believed to have been constructed in 1925. The work, which is located in the Art Deco, Plano, and modernist Renaissance style, was one of several “lost” works by Marcellino, who was a member of a group that included Mina Saunders, Agnes Martin, and Tracey Winters.The organization set up a special fund to help with the payment of Marcellino’s outstanding medical bills from the late 1990s through last fall, when it closed to the public. The six-figure sum was derived from a combination of loans, sales, and donations, and the funds will go toward paying off the debt. The museum is expecting to have full", "The next Biennial should take place in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Boston, has released the list of seventy-eight artists who will participate in its next iteration. Titled “Falling Into Light” and curated by Carlo Cipolletta, the exhibition will run from April 19 to April 20, 2020. The seventy-eight-person jury comprises artist and curator Andrew Wiles; architect and professor Judith Anagnos; and artist and curator Mark Schierli.“The show is a reimagined version of the show that is not quite a show but a series,” said Wiles. “I’m excited that we’re finally going to create a show that can address the indelible legacy of the Boston Public Library (BPL).”Said Cipolletta: “The show’s invitation to perform a show that addresses the legacy of the BPL is a powerful statement of cultural cooperation between a city and an institution that has been at the forefront of building new cultural narratives: MoCA. It is also a statement of the power of contemporary art both inside and outside of Boston.”Starting with a selection of works by forty-", "The next Biennial should be held in 2021. The twenty-fifth will be held in 2022.  Artforum was not able to reach Lavigne for comment, and the gallery did not respond to a request for comment.\n\n\nCécile B. Novak, a leading artist who pioneered the work of women artists in the United States, has died at eighty-eight years old. She was born in Brooklyn, New York, on December 7, 1941, the daughter of Italian immigrants who settled in the area after World War II. She began drawing at age six, and since then she has exhibited her work to notable collectors such as Jack and Diane Antonovich of the Metropolitan Museum of Art in New York and Jean-Michel Basquiat of the Basque Country in Spain.As a member of the Vesper-Solomon-Dorsch group, she was involved in the creation of works such as her “Anarchy of the Eye” (1952), which combined surrealism and sculpture to create a work that combines mathematical simulations of drawing with figuration and masks. She was also a cofounder of the term “artistic futurism” and a fellow at the Institute of Modern Art in New York.", "The next Biennial should take place at the new Diller Scofidio + Renfro–designed site in March 2022. The exhibition will consist of twelve works, selected from a collection of twenty-five, and will be organized in the contemporary art museum fashion. The works will also be curated by museum director and CEO Peter Rosenberg.“I have long believed that the Diller Scofidio + Renfro’s collaboration with the museum was one of the most important and enduring in the world,” said Rosenberg. “I was fortunate to work with the Diller Scofidio + Renfro team on the exhibit ‘The Future Is Not Enough: Contemporary Art in the End of the World’s Age.” He added that he was also a patron of the institution, whose board of trustees includes Richard Armstrong, Kenneth C. Fowler, and Howard University art historian and global thinker Joyce Sylow.After the current exhibition, “The Body and Society,” closes on March 18, the museum will hold a special exhibition of work by artists from the collection. The show will open with a presentation of a selection of work by Ekaterina Glukhova’s work for the exhibition", "The next Biennial should be held at the Museum of Modern Art in New York in 2021. \n\nThe French artist and curator Joël-Espenès, whose hauntingly lifelike sculptures tackled gender, gender roles, and the self, has died at eighty-eight years old. Born in Marseille in 1926, Espenès first studied under Pierre and Louise Béchard at the École des Hautes Études in Paris before moving to the École des Beaux-Arts in Paris in the 1950s, where he eventually met the painter Gil Parachute. Their partnership would pave the way to the two-dimensional works that dominate the artist’s body of work.Born in the city of Nice in 1943, the son of a factory worker, Espenès left school to study at the École des Beaux-Arts before joining the French Ministry of Education in 1954, where he would work on his first book, La Vie en Rose (The Rose), in 1957. A year later, his first major retrospective at the Museum of Modern Art (MoMA) in New York, which took place in October 1958, was followed by the exhibition �", "The next Biennial should be held in 2020 and the venue will be moved to a new location. The first Biennial was held at the Museum of Contemporary Art in Cleveland in 1989 and was the first event to address the legacy of the Stedelijk Museum, the University of Amsterdam, and the Haus der Kunst, Germany, in an effort to explore how artworks from the late nineteenth century to the present-day could be incorporated into “the future together with the museum.”\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has named Christine Meade as its next director. Meade joins the institution from the Museum of Contemporary Art in New York, where she has served as deputy director of planning and public programs since 2015. She succeeds Susan Holmberg, who retired in June 2019 after eighteen years to become the eleventh director of the Metropolitan Museum of Art.“Susan and I are thrilled to have the opportunity to lead MoCA with the enthusiasm and commitment she brought to her sixteen-year tenure,” Meade said in a statement. “Over the course of her thirteen-year tenure, she established the museum’s reputation as a leader in art, technology, and design—and her vision", "The next Biennial should be a running exhibition of the work of many artists of the twentieth century; it should be an occasion for reflection and reflection on the ways that images and sounds are reproduced in the vastness of space.”\n\n\nThe National Museum of Art in Washington, DC, has received a gift of eleven works by artist Max Beckmann, who passed away on March 27. The gift includes a miniature theater from the 1960s and ’70s, as well as a film by the American artist and filmmaker Ron French, who served as a mentor to Beckmann. The works are currently on display in a new exhibition, “The National Museum of Art in Washington, DC,” which runs until November 28.The gift was made by artist and collector Bertrand M. Fleury, who has owned Fleury Art for twenty-five years, and an anonymous donor in the United States, who bought the works directly from the artist. Fleury said: “This is a remarkable gift for the National Museum of Art, a museum that has been searching for the ideal partner for the museum. Max Beckmann is one of the most important artists of our time. We are privileged to be able to present his", "The next Biennial should be held in 2021. The question of the appropriate date has been a source of contention among artists and scholars, who agree that the event should be hosted as long as possible to maximize the participation of both the academic and public. Tourism Czech Republic: The exhibition, entitled “The Art of The Sun,” is scheduled to open on August 8. The biennial will then return to Prague the following month. According to a statement from the Ministry of Culture, the exhibition will consist of “at least twenty works by the artists participating in the exhibition.” The decision to postpone the event has been criticized by a number of artists and scholars. While the exhibition will still be held, the exhibition will not be able to travel to and from the city of Prague. As a result, the government will allocate approximately $5 million to help pay for the relocation of the exhibition. The Art Newspaper reports that the exhibition has been designated as a national monument, which means that it will be moved to a permanent location in the capital.Czech Republic: The Art of the Sun, a new exhibition that will focus on the artists, will be presented in the summer of 2021. The exhibition will be held at the Museum of", "The next Biennial should be held in 2020. \n\n\nThe Metropolitan Museum of Art has announced its representation of the British graphic novelist Rosemary Barton, who has been widely acclaimed for her novels The Prelude, The Tales of a Pigeon, and The Madonna and Child. The museum will host a public reading of the first book in the series, The Star-Spangled Banner, at the museum on May 21. The exhibition also features works by artists from the Canadian and European Union. The first public reading of The Star-Spangled Banner was held on July 12, 2020, in Toronto.The second book, The Hours, was published in 1960, the year before Barton was born. The novel, which concerns the American frontier and the centrality of the body and the environment in the narrative, is one of the first graphic novels to be published in English. In the novel, the protagonist, a devout Catholic boy living in a small Christian community near the town of Monadnock, England, journeys across the United States to meet his cousin Elizabeth, a painter and sculptor, who is living in New York City. Through a series of interconnections, Barton and Elizabeth become best friends and are eventually married.Barton is survived by her cousin", "The next Biennial should be hosted at a site within the Cultural Centre, which will take up the vacant space in the city center. The museum will also be renovated in order to offer an exhibition space for the Metropolitan Museum of Art, which is currently housed in a separate building on the second floor, and will add 400,000 square feet of exhibition space to the institution.The Biennials are a collaborative project between the city of Chicago and the cultural district of St. Charles, which is located near Lake Michigan, at a time when the Art Deco industrial city is slowly but surely reclaiming its former glory. The art district is also hosting a number of community-based initiatives, including the Chicago Architecture Biennial, which will feature an opening reception on October 9; and the Chicago Architecture Stories series, which will feature a combination of home-built works and works by established Chicago architects.All of the new exhibitions, performances, and activations will be curated by Jonathan Erdman, an American, who previously served as an assistant curator at the Brooklyn Museum and as a curator at the Museum of Modern Art in New York. He will also be working with curator Samantha Lee-Hebborn, who won a 2015 Tony Award for her exhibition “Work of Art in", "The next Biennial should take place in 2020, and the first in 2021. The biennial will take place on the grounds of the European Research Centre in St Petersburg from February 18 to February 19, 2020. The exhibition will be based in the 19th century and will consist of twenty-one exhibitions. The first show will be “The Harmonies of Man and Nature: ‘Shelley and the Living World’” (2019), which will be followed by “Anatomy of Life: ‘Nuclear Fusion” (2019), “Nuclear Science and Technology: ‘Nuclear Fusion and Nuclear Power” (2020), “Chemistry and Physics: ‘Nuclear Fusion” (2020), and “Chemistry and Physics: ‘Nuclear Fusion’” (2020). It will also feature “The Chemistry of Life” (2019), “The Chemical Evolution of Life” (2019), “Chemistry and Physics: ‘Nuclear Fusion” (2019), and “Chemistry and Physics: ‘Nuclear Fusion’” (2019). The exhibition will also be a cumulative presentation", "The next Biennial should be held in the first half of the decade and will be hosted at the university. The institution noted that it will also continue to be a research university, with an endowment of $25 million, and will begin a ten-year, $3.5 million fundraising campaign.  The institution is currently closed due to Covid-19 and will re-open in phases. Commenting on the upcoming event, Kate Fowle, director and CEO of the Biennial, said: “The future of the Biennial is very much within our grasp. This is a moment of great change and critical growth for all arts and cultural institutions in the city and region. We will work closely with our City Council, with our partners, and with our community to ensure the future of the Biennial, and the future of London as a whole.”\n\n\nOsman Dalloul, a British filmmaker and artist best known for his dissolves, sculptures, performances, and films that involve people unencumbered by society and transformed by nature, has died at the age of eighty-two. The Bahrain-born, London-based artist, who built his career around environmental destruction, was convicted of arson in 2007 and", "The next Biennial should be staged in the autumn, with exhibitions organized as follows: 1        October 26 to December 3, 2020. 2        October 24 to October 26, 2021. 3        March 14 to March 21, 2022. 4        March 14 to March 21, 2022. 5        March 13 to March 21, 2022. 6        March 21 to March 28, 2022. 7        March 16 to March 22, 2022. 8        March 7 to March 13, 2022. 9 March 4 to March 5, 2022. 10 March 3 to March 7, 2022. 11 March 3 to March 8, 2022. 12 March 3 to March 9, 2022. 13 March 8 to March 11, 2022. 14 March 5, 2019. 15 March 7, 2019. 16 March 4, 2019. 17 March 5, 2019. 18 March 3, 2019. 19 March 8, 2019. 20 March 5, 2019. 21 March 10, 2019. 22 March 9, 2019. 23 March 13, 2019. ", "The next Biennial should take place in the fall of 2020. \n\n\nSet to reopen in Tokyo in April 2021, the city’s Museum of Fine Arts (MAK) has announced that it will no longer restrict visitors to the institution by limiting the number of visitors, but will instead focus on building partnerships with local, independent museums that specialize in a particular area of art. In a statement, the museum said that it will “work hard to establish a new museum within the next decade.” “The strategy of increasing the number of museum visitors through exhibitions and the museum’s expansion into the larger city center has been successful,” said Koichi Takeda, director of MÜKUN. “This has led to a strong and stable exhibition program in the museum as well as a strong restoration program. It is hoped that the new plan will also benefit the museum and the city. We look forward to welcoming the new MÜKUN, which will open in October 2021, to the museum.”The announcement coincides with the reopening on November 14 of Museum of Contemporary Art (MoCA) Tokyo, formerly known as the Museum of Contemporary Art Japan (MCAJ), and the", "The next Biennial should be held in 2022.\n\n\nNew York’s Museum of Modern Art (MoMA) has received a major $100 million donation from the Speroni Foundation, which is based in Italy, in support of its plans to open a new contemporary art museum in the Bronx in 2021. The gift extends the grant to MoMA by thirteen years, improving the museum’s exhibition-viewing capabilities, space for public programming, and the museum’s collection, which currently holds more than 4,000 works.The donation also extends the Speroni Foundation’s commitment to modern art, which has included funding the construction of the museum since 1988, and support for artists and scholars working in the field. “The museum will be a model for international collaboration and innovation in the arts, and a place where artists can come together for a wide range of events,” said Speroni Foundation president and CEO Christopher Speroni. “We are honored to receive this gift and look forward to working with MoMA to ensure that this new museum reflects the vision and spirit of the Speroni family.”\n\n\nThe United States House of Representatives voted yesterday to establish a new national museum", "The next Biennial should add programming focused on the creative process, exhibitions about the arts, readings by leading experts, and a digital platform for the public. “This year’s show will be a watershed,” said Gershon Kriendly, director of the Berlin Gallery Sammlung für Bildung und Gesellschaft in the city of Baden. “Its exhibition will be one of the first shows in the world devoted to the interconnectivity of the world’s arts and culture. It will also show the new European Union–wide archive of the art of the Slovak Republic, which will open in 2021. The program will be organized as a show within an open-air museum, with visitors able to walk through and explore central collections and exhibitions.\n\n\nThe Fine Arts Museums of the San Francisco Bay Area (FAMA) and the Oakland Museum of California (O’’M) have received a gift of more than two hundred works by fourteen artists whose works were featured in a retrospective, “Together in Time: Painting, Design, and Architecture” at the Tisch Museum of American Art in New York on November 7. The work, which was organized as a project for the exhibition", "The next Biennial should have a new exhibition dedicated to the artist’s rediscovery, and a new exhibition devoted to the art of the human form. “The first Biennial has been a very large, very impressive exhibition, with many important works, with a great deal of history, and the work of a very great artist,” said director's Maria Elena Zingaretti. “It should also continue to be a great exhibition, and it should continue to be a very powerful platform for dialogue.”The seventy-fourth Venice Architecture Biennale will be the topic of a show of works in the exhibition “The End of the Mystery,” which will be presented by the Italian architect Silvio Cattelan. The show will feature works by twenty-four artists, including Marcel Proust, Edvard Munch, and Kazuko Takahashi, and will run for six months. This year’s theme, “The Contribution of Science to the Development of Art,” is “Science and Contradiction.”\n\n\nWorkers in the Black Forest, an officially recognized cultural zone in northern Cameroon, have been pushed back by armed militants for two weeks after local", "The next Biennial should commence in 2022.\n\n\nThe Leicester Biennial has announced that it has received a £14 million grant from the Leverhulme Trust. The $9 million grant is one of the largest ever made by the Leverhulme Trust and will be used to develop a new series of artworks by Japanese artist Yukio Mishima.“The Leverhulme Trust is delighted to support the Leicester Biennial in its challenging circumstances,” said Leverhulme director Anna Stiegler. “The Leverhulme Trust is delighted to receive this massive gift, which will enable us to create a new series of works by the celebrated artist.”Mishima, an American anthropologist, has been the subject of numerous international exhibitions, including at the Venice Biennale and at the Museum of Modern Art (MoMA) in New York, and his works have been exhibited in the following countries: China, Japan, Korea, Mexico, and Taiwan.The biennial will begin with a special exhibition of his photographs, “Christian Dior: The Passion of the Paintings” (2019), which will open at the Tate, and will culminate with an exhibition of works by the American artist Tr", "The next Biennial should be held in 2020. “I am very excited to continue to work with the Berkeley Art Museum and the Berkeley Art School to produce a new exhibition exploring the history and theory of photography,” said Michael Gould, chair of the board of trustees of the Biennial.\n\n\nThe Asian Art Museum (AAM) in New Delhi has received a gift of twenty-seven works by contemporary Japanese artist Ai Weiwei from a group of donors including the Charles Social and the Pritzker Architecture Prize. The donation is one of the largest ever made by a Japanese artist to an Indian institution. The works will be added to the museum’s collection and will be part of a series of exhibitions organized by the museum in the coming years.“We are deeply honored to receive this gift from the Charles and Pritzker Architecture Prize,” said Praveen Kumar, director of AAM and founder of the investment firm Guggenheim Partners. “Ai Weiwei and his family have contributed to the promotion of modern and contemporary art in India. This is a great gift for AAM and for the gallery team. ”The museum has also added a new sculpture by the artist. While the work is titled �", "The next Biennial should be held at least annually thereafter. LaMarche’s work is included in the exhibition “The Art of Thesis,” which opened on September 14 and runs through March 14, 2020.  The project, which honored LaMarche’s work in an exhibition inspired by the artist’s favorite pastime, drawing, was organized by Timur Myers. The institution will also host LaMarche’s first solo exhibition at the Museum of Modern Art, New York, in 2021. The exhibition will be curated by the architect Alexander LaMarche.\n\n\nThe Israeli government approved a new cultural center in the northern city of Beersheba on Monday, December 7, which will host twenty-one artists and their families from twenty-two countries, including Germany, France, Italy, Peru, and Slovakia. The center, called Beersheba Art Museum (BAM), will be located in the Beersheba Industrial District, in the central city of Beersheba, and will exhibit the works of forty-one artists, including Olivier Assayas, Hila Epstein, Fatosha Fathima, Kenon Kiplagat, and Richard", "The next Biennial should commence in 2020 and will​ be hosted at the new Museum of Modern Art (MoMA) in West Palm Beach, Florida, which is currently being renovated. The museum’s new home will incorporate elements from the former Bronx Museum of the Arts and will launch in 2020.The 2019 winner of the $2.5 million Judd Foundation Grant, Tanya Bonderman, said: “I’m really looking forward to participating in this year’s Biennial, and the challenging boundaries that they may force. The idea is to create a space for collaboration and reflection in which artists can come together, to create a space to understand and share their own identities. It’s about more than just a painting, it’s about a community of artists. It’s about people who are not only working together but making each other’s work represent their own visions of the future.​\n\n\nGerman artist Carl Lösch-Nielsen, whose practice pioneered the use of gesture to emphasize various aspects of culture, has died at the age of seventy-four. A pioneering and innovative artist whose work can be found in the collections of the Kunsthalle Basel, the Kunsthalle", "The next Biennial should take place in Bangui, in the Central African Republic, in December 2022. The Dutch-born, London-based artist formerly known as Janice Gilbert, a.k.a. Jesse James Grimes, has been called a brilliant, prolific, and visionary collaborator. Known for her ephemeral, often moody paintings, which are layered with domestic and urban settings, including the mansions of wealthy individuals, the artist often dresses her work in fabrics and materials found in the household.Gilbert’s work has been exhibited at the Venice Biennale twice, in 1978 and in 1995. Her work is housed at the French ministry of culture in Paris and at the Museo de Arte Contemporáneo in Madrid.\n\n\nPursuant to a settlement with the United States House of Representatives and the Senate, the National Museum of African Art, Atlanta, Georgia, is now a major cultural institution. The historically Black institution, which is housed in a former cotton gin, has been renamed the Museum of the African Diaspora (MoAD). Its new building, which was completed in 2017, is home to more than 180,000 artifacts from the African diaspora, including works by", "The next Biennial should be held in 2020, and the first in 2021.   The second Biennial will be held in 2022, and the third in 2024.  The new architecture will be co-produced by the Swiss and the Belgian firms Fons Meijer and Vanderlei, and will be led by the duo of Anna-Sophie Berger and Marcel de Hebborn.  The projects will be divided into three themes: “Life and Art,” “Being and the Environment,” and “Humanity and Art.” The first exhibition will focus on “Life,” with work by artists such as Jean-Paul Sartre and Jean-Luc Moulène and will run concurrently with the World Humanities Festival, taking place later this year. The second exhibition will focus on “Being,” with work by artists such as Le Corbusier, Pierre-Auguste Jeans, and Mierle de Kooning, and will be presented in conjunction with the biennial’s art & architecture fairs. The third exhibition will focus on “Art and the Body,” with work by artists such as Diana Ross, Charles Ray", "The next Biennial should be held at the Museo de Arte Contemporáneo (MCA) in Madrid, in 2019.\n\n\nAfter a new law was passed in Brazil on May 3 that grants the government the power to take control of Brazil’s biggest private broadcasting and publishing companies, the biggest TV and radio companies in Brazil and the country’s biggest Internet service providers, Brazil’s Ministry of Communications and Information Technology (SECID) and the Federal Public Ministry of Justice, have now suspended their operations.The legislation, which passed in March and was signed into law by President Jair Bolsonaro, allows the government to enter into contracts with private companies for broadcasting and publishing and allows it to terminate contracts in whole or in part. The companies have not yet faced any legal action in Brazil, and the government claims that they will not be affected by the suspension of their operations.The controversial legislation was passed after two groups, the Confederations Sola Antiação (AS), which represents Brazil’s largest media companies, and the Curitiba Municipal Autonomous Association for Media (CMA), which represents smaller companies, filed a complaint with the state court in São Paulo in March, accusing the government of", "The next Biennial should take place in 2022. \n\n\nSITE9, a New York–based nonprofit dedicated to promoting the work of emerging and established artists, is launching a new online platform that will provide free access to more than 5,000 works. Titled The Digital Archive of Art, the program will make it easier for artists to share their digital creations with the public, and will offer a platform for members of the public to purchase works through the organization.“We are innovating to share art with our audiences and craft a better understanding of art,” said David M. Galloway, founder of David M. Galloway & Sons, the New York–based nonprofit, who was instrumental in creating the platform. “We are currently innovating in many ways and are in the process of aligning with the current zeitgeist. The Digital Archive is a great way for us to engage with that future.”The platform will feature the works of twenty-four artists whose work is currently featured in the exhibition “Artforum,” which runs through October 27, including Drew Barry, Josh Birnbaum, Jodi Throckmorton, Jacob’s Project, and Timur T. Taylor,", "The next Biennial should be held in 2021. Šeljuin’s daughter and several of her students are currently working on a new iteration of the exhibition.The exhibition is currently on view at the Institut für Kunst und Moderne Kunst (IKMU) in Bonn.\n\n\nThe City of London police have released CCTV images of five suspects who attacked pedestrians in London on Saturday, March 4, in an attempt to frame a shoplifter they mistook for a shoplifter because the man was carrying a shopping trolley full of books. The suspects, who are all white, aged between twenty-eight and thirty-one, were captured on video by a passerby and have been identified as Mohammed Saleem, twenty-eight, of Luton, and his brother, Hamza, thirty-two, of the same address. The suspects are currently being held at a London police station.According to the New York Times, the pair came under suspicion after a twenty-nine-year-old man told police that Saleem and Hamza entered his apartment complex in Luton around 8 PM on Saturday, March 3 and questioned him about a missing shopping trolley, which he said had been left in a car by a", "The next Biennial should take place in 2020, and then will begin the process of rotating out the ninety-three works in the exhibition. The biennial will then conclude with the event of the artist’s choosing. The exhibition will be inaugurated by a selection of the work’s most recent exhibitions.“The Biennial is a milestone for us, for each and every one of us, and a powerful expression of our vision of the future,” said Iván González, director of the Biennial. “The architect’s work embodies all that is contemporary and modern in the contemporary world. Drawing on the most recent developments in materials science, the artist creates a work that is contemporary in terms of both its form and its content, but also in terms of its ideas and its history, and that advances its own potentialities. It is a work that is capable of shaping and attuning people to profound new themes. I am incredibly proud to have been a part of this project, and I am eager to continue working with these artists, and with the Biennial, for many more years to come.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Adam D. Cohen as its", "The next Biennial should be held at the San Francisco Museum of Modern Art in 2019, and the third at the Museum of Modern Art in 2021.\n\n\nThe modern and contemporary art worlds are waking up to the fact that the demand for exhibition space in China is intensifying, and that the country will not soon return to healthy levels. According to the Art Newspaper, China’s gross domestic product, which is the economic equivalent of the United States’ GDP, has contracted by 4.6 percent in the last twelve months—the largest drop since 1980.With the global economy still struggling to recover from the global financial crisis, the government is looking to the arts for relief. According to the Beijing Evening News, the Chinese state-owned Chinese Academy of Fine Art (CFA) is planning to open an exhibition space in the capital of Beijing that will be able to hold roughly 1,000 Chinese art collectors. The new exhibition space will be located in an industrial area of the capital and will aim to draw a few hundred visitors a day.According to the Beijing News, the CFA’s exhibition space will also feature a collection of works by 20 Chinese artists, including Ma Chao, who won an award at the Venice Biennale for Best New", "The next Biennial should take place in 2021. In the meantime, the main exhibition has been moved to the Art Gallery of Ontario (AGO) in Toronto—the first Biennial to take place in the city. The new date will mark the beginning of its twenty-second iteration. \n\n\nGreenpeace, the international environmental organization founded by environmentalist Harry S. Truman, has secured the release of 175 imprisoned activists from Swedish jails. Under pressure from activists and politicians, Sweden has begun deporting people held without legal proceedings under suspicion of crimes, including arson and murder and allowing people to be held in detention for as little as three weeks.The activists, who were arrested on September 3, 2015, in Stockholm for supposedly participating in a peaceful demonstration against police violence, were released on Wednesday after serving only three-week sentences. They were convicted of \"aggravated assault and conspiracy to assault police,\" which carries a maximum sentence of twenty-four years in prison, and were given two-and-a-half-year suspended sentences.In a statement, Greenpeace said: “The sentence handed down today for these two groups of activists is a clear message to the Swedish state that people are not safe in Sweden anymore. Once again, people are being sent to", "The next Biennial should be held in 2022. \n\n\nThe Metropolitan Museum of Art in New York has appointed David K. Gallo, who has served as the museum’s director since 2006, as its next director and CEO. He succeeds David C. H. Luce, who departed the institution in 2018 after a ten-year tenure that saw the museum increase its exhibition-viewing capacity by twentyfold and expand its student-centered programs.Gallo will take the helm from CEO and chair of the board Michael Lupica, who has helmed the museum since 2011. “We are thrilled to welcome David to the Met,” Lupica said in a statement. “His background as a curator, thinker, and entrepreneur complements our vision for the museum and our mission to present contemporary art to people. His appointment ensures that our future leaders and the museum’s future plans can be realized.”\n\n\nThe Pennsylvania Academy of Fine Arts (PAFA) in Philadelphia has received a gift of forty-four works by twenty-nine artists and collectors in support of the PAFA’s new $70 million renovation and expansion. The donation includes works by twenty-seven collectors who have live exhibitions scheduled in the", "The next Biennial should be announced sometime this year.\n\nFeatured image: Jack and Sally, 1948. Copyright © AMNYC. ______________________________________________\n\nThe Institute of Contemporary Art (ICA) in New York announced today that it is planning on reopening after months of construction. This month the museum began welcoming visitors again, with an exhibition of work by fifty-three artists, including Nathalie Berman, Alejandra Balsom, Marcel Breuer, David Salle, and Yayoi Kusama, and was given a break from its construction schedule. The reopening will take place in January.   The reinstallation of the museum in 2017 was accomplished by removing some fifty thousand pieces from its original location in midtown Manhattan and assembling them into a converted storage facility. The building, which is on the ground floor of 666 Fifth Avenue, is also undergoing a major renovation to increase the museum’s exhibition space, increase its recreational space, and add a performance venue.Gavin Brown, the director of the institution, said: “The ICA’s new position is to create a new kind of space for artists, not only to continue to present their work but to develop new ways for our audiences", "The next Biennial should be held in 2021.​\n\n\nThe London-based company Artbridge, which was founded by a group of artists in 2006, has received a $100 million donation from the estate of Pierre-Auguste Renoir. The Los Angeles–born, Paris-based entrepreneur, whose real name was Pierre-Auguste Renoir, enlisted the help of a group of American sculptors to create a new monument to the French surrealist, which will be installed in the city of London.Renoir’s estate announced the donation in a statement on Wednesday, and Artbridge confirmed the news on Thursday. The donation was made in celebration of the museum’s 75th Anniversary.“With such a rich and thoughtful gift, we are thrilled to be able to dedicate a single section of our Collection to the artist, and to help him to remember us and the many great artists he influenced,” said Bruce Minto, Artbridge’s director.Renoir’s work has been exhibited at the Venice Biennale, the Museum of Modern Art, and the Whitney Museum of American Art; at the Oakland Museum of California; and at the Los Angeles County Museum of Art. In addition to his Paris studio, Ren", "The next Biennial should take place in 2020.\n\n\nAfter an eight-year stay in Vienna, the City of London museum has announced that it will allow the European Commission to stage a major reopening exhibition, “The Future Is Present,” in the city in 2022. The commission’s planning and design group, Cinéma, has named the project Project Tanger, a nod to the 1963 film The Terminator. Titled “The Future Is Present,” will highlight the work of twenty-two artists, including Pierre-Yves Klein, Julien Ghebaly, Mira-Lori Ghebaly, Marion Maréchal, and Rosa Moschetti, who have been featured in the exhibition since its inception in 2015.“For the last ten years, the City of London has been developing a strategy to support the global economy and we are now at a turning point where we can begin to deliver on that. We look forward to the next three years to see how The Future Is Present will impact on London’s art community,” a statement from the commission reads. \n\n\nZoé Whitley, a Canadian international art historian, author, curator, and broadcaster,", "The next Biennial should be held in 2021.\n\n\nA new exhibition organized by Helsinki’s Sculpturepark, “Wiradjana” will return to the capital city next year. The 2018 edition, titled “Wiradjana,” featured artists such as Terena Pankaj, Alain Guiraud, and Per Eva Rüger. The third iteration of the show will take place in the Finnish capital in the fall of 2021.The show, which is organized in collaboration with artist and curator Mika Grönholm, will be held at the Metroplav�n gallery in Helsinki. The show will run from September 5 to September 11, 2020.The Helsinki Art Museum (Helsinki Museums) will receive a $100,000 grant through the National Arts Foundation in support of the renovation and renovation of the museum’s collections. The grant was made in partnership with the Swedish artist Eva Fimin-Söderström, whose work was featured in the first edition of the show.Helsinki Art University (Häljö Artiska) will become the first Swedish institution to host the show, “Wiradjana,” in the", "The next Biennial should take place in 2020. The next Art Sale should take place in 2022. \n\n\nThe Institute of Contemporary Arts (ICA) in Paris, which is currently undergoing a major renovation project, has hired Dirk Fjellkamp, a Hamburg-based artist and filmmaker, as its next director. Fjellkamp will be responsible for supporting the ICA’s artistic aspirations and facilitating the reopening of its two-hundred-year-old museum.Born in Berlin in 1954, Fjellkamp studied art at the University of Hamburg before moving to Paris to study with Pierre Huyghe. In 1994, Fjellkamp founded his own arts organization, Fjellkamp Gallery in Hamburg, which later merged with the ICA. Fjellkamp then founded the film Festival du Paris (FTP), which then merged with the ICA to become the ICA Film Festival. In 2005, Fjellkamp and Huyghe founded the Berlin-based company Filmpilar, which later expanded to a full-fledged Berlin art center. In 2017, Fjellkamp was awarded the Düsseldorf Art Petzold Prize for his art. He also received the Danzig", "The next Biennial should focus on the ethical and political implications of photography\u0097and the medium as a tool for political engagement\u0097as the mainstay of the current political situation in Mexico City, and perhaps even take images of the city itself.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of more than twenty rare works by four-time Oscar winner Hélio Oiticica.Known for his experimental and stylized paintings, which engage with the history and aesthetics of Latin American art, Oiticica’s pastel works have been on display in several Latin American capitals, including the Museo de Cultura Los Angeles de Bellas Artes (Chile), the Museo de Bellas Artes, and the Museo de Los Angeles, for which he created a series of paintings that were commissioned by his collaborator, the artist Gustavo Duden.The gift includes the works One-Eyed Man (1942), which was created in a calligraphic style that uses geometric elements such as lines, circles, and triangles to explore the meaning of the word \"eye\" in Spanish, and the Arte Povera (1943), a series of geometric abstractions and photos", "The next Biennial should be in early 2020 and will be organized in conjunction with the upcoming Art Basel Miami Beach, the first major international art fair in the United States. Hitachi will donate $10,000 to the event as well as $5,000 to the Miami-based nonprofit Miami Art Museum (MIAM), which is working toward acquiring the artworks that will accompany the exhibition. The David Kessler Foundation will also contribute $5,000 to MAM. “We are thrilled to support the Miami Art Museum, which has been a model for thoughtful and innovative exhibitions and exceptional collections,” said David Kessler, president of Hitachi. “We are confident that this donation will help MAM reach new heights in its institutional history and will further enhance the museum’s reputation as an internationally-recognized artist-friendly destination.” While the donation is significant, MAM’s director, Sam Rush, said the museum will also receive $7.50 from the foundation and that the money will go toward operating the museum and providing additional programming. Rush also noted that these funds will not allow the museum to sell works during the exhibition, but will be used to help secure the collection, restore the works", "The next Biennial should be a celebration of the life of the artist and the creative process, and should also serve as a platform to draw attention to the relevance of the work of the twentieth century and its connection to our own contemporary.”The artist reads: “The cosmos is my canvas, and the work of art is my canvas. I am always using the material to express my thoughts and feelings. I am always using the material, to express myself and to express my world. Art is my way of being, of showing, of making visible. Art is my way of life. I am always thinking about what I am going to do next and about the future.”\n\n\nDavid Siegel, who along with his wife and collaborator Andrew Kamm pioneered the use of computer animation in painting, sculpture, and video art, has died at age eighty-seven. He was fifty-six years old when Andrew and David developed the software that became popularized by Steven Pacey (1975–1983), a Chicago-based group known for its immersive computer-generated visual art. “The Kamm-Siegel computer animation system is a classic among computer animation systems,” Andrew wrote in the May 1978 issue of Artforum. “Its", "The next Biennial should be held in 2022.<|endoftext|>The artist’s work is in the collections of the Museum of Modern Art; the Museum of Modern Art (MoMA), New York; the Los Angeles County Museum of Art; the Metropolitan Museum of Art, the Museum of Modern Art, and the Whitney Museum of American Art; and the Petersen Collection in Denver. Also on view in the exhibition are works by artists such as Vincent van Gogh, Robert Irwin, and Pierre-Auguste Renoir.\n\n\nThe Yale Center for British Art (CCA) in New Haven, Connecticut, has appointed Simon Rich as its inaugural chief curator. Rich comes to the institution from the New Art Gallery of New York, where he has served as senior curator since 2018. He succeeds Helen Phillips, who was named curator in April.“Simon brings a wealth of experience and knowledge from among his many years at the gallery and works very well within the constraints of a modern, micro-scale museum,” said director Helen Weiss. “We are pleased that Simon is bringing his cachet to CCA, and are confident that he will continue to expand our work and expand our community.”Prior to joining the New Art Gallery, Rich worked as a cur", "The next Biennial should have been held in the spring, but was postponed until the end of the year. The next Art and Architecture Biennial should have been held in the summer, but was moved to the fall to avoid disrupting the celebrations of the Chinese New Year. “The last two years I have spent on the ground in the art and architecture sectors, and in research, learning, and sharing of knowledge among artists and scholars,” Li wrote in a statement. “Since the announcement of the Agency of Design in October 2018, I have been busy working to strengthen the Agency of Design’s research infrastructure, to advance the Agency of Design’s exhibitions, to develop new exhibitions, to push for new exhibitions, to expand the Agency of Design’s international collaborations, and to identify new themes for the 2019-20 seasons.”\n\n\nThe Tate in London told its staff on Thursday that it plans to reduce the hours of some 150 workers, or about one fourth of its staff, in the coming weeks. The news comes amid a global strike that will last through the middle of March and could force cuts in both the arts and the public sector.The announcement follows a week of demonstrations against the proposed", "The next Biennial should be in 2020. History of art biennial is a word at the core of the project. It indicates the history of art, and I think the project of the future is to create a rich and dynamic history of art in the city with the help of the best historians, scientists, artists, and architects. The project of the future is to create a history that is active and resilient. The project of the future is to create an urban environment that is free from the destructive forces of climate change and carbon pollution. The project of the future is to create an environment that will allow the city to thrive and flourish. The project of the future is to create an environment that will allow the city to thrive and thrive. We will start by taking the most important works that are currently in the city’s collection and we will organize them into exhibitions. We will organize them by subject, by topic, and by location. We will do this at both the civic and the private level. We will also work with public institutions to create the exhibitions. We will build on the concept of the exhibition by creating new public spaces in the city that will offer visitors a unique and special experience. We will organize events with the artists", "The next Biennial should be held in 2021.\n\n\nThe Museum of Modern Art (MoMA) has announced that it is planning to open its new, expanded outpost in the Finger Lakes, New York, in 2020. The new facility will be constructed in a former industrial site at 1000 West Fifty-Third Street in Manhattan, and will be inaugurated by a solo exhibition of work by artist-activists Hilda Solanas and Klaus Biesenbach, a collaboration titled “Living in a Zero-G State.”The exhibition, titled “Microscope” and curated by Solanas, will highlight the work of artists such as French minimalist artist Pierre Ouellet, German surrealist and painter B. M. Wolf, and American painter John Georg Linne, among others. The center will also house a permanent collection of the work of Iranian artist Nima Noma, a keynote speaker at this year’s event.The museum is also planning to launch a new digital platform, the Museum of Israel Studies, that will showcase research and scholarship in the field. The platform will be overseen by veteran curators Haim and Maia Hochner, who will also serve as the curators for the show. According to the New", "The next Biennial should be held in 2021.  The art of sculpture, dance, painting, and video art, and their everyday life, is being organized in a way that will be familiar to the Brazilians and can be easily understood by the world at large. To them, Brazil is a land of enormous potential. The show must bring them together. They are ready to share their dreams and experiences, and their fears and doubts.At a time of global crisis, Brazil has the opportunity to emerge as a beacon of hope.”Armando and I had been discussing the theme of the exhibition for a long time. Armando is a sculptor and the cofounder of the Zócalo Campesinos collective. He was instrumental in bringing together the Chilean artist-activist Visranha, who has lived and worked in Brazil for more than thirty years, and my colleagues. From 2004 to 2011, he was a curator at the Museu de Arte de São Paulo (MASP), where he served as curator of the artist-activists Luana Amede and César Araujo, who adapted the work of the Brazilian artist Luiz Magalhães for their show “Ló", "The next Biennial should be a continuation of this year’s theme of the journey, the intellectual journey of individuals without a family or a home, the journey of a family member through the death of a parent, and the journey of the family through a crisis,” said Biennial president Elizabeth Roberts. “The opening of our new exhibition will allow the public to see how our curated shows, presented by our artists, apply art-based practices to their personal experiences.”Roberts added that the Biennial is currently collaborating with artists and institutions across the globe in efforts to foster the development of new ways to engage with the museum, including with the launch of our new lecture series. \n\nThe Atlanta Museum of Art (A.M.A.) has announced that Rachel Black has been named its next director. She succeeds Joseph Johnson, who retired on February 2 following sixteen years at the helm of the museum. In her new role, Black will work closely with the curators, writers, and scholars who have shaped the A.M.A. through a process known as curation.“The A.M.A.’s curators, writers, and scholars have given the A.M.A. an intellectual and emotional", "The next Biennial should be in September 2020. The committee will announce the theme and the official winner of the 2020 Biennial Art Prize (BFP) in September.\n\n\nThe W.K. Kellogg Foundation in Kansas City, Missouri, has received a gift of $3 million from the estate of the late corporate raider, Carl K. Kellogg. The donation, made in honor of his remarkable career, was made in recognition of his sardonic and insightful use of art and technology to advance social, ecological, and economic justice.Born in 1936, Kellogg studied at the University of Chicago under Richard Avedon, John Cage, and Pierre Cardin, and briefly worked at the New York gallery scene before he embarked on a global career as a multimedia artist, entrepreneur, and media mogul. His products, which included the website Artforum and the online video site MTV, were well received by critics and collectors, who considered them groundbreaking in their use of photography and video to advance social and ecological awareness and public understanding.“Carl was a master of the medium and a pioneer of the digital medium in general,” said John Graham, chief executive of the Kellogg Foundation. “His legacy lives in our daily lives and in the", "The next Biennial should be a platform for the work of the best emerging and established artists in the region, and should be an opportunity for the international community to see the work of these artists in their entirety’s entirety.”\n\n\nThe Flemish parliament voted on Monday to extend the lifespan of the copyright term for a series of works by the Danish artist and activist Jørgen Grieg, who was convicted of attempted murder last year in Oslo after he allegedly stabbed his ex-wife to death in 2014. The legislation, which will now allow Grieg to continue to use the body parts of his victims to create works that explore themes of abortion, human rights abuses, and disability, and is expected to be voted on by the Danish president, Helle Thorning-Schmidt. The legislation also requires that Grieg’s pieces be exhibited in public exhibitions.“The parliament was very clear: Griegs works should continue to be exhibited in public exhibitions,” Thorning-Schmidt said. “I fully support the parliament’s decision and the government’s decision, and hope that the Flemish artist will be able to live his life in peace.”The furloughs, which", "The next Biennial should open in 2022. \n\n\nFrieze announced today that it has awarded a total of $196 million to thirty-nine artists, including David Crockett, Edward Heineman, John Sy, Raphaela Zosima, and Frances Stark. The awards were announced at a ribbon-cutting ceremony at the Golden Frog on August 26, in celebration of the seventeenth year of the award. The thirty-one awards have been selected by a jury comprised of Celia Benitez, executive director of the Gay & Lesbian Arts Alliance; Judith B. Prince, director of the Gay and Lesbian Arts Archive; and architect Daniel H. Weiss.The thirty-six winners were chosen from a pool of twenty-one artists who were nominated by the Golden Frog. The jury also included Rebecca Schatz, artistic director of the Manhattan LGBTQ Community Center; and artist and filmmaker Mark L. Smith.“We are thrilled to recognize the thirty-six winners of the 2020 Golden Frog Award, and the artists whose work we believe represents the LGBTQ+ community in Los Angeles,” said Michele Thompson, artistic director of the Los Angeles LGBTQ Community Center. “These artists will each receive award funds of $50, and each will have the opportunity", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has launched a new initiative to support local arts and cultural institutions as they transition to a new physical form. The initiative, titled MoCA First, was initiated by director Marc Glimcher and chief curator Jenny Holmberg and is designed to provide immediate relief to those affected by the Covid-19 pandemic.“The design of this year’s event, which celebrates the birth of contemporary art, was a reflection of our current moment,” Glimcher said. “The new MoCA will celebrate the creative and inventive spirit in the art form, and will include a new short-form residency program, curated exhibitions, and a reimagined retail experience.”Cultural producers in Los Angeles who do not have physical spaces to create work can apply by emailing MoCA’s Arts & Culture department at arts@mocean.org to request a temporary loan of one of the institution’s temporary exhibitions. The grantee will be given one week to create a new exhibition.Curated by Christine Albergotti and Cristina Acosta, MoCA First is an online program that will provide", "The next Biennial should take place in 2020 and will be hosted by the London-based museum. The event will examine the role of games in shaping modernity and the future of the human body.Organized by the London-based institution CERN, the exhibition will feature more than two thousand works by sixty-six artists. It will also be a platform for the museum to present works by the contemporary artists that are currently understudied or unavailable for public viewing.  The biennial will then return to Geneva and will open in December 2021. The next exhibition, “Between the World and Me,” will be staged at the Museum of Modern Art in New York in 2022. \n\nThe Art Newspaper reports that the Museum of Contemporary Art (MoCA) Boston has received a gift of sixteen thousand photographs from a series of works by Andrea Arnold that were acquired through a multimillion-dollar loan. The gift includes an exhibition of works by the artist at the museum from the “Marina and I” series, which was housed in the MCA from 2004 to 2009. The works, which were acquired by the institution through its acquisition process, will be on display in “The Art of Life” “from August", "The next Biennial should be completed by April 2020. The next Cultural Forum should be completed by June 2020. The next International Workshop on Art History should be completed by April 2021. The next International Congress on Art History should be completed by April 2022. The next International Symposium on Art History should be completed by April 2024. The next International Congress of Cultural Heritage will be held at the end of February 2019. The next biennial will be held at the end of March 2019. Several of the events mentioned above are currently on display in the museum’s new exhibition, “Art and Life in the City of London,” which opened last year.\n\n\nThe Smithsonian’s National Museum of African Art (NMNA), which recently laid off or furloughed more than fifty staffers according to Artnet, has decided to postpone a planned October 28 opening of “The Division,” a pioneering 1965 documentary about the 1967 uprising against US military rule in the US. The November 20 date had long been anticipated. The film, which was shot entirely on digital media, was scheduled to debut at the museum on October 12.On Thursday, the museum informed the staff of its intention to postpone the film. �", "The next Biennial should be held at a location other than the Contemporary, and should be organized in such a way as to avoid the use of stage settings and should take place at a venue that has not been selected for the 2021 edition.The selection committee hopes that the new format will foster greater understanding of the work and will also encourage more discussion about its themes and the artists who were selected to represent the country in the first place. This year’s exhibition will be held at the European Art Museum Amsterdam (EUM); the new venue will host the exhibition in the autumn of 2020.The 2020 edition’s list of participating artists is as follows:Erika BOESSEN, GermanyErika BOBEL, GermanyErika BOBEL, GermanyErika DEUTSCHE & BOBEL, GermanyErika DEUTSCHE & BOBEL, GermanyErika DEUTSCHE & BOBEL, GermanyErika DEUTSCHE DESERT, GermanyErika DEUTSCHE DESERT, GermanyErika FREDERICKS, GermanyErika FREDERICKS, GermanyErika GOLDS, GermanyErika GOLDS, GermanyErika HALL, GermanyE", "The next Biennial should be held at least once a year. Washington, DC: Artforum\nIt is a tumultuous time for the Museum of Fine Arts in Boston. On Tuesday, March 18, the institution announced its closure due to Covid-19. The decision came as no surprise to the museum’s board of directors, which voted unanimously to terminate the contract of interim director Rebecca Schatz, who was hired on March 12.“The board of trustees is deeply disappointed in the board of directors’ decision to terminate an engagement that was mutually agreed to and supported by the museum,” said board president Adam D. Weinberg. “The board made the decision after careful consideration and following a thorough process that ensures a thorough and fair review of all possible options. The board believes that the best course for the museum is for Rebecca to remain at the museum for the next twelve months, during which time she will continue to work closely with the curators and artists that make the museum unique.”Among the artists whose works will be on display in the second exhibition at the museum will be Renzo Piano, who created his famous stained-glass windows in 1975, and his wife, Jodi, and their son Max, who was born", "The next Biennial should be held in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a major gift from the Joachim family: a $1 million donation that will allow MoMA to renovate and modernize its current building, which comprises a collection of more than 150,000 works, and future exhibitions.The gift includes the reconstruction of the museum’s current exhibition halls and the building’s interior, which will be reconfigured to house new works, including works by artists such as Mark di Suvero and Mahatma Gandhi, and will also include the restoration of the existing building and the installation of new works. The gift will also include the opening of a new exhibition, “Beyond Sculpture: Art on Paper,” in 2021 and the reduction of the museum’s exhibition hall capacity by 100 percent.This is the second gift from the Joachim family that MoMA has received in its history. In 2014, the foundation gifted the museum one hundred works by artists such as Alejandro Campanale, Sunil Gupta, and Irina Ghesko.\n\n\nThe museum of modern art (MoMA) in New York has received a major gift of fifty works", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $1 million donation from the Walt Disney Company. The gift, which was made in a joint effort between MoCA and the Walt Disney Co., was made in recognition of the collaboration between the two organizations in performing new work by artists whose works were on display at the museum’s new museum.The donation is made in support of the new MoCA at 608, which opened in November 2019. The exhibition, which features work by seventy-four artists, was curated by Walt Disney artist Ralph Waldo. “We are thrilled to be collaborating with Walt Disney to make a new collection of Disney art for the new museum at 608,” said Eva A. Sinderman, cochair of MoCA’s board of trustees. “This gift will allow us to create new experiences that will challenge and delight our guests and continue to advance the exhibition. Walt and I look forward to the journey of this new collection with your support.”Walt Disney also donated $500,000 to MoCA in 2019 in recognition of its partnership with the Walt Disney Company. The donation was made in recognition of the", "The next Biennial should kick off in March 2020 and will organize a series of exhibitions, lectures, and other programming. The first exhibition, titled “Apologies,” will present works by artists such as Robert Irwin, John Akomfrah, and Shimon Haim, and will invite the audience to participate in an open-concept installation, “Apologies,” as a way of showing their gratitude for the ‘unpleasant,’ and “shocking,” acts that have been committed by artists in the past. The second exhibition, titled “Goodbye,” will feature work by artists who are planning on retiring and will invite the public to participate in a conversation about the impact art has on people’s lives. The third exhibition, titled “Artist Refusals,” will showcase the work of seventy artists in a single exhibition, featuring works by a select group of the first twenty-five years of their careers, and will feature works by artists whose work has not yet been exhibited.“The biennial’s inaugural edition, “The Era of Apologies” (2017–18), drew an audience of over one hundred thousand people. The exhibition yielded several landmark", "The next Biennial should focus on the history of the institution and its relationship to the city of Copenhagen, as well as the challenges and opportunities it presents in the urban ecosystem. “Erik Larsen, architect, curator, and novelist, as well as his colleagues, who have led the Biennial since it began in 1998, are legendary and always readily available to engage in conversation and reflection,” said Hans Christie, chair of the board of trustees. “The next Biennial will be an occasion for the museum to reflect on its history and what the future may hold. . . . I am confident that the next Biennale will achieve the extraordinary volume and richness of the Danish Biennial and become a model for how a biennial should be organized and presented.”Since its opening in 1998, the Biennale has collaborated with the Danish government on 11 projects, including the construction of the Danish Embassy in London; the Danish Embassy in Paris; the renovation of the Museum of Modern Art in Copenhagen; and its acquisition and restoration of the Biennale, which is located in the town of Buholtborg, in the municipality of Væstholmen, in the west of Denmark.\n\n\nThe National Geographic Society is facing a", "The next Biennial should be held in 2021.\n\n\nThe Royal Academy of Arts (RA) in London has announced the winners of its biennial awards. In addition to receiving $30,000 in support of their work, the biennial’s participants were awarded a total of $155,000.The biennial, titled “The Romantic,” will provide an opportunity for artists to increase their understanding of the past and re-create a future by exploring themes such as romanticism, Americanism, cultural imperialism, and language and how it shapes our cultural and political lives. The selected pavilionees are: Arts of the World\n\nMihai Csikszentmihalyi, HungaryCreative Class: Political Action (Full-length)\n\nLawrence Livermore Laboratory, United KingdomCreative Class: Warhol’s Meditations on Cinema (Short-Form)\n\nNate LaMontagne Studio, New YorkCreative Class: The Great Gatsby (Long-Form)\n\nJack Shainman Gallery, New YorkCreative Class: The Dandy Warhol Show (Full-length)\n\nArtists’ Ideas for the 2018 Biennial Prospectus", "The next Biennial should take place in 2021.\n\n\nAfter a deadline extended by the city of New York to lift its lockdown last month by a week, the Museum of Modern Art has announced that it is now able to reopen. The institution, which suffered a severe loss of power following the severe storm Irene in December of 2015, has announced that it would like to welcome visitors again, but only if the city reopens its emergency airspace around the museum.According to the New York Times, the city council voted unanimously to extend the lockdown by another week, and Governor Andrew Cuomo declared the state of emergency. However, since the museum is currently closed until January 15, the museum has been experiencing delays. Following a request from the state, the Museum of Modern Art has sent out an email informing visitors that it is \"committed to continuing our work of educating and engaging with our community in a flexible, adaptive, and reimagined way, while allowing us the flexibility to consider future opportunities and opportunities to engage with the public.” New York City Transportation Authority (NYCTA), which runs the city’s subway system, has also extended its weekday service by an hour. The extension will be made possible by a $4 billion upgrade to the Central", "The next Biennial should take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is changing the way it presents works by the late sculptor and activist Ana Mendieta, who dedicated her studio to her art by repurposing old teak crates and other materials to create works of art that were often inspired by her own life. The museum is extending the reach of its online community edition of a new exhibition, “Luna and the Monster,” which has been on view since March 2018. The exhibition, which will include works by twenty-two artists, has been expanded from a single volume to include a “series of virtual sessions.”In an attempt to address the museum’s long-standing concerns surrounding the legacy of the late artist, the institution will now host thirty-five works from the activist’s virtual studio, which she created while incarcerated in Los Angeles State Prison. The exhibition will also introduce a new platform for the artists to discuss the legacy of the artist and her work. In addition, the museum will improve its existing collection and add five additional works by artists she influenced, including Rachel Antil and Scott Donwood.“I’ve had the opportunity to travel", "The next Biennial should focus on the history of contemporary art and what this means for the future of the art, and on how we create a more just and inclusive future.”\n\n\nThe Institute of Contemporary Arts (ICA), London, which received a gift of more than 6,000 works from the Massachusetts-based artist and philanthropist Peter Zumthor in 2017, has appointed Laura Leibovitz as its next director. Leibovitz will be responsible for the development of the ICA’s current collection, which comprises more than 2,500 works and is currently on display in a public space in London’s Hyde Park, as well as the future plans of the institution.“We are exceptionally fortunate to have Peter and Carrie very close to us at this moment, and to work with him over the next few years,” said director Loring Randolph. “We are delighted to welcome Laura to the ICA. Her experience, knowledge, and talent are wildly inspiring, and she will continue to shape and shape the ICA’s collection in such a way that it is able to continue to thrive amidst the challenges and challenges of a dangerous future.”Leibovitz, who first met the I", "The next Biennial should focus on the ideas, systems, and practices of architecture, design, and design-based practice, and should focus on building on existing scholarship. Among the participating arts are architecture and design, theater, design and craft, and dance. The exhibition will feature sixty works by forty-seven artists and designers. The theme of the biennial is the 'future: the not-yet, the unimaginable, the uncanny and the impossible. The project will be a collaborative process involving curators, collaborators, artists, designers, and attendees of the upcoming exhibition. The art show is currently exhibitions at the Javits Center in New York. The 2019 Biennial will be held at the Shinola Museum of Art in Rome; at the Museum of Modern Art, New York; and at the Museo de Arte Contemporáneo in Bilbao.“This year’s biennial will be a milestone for us, but not only in the scope of its exhibition, but also in the impact of its work on our collective memory of the past and the future,” said Katsu Matsumoto, director of the Museum of Modern Art and curator of the upcoming exhibition.", "The next Biennial should coincide with the opening of the new museum, which is currently under construction in the city of São Paulo. The venue will be inaugurated by a special exhibition entitled “Themes of Contemporary Art: The Future Is Present” curated by the curators of “London, 1972–2007” and “Paris, 1967–1985” at the museum. The exhibition will be followed by “Transitions” (2019), which represents the current state of modern and contemporary art and the first show devoted entirely to a woman. The three-day event will be closed until January 5.COPAC, which was founded by the Palais de Tokyo in Paris in 1971 to further the development of the French movement, was established in 1992 in response to the rise of the Eurocentric art world and its associated cultural imperialism. In the years that followed, the organization collaborated with artists and institutions in the United States, Europe, Australia, and Japan. In 1996, the organization moved to the Palais de Tokyo, and in 2001, the organization moved to the newly renovated Biennial d’Art Contemporain in Paris. The institution currently hosts more than three hundred exhibitions annually.The 2020 edition of the COPAC", "The next Biennial should include a discussion of the literary and artistic heritage of South Korea, as well as a reflection on how art and architecture have contributed to the development of the south Korean state in the past and the current state of the art.The 2020 event will be hosted by the South Korean pavilion at the Twenty-Fifth Venice Biennale in May. Inaugurating the biennial will be a demonstration of the Make in South Korea campaign, which aims to stimulate the country to manufacture locally and at a faster pace. The museum is also planning to launch an internship program in the capital. The theme of the 2020 event will be “How Do We Live Together?” Art and art history as well as design will be the themes of the 2019 Biennial, which was held in Tokyo.\n\n\nThe Beatty Museum of Art in Miami Beach is planning to launch a new digital platform that will allow visitors to explore and purchase works by artists from Around the World by Artists for the Beatty. The museum has partnered with the nonprofit Creative Capital to commission artists to create a new work for the Beatty, which will then give them $100 to use in conjunction with the museum’s annual “Beatty for Contemporary�", "The next Biennial should take place in 2021 and will include a selection of works in both the Contemporary Art and Design categories. In 2017, the exhibition was staged opposite of the International, which was held at the Museum Galleries Rotterdam. The exhibition brought together more than seventy artists from eleven countries, with some works dating back to the nineteenth century. Julia Waldman-Goldin, director of the Biennial, said: “The exhibition was a great success and as a result, we are planning to reconvene the exhibition in 2020. In the meantime, the exhibition and the official programme of the Biennial have developed and changed remarkably rapidly, thanks to the extraordinary support of the public. We are grateful for the understanding and admiration of our colleagues, the artists and for all of our visitors, and we are looking forward to future years.”\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Tate Britain chairman Nick Bond as its new deputy chief executive. Bond has been appointed following a four-month search, chaired by director Maria Balshaw, who will take up the post at the institute on January 6.“I love the work Nick and his team have done over the years to develop Tate’", "The next Biennial should take place in the city in 2021.\n\n\nThe Museum of Fine Art (MoFA) in New York has received a major gift from the legendary American collector Otto Frank, who passed away on January 2, 2019 at age eighty-seven. The donation includes a set of rare photographs by the late American painter John Lloyd, which were included in a major exhibition at the museum last year, and a painting by Jerome Sa�tron, which was recently on view during a solo show of Sa�tron’s work.“The gift of these works is a great honor and a great relief to the staff and patrons of the museum,” said MoFA director Trisha Brown. “They are a mix of contemporary and classic, a mix of sentimental and profound, and are the perfect illustrations of the artist’s enduring power. We are thrilled to have this opportunity to present them to the public.”The works were donated to the museum by Frank in August 2017, at the request of his daughter, Patti, and her husband, Joel, who had recently separated. The gift was made in memory of their son, Evan, who died of cancer in March 2019. The gifts were made in", "The next Biennial should begin with a review of the exhibition “Baroque in Space” (2019), which was organized by the Musée d’Arles and organized by Michael Lador, and will be followed by an exhibition of the artists’ works that will take place in the Musée di Arte Contemporanea in Rome in 2021.\n\n\nThe winning design team of the 2019 Venice Architecture Biennale, which was presented at the Venice Architecture Biennale in October, has been announced. The cross-disciplinary team comprises Haus Stuckart, a design studio based in Berlin; Thee Art & Design, a Berlin-based collective; and Barozzi Croce, a design firm based in Venice. Collaborating with Fondazione GIperto, the design center, the studio will construct a new kind of apartment building, with a solar array, for the exhibition’s finale, “The Most Fantastic Places.” The structure will include a foyer, gallery, and rooms for the installation, which will be on display throughout the exhibition. The exhibition will feature more than seventy architectural works by forty-eight artists, including Paolo Ballabonte, Joaquin Cesarco", "The next Biennial should be inaugurated in 2020. The first iteration, which focused on the role of history in the construction of art, will be held at the Museum of Modern Art in New York, the Metropolitan Museum of Art in New York, and the Museum of Modern Art (MoMA) in New York.For the museum, the upcoming exhibition “The Final Frontier: Art, History, and the Making of Modernism” is a “once-in-a-lifetime opportunity to present the history of photography in the most powerful and unprecedented way possible.” The show will also include two new works by Australian artist Kim Stanley Mack; a selection of contemporary works by Italian industrialist and designer Mona Hatoum; and a retrospective of early works by American artist El Dorado Swain.\n\n\nThe Solomon R. Guggenheim Museum in New York has issued three artist commitments in the next year: Mark di Suvero and Roch Preciado, both of whom will each receive $100,000 grants. In addition, the institution will create 120 hours of free, community engagement programming for schools, and will establish a new prize for visual artists.The promotion of artistic excellence is an important goal of", "The next Biennial should focus on the history of literature in the Philippines, said Eileen A. Pimentel, the executive director of the Philippine Writers’ Association. “This biennial should bring together the writing of contemporary Filipino writers, whose voices are gaining recognition in the West, the Commonwealth, and the Philippines.”Over the years, the festival has staged more than 150 exhibitions, including “Between the Sun and the Moon: Stories of Filipino Writers” (2015); “In the Beginning: Stories of an American Pioneer” (2016); “The Life and Death of a Filipino Artist” (2017); “The Philippine Triennial: The Great Migration” (2017); and “I Same, I Same: Stories of Filipino Writers” (2019).Given the festival’s current plight, which was exacerbated by the coronavirus outbreak—the country had the highest number of deaths in Asia from the virus ever recorded—the 2019 edition is being promoted as the last. “The World Health Organization (WHO) has declared the coronavirus outbreak a global health emergency. The number of cases has tripled in the Philippines since January, and the death toll is expected to rise,” said", "The next Biennial should be held at the institution in 2021. It would then return to the Boucoumuseum for its centennial year.The third edition of the Fifty-ninth Venice Biennale will take place at the Venice Architecture Biennale, the Venice Children’s Festival, and the Kunsthalle Basel in 2020. It will also present works by artists who have been selected by a committee chaired by the Italian director, Christian Stradberg, and will be hosted by the Museum of Modern Art in Rome. The fifty-ninth edition of the Venice Architecture Biennale will be held at the Museo Leonardo di Cunha until December 2022. During the event, which will be hosted by the museum, the winners of the fifty-sixtieth Venice Architecture Biennale will be announced.The Venice Children’s Festival will be held in March. Its theme is “Letting Go of the Past” and will be directed by Stefan Blum. The festival will also feature works by six-and-a-half-hundred artists, designers, and illustrators from the Venice region. The thirty-ninth edition of the Kunsthalle Basel will take place at the Kunsthaus Museum", "The next Biennial should be held in 2021. The first was held in 2007 in Mexico City. The museum will be housed in a former Coca-Cola bottling plant in the capital, designed by the internationally renowned architect Ad Reinhardt, and will be inaugurated by a performance by the Chilean artist Carla De Los Santos.\n\n\nThe Museum of Arts and Design (MAD) in New York has received a gift of more than 30 works by American painter and designer Merritt Wegman. Dubbed the Unearthed Gems, the works, which are based on the Bury St. Georges style, were stolen from a storage area in the museum on Thursday morning.“We are heartbroken, saddened, and angry that these works will be lost forever,” said museum director Michael Govan. “But more than anything, we hope that these pieces will inspire. They will push us to think critically, and they will remind us of the impact these works have on our lives. We hope they will inspire us to think of art as a tool, and as a source of inspiration, not a source of our hatred.”The rare gift was given to the museum by a concerned friend of Govan’s who had", "The next Biennial should take place in 2021 at the Kunsthaus in Frankfurt. The next edition, held in 2022, will be the last. The Museum of Contemporary Art (MoCA) in New York will open its doors in 2021 and will host a biennial exhibition in 2022.  The Boston Museum of Art is currently working on moving the exhibition, “The Material Box: Art and Materiality” (2019), from its site at South Station in Boston to the Boston Public Library. The first edition of the Biennial will be held at the Art Institute of Chicago. “The exhibition will offer a rare opportunity to immerse yourself in the visionary work of the legendary Susan Sontag, whose provocative and nuanced approach as a curator and scholar transformed contemporary art,” said Frank Gehry, the founder of Frank Gehry Associates and the design firm Koons. She is the author of “The Art of Eating: Recipes for Eating and Cooking (In Defense of Food)” and is also the recipient of the Art Council Museum’s Gold Lion Award for design. “The ending of this amazing and difficult journey is a great achievement,” said Eleanor Attridge, chair of the Board of", "The next Biennial should be held in 2022-2023, but its organizers admit that their decision to cancel the event was not made lightly. Michael Wolff, a spokesman for the Herb Simon Museum, said: “We made the decision to postpone the event as a result of the recent events of the last few weeks. We have since reviewed the full range of options available to us and have decided that this is the best way forward for the exhibition, the exhibition, and the retrospective.” The next iteration of the biennial will be held at the New Museum in New York in 2021. \n\n\nA group of artists, activists, academics, and other cultural workers in Syria have called for the United States to suspend all military and intelligence cooperation with the country, which has been embroiled in a civil war for more than four years, and instead invest in the Syrian people’s future. “In light of the worldwide humanitarian crisis, with the support of the international community, we call on the United States to cease all military and intelligence cooperation with Syria and to divert all resources to supporting the Syrian people,” the letter reads.The letter comes in the wake of an agreement between Syria and the European Union that aims to avert the ongoing", "The next Biennial should be held in December 2020. “Our designers and artists have long considered the museum as a platform for their work and to create new works, which is why we continue to be a permanent exhibition center,” said Berthold. “Our vision for the future of the museum has always been to be a partner of the local community.”\n\n\nThe Art Newspaper reports that the Guangdong Provincial Museum of Fine Arts in China, which was planning to start a new program in February 2020, has canceled the event. The initiative would have presented the first exhibition of works by twenty-four artists from the country’s Guangdong province, which comprises more than two hundred cities, in the United States. The exhibition would have featured work by artists such as Ai Weiwei, Anish Kapoor, Laura Owens, and Lee Ki-young. The exhibition was to have been curated by Tanya Baars and will have been presented as part of the 2019–20 academic year.The Guangzhou Festival of Art and Culture, which was set to kick off on February 9, 2020, has been moved to April 11–April 18. The show, titled “The Eyes of the World: Chinese Art and", "The next Biennial should be held in the spring of 2021, said Adriano Biennale, artistic director of the Basel Biennale and the founder of the Yuz Museum. In a statement, Biennale said: “We are very much looking forward to the theme of our exhibition, which must be a statement of our city’s history and the way in which art and architecture come together to address our most pressing problems.”\n\n\nThe Ross-Aden Museum of Art in California has announced that it will reopen in 2019. The institution, one of the oldest surviving institutions in the United States, was forced to close after a fire broke out in its 75,000-work collection in January 2019. The fire was extinguished with the use of an excavator, but the building was left without a permanent foundation.The institution was hoping to reopen this spring, but the fire allowed the debris from the fire to accumulate and the institution to remain closed for another six months. “The museum is currently assessing the feasibility of reopening in the fall,” said museum director Alan Gartenfeld. “We will have more to say about the future of the Ross-Aden Museum when we have more to share with you", "The next Biennial should have a platform dedicated to the history of modern art, and should draw from the creative processes of the artists who created the work or the work should be a work of art. However, the lack of a formal identification of the biennial as an entity. It should have a symbolic relationship to the exhibition.Of the forthcoming exhibition, which will be curated by Hauser & Wirth, the director of the Los Angeles County Museum of Art, Josée Bienvenu, and the artist and curator Adrian Piper, art historian and curator Matthew Lieberman called it a “historic event for the United States. . . . The new Biennial will present two significant pieces of work by the early moderns: the first is a monumental, ten thousand-piece work by Thomas A. Mellon that will be on view in the exhibition ‘Anarchy in the City.’”The second is a series of paintings by the artist and sculptor Mark Sternbrenner, “Anarchism in Time,” which will be on view in the exhibition “Anarchy in the City.”Speaking about the exhibition, Lieberman said: “We are thrilled that these three artists have chosen the Biennial as their", "The next Biennial should be held in the spring of 2022. The first iteration of the event, organized as part of the Organization for the Study of Television in the 1930s, drew 3.5 million viewers and featured programming in the form of a series of interviews with artists and thinkers. The 2018 event, entitled Artforum, was held in October. The biennial will be followed by a third, titled Artforum 2020, which will be held in the spring of 2022.The New York City Commission on Art and Design (CAD) has approved the long-term lease of the space formerly occupied by the American Institute of Art (AIA), which has been home to the prestigious exhibition space Artforum since 1987. Named after the American Institute of Graphic Arts (AIGA) in New York, the new space will serve as the center of the exhibition’s programming for two decades. The space is currently owned by The National Gallery of Art, which will share the proceeds with the National Endowment for the Arts, which is planning to open a new building in the fall.“The National Gallery of Art’s partnership with the AIA has been an important step in the National Museum of American Art’s", "The next Biennial should include a selection of mostly new works by artists from the São Paulo region and be held in the city of São Paulo. The exhibition will be hosted at the Museu de Arte Contemporâneo, Palme di Roo, and the Museu de Arte de São Paulo.“As a matter of urgency, we announced the formation of a special committee, headed by the director of the Bienal, to present to the public and the public at large our new works,” Sergio Annear, director of the Sao Paulo Biennial.The committee will include curators, writers, artists, architects, engineers, scientists, collectors, and others involved with the exhibition. The first exhibition will take place at the São Paulo Museum of Modern Art (StP), from November 3 to November 28, 2020.The second will take place at the Museu de Arte de São Paulo (MORBA), from December 17 to January 14, 2021.The announcement followed a yearlong campaign by artists from São Paulo to ask the city to rethink its plans to turn the site of the Palme de Roo into a research center for Brazilian art. The protest movement led to the publication of", "The next Biennial should be held before the end of this month and will be hosted by the Museums in Madrid. The event will take place in the new building of the Universitat de Madrid (Univ. Madrid), which was inaugurated in 2019 and completed in 2020.\n\n\nThe city of London’s municipal council has voted to scrap the city’s annual gala, which was scheduled for this Saturday, and has set a date of December 22 for a royal commission into London’s underground economy. According to the New York Times, the move will safeguard the annual £43,500-a-ticket event from the political influence of the British Petroleum Society (BP), which has campaigned against the decision.The move comes amid a continuing campaign against Big Oil and its allies in the British government, which have been waging a war against the London-based arts and cultural sector since June, when Thomas M. Paine, the mayor of London, made an anti-terror bill the subject of a royal commission into antisocial behavior. The following month, the British Council withdrew funding from BP, which is waging a war against the London Underground over its plans to shift to electric vehicles. Last week, Prime Minister Boris Johnson announced that the bill", "The next Biennial should open in 2022 and will run until 2020.\n\nThe center’s director, María Berrío Pérez-Santiago, told the Art Newspaper that the decision to relocate the exhibition venue had been made with the agreement of the owners of the occupied buildings. “We are very happy with the outcome, and with the work that will be exhibited,” she said.\n\n\nThe Seattle Art Museum (SAM) has received a gift of approximately $18 million from the estate of the late Seattle native, artist, and educator Keith and Ann-Marie Tate. The donation, which was made in memory of their late mother, Ethel Tate, was made on behalf of her husband and two children.Keith and Ann-Marie Tate were instrumental in establishing the museum’s current mission, which includes the collection and exhibition of the entirety of the Tate’s holdings in its primary downtown location. The couple’s other son, Ross Tate, served as a board chair for seventeen years and spearheaded the renovation and expansion of the museum over the course of ten years.During their tenure, the museum became a major center for the art of the Pacific Northwest and became a major center for the study and appreciation", "The next Biennial should take place at New York’s Museum of Modern Art (MoMA), on January 27–February 5. It will also be hosted by the science and technology museum at the University of Pennsylvania, Philadelphia, and will be the first major retrospective of the artist’s work in more than twenty years.\n\n\nThe British artist, curator, and educator Sidsel Ben El-Khoury, whose experimental, ambient, luxurious, and hyper-dense art embodied a radical, utopian, and utopian-sounding vision of the future, has died at age eighty-eight at his home in London, where he lived and worked throughout the 1970s.Born in London in 1932, with his parents, Elmer and Beatrice (Holmes), Sidsel would go on to gain a reputation as a gifted and successful painter and illustrator. His earlier works, which were made in the late-’50s, are widely exhibited today. In 1973, he returned to the United States to study with Ed Moses at the University of Wisconsin–Madison, where he would later become a Ph.D. student. His first solo exhibition at the official site of the artist’s birthplace, New York’s Museum of Modern Art", "The next Biennial should be hosted by the theme park and will likely be celebrated in December. The biennial has been going on since 1976 and was founded by the American rock group Grateful Dead, whose members were also involved in the creation of the Grateful Dead Museum in Los Angeles.\n\n\nThe fourteenth edition of Art Basel Hong Kong, which will take place from the Art Museum Central in Kowloon, Hong Kong, from March 23 to March 26, 2020, will now be held in the newly renovated Art & Design District in central Tokyo. The show will kick off with a special exhibition of work by three different Japanese artists, Mari Miyamura, Yasuhiro Tsuda, and Kazutaka Yamashiro, and will feature works by artists including Toda BOM and Uikku Hirata.The announcement coincides with Artnet News publishing Artnet's coverage of the exhibition, which is curated by Jeanne Mihai, director of the Museum of Fine Arts in London. After a studio installation by the German designer and curator Wolfgang Lüpper, an interactive exhibition of works by the British artist John Laplace, which was organized by the London-based charity Art in Action, and a performance by the British artist Austin Fattal, which", "The next Biennial should be held in November 2020. John C. Hoberman The Art of War: Selected Documentary Studies, 1966–1972, 1969–2019, 2019. The 2019 features a retrospective of work by Isaac Mizner, which is currently on view until October 20. The Walt Disney Company The Power of Cinema: Selected Films, 1985–2007, 2007.  Box Office Mojo will not be able to transpire to release the 2019 edition of this biennial until January 10, 2020. The 2019 edition of the Art of War, which was organized by the Japanese architect Masaoka Ichiro, was presented at the Museum of Contemporary Art, Tokyo. The 2019 exhibition featured work by seventy-eight artists, including Mark di Suvero, Ermanno Casals, Yoko Kubota, Klein, Kiki Smith, William S. Burroughs, Alex Tsakiris, and David Wallace, as well as new works by conceptual artists such as Guy Debord, Daniel Buren, and Merce Cunningham. The next edition of the show will be held at the Tokyo Metropolitan Museum of Art (MoMA), on February 22, 2020.Bart Ehrlich, director of the Museum of Modern Art", "The next Biennial should take place in 2021. \n\n\nThe Museums Association (MA), a United Kingdom–based advocacy organization, has released a statement condemning the arrest and detention of two American artists, Henry Koehler and Christo, for protesting an exhibition of works by Arturo Rodriguez at the Museums in London.Both Koehler and Christo were held at Heathrow Airport on Tuesday, December 4, for refusing to leave the United Kingdom when British Prime Minister Boris Johnson announced that the two men would be detained until British court decisions rule on their extradition. The two were charged with two counts of instigating unlawful assembly and one count of criminal damage.According to the Art Newspaper, the two were released after a court heard that both men will plead not guilty to the charges on December 18. The men were denied bail last week and remain in custody.May Koehler and Christo be granted asylum in the UK?\n\n\nThe Art Newspaper reports that the Redevelopment Authority (RA) in the United Kingdom has received a request from the London-based nonprofit the Art Fund for $6 million to rezone more than 4,000 square feet of prime real estate within the city limits of the capital, known as the \"ring of fire", "The next Biennial should be in 2021. It will take place in the Amman Art Museum, Jordan, the Museum of Modern Art, and the Museum of Islamic Art in Istanbul, and will be hosted by photographer and curator Grace Grier. Commenting on the upcoming exhibition, Williams said: “The exhibition will bring together a group of contemporary artists whose diverse practices have been translated into a shared trans-historical and trans-cultural experience through the fascination with the West and the Middle East.” The winner of the Biennial will be selected by a seven-person jury comprised of the artist, a curator, and artists, the director of the Amman Art Museum, and the director of the Museum of Islamic Art.\n\n\nThe Columbus-based nonprofit the Columbus Art Museum has received a $250,000 donation from the Walton Foundation in support of the expansion of its curatorial, educational, and preservation-focused programs. The Williams Foundation also provided $150,000 as part of a strategic $1.2 billion plan to advance the museum’s mission, including the construction of a new 19,000-seat theater and the $100 million expansion of the museum’s collection.“The Columbus Art Museum has strived", "The next Biennial should be held in 2020. “The project is a journey of discovery to develop the exhibition and the museum. It is a journey to create a new space for the exhibition, to offer a new experience for the audience, and to shape the exhibition and the museum as a whole,” the curators said in a statement.\n\nThe Aspen Architecture Biennial has announced that it is suspending its upcoming event, “Aspen Architecture and Design,” due to the coronavirus. The 2020 event, which ran from March 13 to March 15, will now take place in 2021. “We are deeply grateful to everyone who has taken part in the past and is delighted that the stage is now ready for a new edition,” said Bjørn Medland, chair of the exhibition. The event will now be held at the Aspen Institute. The 2019 event, which was organized by the Aspen Institute and the Südwestdeutscher Kunsthalle Basel, was canceled due to the coronavirus because of safety concerns. The festival, which was hosted by the Munich-based nonprofit the Lubitsch Museum and the local Stüdtische Galerie, was also affected, and", "The next Biennial should begin with a review of the current state of US‐based art and culture. The theme of the biennial should be “Music, Art, and Cinema” and the biennial should include a selection of works by artists and institutions in the US.The theme of the inaugural biennial should be “Art and Movement.” The exhibition should address the needs of artists and movements and should take place at least twice a year. The event should be hosted by the Museum of Modern Art, the Brooklyn Academy of Art, or the Museum of Modern Art in New York.The next iteration of the biennial will be “Art and Performance” and will feature works by forty-four artists and will take place at the Brooklyn Museum. The exhibition’s first installment, “San Francisco” will explore how the city became home to five continents’ top art dealers. The second installment, “Art and Movement,” will feature paintings by fifty-three artists and will be held at the National Museum of American Art, Washington, DC; the Metropolitan Museum of Art, New York; and the Metropolitan Opera House, London. “San Francisco’s ‘art movement’ is not", "The next Biennial should be held in 2020, and Glover expects the project will begin in earnest as soon as the 2019 exhibition is over. “It’s a big project, and we’re going to get there,” she said. “I’m sure they will be able to produce something new.”\n\n\nFollowing weeks of protests and a sharp drop in the number of New York City’s annual Pride parades, Mayor Bill de Blasio announced on Thursday that the city’s Pride celebrations will now take place from June 16 to June 18, 2020. The move has been made in response to the ongoing protests over police violence and the death of George Floyd, who was killed by the police officer who used excessive force on Floyd on July 13.Among those who have denounced de Blasio’s decision are the New York Police Department, New York City’s Department of Human Resources, and the city’s Human Resources Administration. The department’s top brass have since blamed the mayor; de Blasio has since blamed his predecessor. The move follows weeks of fierce criticism of the mayor, who spoke out against the protests in the days leading up to taking the unprecedented step of canceling Pride—", "The next Biennial should be held in 2022, and the Masjidal Mosque—a UNESCO world heritage site in Ghazni province, which was another site of bin Laden’s death—should be reopened in 2024.\n\n\nThe National Arts and Cultural Centre of the Philippines (NAC) in Manila has asked the National Museum of the Philippines (MMP) and the National Museum of Art in the Philippines (NMA) to work together on a major exhibition dedicated to the African diaspora. NAC president Florencia Alarcon and NMA director Irene Ip reported that the partnership has been in the works for at least six months, and were only able to push it forward due to the success of the 2016 inaugural edition, which kicked off on April 4 and ran through April 6.The exhibition, titled “African Stories” (2017), featured fifty-six works by thirty-five artists and was curated by Naci Rodríguez, who often honors and celebrates African diaspora artists. It opened at the NAC on September 6, and ran until November 16, when the institution moved to a new location in Quezon City, where it will continue to serve as a location for programming in accordance with", "The next Biennial should take place in 2020.   During its opening ceremony, Phillips listed the full list of artists who will be represented at the upcoming edition, which will be hosted at the Ark of New York in 2021. The artist’s list included Rachel Whiteread (United Kingdom), Ming Wong (South Africa), and Takashi Murakami (Japan).The biennial will be held on the seventh floor of the Contemporary Art Museum Sydney. The opening will be on March 23, 2020 and will run for four weeks, from March 26 to March 29. The full list of artists represented at the exhibition is as follows:Andrew Cage (Australia)Andrew Davies (Australia)Andy Warhol (US)Alex Gibney (US)Anna Atkins (US)Adobe Thompson (US)Andrew Harrigan (US)Andy Warhol (US)Alexis Chesnaye (US)Alexis Boyer (US)Alexis Chesnaye (US)Alexis DiGiorgio (US)Alexis Dobson (US)Alexis DiGiorno (US)Alexis Feltman (US)Alexis Fishel (US)Alexis Filippini (US)Alexis F", "The next Biennial should take place in June 2021 and will be hosted at the Santa Monica Museum of Art. The 2019 event, titled From Black to White, was held at the Santa Monica Pier, and the biennial received critical acclaim. In addition to raising awareness of the African diaspora and highlighting contemporary art, From Black to White also featured interviews with prominent African American artists and activists such as Frederick Wiseman, John Lewis, and Jean-Michel Basquiat; a retrospective of works by artists such as Ella Fitzgerald, Alice Aycock, and Albert Aycock; and a lecture series.\n\n\nAfter the Museum of Contemporary Art (MoCA) in Los Angeles closed to the public in March 2019 amid the Covid-19 pandemic, the institution received a donation of $6 million from Jonathan and Nic Cowden. The couple, who have two children together, had previously pledged $3 million in support of the museum. The gift, which has since been made, increased the total offered by the family to $6 million.“The Cowden family gave this museum a major boost by making this gift a reality,” said museum director Adam D. Weinberg. “Although we were incredibly fortunate to have received", "The next Biennial should take place in 2019. Its director, Shigeo Ito, told Artnet: “The real legacy of the exhibition is that it has opened up the possibility for a world-class institution like the Museum of Contemporary Art in Tokyo to hold two exhibitions simultaneously. ‘An exhibition of over one hundred artists from Japan, Korea, and China, including the participants of the exhibition, 嘘田郎 and 嘗田郎, will be presented in 2020.”\n\n\nThe Carnegie Museum of Art in Pittsburgh has appointed Katherine Harrison as its next director and CEO. Harrison succeeds Roberta Smith, who retired in March 2019 after twelve years at the helm of the institution. During her tenure, she strengthened its collection with the acquisition of thirty-six works by seventy-six artists and has overseen the development of a new $10 million artists' studio.“I’m thrilled to have Roberta Smith in our organization’s team,” said Harrison. “We are deeply grateful to the history-making work of the Carnegie Museum of Art’s senior curators and scholars, including Steven Koon and Becca Schoonmaker, for their critical and inspiring contributions to the", "The next Biennial should take place in 2020.    The full list of participating artists is as follows:Philip Cunningham-DawsonArtistic Director, Cardiff Art GalleryDara CollinsonArtistic Director, Cardiff Art Gallery Alex CollinsArtistic Director, Cardiff Art GalleryDiane FrielArtistic Director, Cardiff Art Gallery Benedict MitchellArtistic Director, Cardiff Art Gallery Clive ManningArtistic Director, Cardiff Art GalleryCindy PerssonArtistic Director, Cardiff Art Gallery Catherine WhiteArtistic Director, Cardiff Art GalleryAdi YaxchilanArtistic Director, Cardiff Art Gallery Maud KynastonArtistic Director, Cardiff Art GalleryPatricia OakesArtistic Director, Cardiff Art GalleryTanya SpiewitzArtistic Director, Cardiff Art Gallery\n\nThe Museum of Modern Art (MoMA) in New York has received a donation of $10 million from the Nelson-Atkins family, who gave $10 million to the institution in recognition of their financial generosity in supporting Lévy Gorvy’s project for the last twenty years.The gift, which was made in the form of a gift certificate, entitles the museum to grant the Nelson-Atkins Foundation a total of $", "The next Biennial should take place in the autumn of 2022, and the first exhibition should open in the spring of 2020. The organisers are asking the public to come together to construct the theme of the year, as well as to create works that will be displayed at the museum. The theme will also address the themes of our time, with the goal of bringing together local and international artists.\n\n\nThe Museum of Fine Arts (MA) in Boston and the Museum of Fine Arts (MA) in New York announced that they have reached an agreement in principle for the purchase of more than 8,000 works by 37 artists whose works will soon be on display in the new museum’s building on the Kendall Square campus.The works, constructed in collaboration with the artist-run nonprofit the artist-run space Département Kite, mark the first major milestones of an ambitious plan to transform the Kendall Square campus into a center for the arts. The renovation, which is expected to take five years, will include the construction of new galleries, a new showroom, and the addition of two buildings, a four-story-design extension of the existing structure, and will include the construction of a new performance space and community gathering space.“This is an exciting", "The next Biennial should take place at Madison Square Garden, New York, in 2021. Fellow organizers include Richard Armstrong of the Metropolitan Museum of Art and the Museum of Modern Art; Angelina Jolie; and the late sculptor Jean-Michel Basquiat. “The Bronx Museum of Art is one of the few museums in the United States dedicated entirely to the life and work of Pablo Picasso, and we are honored to participate in its 150th anniversary in 2021,” said Brooklyn-based artist, activist, and Bronx native Rosalind Russell; the first artist chosen to represent the Bronx in the exhibition, which will form the core of the city’s upcoming biennial. The sculpture/performance/installation will be inspired by the artist’s personal life and will address issues such as identity, sexuality, and queerness through a series of sketches and installations. “I’ve been thinking about art and culture, and about the relationship between art and people, for thirty years, and at this moment, it seems to me that art is the vehicle of a certain kind of movement and a certain kind of consciousness—a new kind of humanity,” Russell said. “I hope that this exhibition will", "The next Biennial should be held in 2020. The Barcelona Biennial will be held at the Barcelona City Hall from March 16 to March 18. The 2017 edition of the Barcelona Biennial was held at the Plaza de Catalunya from March 23 to March 26. The Biennial will be hosted by architect María Berrío and photographer Raimond Chávez. The exhibition will be organized in three phases. Phase One will be a review of the first pavilion, “Santiago,” with the work of artist Yanira Fernández; Phase Two will be a retrospective of the exhibition “La Biennial de Barcelona” (2015–16); and Phase Three will be a “review of the second pavilion, ‘Feminine and the Sublime” (2012–13).\n\n\nThe French Court of Justice (CJJ) has ordered the release of Alexandre Meneau, the twenty-eight-year-old French artist who was imprisoned for three months for violating a public order after he was stopped by a police car in the street in Saint-Denis-le-Fleuriel-de-France\u0097a suburb of Paris\u0097on March", "The next Biennial should be held in January 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced its ten-year celebration of the artists and thinkers who shaped its art-historical landscape. The program, titled “The Art of Appreciation,” will focus on “the art of\u0097the appreciation, the celebration, the understanding, the appreciation,” in addition to the work itself\u0097a theme that has been explored in the museum since it opened in 1976.“This year’s celebration will honor a group of artists, whose work has shaped the future course of modern and contemporary art,” said David Silver, the museum’s executive director. “It will include a selection of great works from the collection, as well as thoughtful reflections on the art in its public collections, and will culminate with an exhibition of work by the decade’s most celebrated avant-garde, the Nahanni, Rech, and their collaborations with the MFA.”The ten works, which were selected for the program by MCA director Justine Haffner and curator Madison A. Stevens, were selected by the board of trustees for a $10,000", "The next Biennial should take place in 2021 and will also include a public exhibition of work by the artists represented in the 2019 series.  The 2019 Biennial was organized in collaboration with the public through the partnership between the Museum of Modern Art, New York; the New Museum, New York; the Brooklyn Museum, New York; the New York Public Library, New York; and various artists, including Luna D. Hernandez, Raymond Boisjoly, R.H. Gay of the Bronx, and Judith LeBlanc.At a press conference in New York on Wednesday, the museum announced that the next iteration of the Biennial will be a multidisciplinary event featuring the work of sixty artists and will take place at a location that is currently being restored, in the city’s Meatpacking District. The exhibition will be centered around the themes of community, collaboration, and ecology. “Throughout the Biennial, artists have explored new and previously unspoken questions about community, the self, and the world, and have challenged the boundaries of what is and what might be,” said Walker. “By engaging in a single-minded focus on the important matters of life, the exhibition will be an exploration of the ways in which our individual", "The next Biennial should include presentations by scholars from around the world on the history of modern art in Japan. The theme is “The Future Is Not Present.” The film’s director, Hiroyuki Sadao, told the Art Newspaper that the exhibition will “open up a new paradigm for Japanese art.”The first Biennale exhibition, “The Future Is Present,” opened on January 10, 2020 and ran for ten days. Ten days later, the Biennale’s second exhibition, “The Piracy of Life,” opened on January 12, 2021 and ran for fifty days. It is currently open to the public for three months, from March 2 to March 9.\n\n\nThe sixteenth edition of the Venice Biennale, curated by artistic director Andrea Latella and curated by international group of artists Carla del Malo, Gio Ponti, and Andrea Guarani, has announced its full list of participating artists. The eleven artists chosen for the event are: Amara Boumedouha, Amina Chaudhri, Jawwal Dalal, Tarek Atoui, Dario Catellani, ", "The next Biennial should take place in 2022, and the first biennial in 2024. Both dates are on the organizers’ schedule. Kunstmuseum Stuttgart is planning to hold its first exhibition dedicated to the works of J. M. van der Waals in 2020, and Kunstmuseum Basel is currently preparing to stage an exhibition devoted to the life and work of Robert Rauschenberg in 2020.\n\n\nThe Netherlands will welcome seven new artists and scholars to its cultural complex in Amsterdam from June 2 to June 9, 2020, following a three-month award-and-counciling program that features more than thirty international exchanges on the theme “The Architecture of Life: Art, Politics, Philosophy, Politics, and Philosophy.” The move marks the first time four Dutch artists have traveled abroad to work on a single project, a marked departure from the country’s established tradition of awarding large-scale art projects to individuals. The exhibition is named after a Dutch artist, Willem de Kooning, who died in 1974, and will be hosted at the core by the institution, whose current exhibition hall is currently undergoing a $150 million expansion.“The Architecture of Life: Art,", "The next Biennial should be held at the new site of the National Museum of Aboriginal Art in Canberra. The 2020 event will include two exhibitions: “The Seven Sacred Houses: Avant-garde paintings from the Pacific Northwest” and “Purity: Paintings from the Pacific Northwest.” The 2020 event will also feature a Dharma Garden, a dance program, a performance, a book club, and a gallery exhibition. The biennial will be hosted by the Exhibition and Culture Centre in Sydney. The opening of the exhibition will take place at the new venue on October 3.For future programming, the Centre will plan a series of exhibitions to reflect on contemporary art. “This is a global and ever-changing world,” said Centennial Director Roberta Smith. “We will continue to present and present art and art history in our on-going work in collaboration with the communities we represent, and are already collaborating with local Indigenous communities in partnership with the National Gallery of Art, the Art Gallery of NSW, and the Art Gallery of the Arts in Melbourne.”\n\n\nIn the run-up to the United Kingdom’s general election last week, artists and activists staged massive protests across the United Kingdom", "The next Biennial should be held in October 2020. The date is also the same as the former Art in a Day’s Life, which was staged in the same location and took place in the same year. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is reopening to the public on September 19, 2019, following a $250 million expansion project that included the addition of the Los Angeles County Museum of Art (LACMA), the Pasadena Museum of Art, the San Diego Museum of Art, and the Tampa Bay Museum of Art. The thirty-fourth edition of the Biennial will run from November 2–November 6, 2020.““The importance of this event to the city and county of Los Angeles is undeniable,” said Linda Rosenblum, chair of the board of trustees. “The museum will continue to present an engaging exhibition-driven experience while maintaining the museum’s central location, creating meaningful opportunities for local and regional artists and small-scale entrepreneurs.”The reopening of the museum will coincide with Artists Marching in, the annual celebration of the artists who have influenced the museum’s work. The fifty-fifth edition of the", "The next Biennial should be held in 2022. The next Triennale in the United States should be in 2021. The 2020 edition of the Hong Kong Biennial was delayed by ten days because of a severe outbreak of the coronavirus. The Hong Kong Art Museum and Garden Museum, which has been working to assemble for the past twelve years, expects to start accepting visitors in September. In addition, the Hong Kong Fine Arts Museum (HFM), a contemporary art museum in the city, and the National Museum of Fine Arts, Hong Kong, will reopen in the next few weeks.“Our thoughts are with those affected by the current global crisis, and with the specialist teams and laboratories around the world that continue their important work to try to understand and to cure this illness,” said Chi-Yu Wong, director of HFM and the Hong Kong Art Museum. \n\n\nThe British Council announced today that it will award a total of £13.5 million to thirty-six artists in twenty-four countries. The funding will come from the Office for National Statistics (ONS), the UK’s central government body. The artists selected for the awards are Adam Clayton, Matthew Hoff, Michael Knuth, James Clyne, Sarah Jaros,"]