["The next Biennial should be a collaborative effort among artists, scholars, and institutions. “By collaborating with partners across disciplines, we hope to create a new kind of biennial, one that provides a platform for the culture of the Creative Economy’s artists to mobilize and continue to empower their communities,” Mary Anne Kamm, director of the Biennial, told the Art Newspaper.\n\n\nToronto-based artist Amira Adam has received a major new grant of $5.25 million from the Coronavirus Aid and Relief (CAR) Coalition, which is dedicated to fighting the coronavirus, in support of the artist’s “Art of Shots,” the first exhibition of its kind organized by an independent curator in the United States. Adam is the founder and curator of the experimental, work-in-progress photography blog In Situ. “Amira Adam’s Art of Shots” will open at the Diller Scofidio + Renfro–designed National Gallery in Ottawa on October 7 and will run until March 10. The show will also present a new project, a “documentary” on the impact of the coronavirus and its effects on the environment", "The next Biennial should draw from the existing collection, and should include a selection of works in three broad themes: the medieval, the Renaissance, and the modern. The theme of the forthcoming exhibition will reflect the theme of the exhibition, an exploration of the limits of art.”The new exhibition “Beyond the Modern: Art, the Modern World, and the Renaissance” will be held at the Bandar Abbas Art Museum in the capital of Saudi Arabia from January 19 to January 22, 2020. The exhibition will also feature works by artists in exile, and will feature a new sculpture by Yinka Shonibare.The first show, “The Presentations of the Land,” will be presented by David H. Spero, an American curator, art historian, and author, in collaboration with the Los Angeles County Museum of Art, Los Angeles; the Museum of Modern Art; and the San Francisco Museum of Art. The second show, “The Presentations of the Hand,” will be presented by Julia Craven, an American curator and author, in collaboration with the San Francisco Museum of Art, Los Angeles; the Museum of Modern Art; and the Museum of Modern Art. The third show will be hosted by Emily Hall", "The next Biennial should be held in the fall of 2020, with the exhibition marking the centenary of the French revolution. The biennial will organize a new collection of the work of the artist Marcel Proust, as well as a new exhibition of works by the French and European contemporary art.Proust’s works have been included in numerous exhibitions, including at the Venice Biennale in 1997, the Museum Alpes in 2009, and the Museum d’Art Contemporain in 2012. In 2013, a retrospective of his work was staged at the Museum d’Art Contemporain. In the same year, a new exhibition was commissioned for the first 20 years of the biennial series.Over the last ten years, the artist and curator has been involved in a number of international exhibitions, including the Venice Biennale (2016), for which he was the artist-in-residence; the inaugural edition of the special exhibition “Proust in Paris” (2016); and “NACLA: New Art” (2017–18), a major retrospective of his work at the Museo Nacional de Cultura Paz, Mexico City.\n\n\nThe Porsche Museum in Berlin announced today", "The next Biennial should be held in 2021 and will host twenty-eight artists. The art of sculpture will be curated by Wu Ji Yilun of the First Art Museum in Beijing. The biennial will also include the theme \"The Future of Art\" and the artist, the architect, and the curator Gao Jianfei, whose work investigates the concept of the future.\n\n\nOn Friday, the United Kingdom voted to leave the European Union, citing the loss of European culture and identity as the reason. Titled the Investigatory Powers Bill, which will also involve the surveillance of internet and phone traffic, the legislation will also give the British government the power to detain people without warrants for suspected crimes, and will give the British police the ability to carry out mass arrests.The legislation was drafted in response to mass protests against the Brexit vote in the United Kingdom, and has faced fierce opposition from civil liberties and independence groups. Some fear that the legislation will stifle freedom of the press and infringe on people’s rights, while others fear that it is too broad and will stifle political dissent.The bill, which was passed by a vote of 318 to 206, will be introduced into Parliament before the end of the month and is expected to be passed", "The next Biennial should take place in the spring of 2022.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MCA), announced today that in 2018 it renovated a portion of its main building in order to improve access to the museum. The renovation project, which was funded by a $3.4 million gift from philanthropists Michael and Bernadette Kern, was completed in partnership with the Kerns and included the construction of a new 50,000-square-foot entrance in the building that will allow visitors to enter the institution through a new glass walkway.The renovation, which was completed in 2019, added new works by local artist Nna Ziad and the Kerns, as well as works by artists from around the world. A new work by acclaimed artist Rina Akram, which was on view for the first time in its entirety, was also added to the museum’s collection. The new sculptural paneling and lighting work, which was created using eighty thousand materials and incorporating eighty vinyl panels, was made in response to the demand for more contemporary works by art-world pioneers.“The museum has been exploring ways to make the museum more accessible to people of all ages for more than a decade, and we are", "The next Biennial should be held in 2021 and will be organized in the same way as the current one, with the following changes:1. The selection panel will be comprised of members drawn from the full board, including the president and the secretary of conservation and sustainability, as well as the secretary of education. The board will be composed of three members and will be chaired by the secretary of cultural affairs, the director of cultural heritage, and the director of curatorial affairs.2. The event will be hosted in Parliament Buildings, in partnership with the Centre for European Policy Studies (CEPS), and will be hosted by a board of trustees comprised of representatives of the museum, the city hall, and the European Commission. The institution will also receive funding from the European Commission, which in turn will receive a 2 percent grant from the assembly, which will be dispersed as a proportion of its budget.3. The date of the exhibition will be September 8–September 16, 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $2 million gift from the Michael J. Fox Foundation, the David Fox Foundation, and the Los Angeles County Metropolitan Transportation Authority (LAUSD). The $2 million gift includes $1.3 million for the", "The next Biennial should be held in 2021. The twentieth is in the first quarter of the twenty-third. The biennial will commemorate the centenary of the foundation of the Centre Panéale d'études en sciences sociales (CPA), in Paris. The twenty-twelfth will be a presentation of the work of Michel Léger, and the twenty-eighth will be dedicated to the work of Anne-Marie Hewitt.The twenty-ninth Biennial will be organized in tenor the laboratory of Bruno Latour. The twenty-ninth will be inaugurated with a performance by a group of young female musicians, known as the Countesses of Verona, in the Greek city of Patras, and will be followed by a lecture by Jorge Luis Montoya, the Chilean director of the Centre Panéale d'études en sciences sociales (CPA) in the Catalan city of Almería, and a moderated discussion by Wolf Kahlen, the executive director of the CPA, in Munich.The twelve-thousand-work-year-long exhibition, titled “The Intention to Create,” will be in the exhibition “Laboratorium,” curated by Bruno Latour,", "The next Biennial should observe a new programme of exhibitions and other programming devoted to the concept of the contemporary living organism\u0097it should also introduce a new exhibition series and a new digital platform for research and discussion; and it should collaborate more closely with the Institutions. A list of twenty-four artists whose work represents their collections and institutions is posted on the Biennial’s website.\n\n\nThe Vancouver Art Gallery (VAG) is planning to reopen to the public in early March following a $250 million expansion designed by Vancouver’s city council. The $250 million expansion includes the construction of a new visitor entrance on the grounds of the institution and includes the addition of a new pavilion and gallery.The new building will also introduce new exhibitions and educational programming in addition to expanding the visual arts. The new gallery will be designed by Vancouver’s design firm, Galen Millar, and will be inaugurated by a presentation of the new model of the museum. The new exhibition space for the modernist movement will be situated in the basement of the VAG.The new curatorial and installation spaces will be located in the basement of the museum and will be connected by underground walkways. The contemporary art and design community of Vancouver will be thrilled", "The next Biennial should be held in 2022. The next Reel Art Forum should take place in 2025. The next Art of the Gathering should take place in 2020. The next Artforum should be held in 2021. The next Artforum should be held in 2020. The next Artforum should be held in 2021. The next Biennial will be held in 2022. SCHEDBAG, SCDGF, and the print and digital arts industries are preparing for a collapse that could spell the end of the current model of exhibition-based artmaking, the New York Times reports.The sponsors are working to create new revenue streams through higher ticket prices and reduced hours, and are raising funds for the costs associated with “dramatic reopening,” the restructuring of the company that owns the company behind the annual art fair, which will move to a new space at the Alliance França’s headquarters in Paris in the spring of 2021. The restructuring plans were first announced in March, with the move to the French capital set to commence in March 2022. While the new space, called the Place d’Arles, will be fully booked for at least two months, organizers are concerned about the reopening of the", "The next Biennial should be held in 2020. I believe that a new venue will be found where the public will be able to enjoy art from the artist as well as from the museum as a whole.” \n\n\nThe San Francisco Museum of Modern Art (SFMoMA) is planning to move the forty-second edition of the Sprawl Festival, which was originally scheduled for this weekend, into the spring. The March 24 event, which was originally moved to April 4, will now be held in the fall. According to Artnet, the move will allow the museum to establish a new partnership with the City of San Francisco and the Department of Public Works. SFMoMA also plans to pause construction on a major expansion and renovation of its existing building, which is currently undergoing a $500 million upgrade, and will unveil the first major design overhaul within the next year.The move has been in the works for months. In March 2019, SFMoMA announced that it had reached a tentative agreement with the city and County of San Francisco, which would pave the way for the installation of a new $200 million public plaza in Monterey Park, and had already agreed to halt construction on an expansion of its footprint. The announcement drew criticism from some local residents and", "The next Biennial should be on the theme, 'The Place of Women in Space: A Feminist View, 1947–1977,' and will be held at the museum from April 12 to April 14, 2020. \n\n\nAmerican painter and sculptor Robert Irwin (1902–1987) is one of the twentieth-century’s most influential and influential women artists, having influenced not only the careers of Al Murray, Charles Atkins, and many others, but also the identities of many early 20th-century artists and designers. Among his works are his infamous crash-and-burn, 1932’s Blue Frame, a three-channel polychromatic video installation that combines three paintings—a series that blends painting, sculpture, and installation—by John Mitchell, Michael Kors, and Orson Welles, as well as two sculptures, the two-dimensional Neuromancer and the three-dimensional Neuromancer: The Movie.Born in Cincinnati in 1934, Irwin moved to New York City in the mid-’50s to study at the School of the Art Institute of Chicago, where he met his wife, the sculptor Ella Pender; they eventually moved to their hometown, where her work was exhibited at the Art", "The next Biennial should take place at the Metropolitan Museum of Art, where it will crown the 150th anniversary of the institution's founding. The event will also include a restoration of the museum’s late-Victorian building, the Metropolitan Museum of Art, the first museum to open in the city in 1904, and a reopening of the Metropolitan Museum of Art, which is currently undergoing a $50 million expansion.The three-day event will inaugurate the new museum, the inaugural exhibition to be titled “The Prisoner of Innocence.” The exhibition, which will feature artworks by Gertrude Stein, Robert Irwin, and Thomas and Mary, will run from January 27 to March 9. The first part of the show will be dedicated to Stein’s iconic Black Madonna, an episode of The Prisoner of Innocence, and will showcase the work of thirty artists. The second part of the show will examine the legacy of the Black Madonna and will begin on March 8. The third part of the show will be on March 13. “This exhibition is a reflection of the aesthetic of New York, the importance of the exhibition. We wanted to start with a movement of indeterminacy, by taking a", "The next Biennial should be in the autumn of 2020. In an attempt to make up for lost time, we will present all of the participating artists in the same format as the first, with a new title and a new theme. We will also introduce a new register of the artists and their projects.We are grateful to the artists whose works will be included in the second edition of the Biennial, and most of all to the public for its enthusiastic support of the new format of the exhibition. We are convinced that the new platform will allow us to create an exhibition of the best works of the forthcoming biennial, a programme of shows, performances, workshops, concerts, exhibitions, talks, lectures, concerts, films, videos, performances, documentaries, performances, and documentaries-like that will be produced with the utmost integrity and creativity.”\n\n\nThe German government has released a $166 billion aid package for states and local governments struggling with the economic fallout from the coronavirus. The package, which also includes billions for the arts and culture, includes $47 billion for festivals and other events; $13 billion for small and mid-size businesses; and $8.5 billion for arts and cultural institutions and their employees.In addition to the financial relief announced", "The next Biennial should take place in 2020. The first Biennial in 2008 was held at the Albright-Knox Art Museum in White Plains, New York. In 2011, the museum staged a Reconstruction, “Theater of Operations,” biennial, “Human Rights,” which re-created the events of the Gulf Wars.\n\n\nThe Richard Avedon Foundation has announced that it will donate $2 million to the Los Angeles LGBT Community Center (LAHC), which is working to create the Los Angeles LGBT Museum. The gift is the third major financial gift that the nonprofit organization has made to the arts over the past five years. The organization also raised funds for the facility through a special auction in October 2016, which raised more than $8 million for the facility. “With the promise of a lifetime, we have made this possible through a dedicated and dedicated team of individuals and donors, and we are thrilled to see how the museum will become a beacon in the city of Los Angeles,” said David Avedon, the Richard Avedon Foundation’s executive director. “LAHC has followed through on its promise to pioneer new models for public engagement with LGBT history and has shown an incredible commitment to", "The next Biennial should be held in the United States in the Spring of 2021. Architectural Digest adds: The decision to cancel the show was made in light of the evolving situation in the country over the last year. The exhibition had been slated to run from March to June 2020, yet it was moved to the Spring. In a statement provided to the New York Times, Leonardo DiCaprio said: “The decision to cancel the show was made in light of developments in the world around me, both personally and professionally. I am very much looking forward to the new exhibition, which will take a special look at my life and I am sure many of you wish the show would have run. This is an opportunity to honor my past achievements and to create a show that celebrates the richness of the arts and the future of architecture.” The show’s trustees include John Walter, the founder and director of the firm MCH Group; Charles and Monif Schild, the owners of the prominent firm Schild & Company; and James Dyson, the co-owners of Toshiba.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Donna Frieri as its new deputy director of collections", "The next Biennial should focus on the politics of migration and refugees, on how they affect contemporary life, and on the future of art, design, public health, and society as a whole. “Art is a political instrument, a tool for articulating the possibilities of art,” said David Kincaid, chair of the festival’s board of directors. “This year’s Biennial will take the issue of migration and migration as it pertains to art and design seriously. We will be discussing the relevance of art to our current predicament and assuming that art is more political and more in tune with our time than ever.” For the next edition of the Festival, slated to run March 22–March 23, 2019, the theme “Migration and migration as art, design, public health, and society’s most pressing social issues,” will be “Migration and migration as art, design, public health, and society’s most pressing social issues.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed James Cuno as its new executive director. He is the fifth person to lead the institution since its founding by visionary former Los Angeles Mayor Mike", "The next Biennial should take place in the United States in 2022, and once the exhibition is over, a new exhibition of the remains of the SS Panzer Battalion will open in Königsberg. In the coming months, the biennial’s exhibition “βʙs Paths of Resistance” will return to the city once more. It will be on view until March 19, 2022.\n\n\nItalian curator and architect Silvia Bocci has been named the winner of this year’s Pritzker Architecture Prize. The prize, which recognizes the achievement of the 50th anniversary of the award in April, will support a new exhibition that will take up issues of modernity and architecture at large. Bocci’s exhibition “Phyllis: The Art of Architecture” will be held at the Allen Memorial Art Museum in Cincinnati in June. It will be followed by “Reconstructing the Land: Art in the City,” at the Allen Memorial Art Museum in June 2022 and “Architecture Today: Art in the City” at the Allen Memorial Art Museum in September 2022.Bocci is a leading curator, architect, and educator in Italy and the United States. Her work", "The next Biennial should focus on the use of photography and sound in the production of art, and on the interrelationships between photography and art. It should also consider the relation between photography and the art world as a whole. The theme of the exhibition should be “Life and photography: the art of photography.”The biennial will be organized as a platform for students and teachers of art history and design. It will also be curated by Karolina Wojtas, director of the Moscow Design University, and will run concurrently with the upcoming exhibition “2017/18.”The exhibition, which is being organized by the Russian Academy of Fine Arts, will include works by artists such as Pyotr Ilyich Tchaikovsky, Amedeo Modigliani, and Gennady Gramsci. Curated by Alexander Shvetsov, the show will be on view until July 22.\n\n\nThe British government has endorsed a new $16.7 billion aid package that will provide billions of pounds in aid to Britain as it attempts to stem the global outbreak of the novel coronavirus. The £9 billion package, which has been called an “imperfect vision” by George Osborne, includes $5.5", "The next Biennial should be pushed back to 2020, and the 2020 edition of the Biennial should focus on the history of India’s national artist-in-residence, Laxmi Baghramian, and the next year’s themes should be “Isolation and the Global Body” and “Fighting the Future.”\n\n\nAfter nearly three decades at the helm of the biennial, which celebrates the work of contemporary Indian artists and celebrates the country’s art scene through a variety of formats, including short-format, online, and large-scale exhibitions, the biennial’s artistic director and curator, Nalin Kohli, has announced that the twenty-fifth edition of the Bangalore Biennial will not take place. “I am very sad to announce that for the twenty-fifth edition of the Bangalore Biennial, I will not be at the helm of the exhibition,” said Kohli. “After a long and successful career as an artist, I am ready for new challenges, new opportunities, and new experiences.”While the biennial and its organizers have been working on the theme since 2010, the exhibition opened to the public in January 2011 and has since featured works by", "The next Biennial should take place in the autumn of 2021, with a new edition of the biennial to be held in spring 2022. The exhibition “Theoretical Biennials” will present trans-disciplinary projects that explore theoretical frameworks and advance the theoretical agendas of the past and future. The show will also feature the exhibition “The Resurgence of Things” and “The Selfie.”\n\n\nThe royal commission for cultural heritage of Catalonia, which was established by the Spanish government in 2015, is taking another step forward. On Thursday, Spanish Culture Minister Luis de Guindos signed an order for the construction of a museum in the capital of Barcelona in a historic district of the city. The research center, which will include a museum and a permanent collection of the region’s cultural heritage, is expected to be completed by 2021. The museum will be inaugurated by an exhibition of works by the artist Pilar Espinosa, who died in 2017, and will be surrounded by gardens and will feature a public space.The cultural center, which has been the center of a fierce campaign to tear down a monument of the region’s dictator General Francisco Franco, has been at the centre of a major dispute between", "The next Biennial should be held in the spring of 2020, with the help of an international team of curators and scholars.\n\n\nRTÉ Studios in Dublin has appointed Rowan Kavala, who has helmed the arts organization since 2014, as its new executive director. Kavala succeeds John McCarthy, who retired last month after seventeen years at the helm of the institution. “John was a remarkable talent who has shaped the direction of the RTÉ studios ever since he became a director,” said RTÉ director Monaghan Pearse. “John has been a champion of our artists and our mission, and has given us transformative opportunities to showcase their work. He was instrumental in our two-year campaign to raise $1.2 million to support the construction of a new studio in his honour, and he was instrumental in the reopening of the studio in 2017. He leaves at a great position of deep and enduring influence.”Kavala’s new role will take him through a transition period since he will assume the role of director of the RTÉ studios in January 2021. He will also be responsible for ensuring the programming of the studio’s events and exhibitions, while also overseeing the development of its digital presence.", "The next Biennial should be held at a location that can accommodate the exhibition, and should aim to bring together between sixty and seventy artists from the Philippines. \n\n\nThe Minneapolis Museum of Art (MMA) has appointed Richard Powers as its next president and CEO. In his new role, Powers will be responsible for establishing the 2020 biennial, which will focus on issues of the year, and will oversee a network of international artists that will bring together fifty-nine of the city’s best-known art galleries. “Richard is an iconoclastic and forward-thinking curator whose work embodies the spirit of the Minneapolis institution,” said Museum director Monica Levin. “Since his initial appointment in 2002, Richard has demonstrated a remarkable ability to expand and shape the core mission of the museum. His vision and dedication to innovative and imaginative artmaking are among the hallmarks of a visionary leader. He will continue to shape the museum’s collection strategy, and shape the future of RMMA.”In his new role, Powers will work alongside Angel Vazquez-Baca, who has served as the museum’s executive and artistic director since 2012, and will assume his responsibilities on August", "The next Biennial should focus on the contemporary world, and the important role of the arts in sustaining and uplifting our lives and well-being. The exhibition should aim to give voice to the voiceless and address the challenges and opportunities that individuals and communities face.”\n\n\nThe National Geographic Society’s plans to move the headquarters of its twenty-four-year-old parent company from its current home in Washington, DC, to a new space in Beijing have come under renewed scrutiny following a report in the New York Times that the organization is planning to sell off more than one hundred properties it owns overseas. In an attempt to sort through the myriad corporate interests that might be at odds with its mission, the company recently appointed Kathryn Reich to lead its international affairs division.“It is a massive undertaking, and one that will involve a lot of moving around,” said Marc Glimcher, a biennial curator and former director of the National Geographic Society’s Beijing chapter. “There are going to be a lot of cross-cultural contact points, and a lot of moving parts.” Reich will begin her tenure with the National Geographic Society on January 5, 2020.In order to facilitate the move, the company is planning to", "The next Biennial should take place in the summer of 2020. The museum will then host a second exhibition dedicated to the works of the late British director Jean-Luc Godard, and a third dedicated to the works of the late Italian director Piero Manzoni. The opening of the biennial will coincide with the kick-off of the Venice Architecture Biennale.\n\n\nThe University of Central Florida (UCCF) in Florida is losing $1 million a day due to the coronavirus, the Florida Department of Health (FDOH) announced today.According to the report, the average consumer loses an estimated $6,700 a year because of the virus, and the loss of income for the state—which has suffered $46 million in direct financial losses—has been estimated at $125 million. While the cost of treating Covid-19-related illnesses has been cut substantially, the department is predicting that the number of people infected with the virus will continue to rise.The agency said that the loss of $300 million in income has been attributed to the coronavirus; $100 million to the spread of Covid-19; and $50 million to economic damage caused by the coronavirus itself. The district attorney’s office in", "The next Biennial should take place at the Wünssee and will be held in the autumn. The inaugural edition, “The Great Exhibition of the World,” in 1955, was a completely different beast. In the exhibition, which was organized by the German-born, Swiss-American artist Werner Vossenberger, the works were presented in a highly abstract, “historically precise, and sensually suggestive style.” During its run, it was the only exhibition in the history of Germany to feature the work of a single artist.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has announced that it is planning to divest from the private museum chain it has partnered with, and is preparing to sell more than twenty-three assets to KrebsAutoArt, a private Italian art collector based in Florence. The Italian conglomerate, which currently owns the León family, an umbrella company that includes the godfather of Italian art, Giannino León, and other cultural giants Federico and Beppe Cipollina, is planning to sell the collection to the Met for $3.7 million in September and is awaiting the future of architect and collector Giuseppe Mazzucato, who", "The next Biennial should be held in 2022. \n The German city of Bonn, which has been battling to retain part of its historic Mainz Castle, has announced that it will not extend the deadline for the construction of its new cultural monument to the 1936-1945 German army. On Saturday, the city council voted to hold the memorial, which will be situated in a former iron works, for a grand opening in 2022. The decision, which was met with applause from city residents, was made in an attempt to create more momentum for the city’s bid to hold a major retrospective of the Third Reich, which will be staged in 2021. After the vote, Mayor Dieter Reimer said: “Bonn is making all efforts to secure the development of the city’s future. We have presented a bold project, and will continue to present a bold project, to the world. We will continue to do so, in the future, as a city with a World Heritage site. We will not stop.” According to the Art Newspaper, the city of Bonn plans to extend the construction deadline by another twelve months. The extension was prompted by a change in leadership of the city, when the newly appointed", "The next Biennial should be held in 2020 and will be organized as follows: Themes of the Past: The Biennial of Modern Life (2019)’s theme, Modern Life, is universal and vital, and is expressed in a variety of ways. The theme of the upcoming exhibition “Flow: Art and the Body” is created from the contemporary, contemporary art, and the family. The exhibition will address the themes of flow and the body as well as the biennial’s previous incarnations, which have devoted their fairs to issues of aging and longevity. “This year’s Biennial is a direct response to the current situation,” said Yvonne Goldor, chair of the fair’s executive committee. “Our theme of the biennial was always the importance and power of tradition. Our selection of artists, our world-class staff, and our exciting new exhibition in the form of a biennial will always reflect the spirit of the fair.”The full list of participating artists is as follows:Alexandre Béchard (France)Samantha Boyce (South Africa)Tommy Boyce (South Africa)Geneviève Brunel (France)Bernice Ber", "The next Biennial should be held in the first half of 2020 where Biennials will be organized under the leadership of a new generation of curators who will be responsible for an exhibition of their work, translating the themes of the exhibition into the form of a public space. The full list of participating artists is as follows:Peter Balós Oliver TurveyDaniel SousaDonato MonacoJenna Streb\n\nThe Director of the Museum of Contemporary Art (DMA) in New York, Charles D. Farbman, has announced that he plans to resign in March 2020 and return to the United States after completing a three-year fellowship at the Museum of Modern Art (MoMA) in the fall of 2020. Farbman, who has helmed the museum since 1993, will assume the role of director of the Brooklyn Museum, which will remain in New York.“I’ve been a board member of MoMA since 2000, and I’m proud to have helped to develop an environment where thousands of art-lovers can visit the museum every year, converse with museum staff, and sample works by some of the most celebrated artists of our time,” Farbman said in a statement. “MoMA", "The next Biennial should mark the occasion of the artist’s forty-fifth birthday. The event will be organized in collaboration with her son and current director, Michel Dallouil. For the last three years, the artist has been visiting the museum on a daily basis. The first event took place in November 2016, when she and Dallouil staged the first Biennial at the museum in the artist’s home. The second iteration of the exhibition took place in March 2019, and the final event was staged in April 2019. The biennial will visit Museums and Cultural Platforms across the city of Saint Petersburg and will showcase contemporary artists. The exhibition will be curated by Oleksandr Lutsenko, director of the Leningrad Art Museum.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Kate Fogle as its next director. Fogle comes to the museum from the Boston-based nonprofit the PREDATOR Project, where she has served as senior director of development and external relations since 2016.“Kate’s proven track record in integrating art and philanthropy and her desire to forge new connections with local, regional, and national leaders exemplifies the values we�", "The next Biennial should take place in 2020.  The museum will then continue to grow with the installation of new works by award-winning artists.  The next edition of the Art in the City event will be held at the Museum of London in 2021. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MoCA), has announced that it is looking to relocate the works of Annie Godfrey, Midge Decter, and Thomas Niles, which are currently housed in the museum, and to open their galleries in 2020. The move was made in anticipation of new contracts with the artist collective Artists’ Rights Society.“The move is in line with MoCA’s ongoing commitment to supporting and cultivating the work of emerging artists, our new contracts with Decter and Niles, and our recent expansion to the new building, which will enhance the museum’s ability to keep Milwaukee in the loop, help us develop new projects and engage with local communities,” said museum director Nicholas Hildkvist. In addition to the artist collective, which will reopen in 2022, MoCA will begin a major renovation of the museum’s collection of contemporary art. It will also expand its", "The next Biennial should be held in 2021, when the first exhibition will be inaugurated by Misa, an artist-in-residence from the Iberian island of Madeira, Portugal; the exhibition will be preceded this year’s by an exhibition of works by the contemporary artist Tatjana Prusak, which was staged in October.The programme will include works by the then-unknown artist María Berrío, whose practice blends sculptural and sculptural-inflected performances; the artist-in-residence who founded the website www.misa.be; and the artist-in-residence who works primarily in video and film-printing.Commenting on her selection, Teresa Fedor, a senior curator and curator based at the museum, said: “Misa’s work is as moving and striking as any of her films, and her video works always take the viewer to places where motion and fluidity are central to the work. Her works know how to be at once relevant and new, and her video works belong to a movement that has become central to the visual arts in recent years.”The 2020 Biennial will run from March 16 to March 20 and will offer various programming in", "The next Biennial should be held at the Künstlerhaus in Karlsruhe, Germany, where a show of the works of the sixteenth-century Polish sculptor Beata Wissowska, the great-granddaughter of Polish president Wislawa Węstanska. Wissowska, who is known for her works that engage with topics such as the history of science and the history of women, is to present a new drama program at the Berlin-based commune Oberhaus in September.\n\n\nA new exhibition at Kunsthalle Basel is scheduled to open in the Chinese city of Beijing on February 5. In honor of Prime Minister Li Keqiang’s birthday, the 17th edition of the China/Russia Exhibition will feature thirty new works by nine artists. The show will offer a preview of the upcoming 50th anniversary celebrations of the two countries, and will take place in December 2020.Since the exhibition is based in Shanghai, the artists are committed to producing works in the Chinese city. Three of the works in the show—Solomon Rauhssen’s Modernism in a Contemporary Setting (January 2019), Tomer Hetouma’s Theater of Operations (", "The next Biennial should be held in 2021. “The biennial is a reflection of the city’s future aspirations, and of the long-term work of biennials in the city’s history,” said Laura McKissack, executive director of the biennial. “The theme of the upcoming exhibition is the city’s future and work, and the exhibition should honor the work and character of the artists who have shaped the city’s art and architecture.”\n\n\nAn inquiry into the circumstances surrounding the death of a British artist may soon take place in a Bronx courtroom. In the course of an ongoing legal battle, Raphael Padilla, a New York–based artist who had been working on a large-scale installation, was awarded $3 million in damages by a judge who ruled last month that the work, titled Stage Fright,” was not considered “worthy of the gift” of Jonathan Pryce, a New York–based artist and the founder of the Pryce Group, and was therefore not eligible for a private memorial service.The judge ruled that “Pryce leaves little to the imagination as to what might have happened had the work been sold to him for", "The next Biennial should be held in 2019.  \n\n\nThe nonprofit Art Museum of Chicago, which was forced to close over the summer due to the coronavirus, has received a gift of twenty-six works by artists including Luis Campos, Joye Bouche, and Oriana Fallaci. The works, which were donated by Michael K. Williams and Debbie Linklater, are included in the museum’s current exhibition “Winter on the Move,” which opens on December 7.The gift, which was made by Williams, the president and CEO of the Knoedler Gallery, a New York–based company that provides transportation, storage, and exhibition space for artists, was made in recognition of the institution’s close relationship with the artists. The partnership began in 2016, when Knoedler helped build the museum’s new space on the North Side. According to Artnet, the works were donated by the late artist Carlo Rosales, who passed away in 2018, and by Odette Laudel, who made her first solo exhibition at the museum in December of 2018. “The works are wonderful and superlative and reflect a deep and important tradition in", "The next Biennial should be held in 2021, the Noguchi Foundation’s president and CEO, Charles Noguchi, told the Los Angeles Times. The museum is planning to remodel the facility and will consider the feasibility of installing climbing walls, a pool, and a pavilion for the exhibition.The Los Angeles County Museum of Art (LACMA), which has been at the same location since 1999, is currently undergoing a $1.5 billion expansion. LACMA’s new home is in the city’s Historic Arts District and will include a redesigned exhibition space and an auditorium.The new LACMA is designed by the same firm that created the original Museum of Modern Art in 1967. The museum will boast 1,200 rooms and will offer free admission for thirty days to visitors twenty-one years of age or older. It will also boast a restaurant and a movie theater. The renovation and expansion project was funded with an $11 million federal grant. \n\n\nThe Association of Art Museum Directors (AAMD) is asking the federal government to establish a national fund dedicated to the care and preservation of the collection of art within the United States. The funding would come from the Oversight Recovery Fund,", "The next Biennial should be held in 2021; it will then include a “final project for the exhibition’s ‘translation” program. The project, which will involve the installation of twenty-one paintings from the exhibition, will be organized as a panel discussion on the exhibition that will take place at the end of the exhibition. It will be organized in collaboration with the National Museum Moscow, the National Museum of Fine Arts in Oslo, the National Museum of Contemporary Art in Munich, the National Museum of Fine Arts in the Arts of Art of Moscow, the National Museum of Fine Arts in the Arts of Modernity in Moscow, and the Sberbank Museum of Art in the city of Saint Petersburg. Advertisement\n\n\n\n\n\n\nThe Perrotin Foundation, a New York–based organization that provides financial and cultural support to artistic and cultural workers in the United States, has awarded $50,000 to twenty-three artists in the Greater New York Area. Established in 2017, the grantees are: Christopher Atkins, Arts of Life, Origin, Work of Art, and Art of Life; The Black Acre Project, which works with African American artists to promote Black identity through installation and performance; Fred", "The next Biennial should be on the question of the history of art. Currently, there is a great sense of symbolic distance between the two events. The next edition of the Biennial will take up this question by presenting a selection of new works by artists from different periods in its history, drawing from the collections and the collections of renowned curators, scholars, and curators. In recognition of the interdependence of the two subjects, Biennials will be collaboratively organized and will be affected by the same interconnections, the same histories, and the same processes, and so the next edition of the Biennial will have the same ambitions as the previous one. The new Biennial will ensure that the Art of the Past, which is an integral part of the theme of the 1st Biennial, will be remembered and will offer an alternative format for the exhibition of works from the collection of Anna Kukuro, the founder of the Kukuro Gallery. A selection of biennial works will be presented by artists from the collection of Yuki Hoshine and will be displayed in the exhibition “Yoshitomo Takeda” in Tokyo next month. The exhibition “Art of the Past,” which will", "The next Biennial should be ready for the 2020 edition, which will be held at the Tadahanga Contemporary Art Centre in Durban. The artist’s studio/workshop will be inaugurated by a public exhibition, “Red Sun,” at the venue in April 2020.\n\n\nMichael Meade, a New York–based artist whose practice encompasses installation, performance, video, photography, and sculpture, has died. He was ninety-eight years old.Born in New York in 1941, Meade grew up in a New York City household with a father who was a superintendent of tenant services, and a mother who was a homemaker. Meade studied with Alan Silver at Columbia University and worked in the garment industry, but in the 1970s, he began to focus on painting and started to experiment with his own body.Meade’s earliest works were adaptations of works by Franz Kline, which include Fashioning The Body of Franz Kline, 1967. The series, titled Auf immer Freund, was an experiment in performance art and the body. The work became a centerpiece in the late ’70s for its installation in a series of paintings in which Meade portrayed the body as", "The next Biennial should be held in India in the year 2021, the organizers of the event said.\n\n\nThe Museum of Modern Art (MoMA) in New York has been awarded a new $25 million grant from the Andrew W. Mellon Foundation, which was established in 2011 to support the design and preservation of modern and contemporary art in the United States. The $125,000 grant also added twenty-one works by ten artists to its collection, including Lisa Loven and Adrian Piper.Loven, the first female artist to win the National Medal of Arts, was selected for her installation The Nude in the Museum of Modern Art, which opened to the public in June 2019, and her work The Naked Highway, which was on display for the first time in the museum as part of a retrospective of her work at the Museum of Modern Art in March 2020.The grant also funded the design and construction of a new Andrew W. Mellon Fellowship for Art and Design, which will offer fellows $50,000 to design and create new collections, and the Andrew W. Mellon Pavilion for Art and Design at the Museum of Modern Art in the year 2020.Each grantee was given $50,000. The deadline for applications is April 24. Grantees will be", "The next Biennial should take place at the Museum of Modern Art, which is currently closed due to Covid-19. We are planning to carry out more research to understand exactly what factors might be influencing this, so that we can continue to present innovative and thought-provoking exhibitions and events in a timely and meaningful way.”\n\n\nA group of Los Angeles–based artists and designers have sued the city of Los Angeles and six of the city’s design-industry representatives, accusing them of failing to protect the artistic community that is currently threatened by the coronavirus. The suit—which was filed by Brooklyn-based designer Akua Akunyili and her sister, Suzy Akunyili, in Los Angeles Superior Court on Tuesday and has yet to be heard by a jury—is one of several that have been filed by Arts4LA, a coalition of arts organizations, including the Los Angeles Alliance of Museums, Artists’ Association of Southern California, Artsnet LA, and the Los Angeles City Council, against the city and six of its design officials: architect Frank Gehry, who most recently served as chief curator of the Warner Bros. Museum of Art, and city planner Jack Evans.According to the suit, which", "The next Biennial should be held in 2022. \n\nAdvertisement\n\nThe Dusseldorf Art Museum in Germany has been awarded a $4 million grant from the Max Hetzler Foundation. The fund, which was established in 2012 by the German social democrat politician and collector Hermann Hetzler, received the $3.5 million grant in recognition of his commitment to supporting the museum’s program. Commenting on the grant, Dusseldorf’s director Christian Brüggemann said: “It is a great honor to receive the Max Hetzler Foundation’s support for the Dusseldorf Art Museum. The museum developed a brand new exhibition that will commemorate the seventy-fifth anniversary of the outbreak of the measles. Under the appointment of Max Hetzler, the Dusseldorf Art Museum has grown to become a true museum of art, and today remains a true cultural center.”The prize will also be awarded to the Rembrandt Foundation in the United Kingdom for its commitment to supporting exhibitions and educational initiatives. The museum will be given a total of $4 million. \n\n\nThe Solomon R. Guggenheim", "The next Biennial should be held at the Museo de Artes Plásticas (MASP) in Madrid next June. The second should be held in the city of Bandelgüria in April 2021.\n\n\nThe Royal Academy of Arts (RA) in London has received a gift of twenty-two pieces from the National Galleries of Scotland. The donation includes two rare works by the artist Jack Hain, from the Finnish collection, and two sets of works from the British collection, from the House of Nelson.The new arrivals are from the British Museum (BHM), London, and the National Gallery of Scotland, Edinburgh. Both sets are valued at between £2,500 and £3,500.The BHM, which is housed in a former textile factory in Glasgow, is currently undergoing a major renovation, and the National Gallery of Scotland, which opened in Edinburgh in 1955, is currently constructing an additional 450,000 square feet of exhibition space. The institution will also be adding a new celebrated Jack Hain and John Barlow exhibition, which will be staged in 2019, and plans to open its new Marsden Endowment building in 2030.The National Galleries of Scotland also announced that the twenty-second", "The next Biennial should be held sometime in the second half of 2020, said Katherine Kuhn, the executive director of the Biennial, in a statement. “We are looking forward to working with our audience and collaborating with them as they transition into the new year.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has received a gift of fifty-two works by eighteenth-century textile technologist Jane Austen. The works, which were donated to the city by the Austen Museum in Manhattan, were acquired through a ten-year, $6.8 million fundraising campaign led by the Jane Austen Arts Partnership (JAA), an organization that supports arts and cultural organizations in New York City. The pieces were donated by artists including Robert Graves, Helen Frank, and Robert Irwin. The foundation will donate half of the works to the Jane Austen Museum and the other half to the DCLA. The new arrangement is part of a $10 million cultural campaign to raise $6.8 billion for the city’s cultural infrastructure, including the New York Museum of Art, the Metropolitan Museum of Art, the Brooklyn Museum, and the Bronx Museum of the Arts.The campaign, part of Mayor Bill de Blasio’", "The next Biennial should be in 2019. The Fisk University Art Museum in Rochester, Minnesota, will also be reopening this fall.\n\n\nSculptor Peter Hong, a Hong Kong–born, US-based artist known for his large-scale works, such as his large-scale sculpture The Perfect Situation, 1993, which is currently on view in the exhibition “The World is Not Enough: Chinese Art in Hong Kong” (2019), which is on view until January 3, 2020, at the Fisk Museum, in St. Paul, Minnesota. Hong was awarded the National Medal of Arts last year.Hong formed his first group of Chinese artists, the Shenzhen Group, in 1992. He began collaborating with Hong Kong artists in 1997. In 1999, Hong hosted the exhibition “New Portraits: China in Hong Kong” at the Fisk Museum. He became affiliated with the museum in 2006.Hong was selected for a $2,500 award for excellence in artmaking in 2019. The ceremony took place at the Museum of Contemporary Art Hong Kong. \n\n\nNew York’s Solomon R. Guggenheim Museum and the Metropolitan Museum of Art are planning to build a new $2.5 billion center", "The next Biennial should be held in 2021. The museum will begin welcoming visitors from January 1, 2020, to March 31, 2020, with the first exhibition scheduled to open in March 2021. “The Future Is Now: From the Art of Artificial Intelligence to the Design of the Future,” which was organized by the British artist Richard Ings, is slated to open in March 2021. The forthcoming exhibition, titled “Artificial Intelligence and Design,” will be the first in a series of exhibitions that will explore the interrelationships between art and technology. Among the works scheduled for the event are “Artistic Intelligence and Computer Science” (March 2021); “Artificial Intelligence and the Future of Work” (March 2021); “Artificial Intelligence and the Future of Life” (May 2021); “Artificial Intelligence and the Future of Learning” (May 2021); and “Artificial Intelligence and the Future of Health” (May 2021).\n\n\nIn a move that could reshape American art, the Carnegie Museum of Art in Pittsburgh has launched an online viewing room and a digital-only version of the museum, which was already available only in-person, in an attempt to engage", "The next Biennial should be held at least two years from now. I really believe that this is a very important project and that we should be working together with the Cultural Heritage Foundation of the State of California to make sure that this piece of California’s history is preserved and made accessible to future generations. In the meantime, the museum is working with the Heritage Foundation to develop a new set of guidelines for where the works can be displayed and is working with legislators and others who may be interested in preserving this piece of California’s past to find a way to remove it from the site. I thank our staff and community for their efforts in making this possible.\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of four hundred photographs by Claudia Bocconi. The donation includes ninety‐four portraits, including Frida Kahlo, Pablo Picasso, Henri Matisse, and Jean Du Beug. The gift was made by the Joslyn & Joslyn Company, which is based in Bellevue, Washington.“The gift of these four hundred photographs is an incredible honor and a tremendous relief to all of us who have worked with and admired Bocconi over the years,” ", "The next Biennial should be held at the Exhibitionist, London, in 2022, and the fourth at the Musée National Picasso in Paris in 2024.  Bradbury and the Art Institute of Chicago have announced plans for a new exhibition to take place in the Museum of Contemporary Art (MoCA) in 2020, and the 2019 and 2020 editions of the Art of Living will be staged at the institution in 2020 and 2021. \n\n\nThe Metropolitan Museum of Art in New York has created a new position to represent art at large institutions in the city. Named after the late American architect David Chipperfield, the new position is tasked with supporting new and existing artists in the city. In a statement, the museum said the appointment was made \"in recognition of the historic value of the work of David Chipperfield and the cycle of his life and work.”The new position was created by appointment of David Chipperfield’s contemporary, Harvey Prefect, and was created in celebration of the museum’s centennial year. The museum will inaugurate the new position with a special exhibition of works by David Chipperfield and his immediate circle on Monday, January 23, 2020.The museum is constructing a new David Chipperfield–designed", "The next Biennial should be set in the plaza of the Museum of Modern Art, which is currently undergoing a $500 million renovation. The 2020 edition, titled The Art of Happiness, will be launched on September 23 and be followed by a follow-up exhibition, The Art of Destruction, on October 7. Beijing Biennials-2019 will be held at the new 33,000-square-foot museum on the ground floor of the Art Deco Beijing State Museum (ADM), from September 19 to September 21. The first exhibition will feature work by 16 artists, including Anton Kern, Bartolomeo Zingaretti, Fotopressu, and Mackenzien. The second, titled The Final Day, will be staged on October 4 and will run until October 8.The 2017 edition of the Beijing Biennials, titled The Art of Innovation, was held at the ADM from March 3 to March 6. The 2019 edition, titled The Art of the City, was held at the Art Museum Beijing. The 2017 and 2019 editions of the Beijing Triennial, Artists in China: Export and Import, were staged at the Art Museum Beijing and the Art Shanghai.The Beijing Art Museum", "The next Biennial should take place in Mid-Autumn in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has released the schedule for the next Biennial of Italian Modernism (BIM). The three-day event, which will run April 13–April 20, will be hosted at the Atlanta Museum of Art (A.M.A.), which is currently undergoing a $150 million expansion. The inaugural edition was held at the museum in March. The second and third editions were held at the Museum of Fine Arts in New York in 2017, and the twenty-eighth Venice Biennale was held at the museum in 2019. The 2019 event took place at the historic Villa Borghese, a former convent that is now a museum. The 2020 event will follow the theme, “Feminine and Human” and will be held at the Museum of Fine Arts in Boston. “The BIM is a celebration of the full range of artistic achievement in contemporary Italy,” said Mark B. Stein, the director of the museum and the executive director of the Museum of Fine Arts. “It is a celebration of the expertise and creative spirit of the four founding members of the BIM, Shiger", "The next Biennial should be a review of the work of the artist-in-residence, Hélio Oiticica, who is based in the northeastern city of Santiago, Chile. The festival will be hosted at the Museo de Arte Contemporáneo in Buenos Aires.\n\n\nThe Saatchi Gallery in New York is expanding its presence in the city with three new exhibitions and a collection of contemporary art, according to the New York Times. The third exhibition will be on the artist-in-residence, Alex Abad, and will open on January 10, 2020. The second exhibition, which will examine the work of the artist-in-residence, Chantal Akerman, will open on March 13, 2020. The third exhibition will be titled “Olivier-Auguste” in June 2020. The shows will feature works by artists such as Olu Riël, Alex Alegria, and Maren Braden, among others from the Saatchi Gallery.The expansion of the museum coincides with the opening of “Olivier-Auguste” (2019), a major exhibition devoted to six decades of artmaking by the artist-in-residence, which", "The next Biennial should take place in 2021 and will be hosted at the museum in cooperation with the Museum of Modern Art, in New York. The art of the biennial should reflect the current extent of the exhibition. It should also use a contemporary art medium, while insisting on a continuity of the exhibition with the biennial. The institution will introduce a biennial exhibition series that will highlight the work of emerging artists and will introduce new artists to the exhibition program in conjunction with the biennial. The program will be curated by Ramona Carter, curator of contemporary art at the Whitney Museum of American Art in New York, and will be directed by Joseph B. Evans, director of the Asian Art Archive, and will be presented by James L. Martin, curator of contemporary art at the Whitney Museum of American Art in New York.The Biennial will be hosted by the Museum of Modern Art in collaboration with the Metropolitan Museum of Art, the Met, and the Solomon R. Guggenheim Museum. The caption: “Who Goes There?” will be displayed in the exhibition “The Art of Doing Things” and will appear in “The Price of Everything” and the ’70s film The Artist’s Body.", "The next Biennial should take place in 2022, and the twenty-first will be held in 2020. The second edition, titled LIMA, is currently on view until March 24, 2020.\n\n\nThe Annandale-based nonprofit Gallery Without Borders (GIB) is suspending its springground opening in London and will postpone its third edition, set to open in April, until at least April 19. The event, which would have taken place at the Annandale Sculpture Garden in the city of Kent, United Kingdom, and was being staged by the Annandale-based artist and curator Rickert Hanley, will be held at the Annandale Art Gallery from March 14 to March 25, 2020. Its exhibition “LIMA” will feature work by eighty-three artists from forty-five countries, including the United States, Italy, Switzerland, and Russia.“We are deeply grateful for the support of the British and international communities, and especially the support of the artists and collectors who have made London such a vibrant and welcoming community,” said Marc Spiegler, the director of the Annandale Art Gallery. “We are committed to working with all of our partners, including the artists, to", "The next Biennial should be held in 2021 and will be commissioned by a new collective of sixteen artists. The festival is currently accepting submissions from artists who are based in the United Kingdom and the United States. The exhibition will be hosted by the Tate, London, and will take place at the Tate Modern in London from November 19 to November 21, 2020. From show creators to the artists themselves, the exhibition will feature an international cast that includes artists from the United States, Italy, Georgia, and South Africa, as well as established and emerging artists from Central and South America. \n\n\nThe Art Newspaper has released an excerpt from a new interview with artist Sergio Cervantes, in which the poet discusses his relationship with the American flag and its association with liberation struggles. “The flag is at the heart of my life, of the revolution,” Cervantes, whose work sometimes addresses themes of the flag and patriotism, told the Art Newspaper in an exclusive interview in July, reminiscent of the American flag and its ongoing association with freedom struggles. “The victory of freedom is not only a victory of democracy, but also a victory of humanity.”Cervantes, who died in the Spanish Civil War", "The next Biennial should focus on both the history and future of the garden and museum in the city, and will expand the exhibition to include the institution’s collection and exhibition space. The first exhibition will open in 2020 and will visit the history of the museum with a view of the gardens. The second exhibition will take place in the museum in 2021 and will present the collection and exhibition space at the garden.\n\n\nThe European Space Display (Esters) in Brandstift, Germany, has given the green light to a new exhibition, “The Future Is Present: Modern Art from the Seventeenth to the Twentieth Century” at the the German pavilion in the Venice Biennale. The exhibition will feature work by seventy-nine artists from thirty-six countries and twelve countries in Europe. The artist-in-residence, an American-born Curator from the United Kingdom named Octavia England-Motion of London, will join the tour in 2020.“We are thrilled to add Octavia England-Motion to our team and to the history of the festival,” said María del Carmen Mendieta, director of the Esters. “She is a talented and committed curator whose international reputation and reputation for presenting", "The next Biennial should be held in 2022. The exhibition will take place in the newest exhibition space of the Biennale in Amsterdam, the Aarhus Biennale, and the Centre Pompidou. Its main objective will be to commemorate the fifty-seventh anniversary of the defeat of the Nazi regime in World War II. The exhibition will feature three hundred works by forty artists from twenty-three countries. Among the works on display will be works by the Holocaust’s most celebrated artists: Adolf Hitler, Karl Lueger, Frederick Seitz, Richard Kahler, André Baptiste, and Hannah Wilke.\n\n\nNYC’s Metropolitan Museum of Art is planning on opening an outpost in the city’s Gowanus neighborhood, where the institution has a space in a former steel mill in the 1960s, but has been tight-lipped about when it will be able to welcome visitors. The Met, which has six other locations in New York, is seeking a ten-year lease at the site, which is zoned for commercial use only. Since plans to build a new $1 billion Met building have been in the works for some time, the institution was quick to", "The next Biennial should be announced soon. \n\n\nThe Museum of Modern Art (MoMA) in New York is preparing to welcome visitors back to the institution in the wake of a devastating fire that swept through the institution on Thursday, February 14, at around 9 PM. The blaze, which broke out on the third-floor of the museum, has since been classified as accidental.The museum, which is currently closed until March 14 due to the Covid-19 pandemic, issued a second statement on Friday, informing visitors that it is working to reopen, but that it is not yet able to begin the process of removing the wreckage of the destroyed building. According to the New York Times, the museum is planning to open to the public once the fire is contained.The firemen who extinguished the blaze, which burned for six days before it was put out by the New York City Department of Environmental Protection (NYCD), were able to extinguish the blaze within hours because the building is equipped with fire-damaging equipment that was installed in the building prior to the fire. The fire department has since confirmed that the fire was caused by an electrical problem, not a gas leak.According to the New York Times, the firemen found no evidence of forced entry", "The next Biennial should be titled “After the events of March 19, 2019.” The theme will be “The state of our possibility.”The exhibition will be organized entirely within the walls of the exhibition space, having been assembled and arranged by the five-member team of artist-activists who collectively produce the award-winning shows.\n\n\nThe Portland Museum of Art (PMA) announced today that Melissa Chiu has been appointed as its new board chair. Chiu comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as director for twenty-eight years. She is the first woman to lead LACMA and has helmed the museum since its dissolution in 2006.“Melissa has been instrumental in guiding LACMA through its most challenging period, from the 2009 reopening of the museum to its current incarnation as the Portland Art Museum (PMA),” said Portland Mayor Ted Wheeler. “Her record of success and commitment to art and the arts makes her uniquely qualified to lead the Portland Museum of Art through its next chapter.” During her tenure, Chiu oversaw more than twenty-five thousand works and helped the museum become a model for museums around", "The next Biennial should be set up in January 2020, when the Art Newspaper reported the opening of the Biennial of China’s Contemporary Art at the Kunsthalle Beijing, the first museum to host China’s first-ever museum of Chinese art.  Better still, it should be a continuation of the art-making process that began in the 1980s with the opening of the China art biennial in Beijing in 1999.\n\n\nAs New York City heads into Phase 4 of its reopening plan, the city is preparing to welcome the public at a cost of $1.2 billion, a slight increase from the $1.1 billion it spent to complete the project in February. The $1.1 billion that remains, however, includes $800 million for the redevelopment of the Javits Center, which houses the Museum of Modern Art, the Metropolitan Museum of Art, and the Whitney Museum of American Art, as well as the Metropolitan Opera House and the Metropolitan Ballet Theater. The remaining $540 million is for “transformational improvements,” the city said.“At this critical juncture, the City of New York is committed to spending $1.2 billion to re-open our iconic landmarks, our cultural", "The next Biennial should be held in the second half of the year. The museum is hoping that the exhibition, entitled The Intersection of Art and Design and Technology, will be completed by July 2020 and will present the first part of its first-ever major retrospective, which will be held at the museum in the fall of 2020.  The museum will then host the second part of its first-ever major exhibition. This second part will focus on the history of the intersections of art, design, technology, and the social and will be organized in collaboration with the local communities of the Museum, on a continent-wide scale.A version of this article was published in the July/August 2020 issue of Artforum.\n\n\nRebekah Burke, the wife of Apple cofounder Steve Jobs, has been named the next chair of the Walt Disney Company. Burke is the second woman to lead the company in its history and the seventh woman to run for chair. She succeeds Richard Armstrong, who retired after a forty-five-year tenure on June 3.“We are thrilled that Rebekah will succeed Richard as chairman of Disney,” said Walt Disney CEO Bob Iger. “Our artists, writers, and creators have a special responsibility", "The next Biennial should be held in 2022.\n\n\nThe Caen Gallery in London has launched a new exhibition devoted to the work of Romanian artist and theorist Stanisław Gieda. Gieda’s groundbreaking experimental artworks, which reflect his pro-democracy, anti-imperialist, anti-imperialist communist leanings, are set to open at the gallery’s new site in Maida Vale in the City of London in December 2020. The show will also present work by artists in the field of film and video, and will continue to present short-form works by artists from around the world.Set on the 125th anniversary of the birth of Romanian theorist Slavut, the show will explore the conceptual processes behind Gieda’s work, which includes his “La vita” (Two Girls), 1972, which celebrates the twenty-sixth anniversary of its conception and is dedicated to the contribution of the six daughters of Stanisław Gieda. The exhibition will also highlight the films and videos made by Gieda, whose body of work comprises works from his 1971–2015 period, which was centered in the late ’50s and early ’70s.Commenting on", "The next Biennial should be held at least twice a year and should be organized to include a public program that represents the diversity of our communities, including a virtual reality exhibition for young people and an open access exhibition for the elderly. The biennial exhibition has been presented as a potential solution to the dearth of contemporary art exhibitions in Hong Kong, but the exhibition has faced strong opposition from both local and foreign critics, who argued that the project would place a heavy financial burden on the local arts community and would be difficult for the biennial to sustain financially. \n\n\nThe Chicago Architecture Biennial, curated by architect-turned-collector Ralsa Wijesooriya and featuring works by twenty-four artists, including Richard Diebenkorn, Karl Lagerfeld, Joël Sallet, and Ulla and Frank-Nina Schwirth, will reopen this fall. The exhibition, which was organized in collaboration with the Chicago Architecture Center (CAC), will feature works by seventy-seven artists. The exhibition is part of the city’s 28th Architecture Biennial, which consists of research on architectural forms and their relationship to urban development, public policy, and the environment.The biennial, which opened on December 5, 2019, will", "The next Biennial should be held in 2020.  Diana Al Hooraly, a French artist and curator, and creative director of the Paris-based company Creative Space, has said that the theme of the biennial should be “about the very evolution of the universe.” The event will be hosted by the Alali Art Center in Alali, France; the Alpergoud Museum in Dusseldorf, Germany; and the Royal Academy of Arts; and will be held at an altitude of one thousand feet.The first edition of the biennial, “The Big Bang,” was held in 2002 and was notable for its audacity: At the time, scientists thought the universe had only been around for about ten billion years. The exhibition showcased the work of ten artists and featured work by thirty-nine artists. The event was organized by a committee comprising Peter Meijer, a curator and Berlin-based artist; Catherine Montagnier, a curator and curator of modernism, art and architecture; Jean-Luc Melanin, a curator and modernist artist; and Bénédicte Galan, a curator and curator of architecture and design.The twenty", "The next Biennial should take place in 2022. The 2022 event “will include the first public exhibitions of the artist’s work in the UK since 2012, and will be hosted at the Tate Britain in London, Telfs Gallery in London, the National Galleries of Scotland, the National Assembly Gallery in Edinburgh, and the London Gallery of Art.”\n\n\nThe Takashi Maoka Foundation, located in Tokyo, has received a $25,000 donation from the Kochi-based philanthropists Seiji Ihara and Takashi Maoka. The donation is the latest in a string of awards given by the two men, whose foundation has supported projects in the arts and human sciences since 2008, as well as in conservation and education.“We are delighted to receive this extraordinary gift from the Kochi-based philanthropists Seiji and Takashi, who have helped shape our vision for the 2020's Takashi Maoka biennial,ʜ said Takashi. The artist will be receiving this award in recognition of his work and artistic achievements. He has given us a great example for the future of art, which is highly valued by the foundation.”Maoka, who has exhibited his work at the Japan pavilion in", "The next Biennial should be held sometime in the first half of 2020. \n\n\nThe German government will allocate $6.3 billion to the arts and cultural sector in an attempt to avert the global health crisis sparked by the novel coronavirus. Chancellor Angela Merkel announced the relief package, which also includes funding for local and international support, on Wednesday, November 17. The Allgemeine Universität Berlin, Diesen Universität Frankfurt, and Düsseldorf University are among the institutions that have recently announced they will not reopen. The emergency aid package was considered ahead of schedule by Merkel and other senior German cabinet officials in late November, because of the rapid spread of COVID-19, which the World Health Organization (WHO) declared on October 26 as “non-lethal,” and has been in the works since May. “The European Union has taken a decisive and decisive role in stopping the spread of COVID-19 in Europe and in the world,” Merkel said. “We expect that this support will continue with the reopening of the museums and the institutions, and will be available as a", "The next Biennial should be held at a different location in the city during the fall, and might be held at a later date. The institution’s board chair, Joseph C. Johnson, said: “This is an unprecedented situation. It is extremely challenging at this point to provide a date for the exhibition, but we believe it will be sometime in the spring. As always, the board is committed to protecting and enhancing the exhibition, and we will provide additional information as appropriate.”\n\n\nThe crowdfunding platform Kickstarter has raised a staggering $164 million in six months, half of which was devoted to artists who were seeking funds for their upcoming works. The funds were distributed in installments, with artists receiving $10 million each, and the remaining $8 million going toward artists who had not yet received funding. Some of the money has been used to pay artists and organizations, and the majority has been spent on artists’ personal expenses.In a statement, Kickstarter said: “The $164 million raised since Kickstarter launched in May 2015 is a spectacular record for a crowdfunding platform. But, it still leaves behind $137 million in unpaid artists. The problem is that unpaid artists", "The next Biennial should take place in the Cuban city of Havana in June 2022.\n\n\nArtist-run museum in São Paulo, Brazil, which was founded by artist Elda Pape and her husband in 1987, has been rebranded as the \"Pape Contemporary Art Museum.\" The announcement was made on August 17, four days after the institution’s reopening with the launch of a series of exhibitions, performances, and residencies.The first exhibition, titled “Feminine(s),” will explore the intersections of art and politics in Brazilian and Latino culture. Titled “I’ve Had Sex,” the exhibition will feature seventy-two works by women artists from Argentina, Brazil, and the United States. The show will include work by Diana Alves, Amadou Camara, Ana Conceição, and Lorena García. The second exhibition, titled “Women and Art’s Evolution,” will present twenty-six works by women artists from the Americas. This show will debut with work by Yinka Shonibare and will be on view until October 27. The third show, entitled “Sustainability and the Future of Knowledge,” will be on", "The next Biennial should also focus on the history of art in the Philippines, both in terms of art and architecture, and on the concurrent emergence of an indigenous art form in the islands. In addition, the program should look to the future, as exemplified by the recent Filipina diaspora in the United States, and in collaboration with the art world, to include an international audience. At the time of its cancellation, the biennial was already facing backlash over its lack of funding and its exclusive focus on the islands.  \n\n\n\n\n\nAlexandra Kuzma, Johanna Kuzma, and Kiehl Kuhn, the three founders of the eponymous Detroit furniture company, have been appointed to the board of the Museum of Contemporary Art in Kansas City, Missouri. They will be co-chairs of the museum’s board of trustees for two years and will serve a two-year term beginning November 2020. Both Kuzma and Kuhn are African American women who were selected for their creative vision, innovation, and drive.“This is a historic day for the museum, and for the city of Kansas City, Missouri. We are honored to have three of the most powerful women in the industry elevate to our boards,", "The next Biennial should be in October or November 2021. Since the biennial will be held on a larger scale, the work is planning to open a new exhibition space in the city in January 2022. However, this date is subject to change according to the need of the moment. According to the Mayor of Jerusalem, Nir Barkat: “We will decide based on the biennial’s vision.” The release of a video on the theme “Events of Our Lifetime” by the Israeli artist Yoav Galant, who was commissioned to create the exhibition for the museum but chose not to go through with the project, was also delayed. The film is scheduled to be released sometime in June.Galant is currently working on a project for the museum that will include the exhibitions “The Days of David and His Children” and “The Days of the Messiah.” The project is scheduled to open in January 2022 and will consist of the installation of seven bronze reproductions of the biblical scenes. The video, titled “The World as We Know It” and curated by Sari Feldman, will be shown at the Museum of Modern Art and will be accompanied by an", "The next Biennial should be held in 2021. The 2020 work is titled 'Blackout, Blackout: The Untold Story of Black Power, 1890–1941, 1941–1966, 1966–1979, 1979–1985, 1985–1987, 1987–2000, 2000–2007, 2007–2009, 2009–2013, 2013–2018, 2018–2019, and 2019–2019.Exhibition will be on view March 22–May 21. The exhibition will be organized as follows: “The Blackout, Blackout: The Untold Story of Black Power, 1890–1941”  “Part of the exhibition ‘Blackout,’ 2018’” will be dedicated to the biennial ‘The Blackout,’ 2019. \n“The Blackout,” the inaugural exhibition dedicated to the life and work of Black radical and revolutionary Alice A. Nadolsky, will be closed until April 7. The program, which will be on view until May 24, was curated by Charles A. Farley, executive director of the Black Arts and Activism Foundation and a curator at large, and Paul", "The next Biennial should be held in the spring of 2021, with the opening of the exhibition “Feminine Bodies,” curated by a group of female artists. Leandro Paredes, the president of the Italian Alliance of Museums, told the Art Newspaper that the theme will reflect the changing body image, and will “attempt to explain the role of artist bodies in the contemporary life of Italy.”\n\n\nThe museum’s collection of more than 1,200 works on and from women has been on display at the MOMA in New York, New York, since 1993, and the first exhibition devoted to the collection—a joint venture between the MOMA and the Simon Whitney Museum of Art—was staged in 2004. In celebration of its centenary, the MOMA opened a new building dedicated to the collection, and the MOMA’s new campus, the MOMA Museum of Art, which is currently undergoing a $50 million expansion, and will host a museum-wide tour of the collection, which is divided into twenty-five exhibition rooms.The collection is also being expanded into a new exhibition at the MOMA, which will present new work by forty-one artists", "The next Biennial should take place in the city, in the first half of 2021, with the end of the next one in 2022.The institution is also considering the creation of a task force made up of academics, urban designers, and residents of the city to advise it on how to adapt to climate change. “The city is undergoing a major environmental crisis that has been aggravated by climate change,” the petition reads. Commenting on the petition, city council leader Nick Pagliotti said: “The city council is very concerned about the welfare of the people and their environment and has been working with the local, state, and federal government to develop strategies to adapt to climate change. It is a top priority for the city to continue to be a leader in sustainable development and to become an innovation hub. The question now is: How do we create new jobs that create new opportunities for residents and visitors to the city? And how do we move to 100 percent renewable energy?”\n\n\nThe Metropolitan Museum of Art in New York has moved a step closer to becoming a reality with the approval of a $2.9 billion expansion that will include an 11,000-seat theater, an auditorium, a restaurant, and a rooftop garden", "The next Biennial should focus on how contemporary art can help us reflect on the past and the future. ”The full list of participating artists is as follows:\n\nART AFGHANISTAN: The Aliya Art Foundation, Kabul Art Center, ANAAR, AfghanistanBACH, AfghanistanBRIC, Cape Town, South AfricaBØRN, Nigeria“After The Fall”, Cape Town, South AfricaCORELLYARD ART CENTERS: “Pour résistance Âtre découvertes” (New Revolutiont, Paris)Lévy Gorvy Art Museum, Bridgetown, United KingdomLabyrinth Art Museum, London“Lévy Gorvy” (London)Laurie Glade Gallery, London“A Song of Three Birds” (London)Laurie Glade Gallery, London“The Tree That Shatterthru the World” (London)Laurie Glade Gallery, London“Awe, Our Land” (New York)The Lady Iris Museum, London“My Life as a Woman: A Biennial of Women” (New York)Angela Hawk Gallery, London“Beyond The", "The next Biennial should be held at the Auckland Art Museum in New Zealand in 2022. The exhibition will be hosted by the New Museum and will feature work by internationally renowned contemporary artists such as Yehudi Menuhin, Willem de Kooning, Anselm Kiefer, Felix Mendelssohn, and Wolfgang Paul Schubert. The New Zealand pavilion will be led by Phil Hickey, curator of modern and contemporary art at the Auckland Art Museum.\n\n\nMarkus Skylark, the director of the Greenhaus Museum in Berlin and Germany’s former director of cultural mobility, was fired from the institution on Wednesday, May 14. Skylark was suspended in April for violating German social policy by relocating his family to the United States after he left the country to return to Germany, where he has been since March. According to the Art Newspaper, he was reinstated to the institution last week.His dismissal follows a public outcry over an alarming increase in domestic violence cases at the institution, which serves as a gathering place for visitors from across Europe. The Berlin police have so far confirmed one hundred sexual assaults reported there since the beginning of the year, but the number is believed to be much higher, due to a lack", "The next Biennial should open in 2022.\n\n\nThe New York Times reports that the Museum of Modern Art (MoMA) in New York City is planning to move the exhibition “The Color Purple,” which is currently on view in the exhibition, from the curatorial team’s current space in the museum to a new exhibition space planned for the museum’s third building, the Museum of Modern Art. The move, which is part of a larger renovation project, will also involve the addition of twenty-six more works, all of which were on display in the museum last year.MoMA told the New York Times that the work was originally scheduled to go on view as part of the renovation of the museum’s building in September 2019. However, the show was moved to February, and the museum closed for a period of ten days to accommodate the installation of the work. The move also included the removal of eleven works from the collection, including two earlier works by the artist Harry A. Silvergate. Because of the construction of the museum, the gallery was not able to transport all the works to the new space.On the matter of the original date for the exhibition, which is one of the few remaining works from the 1967 exhibition", "The next Biennial should take place in 2021, and the first exhibition in 2022. The upcoming exhibition “The Threshold” will then open in 2021 and be closed until 2022. The next show will be held in 2022, and the next exhibition will be held in 2022. The 2019 show was organized in collaboration with the National Gallery of Art in Washington, DC, and featured work by eighty-eight artists. “This is an unprecedented year for us to celebrate,” said David Goyer, director of the National Gallery of Art and a former curator of contemporary art. “The years ahead will bring us new and exciting exhibitions, new stories, and new opportunities to build on the extraordinary work of our curators and staff.”Over the past ten years, the Biennial has commissioned forty-five artists and artworks for its biennial shows. The biennial’s first exhibition, “The Power of Picture in Modern Art” (2019), was curated by Jonathan Antipolis, Gabriel Arnaud, Kent Anderson, Eshtia Baraka, Alex Black, Mark Borthwick, and Adnan Viro. The two-part exhibition, which was held at the Push Gallery in London", "The next Biennial should be in 2021, with the 2020 theme, 'Feminism and Design.”The Biennial will be held at the Museo de Arte Contemporáneo in Madrid and will be led by artist-in-residence, architect-designer, and curator, Anna Wintour; curator José Roca of the Roca Moderna Foundation; and curator Maria Luis Campos, director of the Institute for Contemporary Art in Lisbon. The participating artists will be chosen by a jury comprising Galárdiz Dias, chairman of the Museo de Arte Contemporáneo; anthropologist, designer, and urbanist, Ana Paula Fernandez; and architect, Agustín García-Cervetto.The twenty-nine-month project will focus on improving living conditions in Madrid’s increasingly overcrowded and unaffordable housing projects. To meet the demand for housing in the city, the government launched the construction of the 7,800-unit Índras project, a massive expansion of the city’s municipal government building complex that will stretch from the central district of San Nicolás in the north to the residential neighborhoods of the city.The project aims to alleviate the pressure on housing", "The next Biennial should begin in May, 2020, and run through January, 2021. The museum will also present an exhibition of works by artists such as Peter Schäfer and Vincent van Gogh, curated by Bjorn Lomborg, in the spring of 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Stacy Jordan as its next executive director. Jordan comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as interim director since March 2019.“The LACMA board of directors and I are thrilled to welcome Stacy to the museum,” said Christopher Schwarz, who has served as interim board chair since June 2019. “Her track record of success in bringing new projects and exhibitions to LACMA, her passion for the arts, and her vision for the future of the institution make her uniquely qualified to lead the museum.”Jordan will assume her responsibilities on September 9. Previous to joining LACMA, Jordan served as the executive director of the Pacific Standard Time Museum in Los Angeles, where she helmed the “Pacific Standard Time: The Art of Journalism,” which opened in October 2011 and closed in April 2012. She also served as the", "The next Biennial should focus on “memories,” Hermann said. “After the tragedy of the World Trade Center, we had a moral obligation to seek a new way forward.”The 2017 edition, “The Last of His Name,” will be presented by the Yuz Museum in Seoul, and will feature works by thirty-one artists, including Kip Thi Nguyen, Hong Chih Gyu, Juan and Elsa Pérez Zárate, and Jarek Thaddaeus. The exhibition will also be the last of its three-year run. The fourth iteration will take place at the National Museum of Contemporary Art in Athens in 2021.\n\n\nThe National Galleries of Scotland have announced that Ken Middleton will lead the organization for the next seven years. Middleton succeeds Alison Fox, who was succeeded by her husband, Philip, in September. Alongside the senior curator, he will work with the National Curatorial Team to guide the exhibition of twenty-three works by fifty-two artists in the new Royal Collection Building at Edinburgh Castle.Commenting on his appointment, Middleton said: “The National Galleries of Scotland are dedicated to the collection and exhibition of contemporary art and deserve great credit for", "The next Biennial should be held in 2022, the Los Angeles Times reports. A group of artists and critics, led by Roberta Smith of the Art Newspaper, have called for the exhibition to be postponed until the crisis is over. Smith told the Art Newspaper: “I want to see the crisis ended as soon as possible. The only way forward for the museum is to invest in the artists and their work and remain true to its mission of providing a platform for the art of California’s North Coast region.”The LA Times adds that the next show, “Feminine/” will be held in late June.\n\n\nThe Stedelijk Museum in Amsterdam, the Potsdamer Straße in Berlin, and the Künstlerhaus in Cologne are among the thirty-four museums in Germany that are facing a possible shutdown because of the coronavirus. According to the New York Times, the outbreak of the virus in China has increased the pressure for Germany to take greater action to contain the outbreak. On Monday, Chancellor Angela Merkel said that she expects the number of cases in Germany to hit 100,000 by the end of the week. On Wednesday, Merkel announced that her government will", "The next Biennial should be held in 2020, but some plans are currently in place to hold two shows in 2021 and 2022. “The exhibition of an exhibition of photographs in the same year as the exhibition of the latest work in the main exhibition is a common practice, just as is the exhibition of the artist’s work in the main exhibition, and it is not unusual to see the work of two artists in the same year,” Frank de Martino, the chairman of the exhibition, told the Art Newspaper.\n\nThe Museum of Modern Art (MoMA) in New York has hired Peter Dreher as its new deputy director for exhibitions and collections. Dreher will be responsible for overseeing the development and execution of MoMA’s new partnership with the biennial, “The Next Biennial,” which will take place in the fall of 2020. The show—which will be led by Rachel LaBouvier, whose recent exhibition at the museum included the first solo exhibition by an African American artist in the United States—will be organized as a series of presentations that will culminate in a weeklong event on October 25.“Peter is a seasoned executive and has been instrumental in transforming MoMA into a leading global", "The next Biennial should take place at least annually in 2022 and will comprise thirty-eight artists. The exhibition will showcase the work of twenty-eight artists, including Ghenarth, Fincher, and Sébastien Lemaire, as well as a selection of Michelangelo’s sculptures. The biennial will be curated by an artist-in-residence, Pilar Boët, and will be hosted by the Museo de Arte Contemporáneo in Madrid.The project was initiated by the British artist David Hockney, whose paintings are currently on view in the exhibition “David’s Biennial: The New Mutations” at the Museum of Modern Art. The exhibition was curated by Sinthujan Modi, the director of the São Paulo Biennial, who also curated the exhibition “Fun and Games: Cézanne and the Arts of Cinema” at the Mumbai Art Gallery in 2011.\n\n\nThe Museum of Modern Art in New York has announced it will no longer contract photographer Ryan Lee-Winters, a self-taught painter, and his collaborator Max Hollein, a sculptor who first met Lee-Winters when they were both interns at the Los Angeles", "The next Biennial should take place in October 2021. \n\n\nThe National Museum of Fine Arts (NMA) in Athens, Georgia, has received a gift of two hundred photographs by the late artist Tarkram Gebre Gebre. The museum will now be able to display the works in its new location on its campus. Located in the city of Gebre, near the city of Kassel, the museum previously had a location in a former brewery, but the renovation of its building, which was completed in 2013, brought about a renovation of the entire museum; the redesign of the building and its two-thousand-piece collection.“After more than twenty years, our new exhibition, ‘The Colors of the Sun,’ will be able to present the photographs in their most comprehensive and ambitious way,” said museum director Alexis Kalinske. “As we have said many times, the NMA’s collection is a reflection of the national spirit\u0097it has a special relation with art. The gift of these photographs, which have never before been in the public gallery, will be a great inspiration for future exhibitions and educational projects.”The first exhibition, ‘The Colors of the Sun,", "The next Biennial should be held in 2021. In an exclusive interview with Artforum, lead curator of the exhibition, Sherrin Abdel Nabi, said: “We have been working for years to create an environment that would bring together the best contemporary artists from the Middle East and North Africa. It will involve a very large-scale, multi-media installation, a public performance, and a writing exercise. In future years we hope to organize more exhibitions at the Montparnasse and on the Rivoli, but for now we are very pleased with the work that has been done here. The exhibition and the work of the first Biennials have given rise to new ideas about the contemporary art of the region, which we are very much looking forward to further exploring.”\n\n\nNew York’s Solomon R. Guggenheim Museum has announced that it will no longer contract the Sargent’s Daughters, a group of New York–based artists who often present collaborative, transdisciplinary exhibitions, in the future. The institution’s board of trustees voted 5–0 in favor of excluding the twenty-six-year-old artist duo from future contract payments, which are scheduled to run through 2021.In a statement", "The next Biennial should be held in the spring of 2021.\n\nCulture Minister Aung San Suu Kyi announced the launch of the 2020 edition of the National Art Biennial (NAB), titled “National Art of the People.” Although the issue of human rights has been a contentious topic in the past, the country’s new constitution prohibits the forced relocation of people from their homes and places of livelihood, and the new legislation stipulates that the biennial be held in the capital city of Kyiv. The twenty-third edition of the biennial will take place in the city of Kharkiv from February 21 to February 26. “We are pleased to be able to open the 2019 biennial in Kharkiv in April, and welcome more than fifty thousand visitors to our city from March 25 to March 30, 2019, in a show that reflects the vitality and diversity of the region,” said Naryska Krymash, director of the National Museum of Art. The 2020 edition of the biennial will also include events for the general public, open to the public for two weeks, in addition to a lecture series by the Belgian-born artist Willem de Kooning. The bi", "The next Biennial should be held in 2020, and it will be a retrospective of the first twenty years of the exhibition. The new venue, at the New Museum, will host an exhibition of the works of Yoko Taro, Goya, Matisse, and other modern artists in 2020. The new program will be led by curator Erin B. Johnson, who has served as curator of fine art and film at the museum for two decades, and will be organized in partnership with the biennial. The exhibition will include works by Benoît-François Seurat, Cézanne, François Mènel, and Jean-Luc Godard.  Taro’s first retrospective, “The Crows,” was held at the Museum of Modern Art in New York in 2001, and Goya’s first exhibition included works by Arnold Bode, and faced numerous challenges including the September 11 terrorist attacks in 2001, which prompted an international campaign to raise funds for the families of the nineteen victims of the September 11 attacks.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Matthew Higgs as its next director and CEO. H", "The next Biennial should be held in 2019, and the first event in 2020. The architects have yet to determine a date for the museum’s second iteration, but it will be housed in the BIRTHl hospital, a new cultural complex on the university’s campus, in the city of Foshan and will launch in 2021. The museum will also be overhauled. The architect will create a new exhibition space that will be situated in the museum’s building and will create an outdoor plaza where the exhibition space will be located.The BIRTHl will also employ new technology to support the exhibition. The institution will utilize a new digital platform, which will be hosted by the university, that will collect and analyze biennial visitors’ digital experiences through a combination of interactive technology and real-time communication. The platform will also host educational activities and will provide biennial visitors with information on contemporary art and design.“Originally, we envisioned a museum where the theme of art and design would focus on the intimate connections between people, their experiences, and art and design,” Mansour ALHASSAN, the director of the BIRTHl, told the Art Newspaper. “But as we have been working on this", "The next Biennial should be held in 2020. If all goes according to plan, the festival will return to the city of New Orleans in 2021.\n\n\nThe Museum of the African Diaspora (MoAD) in Atlanta has appointed Patricia Brown as its new executive director. Brown comes to the institution from the Museum of Contemporary Art (MoCA), where she has served as director since September 2019. In her new role, she will oversee the development of the museum’s collection, research and programming, and administration.“Our board of directors is so grateful to Patricia for her leadership and commitment to MoAD and to her years of loyal service to the community,” said board chair J. Allen Peacock. “It is also a great honor to welcome Patricia to the museum. I look forward to working with Patricia and the board to help them navigate the complex world of contemporary art and the greater Atlanta community in order to create a model for future leadership.”Brown joined MoAD in 2017 as the deputy director of curatorial affairs at the Allen Memorial Arts Center. During her tenure at the center, she organized over fifty exhibitions, including “Africa and Contemporary Art” (2017); “Should We Admit?: Contemporary", "The next Biennial should take place simultaneously in Hong Kong and Beijing. Kawamura said that the government should step in and arrange for an exhibition in both locations. “This can be achieved by raising the funds, purchasing the works, negotiating exhibition partners, issuing news releases, and organizing other activities,” he said.“In my opinion, there are enough artists here in Hong Kong concerned with issues that are more urgent than the history of the Cultural Revolution to be able to organize an exhibition, promote it, and have it displayed at the Contemporary Arts Museum here (Beijing) and at the Museum of Modern Art in Seoul (South Korea) in order to fight cultural terrorism within the city of Hong Kong.”\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of more than 2,500 artifacts from the collection of the Charles Darwin Foundation, including works by the artist Tala Ashe and his wife, Susan. The gift includes works by artists such as Josiah Johnson, Mary Elizabeth Winstead, and William and Mary Scott, as well as works by Annie Prouvé and Claude Monet.“Charles Darwin is a hugely important figure in American art history, and this collection is a great honor", "The next Biennial should be announced within the next two weeks. The 2018 edition, entitled Amerindian Art, featured a number of works by artist-activists and activists from India. The work of Tristana Mallya, Anupam Kashyap, and Meghana Purkayasya, among others, were included in the exhibition.\n\n\nThe Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the Ford Foundation, the", "The next Biennial should focus on the central role of art in shaping public consciousness and the political process in contemporary Singapore,” said   V. M. Trivedi, chair of the board of trustees.Trivedi and S. K. Dautu, the trustees of ArtAsiaPacific, were in Singapore to promote the exhibition “Art Asia Pacific: Japan and Art” (August 27–September 18). The exhibition will feature work by seventy-eight artists and will also include studio shows by sixty-five Japanese artists.In an open letter dated January 29, 2017, Dautu and Trivedi wrote: “The Biennial is at the forefront of a long-term and bold new vision for Art Asia Pacific. It is exploring new and exciting mediums through which the biennial can expand its reach and impact by connecting with and engaging contemporary audiences through a wide range of artists and practices. The exhibition is being curated by a highly skilled and enthusiastic team, and we are confident that it will deliver a compelling exhibition.”The first edition of Art Asia Pacific, “The Biennial of the Pacific,” opened on February 23 and ran for fourteen days. The exhibition also featured work by seventy-two", "The next Biennial should be a continuation of the theme of the exhibition, “Gender and the Arts”\u0097with a new twenty-minute animated film by artist Nari Ward, the artist-in-residence at the museum. The exhibition, titled “Beyond the Frame,” will open on May 2 and run until April 24.The design center will be inaugurated with a retrospective of the work of the same name from artist Frida Kahlo in the summer of 2019.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has placed the final artwork in its series “Romance, Cosiness, and Silence” (2007–2009), a retrospective of works by Polish-American photographer Tomasz Klimczyk, in the collections of the American Jewish Museum (A.I.M.) and the American Society of Art History (ASA). The show, which has been hosted at the museum since 1995 and was first staged at the Museum of Modern Art in New York in 2011, will now travel to the A.I.M. and the Museum of Contemporary Art in San Francisco.Klimczyk’s 2006 exhibition “Romance” was selected by a jury consisting of Emil", "The next Biennial should be held in the autumn. Joel and the gang will return to New York to present their next retrospective, scheduled to open in January 2020.\n\n\nA new organization has emerged to help the visual arts and culture sector in the Philippines as the government struggles to contain the coronavirus. Called the Filipino Biennale, or Filipino Alliance for the Arts, the coalition includes the Philippine Museum of Art (PMA), the Institute of Design, the Institute of Contemporary Art, the Center for Contemporary Art, and the Manila-based architect Cristina Roach.The alliance is comprised of the following organizations: Filipino Alliance for the Arts, Inc., the Manila Arts and Culture Center, the Manila Arts and Culture Foundation, the Manila City Museum, the Manila Museum of Art, the Philippine Museum of Art (PMA), and DPW Architects.“The diversity of our audiences and audiences’ needs to be reflected in the exhibition and the exhibition,” said Rosa Carranha, director of the Manila Arts and Culture Center. “This kind of engagement can bring a new and different perspective to the exhibition, and it can bring a deeper understanding of the work being exhibited, and this is especially important", "The next Biennial should take place in 2020, and will include the work of thirty-nine artists from twenty-eight countries. The show will also include a mapping project of the exhibition space, a public forum, and a biennial catalogue. The exhibition will be hosted at the Museum Stiftung Basel, which will be inaugurated by the exhibition's artist, Edward Hwang.The venue for the festival was selected from a shortlist of five artists. The list comprised of Yoko Ono, Kathy Lee, Yuki Kondo, Li-Man Hsu, Katsu Nara, and Kim Sung-kyo. Joining the art world and academia are artist-workers of Korean origin, including Kim Seo-kyung, Kim Eun-sung, and Kim Dae-sung.The artists selected for the Biennial were chosen based on their work and their artistic and cultural contributions to Korea, reflecting the diversity of their artistic styles, backgrounds, and stories. The finalists were…\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning a major renovation of its historic building in the city, which will include the installation of new works by sixty-one artists and will replace the existing museum with a", "The next Biennial should take place in 2021, and the first in 2022. A new exhibition, titled What Are We Building? , will be staged at the Museum of Contemporary Art in Moscow in 2021. If this means less disruption to your life, I hope you will consider the possibility that what will replace it might be better.\n\n\nThe Museum of British Art (MoBA) in London has appointed Ana Mendieta as its new deputy director. Mendieta, who has previously worked at the institution as a curator, writer, and lecturer, succeeds Kate Fowle, who has served as interim director since January 2019.“We are thrilled that Ana has agreed to join our team at MoBA and is committed to the museum and to the collection as a whole,” said director Maria Balshaw. “This is a challenging period for the institution, because it has been transformed, and so many of our work is now in the collection. She has demonstrated an extraordinary ability to bring people together for exciting and challenging projects, and we were impressed by her ability to take on challenging and important projects in collaboration with passionate and talented colleagues.”Born in New Mexico in 1987, Mendieta first studied at the University of California, Berkeley", "The next Biennial should be held at the Museum of Modern Art in New York, where the show will be staged from January 17 to February 20, 2020. The upcoming exhibition “Art and the Body: The Science of Healing,” which will offer new curatorial approaches to culture, will also feature the work of the late Belgian artist Willem de Kooning; the Swiss artist Jules Verne, who was active in both the USA and Belgium; and the Italian sculptor Bettino Cattelan.\n\n\nThe president of the United States, Donald Trump, recently signed an executive order designed to crack down on foreign governments and corporations that undermine social and political stability in their countries through violence and climate change. The massive 547-page document, which outlines a number of new regulations that target the global environment, is aimed at deterring companies from doing business with countries that he believes are abusing their human rights records and is an attempt to make the Environmental Protection Agency (EPA) more effective at regulating the environment.But the move has sparked outrage and confusion in the country’s arts community, where artists have criticized the plan as an attack on their industry and have called for its repeal. The American Alliance of Museums (AAMP", "The next Biennial should take place in 2022.  The 2020 event, “Ateliers d’Art Contemporain,” was organized by Dries Molenbouw, Dominique Brons, and Daniel Buren; the 2019 event, “Ateliers d’Art Contemporain: Paris’s Contemporary Art of the 1960s,” was held at the Museum de la Neuve in Paris; and the 2018 exhibition, “Ateliers d’Art Contemporain: Modern Art” was at the Musée national d’Art Contemporain in Paris. \n\n\nThe Institute of Contemporary Arts (ICA), London, has appointed Elizabeth Bevan as its new board chair. Bevan comes to the institution from the Institute of Contemporary Arts (ICA) in New York, where she has served as a board member since 2015. She succeeds Paul Mpagi Sepuya, who succeeded her as board chair in September 2018 and will assume his post on January 6, 2021.“During his tenure, Bevan has proven herself as an instrumental and creative member of the ICA team,” said ICA director Kate Fowle. �", "The next Biennial should take place in 2020, and the first exhibition in 2021.The B/I Museum in New York has been working on an updated version of its Martha Graham–designed space that will incorporate more community-based programming. A public consultation on the redesign is currently underway.The $20 million Fisk Contemporary Art Museum in Portland, Maine, revealed that it is planning to remodel its entrance, added a public area, and added more galleries. The museum also wants to expand its digital offerings, and it is expanding the hours of its five-story, 400-work collection. The renovation will focus on creating more of a visual and cultural exchange between the institution and the surrounding region.The Diller Scofidio + Renfro–designed Museum of Modern Art in Manhattan has released its list of current contributors to its $50 million Anselm Kiefer Institute for Contemporary Art. The 2020 recipients include Griselda Cervetto, Julia Davis, Zoe Boye, Alejandra Cipolletta, James Crowley, Astrid Dallaglio, and Jasmine Carney. Advertisement - Continue Reading Below\n\nThe Museum of Contemporary Art (MoCA), Los", "The next Biennial should include the exhibition “Anton Kern, The Military Architect,” a selection of projects by Kern that will be exhibited at the museum. The exhibition will mark the centenary of the German scientist’s death.\n\n\nMore than 1,800 cultural workers, including artists, academics, and school principals, are urging the UK government to implement emergency safety regulations to protect the cultural sector amid the coronavirus pandemic. According to The Guardian, more than 1,600 people are currently sick and more than 3,500 have died from the virus—more than 90% of cases have occurred in England and Wales.On Monday, British Prime Minister Boris Johnson published an emergency safety plan that calls for social distancing and restrictions on travel, mass casualty incidents to be avoided, and for the number of people infected to be reduced by 65% by the end of the month. The policy has been hailed by environmentalists as a major step in curbing the spread of Covid-19—Johnson cited a recent survey of 1,600 senior workers at the country’s major museums as evidence that restricting travel and large groups was crucial—but critics contend that the plan only addresses the short-term effects of Covid-19, leaving", "The next Biennial should be held in 2019, and the biennial will focus on the history of the Museum of the Arts (MoA) in partnership with the city of Los Angeles and the educational planning efforts of the city and county of Los Angeles. The theme for this year’s event will be “Who Stole Frank Gehry” The event will be led by the architect and urban designer Paul Giamatti, who is best known for his sculptural installations; Anna Wintour, the actress and former model; and curator and art historian L.A. Reid.The biennial will be curated by veteran curator and art historian Rosemarie Deutsch, who most recently served as curator of the West Coast branch of the Museum of Contemporary Art (LA) in San Francisco; and David L. Bochere, the director and CEO of Los Angeles’s Museum of Contemporary Art (LA MoCA), which has been closed since 2009. The museum will reopen next spring with a new exhibition of work by the French Impressionist Léonïs Adolphe-François Sauvage, which will be preceded by “Unfinished Business: The Art and Vision of Frank Gehry” (2019).The", "The next Biennial should be the last. After a period of thirteen years, the biennial will close on September 29 and will be replaced by the sixteenth, which will be held in 2020.“The Biennials are an important part of the history of the city of Helsinki, and their passing will continue to shape the city’s future,” said Helsinki mayor Martti Laine. “This will be the last year of the Biennials. I’m sure that the next year will be filled with new ideas and new ideals.” The museum’s director, Dr. Lene Østby, added: “The Tate is an iconic institution, but it cannot thrive in a world where the future of art is increasingly uncertain. We must continue to work together to shape art and advance our ambitions for artists, so that it can inspire and challenge us all.”\n\n\nThe Jerusalem Art Center (JAC) has announced that it is no longer planning to open its new outpost in Jerusalem’s Old City in September 2020. Instead, it will begin a reopening campaign that will last for eighteen months.The center, which has been located in an industrial area of the Old City since", "The next Biennial should bring together twenty-six curators and explore how art—and artmaking in general—has always been connected to and influenced by hardcore punk. The event’s theme: “Punk,” writes a caption on the show’s website. “I had a chance to see punk at its most extreme, and that was in the very early days of its history, in the late ’60s and ’70s. I was there when Los Angeles’s hardcore scene was at its peak, and I was there when the genre completely died in the United States. I was there, and I still am, when the music I listened to was hard and the art I saw was silly.”In a statement, Laura DeSousa, director of the Biennial, described the upcoming event as follows: “The theme of the 2019 Biennial is Punk: a word that has been used by artists, academics, and those who have had a profound and meaningful impact on the history of art, and by no means an exhaustive list. We are excited to present an exhibition celebrating the work of twenty-six artists and forty-five years of the Biennial, with the theme of", "The next Biennial should take place in 2019. The 2020 edition will mark the twentieth anniversary of the institution and will offer a selection of works from the show’s twenty-five-year run.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift that will change the course of its long-standing, landmarked late-night art installation Behold, a gargantuan, twenty-one-ton, steel sculpture that has stood on its three-story, 600,000-piece aluminum shell since 1987. It is the first piece of the $3 million MCA’s massive, but unfinished, “Game Over—” series, which is dedicated to the eponymous game of life, and is set to be installed in mid-2018.“As we unveil Behold, we are excited to introduce the world to the highly unusual and yet extremely valuable geometric shape of the steel sculpture,” said Joao Oliveira, the MCA’s associate curator of late-night art. “This work is the culmination of many years of artistic speculation and exploration and is a major milestone in the evolution of the MCA.”In 1980, Oliveira was a visiting assistant professor", "The next Biennial should be held in 2020. As the museum is currently closed until January 19, 2019, some think this announcement will be a distraction from the work already underway\u0097a project that includes the exhibition “Practical Strategies,” which will be on view until March 11, 2020.\n\n\nThe Smithsonian’s National Museum of African Art (NMFA) in Washington, DC, announced today that it plans to reopen to the public on August 29 after it was temporarily closed since February 29 due to Covid-19. According to the New York Times, the institution was able to temporarily shut down its space at the Smithsonian’s National Museum of African Art in order to continue adding programming to a larger exhibition space on the grounds that the pandemic has not affected the institution’s traditional programming.According to the New York Times, the retractions from the museum were made in response to a surge of cancellations and reduced visitors. The museum has been closed since February 29. The museum, which is located in the historically Black city of Fayetteville, Arkansas, is estimating that it will lose $6 million during the opening weeks of August 29–28. The institution is also facing backlash from local, state", "The next Biennial should be announced soon and will take place in November 2019. The sixty-fifth will take place in February 2020, the sixty-first in March 2020, and the seventeenth in April 2020. The theme of this year’s exhibition will be “The Body and the Universe.” \n\n\nThe Museum of Modern Art (MoMA) in New York and the Art Institute of Chicago have announced that they are collaborating to launch a new universal service that will offer free admission to the museum each week for twenty weeks. The service will begin this fall and will run for twenty weeks, from September 20 to November 21, 2020.The partnership between MoMA and the Art Institute of Chicago—which will be named after the institutions’ founding donors—was first announced in March 2018. The partnership was announced in conjunction with the opening of the two museums’ first major commissions, “The Architecture of Light” (2019) and “The Body and the Universe: An Exploration into a Universal Reality” (2020). The commission, which was created for the Museum of Modern Art, was created by Mike Kelley, director of the Art Institute, and Mel Chin, director of MoMA, to honor the legacy of the late", "The next Biennial should be held in 2020.\n\n\nThe five-time Emmy Award winner was still behind-the-scenes at the 2014 inauguration of the Museum of Contemporary Art (MoCA), Los Angeles, but on Tuesday she announced that she would return to the city for a retrospective of her work at the Museum of Contemporary Art (MCA) in 2020. The project, titled “Hoak, Wolf, Bird,” and curated by anthropologist Anita Goldstein, will open on November 5 and run through November 8.Tickets to the museum will be free for the general public and will cost $25 for members and $45 for students, seniors, and students with tickets purchased through the institution. According to the Los Angeles Times, the exhibition will be divided into three parts: 1) A timeline of her work, 2) A discussion on the practice of art as an art form, and 3) A performance by Sargent’s drawing.“We are pleased to present this twenty-fifth exhibition in the series at the Museum of Contemporary Art to the public,” said Mitchell L. Levy, chair of the board of trustees. “The show will explore how the possibilities of art and artmaking have helped", "The next Biennial should be held at the Los Angeles County Museum of Art (LACMA) in three years, and the second at the Museum of Contemporary Art (LA) in a year. The theme of the third biennial is “I Am Alive,” a reference to the first two seasons of the HBO series I, Myself and I, an elegy to her father who died in a car crash. The fourth will be dedicated to the work of the late Brazilian painter Guile’s three-dimensional works. The fifth will be dedicated to the work of the Brazilian artist and feminist theorist Cervantes. The sixth will be on the materiality of art, Guarani’s enduring influence on the art of the late twentieth century, and will be held in 2021. The final, the most ambitious, will be on the history of African art, with a view to the future of art in Africa and beyond. The biennial is run by the Biennial Foundation, a Los Angeles–based nonprofit that receives support from individual donors and is supported by a biennial grant from the David Rockefeller Foundation. The 2019 edition of the rainy-day carnival, titled “Mama’", "The next Biennial should be held in 2020 and will be curated by the artist-in-residence, Rachel Whiteread, and will include works by forty-three artists.Whiteread will be joined by artist-in-residence Heather Stone, whose work is housed in the museum’s collection, and curator Matthew Martensen, who curated the exhibition “Feminine Ray” last year, for a retrospective of the artist’s work at the museum in March.Swiss curator and curator Peter Schöffer-Tuttle, a professor of contemporary art history at the University of Bern, will curate the twenty-fourth edition of the Swiss exhibition Biennale De Berlin, which will open in December 2020. The event will be held at the Kunsthalle Basel from February 22 to February 27. Other artists participating in the event are Christoph Waltz, Johannes Klipp, Salvador Dali, Jean-Luc Godard, Jean-Michel Basquiat, Karel Voigt, Monir Shah, Oskar Eustis, and Stephen Friedman. The 2019 edition of the event, which was held in the Swiss Alps, saw some five hundred foreign artists participate. \n\n\nThe", "The next Biennial should hopefully be a 'Best of Show,'” said curator and president David Breslin. “The exhibition has moved to the new space, but the format needs to remain the same. The new exhibition will become the Biennial of the Mid-Atlantic.”He continued: “The key thing to understand about the Mid-Atlantic is that it is a region of the United States where, for the most part, immigrants have remained in their homes, have continued their lives in their neighborhoods, and are still doing so. The Biennial of the Mid-Atlantic is about to enter a period of transition.”The exhibition will feature works by ten artists of African and African American descent who are representing the United States in twenty-two exhibitions, including solo shows at the Guggenheim and the Jewish Museum, the Museum of Fine Arts, the Metropolitan Museum of Art, the Whitney Museum of American Art, and the Whitney Museum of American Art, among others. The works will also be reimagined in a way that will encourage the public to reconsider the role of artists in the United States and across the globe. “The UASTAT program is an innovative way for artists to emerge from the current moment and to", "The next Biennial should be held at the Museum of Contemporary Art, Los Angeles (MCA), the Museum of Contemporary Art, New York (MCA), and the Brooklyn Museum of Art (BAM), New York. The 2020 version will feature a selection of the work of the seventy-two artists who have been selected by the San Francisco-based artist-run nonprofit 501rf. The theme for the event will be “art at its most urgent, aural, and dreamlike.”The 2019 edition of the Biennial, titled “Financing Anarchy,” was organized by the artist-run nonprofit 501rf and was presented by renowned Los Angeles dealer Matthew Weiner, who currently serves on the board of trustees of the Museum of Contemporary Art, Los Angeles (MCA). The exhibition, which will run through March 2020, will feature work by sixty-four artists from twenty-six countries. The biennial’s first exhibit will be a group show “I’m Not Alone: American Art at the End of the Golden Age,” curated by David K'skydall Gallery and curated by Martha Graham, at the San Francisco Museum of Art. The exhibition will focus on the 1970s, ’80", "The next Biennial should be held in 2022, and the first in 2021. The museum will also open an exhibition of work by Susan B. Anthony, James A. Porter, and Frank Stella in 2020.Meanwhile, the Schloss and the Tate in London are planning a new exhibition devoted to the life and work of Pablo Picasso. The first exhibition, titled “Pablo Picasso: Life and Art,” will open at the Schloss next month and run through March 2021. The Tate has yet to announce a date for a biennial of the artist’s work.\n\n\nThe University of Chicago announced today that it is suspending all events and programming through its fall semester, and will be in the midst of a major reopening of its modern-day Museum of Art, just a stone's throw from the Illinois-Michigan border. The announcement came on the heels of a statement issued by the university regarding the impact of the Covid-19 pandemic on its campus. “Covid-19 has had a devastating impact on the University of Chicago,” said university vice chancellor and provost Elizabeth Anagnos. “It has become clear that many of our students and faculty are feeling the impact of the Covid-", "The next Biennial should focus on how we move beyond the conceptual territory of the natural world and move into the real world, and what we can achieve in the virtual world. The next one should focus on the future and the sensual. And the next one should be a celebration of the scientists who have made the most important contributions to our understanding of how the world works.”The biennial was inaugurated by the museum’s return to the European continent in the form of a new collection devoted to the African diaspora, the work of artworks, and the museum’s acquisition of two African artworks, a work by Kengo Edson, and a small but spectacular work by the Nigerian artist Nola Oke-Agulu. The works will be on display in the exhibition “Art and Science in the Black Atlantic:” which opened at the museum on September 26. The exhibition will also feature work from ten African artists born in Africa and New York, including Akonghe Eleorye, Garibaldi Mabaso, and Paolo Tavoni.A number of artists have formed the Biennial Project, a collective whose mission is to develop a new exhibition each year that will focus on an African artist in", "The next Biennial should take place in 2020 and will culminate in a retrospective of the work of the artist-in-residence, a biennial exhibition. Details about the biennial’s content and format will be announced soon. \n\n\nThe Museum of the City of New York has announced a new partnership with the private contemporary art museum St. Vincent de Paul to commission new works by the artist-in-residence, Anton Kern. The highly anticipated exhibition will take place in the museum’s basement and will comprise two exhibitions: “Anatomy of an Emissary: A Peculiar Means to an End,” which will open in the fall of 2020 and “Anatomy of an Image: A Peculiar Contribution,” which will open in the spring of 2021.Kern, who is best known for his paintings that are rooted in both experimental and philosophical practices, will illustrate his new career through the construction of a memorial statue for the late artist’s work, which will sit in the basement of the museum. “As an artist-in-residence, I am honored to be able to add this work to the legacy of my fellow artists and to", "The next Biennial should dive into the philosophy of what it means to be a feminist and how it can be achieved through a feminist arts program. The anthology 'The Feminist Future: Art and Feminism in the Twenty-first Century’s World, 1940–1950,” edited by Annemie Meijer and Georges Janzen, will open at the Museum of Contemporary Art Berlin in July. It will then be followed by a new exhibition of work by the artists who participated in the exhibition “The Future Is Present: Women and the Art of Art” and a special exhibition featuring work by twenty-five artists from the feminist arts field.The new exhibition “The Future Is Present: Women and the Art of Women” will be on view in conjunction with “The Future Is Present: Art and Feminism” on September 4 at the Centre d’Arles.\n\n\nThe Open Street Foundation, a New York–based nonprofit dedicated to preserving the physical environment in which American art can thrive, has launched a new initiative to help young artists win a $1 million prize. The program, which will run from May through November 2021, will invite twenty-three artists from the Brooklyn arts scene to Paris to apply for", "The next Biennial should be held in 2020, and by then the institution will have more than fifteen thousand works on paper. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Amara Chaudhuri as the institution’s new executive director. Chaudhuri comes to MoCA from the Museum of Modern Art (MoMA), where she has served as deputy director for the past thirteen years. During her tenure, she has coordinated performances and public programming in collaboration with the likes of Alison Krauss, David Sedaris, and The Wolf of Wall Street and helped shape the institution’s collection strategy.“Amara’s leadership in the field of contemporary art and her ability to bring thoughtful and creative approaches to presenting exhibition and collection design and to developing and rethinking the museum’s collection are unparalleled,” said Elizabeth Harris, director of the Museum. “Her appointment to this important and influential position comes at the perfect moment as MoCA enters a pivotal moment in its history as the institution becomes a new chapter in the story of the artist-built environment.”Chaudhuri comes to MoCA from the Museum of Contemporary Art (MoMA), where she has served as deputy director", "The next Biennial should be held in 2020.\n\n\nThe Museum of Modern Art in New York has announced that it is negotiating with the city of New York to relocate the institution’s permanent collection from the Hudson Yards site on the northwest corner of the city’s two boroughs, in order to make way for the construction of a new Metropolitan Museum of Art. The move is part of the city’s comprehensive redevelopment plan, which aims to reshape the neighborhood through the conversion of thousands of industrial buildings into mixed-use apartment buildings and the removal of hundreds of thousands of trees. In an attempt to mitigate the impact of the renovation effort, the museum has also removed more than 1,200 artifacts\u0097including pieces from the institution’s collection and from the New York Public Library\u0097from its holdings.“The city is committed to ensuring the collection has a strong future for the three boroughs, and we’re working hard to find a solution that will meet that goal,” said Christopher Dunn, the director and CEO of the museum. “We’re actively discussing options with city government and are prepared to present our proposal to the city council in the coming weeks. We’re confident that we can", "The next Biennial should be unveiled in the spring of 2021 and will be hosted by the Museum of Contemporary Art (MoCA), Los Angeles. The exhibition will include new works by twenty-four artists from Albania, Algeria, Armenia, Belarus, Bosnia and Herzegovina, and Russia.Founded by three brothers in Belgrade in 1977, the institution is operated by an urban planning group led by architect Rene Serotta. In addition to the arts, it also offers a variety of education and cultural activities. The museum houses several buildings, including the Department of Arts, lists over sixty galleries in its collection, and manages a permanent collection of forty-eight hundred works.The museum also hosts the legendary former chess grandmaster Ivorian Gheorghe Tosunčić, who was a major ally of the school. He donated seventy-five works to the school, which was founded in 1941, and is the recipient of the MBE for Services to Architecture and Design.The biennial will host the first exhibition of work by dissidents Musa Atif, Yasmina Hidayat, and Selim Sarsam, two Bosnian artists who were imprisoned after staging a show at the institution in 2012. The exhibition will include works by forty-three", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid in 2022. The 2018 edition, which was curated by Francisco de Alvear, was held at the Museo Nacional Centro de Artes Plásticas in Madrid. The first-ever biennial to feature the work of Mexican artists was inaugurated by María Berrío-Santiago.\n\n\nOracle Art Gallery Mumbai has appointed Yara Shah as the new head of its Contemporary Art and Design (CAD) exhibition program. Shah, who joined the gallery from the New York–based firm Kohn Gallery in 2015, will take up the post in January.Kohn said: “We are thrilled to welcome Yara to the gallery. Her deep experience and commitment in developing contemporary art and design, combined with her demonstrated ability to create compelling and original exhibitions, make our exhibitions unique and exciting, and shape curatorial work to further our vision of a contemporary Art and Design for Mumbai.” In a statement, the Narendra Modi-led India government said Shah “is committed to supporting the portfolio of the Contemporary Art and Design theme in creating a unique space for contemporary art and design in", "The next Biennial should be a success, as a long-term custodian of the collection, and as a catalyst for cultural exchange between Italy and the Republic of South Africa.In addition, we are going to develop a new exhibition format that will be responsive to the current cultural and political situation. The programme will also be a work of civic engagement and will reflect the spirit of the Biennale, a day-long celebration of art and creativity.It is an honor to represent the Italian Republic in this year’s iteration of the Biennale de Venice. The prize is an expression of our profound gratitude for the many years of work performed by the talented staff and the dedicated committee, and we look forward to presenting the best art and architecture of our time to the public.\n\n\nThe Metropolitan Museum of Art in New York announced today that it has named Sarah Carleton assistant curator of contemporary art, design, and design media and culture. She will be responsible for working across disciplines at the museum to advance the Met’s curatorial interests through a mix of exhibitions, publications, and digital platforms and will begin her tenure in December.“In a world of ever-changing technologies, it’s what we do that matters most,”", "The next Biennial should see the unification of the two facilities, the organizers said, and they will work together to present the works.“More than sixty thousand people have visited the museums in the past twenty-four months, and the scene is undergoing a radical change,” said Rosa Pérez-Martínez, director of the Museo de Arte Contemporáneo in Madrid. “Already the local community has enjoyed some of the most intensive exhibition-making in Europe. The new exhibitions will bring together the work of the most distinguished artists of contemporary Spain and will introduce the greatest number of new works by major Spanish-based artists from the last fifteen years.”The fourteen new works presented in the new exhibition, titled “Rafael Benitez: The Free,” will be presented by Lourdes de Castro, Bechiro de Castro, Maria Roca, Gisèle Pape, and César Navarro, among others. The exhibition will be curated by Martin Panto, director of the Universidad de los Andes in Madrid, and will open in two weeks.\n\n\nThe National Museum of Fine Arts in Athens, the National Museum of Fine Arts, Athens, and", "The next Biennial should be held at the museum in 2020.”The museum will be inaugurated by a new exhibition “The Painted House,” which will draw from the curiosities of Stockholm and Ukraine and showcase the work of Polish-born, American-based artist Michal Wojtyla. The exhibition will be followed by a museum tour of the institution, which will be followed by a lecture series on the museum’s collection and collection projects, and a public reception. The former home of the Painted House is currently undergoing renovations.\n\n\nThe University of California Berkeley (Berkeley) has received a $500,000 donation from the Walton Family Foundation, the New York and New York–based philanthropic organization that has aided California public universities since its inception in 1985. The gift, which was made in partnership with the Berkeley Art Museum, comes on the heels of a $1 million gift from the Walton Family Foundation in 2017.“We are extremely grateful for this significant gift from the Walton Family Foundation,” said John Boyd, chair of the university’s board of regents and chair of the board of trustees. “It is a tremendous honor to receive this generous gift, especially since the organization", "The next Biennial should deliberate on the possibility of creating a new institution to house the historic collections, restoring the collections, and organizing exhibitions. In addition, the programme should include a series of discussions around the ideas of the collection and its history.”Art historian David Shorter, who also serves as director of the Museums Association in London, said: “Montreal’s concept has never changed. It has always been to do with the collection as a community. And its history, its beauty, has always been at the heart of everything. So the whole idea of a new museum is exciting. And hopefully it will be a success.”\n\n\nSculptor and curator Richard Beasley, who led the exhibition-filled field in which he created a public sculpture garden that has stood in a park in London since 1977, died on January 9 at the age of ninety-eight. “Richard Beasley was an artist whose work was grounded in an understanding of the importance of art as a tool for reality change,” said director Loring Randolph, who also presented Beasley’s work at the National Galleries of Scotland in 2008 and at the Royal Academy of Arts in London in 2013. “His", "The next Biennial should be in 2020.\n\n\nThe Tenement Museum in Brooklyn, N.Y., has launched two new initiatives that will help fight antisocial behavior in its buildings, and will donate $75,000 in support of the initiatives. The arts space will become the latest institution to offer a citywide, 24-7 emergency shelter for people experiencing homelessness. The other new initiative, a collaboration between the museum and the New York City Coalition Against Antisocial Behavior, will offer free emergency medical care and services to people living in the buildings.The initiatives were created by the commissioning board chair, artist and Brooklyn native Melissa Chiu, and the museum’s New York City director, Andrew Lloyd Webber. The two organizations will share the $75,000 in funding from the city’s homeless prevention fund and create a public service fund so families and individuals can give back to the city.“We are thrilled to partner with the Tenement Museum to combat antisocial behavior and provide essential services to our community,” Lloyd Webber said. “The strategy will provide critical relief to New Yorkers experiencing homelessness and will allow us to further our mission of increasing community engagement by sharing stories and celebrating social connections. We will work with you", "The next Biennial should be held in the fall of 2020. The 2020 event will focus on “The Biennial of Modern Art,” an exhibition launched by the city of Cologne in collaboration with the Metropolitan Museum of Art in New York in 2015 and organized by the museum at the time. The exhibition, which included works by twenty-three artists, including Jackson Pollock, Renate Peroff, Miuccia Prima, Guy and Ramon Agosto, and Oskar Kusturica, was put on hiatus in April 2021 to focus on revitalizing the city.The Biennial of Modern Art is currently undergoing a $10 million renovation that will include the opening of a fifty-six-thousand-square-foot Palazzo delle Papesse, a new twenty-three-thousand-square-foot exhibition space, and the restoration of Palazzo delle Papesse’s original facade. The project is part of the city’s plan to modernize the former Clio da Capitale, a former marble-studded mill, and is part of a larger plan to re-emerge as a more urban city.\n\n\nThe Biju Mihir Museum at New", "The next Biennial should take place in 2022, according to the organizers.\n\n\nThe Institute of Contemporary Arts, London (ICA), has released the list of sixty-three artists whose works will appear in the 2019 edition of the Biennial. The artists chosen for the exhibition are:Alberto Campos (Mexico), 1955–1966Alberto Camacho (Mexico), 1956–1966Alberto Conti (Mexico), 1956–1966Alberto De Jesus (Mexico), 1949–1966Alberto Espinosa (Mexico), 1952–1966Arturo Ferrer’s (Mexico), 1955–1966Alberto García (Mexico), 1948–1966Amara Aljam, (Mexico), 1963-1967Arturo Merz (Mexico), 1953–1966Alexei Koshkin (Russia), 1951–1966Annie Powers (Canada), 1949–1967Barthelie Wheatley (G7), 1952–1968Ülene Braxton (Canada), 1954–1968First Prize: Alan Hutton (UK), 1955–1966Second Prize: Vinayak Das (India), 1955–1966Third Prize: Anna", "The next Biennial should take place at the Museum of the African Diaspora (MAAD) in Boston, Massachusetts, in 2021. \n\nThe Art Newspaper reports that a new collection of Japanese modern art, art from the same era as the Mori Art Museum in Osaka, and art from the 1970s and 1980s is currently on display in the Kiasu Museum in Tokyo. The exhibition, titled “Kisatsu no chibi: Japan Art of the 1970s”\u0097the museum pledged to continue collecting works from the 1970s and 1980s, but withdrew the pledge from the Kisatsu Museum, which was founded in 1998\u0097was not its first foray into the exhibition field. Descending from the 1960s school of Japanese painting, it became a hub for contemporary Japanese modern art, and later became a site of a 2019 retrospective of Kaneda Takuya, “Japan Art of the 1960s”\u0097a show sponsored by the Kiasu Museum.Since Miyazaki Ikari, the current director of the Kisatsu Museum, took over the helm of the building in 2016, the museum has undergone a major expansion, which adds a number", "The next Biennial should take place in 2021 and will showcase new works by the artist-run experimental spaces that have created and explored new and pressing issues in contemporary art. With the midterm in 2019 approaching, the research team is now planning to focus primarily on the field of contemporary art and not just the biennial, but also the exhibition it will be at and how the exhibition will be organized. “The biennial is in the process of preparing for an exhibition about its program, but we intend to avoid the traditional exhibition model and to focus our exhibition on the artist’s own works,” Farid Al Rassam, the director of the biennial, told the Art Newspaper. “The exhibition is not the same as the exhibition.”He added that the exhibition is not yet scheduled to open, but will be inaugurated by a lecture by the artist in conjunction with the biennial’s commencement.\n\n\nAustrian curator Lars Politička is seeking the immediate removal of an exhibition that is currently on display at the Center for Italian Art in Vienna until February 2, 2020. “The exhibition is one of the most important projects of the Center for Italian Art,” the artist-run organization that runs", "The next Biennial should be held in the coming years and will include the work of a wide range of artists and will feature works that address the current social and political climate and reimagine the future. “The idea of a biennial has been around for a long time, but it’s only recently that it really caught on with a lot of people, and it’s only recently that it really became an institution,” said Muriel Nava, director of the Biennials at the Art Institute of Chicago. “The Biennials are an expression of our community and it’s our mission to connect with that community.”According to Artnet, the institution has received a $125,000 donation from the estate of Jack and Elsa Mather, descendants of the early biennialists who were instrumental in the late’s show, which was staged at the Michigan Institute of Art in Ann Arbor, Michigan, in 2017. The donation was made in honor of the museum’s fifteenth anniversary, which coincides with the exhibition’s opening. The Mathers are donating $100,000 to a fund for artistic research and the museum’s art museum, which will receive the", "The next Biennial should be held in 2020.“We are very pleased with the outcome,” said Daniela. “The exhibition was a success, and it was a pleasure to collaborate with the professionals and make a new works in unison. Even though the Biennial was not a success in itself, we were still able to present cutting-edge work in the exhibition.”The exhibition was organized as part of the masthead of the contemporary art week. The inaugural edition in 2019 featured work by thirty-three artists, including Adriana Abi, Alberto Barbera, Nicolas Henrot, Andrée Chedid, Antonio Cespedes, Andrea Graziano, and Alberto Hernández-Biry, as well as a selection of new and emerging work, curated by the artist-in-residence, Tyler Joyce.In the exhibition, which was curated by the artist-in-residence, the first artist chosen to represent the Biennial was the Italian architect Filippo Puzo, whose architectural projects include the renovation of a large façade for the Museo de Arte Contemporáneo in Rome. Puzo, who is known for his projects in Florence and in the"]