["The next Biennial should focus primarily on the cultural and social impact of the evacuation of Puerto Rico, according to organizers. It should also include several exhibitions and performances, such as an exploration of the role of Puerto Rico in the United States and its Caribbean.In its inaugural edition, which opened in August 2019, the biennial, titled “The Internet,” was organized by the San Francisco Museum of Modern Art (SFMoMA), the Toronto Opera House, and the Bowery Boys. The theme was “The Future of Life,” and the selection of works by the San Andrés Project, the Dada Museum, and the Staten Island Museum of Art was similarly grounded in the island’s history.\n\n\nThe Metropolitan Museum of Art (Met) in New York has announced that Rachel Soltan, the executive director of the Arab American Museum (AAMD), will be the next director of the institution. Soltan comes to the Met from the Museum of Modern Art (MoMA), where she has served as director since 2014, and will assume her responsibilities on May 5.“The Arab American Museum has been a powerful organizing principle and an incubator for creative and academic dialogue between the United States and Israel,”", "The next Biennial should commence in 2021, with the first exhibition, “Reframing the Trinity: The Art of the Body and the Body of Christ”, to open in the United States at the Smithsonian American Art Museum in 2021.\n\n\nThe British artist Aline Hindmarsh has won the National Galleries of Scotland’s Crystal Palace Fund of Arts. The fifty-seven-year-old, who began her career as a painter before moving to Edinburgh in the 1960s, was chosen for the award by a jury\u0097one of whom was fellow British artist Jana Anton. Hindmarsh’s work is often considered one of the first paintings by a woman; her first solo exhibition was at the Royal College of Art (RCA) in Glasgow in 1981. “After a decade of being an artist and a professor, I’m thrilled to be giving my first solo show in Scotland,” said Hindmarsh. “This is a very special year for art, and I’m thrilled to help raise funds for the RSA’s proposed new £1 billion arts facility in the grounds of the National Museum of Scotland. I’m also excited that this will be a very rare", "The next Biennial should be organized as follows: Following the completion of the current exhibition, the Biennial will not resume. This means that the exhibition’s final programme will be held in the summer of 2022. The twenty-third Biennial will take place in the town of Graz, in Austria’s state of Hesse, in 2021. The twenty-eighth Biennial will be held in the city of Künstlerhaus, city of Munich, in 2020. The twenty-ninth Biennial will be staged in the city of Dresden, in 2020. The twenty-ninth Biennial will be staged in Vienna, in 2020. The twenty-ninth Biennial will be held at the Institute of Contemporary Arts in the Czech Republic, in 2020. The twenty-ninth Biennial will be staged in the city of Zagreb, in 2020. The twenty-ninth Biennial will be staged in the city of Krakow, in 2019. The twenty-ninth Biennial will be staged in the city of Zagreb, in 2019. The first exhibition in the series will open in Prague on March 22 and run until March 29. The first exhibition", "The next Biennial should take place at the Academy of Fine Arts in Moscow, which is currently undergoing a massive renovation. While the opening of a new exhibition is celebrated, the event will be closed until March 21. In a statement, the museum said: “We are doing everything we can to keep the staff and visitors in the best possible mood as much as possible. It is impossible to consider a permanent solution to the current situation when the exhibition, the exhibition programme, and the events of the Biennale season are still open. The exhibition class is still open, and the programme will continue as planned. We hope that the exhibition and the show will be open as soon as possible. We are fully committed to maintaining an exhibition programme of the highest quality at the Academy of Fine Arts.”The museum said: “All fairs and other events at the Academy of Fine Arts are subject to the same financial constraints and restrictions as the exhibition programme. Therefore, we are analyzing the possibility of postponing the exhibition in order to have the best possible outcome for the exhibition programme. We are analysing all possible possibilities and will not know until the week of March 19, whether we will be able to open the exhibition and the exhibition programme in the next", "The next Biennial should begin with the seven-thousand workshop that is currently underway in the university’s Thomas More Society Building, titled “From Bed to Screen: Conversations on Cinema and Cinemaography” (2019–20), and culminate with a presentation of the work of eighty artists. Selected by an independent panel of curators from an initial list of thirty-three artists, the exhibition will be on view until October 19.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Christopher Bedford as its next chief curator. Bedford will be responsible for developing and implementing the museum’s strategic vision and curating its exhibitions. He succeeds Laura Dern, who has served as the museum’s chief curator since 2013, and will begin his tenure in January 2021.“Christopher’s long history of curating demonstrates that he is fully committed to developing new ways to support museums as we continue to celebrate and present the work of contemporary artists and their peers,” said museum director Kathy Haag. “We are confident he will continue to shape the exhibitions and collections for the National Gallery of Art and our collection as he continues to expand the gallery’s expertise in contemporary art through exhibitions, educational initiatives,", "The next Biennial should have a new theme, “situations of social and political crisis,” Ng said. “We will continue to present the work in different ways to bring more people together.”\n\n\nMuseums and cultural spaces across the United States are mourning the loss of a beloved, long-standing, and influential collaborator of contemporary art. Beth Anne Lucas, whose expansive and captivating paintings and drawings were often at odds with their time, has died at age eighty-nine, and her work, “The Polyester Triangle,” is now widely recognized as a defining work in American abstract art history.Born in Chicago in 1936, Lucas grew up surrounded by avant-garde and mid-twentieth-century American art, including Benjamin Zwick, the neo-expressionist artist known for his geometric, organic landscapes of silk, fabric, and cotton. But Lucas soon discovered the radical and subversive political and philosophical critiques of her earlier paintings, and the radical implications of abstract thought.“Lucas is a remarkable artist,” Robert Johnson, a former mentor of Lucas’s, told the New York Times. “She has an exceptional range of emotions, and it\u0097", "The next Biennial should take place in 2024. The first event, “The Body & Culture” (2019), addressed the current political climate, and the second, “The Contemporary Situation” (2019), was organized as a sort of “art-event” in which visitors would have the opportunity to view the works of artists and other works that they had the opportunity to purchase.The new year marks the centenary of the Dutch artist Walt and his foundation, the Center for Contemporary Art. In his career which spanned four decades, the artist amassed more than 4,800 works. He was one of the pioneers of the modernist style of painting and sculpture and was one of the first artists to work in a studio. He began his career in 1967 at the Center for Contemporary Art in Amsterdam and then, in 1979, moved to the Museum van Hir, where he organized the show “Walt Buju: From Space to Time” (1979). In 1993, the Museum of Modern Art in New York presented his work in its “20th Anniversary” exhibition, “The Body for Modern Art.”From 2007 to 2016, the artist worked in the United States and Canada, where he lived and worked in", "The next Biennial should be in July 2020. “As the artist-run biennial will be inaugurated with the exhibition ‘Unseen,” curated by my husband, the artist Osman Khan, in the exhibition will be hosted by the artist-run nonprofit Art+Art, which will receive a total of $3000 from the museum. The museum will be preparing for the next year-round exhibition with the same vigor it has for the last decade. The institution is also working to create a new space for children’ art, in the form of a digital platform, the Digital Playground, which will allow the public to engage with up-to-date art and design through interactive programs. The new pavilion will be inaugurated by “The Art of Tomorrow: Design After September 11”, curated by Noguchi, and will be inaugurated by the artist-run biennial “The Lives of Others: Frederic-Auguste Breton, 1869–1959” on October 8.\n\n\nThe National Gallery of Scotland has received a £6.5 million donation from the estate of the late British colonialist Cecil Rhodes. The European Heritage Fund also announced a $5 million grant for", "The next Biennial should take place in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Amanda King, the director of the Metropolitan Museum of Art, as its next director. King comes to the institution from the Solomon R. Guggenheim Museum in New York, where she has been the director since 2016.“Since becoming director, Amanda has guided MoMA through a reopening inspired by the contemporary and her own emerging narrative,” said Peter Heller, chair of the museum’s board of trustees. “It is a landmark year for MoMA, and for the city of New York, as we enter its 150th anniversary. We are pleased to welcome her to the museum and look forward to her leadership role in ensuring that our exhibitions and programs reflect the extraordinary breadth of her work.”King previously served as director of the Solomon R. Guggenheim Museum in New York from 2016 to 2018. During her tenure, she increased the museum’s attendance by more than three hundred thousand visitors, expanded its collection, launched new public programs, and secured more than $65 million for the museum.“It is impossible to overstate her impact on MoMA,” said Michael L", "The next Biennial should be held in 2021. According to the Art Newspaper, the organizers are also planning to open a new exhibition space in the city’s cultural center São Paulo, with the aim of reopening the museum in 2020. Artnews reported that the replacement of the National Museum of Modern Art will be announced later this month.\n\n\nThe Los Angeles County Museum of Art (LACMA) and the San Francisco Museum of Art (SFMoMA) are teaming up to present the next edition of the Venice Biennale, which will take place in 2022. The announcement came amid a wave of resignations and accusations of censorship following violent protests against the exhibition, which drew an audience of some two hundred thousand people, leading to the firing of the SFMoMA director, Marc-Olivier Cicutto, and the management of the LACMA branch.The new partnership, announced on Tuesday, allows LACMA to present the Venice Biennale, which will be hosted by the Palazzo della Scala in Venice, under the theme “Decadence and Surrounds,” while SFMoMA will become the Venice Convention Center for the event. The partnership also allows LACMA to organize the", "The next Biennial should be a summit of the artists, designers, and curators who have made the most important contributions to visual art over the last fifty years. In addition, in the tradition of the previous two years, the Biennial will stage an exhibition organized by the artist, the concept, or the artist’s client, and be inaugurated by a performance by the artist. The first iteration of the Biennial will take place at the Art Exposition Berlin, the Art Basel, and the Art Newspaper in December 2020 and will run through March 2021.The biennial will celebrate the contributions of eighty artists from twenty-four countries and by examining their projects through the artist’s own personal artworks and by exhibiting their work in the upcoming exhibition Space.\n\n\nThe Metropolitan Museum of Art in New York has launched a new Initiative to Promote the Visual Arts (IMVA), an initiative that will pair forty art-historical institutions, including the Brooklyn Museum, the Bronx Museum of the Arts, and the Metropolitan Museum of Art, with the artist-owned space the Void Studio and its space in Manhattan’s SoHo neighborhood. The program will provide funding to encourage the installation of new works by twenty-two artists selected by the", "The next Biennial should take place in 2022 and the following years will likely be the final years of the project. During the works’ lifetime, every work will be curated around a theme; there will be no break between works. The Golden Lion will be awarded for artists whose work expresses the spirit of the great city while also providing an explanation as to why city life has been established in the first place. In order to facilitate invitations to re-enter the Biennial, the Grand Jury will invite the participants to be included in future editions.\n\n\nThe Museum of Fine Arts (MFA) in Boston is delaying the opening of its new arts space, the Gallery for American Art, by a year. The institution had previously announced that the exhibition would open in the spring of 2021, but this hasn’t made its 2020 opening date any less distant, as the museum plans to remain closed until at least December 2021.“Every step toward opening the Gallery for American Art is a year behind schedule,” said museum director Nicholas Cullinan. “We are continuing to work with our partners and stakeholders to deliver a vision of contemporary art that addresses how art can enhance and guide the daily experiences of artists, and that is grounded in a sense of historical", "The next Biennial should take place in the autumn, to coincide with the fall equinox.  In a letter dated August 24, the exhibition’s artistic director, Julia Salomons, said: “It will be an extraordinary adventure for us to create a show that is both deeply rooted in the movement of the sun and also deeply rooted in the movement of the sun’s celestial bodies. This is a challenge which we will take as we continue to present the work of the exhibition.” \n\n\nAmerican artist and educator Robert Irwin, a prolific and influential artist whose work explored the history of the American Southwest, will be remembered for his dedication to art and his work as a teacher.Born in New York on December 25, 1926, in Brooklyn, New York, Irwin moved to San Francisco in the ’50s to study the history of art at Columbia University. In 1965, he returned to his hometown to teach at the University of California, Berkeley. He continued to live on the Bay Area, where he worked as a garden designer, a gallery owner, and a homemaker, and made several other artworks. His artwork was included in multiple international exhibitions, including at the Venice Architecture Biennale in 1967, the", "The next Biennial should take place in 2021, the full list of participating artists is as follows:Beijing Art MuseumBing Art MuseumBishkek Art MuseumBishkek GalleryBishkek Gallery for Contemporary ArtBishkek Gallery for PhotographyBishkek Gallery for Visual ArtsBishkek Gallery for Writing Bishkek Gallery for Visual ArtsBishkek Gallery for Visual Arts2Bishkek Gallery/Art Institute for Contemporary ArtBishkek Gallery/Beijing Art MuseumCAA Multimedia CenterCACM (Thai American College of Media)CACM Centre BeijingCACM China Contemporary Art CentreCASSOCIATES INTERNATIONAL (Philippines)CASSOCIATES INTERNATIONAL BeijingCASSOCIATES INTERNATIONAL BeijingCASSOCIATES INTERNATIONAL Beijing/Meiji Art MuseumCASSOCIATES INTERNATIONAL Beijing/Meiji Art Museum China (Art Gallery)CASSOCIATES INTERNATIONAL BeijingCASSOCIATES INTERNATIONAL BeijingCASSOCIATES INTERNATIONAL BeijingCASSOCIATES INTERNATIONAL BeijingFRIENDSHIRE Contemporary Art Museum, UCCA, Japan: \"Hachiwa no", "The next Biennial should take place in the spring of 2020.\n\n\nWhen the Art Newspaper published an article announcing that the Royal Academy of Arts (RA) in London would be celebrating a century of Flemish painting with a new exhibition titled “Flemish Painting in the Life of Paul Gauguin” in January 2020, the show was met with confusion and confusion of the very definition of the term. “The exhibition is not a Flemish painting,” the Art Newspaper wrote. “The exhibition is a tribute to the forty-fifth century of the painter Paul Gauguin, who created in the city of Rotterdam, the first exhibition dedicated to the work of the Flemish painter Jan van Eyck. The show will present the first major retrospective of the artist’s work in the United Kingdom and Europe.” While the exhibition would have featured forty works by van Eyck, the show was not organized as a museum show. Instead, it was organized as a fundraiser for the Royal Academy of Arts.While the museum has not yet commented on the exhibition, the museum said: “This is a collaborative project between the RA and Paul Gauguin. The RA will present a series of works from", "The next Biennial should aim to 'explore the relationship between the humanities and the natural sciences, exploring the possibility of incorporating both disciplines into a single exhibition, as the themes of the next edition are ‘inquiry and ‘inventivity,’” the museum said.For the 100th anniversary of the National Museum of Modern Art, in the same year a new group of artists will inaugurate its new building, the Smithsonian Art Museum in Washington, DC. The Smithsonian’s new president, Virginia Guggenheim, told the Washington Post that the institution will be “inventive and modern” and will be “in a unique and very strong state.” Inaugurating the museum in 1967, Guggenheim was the founder of the Columbia University art school.\n\n\nChina has provided more than 1,400 additional jobs for artists and art workers since a new nationwide government-backed scheme was launched in June, according to the State Administration of Arts and Cultural Heritage, and the economy is projected to add around $106 billion to the national budget by 2020.As part of a sweeping plan to support the arts, the People’s Republic of China invested more than $100 billion into the economy since", "The next Biennial should take place in 2022. \n\n\nThe Council for Contemporary Art (CCA) in London announced today that it is holding its next General Assembly, the London Forum, in May 2020. Organizers say the event will continue to be hosted by the same organizers as it has since its inception, with the addition of new artists, institutions, and audiences.“CCA’s Board of Directors and I are very proud to announce that the London Forum will be hosted by the same amazing and talented artists as it has always been,” said directors Ulla and Wim de Kooning. “We can’t wait to welcome you to the Forum, and we’re excited to see what you think. We’ve seen what works and what doesn’t, and we’ve seen what happens when you bring people together.”The 2020 event, which was established in 1976 and has been held every four years, has received a $9 million donation from the Khawarij Foundation, which was established in the United Arab Emirates in 1999 to help fighting the spread of the virus. The investment in the venue, which is in a former textile factory in Coventry, follows a pledge by the", "The next Biennial should be held in 2020.\n\nThe Museum of Modern Art (MoMA) in New York has announced that it will not be able to hold the upcoming exhibition “The Black Swan” at the institution, which is located in the Battery and opened in 1882, due to concerns relating to a coronavirus. The show, titled “The Body Politic,” will open on March 4 and will run until March 12. It will also suspend the two-day event for a future edition in order to “build on the momentum generated by the exhibition,” according to a statement posted on the museum’s website.Among the exhibitions currently on indefinite hiatus are “The Blue Wave” (March 3–March 13) and “Jadower,” which will be on indefinite hiatus until March 12. Artnews reports that MoMA has not yet determined the exact dates of the next iteration of “The Body Politic,” but that it will likely skip the 2020 event altogether. The decision to suspend the exhibition came as no surprise to those who have recently attended the museum. The exhibition was already scheduled to open on March 3, but was pushed back to March 13", "The next Biennial should be held in September 2020. The museum has announced it is also expanding its digital platform to include the exhibition of approximately 1,500 works of art from the Biennial. The show will include works from the first exhibition in the series “Notes on Life” in 2018 and the second exhibition “The Life of Art” in 2019. The exhibition will open on October 8 and will run until November 21.“The new exhibition will be a valuable opportunity to explore the work of contemporary artists in a wholly new way,” said Tomasz Klimczyk, director of the Biennale, while Aram Vandyck, the director of the Museum of Modern Art, and Ludmilla Moskalova, the chief curator of the Biennale, as well as the global head of the exhibition, said: “At the Biennale, we have always kept our creative vision in mind, delivering a rotating cast of artists to create a new kind of platform for the show. The new format will offer even more opportunities for visiting artists and visitors to share their work and experience with one another.”\n\n\nThe British Museum in London has appointed Naveen Watters as director and", "The next Biennial should be held in 2020, and the twenty-sixth should be held in 2022. “The new structure will allow us to create a series of exhibitions that will provide space for the next generation of artists, and will play a central role in the development of visual art in Barcelona,” the commission stated. The final design of the fair will be determined by the city of Barcelona, and will encompass a total of twelve exhibition spaces, which will be equipped with telepresence devices, virtual reality, and other forms of enhancement.\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced that it is planning to begin welcoming visitors back to the institution on August 29, following a temporary closure due to the Covid-19 pandemic. The date for the reopening of the institution will be determined by the county of Los Angeles, which announced the date for opening on July 29. “We are working hard to minimize the impact of Covid-19 on our staff and our guests, and to begin allowing the public back into LACMA as soon as possible,” said museum director and CEO Matthew Teitelbaum. “More importantly, we will continue to listen to you and engage with", "The next Biennial should be held at the Museum of the Contemporary Arts in Boston, which is currently undergoing a $1 billion renovation and is expected to open in 2024, or in Los Angeles in 2023. The 2020 event will be titled “Art & Memory: Reconsidering the Past in an Age of the Present—” and will be curated by LA-based artist Aidan Hamilton. Art and Memory is part of a new collection of works by contemporary artists that will be presented in the museum’s new “FYI: Art & Memory” section, which will be inaugurated by the artist-in-residence “The Girl in the Window” in the fall of 2020, and will be curated by Matthew Teitelbaum. “I’m excited to begin this new chapter with the creative and experimental artists who have shaped the current concept of Art & Memory, and to continue to push the boundaries of what this new collection can and can't contain,” said Mary Anne Wilson, president of the Austin Museum of Art. The museum previously held a show of work by Harriet Beecher, of the Beechers, which was staged at the Darling Gallery in London, in", "The next Biennial should be a celebration of all the artists, writers, and inventors that have shaped the way that we live our lives and are shaping the future of our art. We hope that the venue and the subjects of the seventy-sixth edition will provide a powerful platform for them to present their work and reflect on their lives. \n\n\nThe California Academy of the Fine Arts (CFA) in Pasadena has received a gift of more than four thousand photographs by Oscar Murillo, a Mexican-born American photographer whose work explores the American experience with a surrealistic, color-toned perspective. The works are part of the CFA’s collection of works by the American photographer, whose complex and intimate approach to photography weighs heavily on the artist’s various projects, including the recent exhibitions at the Museum of Modern Art and the Brooklyn Museum.“When I was selected to represent California in the exhibition ‘The Best of American Photography’ at the CFA,” Murillo wrote in a statement, “I was excited to present my first work in twenty years. I am thrilled that this work is being housed in this museum and will be able to continue to work and live in Mexico City and pursue photography with my family", "The next Biennial should be held in 2021, and the inaugural exhibition should open in the year 2020. Final plans for the event are currently under discussion. The first biennial will include more than ninety artists, including artist-in-residence Marcel Prouvé and Tate curators Rachida Bhandari and Michael Chabon; the first wave of artists scheduled to participate in the exhibition, from August 11 to August 13, will be announced in October.The announcement came amid the UK “s Autumn Statement,” an exhibition that will include more than sixty works by forty-nine artists at Tate Britain during the month of September. The show will run from September 5 to September 8. The Autumn Statement is part of a wider plan to overhaul the UK’s infrastructure and spend £350 million to create a new creative and cultural hub in the city, known as the Biennial Village.The change will see the Tate transform the grounds of Tate Britain into a new exhibition space and will involve the building of an underground garage for the exhibition, which will be moved to the north-west of the pavilion, and the restoration of the pavilion and grounds. The garden will also be enlarged and will boast a new area for audience participation. The", "The next Biennial should take place in 2021.\n\nThe jury that selected the ten finalists for the 2020 prize, which honors the cultural impact of art with a prize of $50,000, also awarded the $30,000 Peiksapa Biennial $20,000 in support of its inaugural year. The prize jury also awarded $10,000 to The See-Saw-Seren, the Israeli troupe that staged a performance for the first time in the competition’s history at the final round of the prize in July.The judges for the prizes were David Wonchak, who has served as the Prize’s executive director since 2015; Peter Blum, the curator of contemporary art at the National Museum in Oslo; and Jason Bech, a curator at the Museum of Contemporary Art, Los Angeles.Blum thanked the Prize’s jury for their vote of confidence in his curatorial work and said that he hopes the prize will help to advance the exhibition’s goal of a new combination of exhibitions, residencies, and projects that would help advance the art of the contemporary. “Our goal is to develop new approaches to exhibitions and residencies to support and extend the work of the Prize’s members", "The next Biennial should take place at the Museum of Contemporary Art in London in 2021. \n\n\nLouis Vuitton’s A.S.P.E.N. (Artists’ Palestinian Protection Units) are holding an action in solidarity with the people of Gaza, which has been ravaged by a devastating war between Israel and the Palestinians since November 8, 2017. The art has been used by artists such as Donna Karan, Pablo Picasso, Jacques-Xavier Huyghe, and Anne-Sophie Prouvost, and is currently on display in the exhibition “Made in LA 2020: Part of a Group,” which is curated by Maureen O’Grady.The exhibition opens to the public on October 28. \n\n\nThe Künstlerhaus Berlin, which represents the Picasso-trained artist Alexander Calder, has announced that it will no longer participate in the annual exhibition, “Theatrum,\" which will return to the Moskau Biennial in May. The Künstlerhaus’s artistic director, Anton Kern, told the Art Newspaper that the institution has been collaborating with the Israeli Defense Forces (IDF) since the late 1980s and", "The next Biennial should be held at the Museu de Arte Contemporâneo in Lisbon in the summer of 2022. The exhibition consists of an assemblage show, a performance tour, an educational program, and a forum focused on contemporary art and social movements.\n\n\nArt Basel has pushed back the start of its next edition in China, which was originally set for November 28–December 3, from December 13–December 16. The move follows a backlash against China’s exhibition at Art Basel Hong Kong in December, which drew 300,000 visitors. The exhibition was canceled amid the ongoing protests over censorship in China and Hong Kong, and the country’s government ordered a crackdown on pro-democracy activists. The New York Times reports that Beijing responded by further restricting Hong Kong’s travel, and the art world witnessed a further decline in attendance.Last week, Art Basel announced that it would be rethinking its 2021 edition in China, which would have taken place in October, and is now working with the Chinese government to develop a new engagement strategy. The announcement followed an event at the Chinese Ministry of Culture attended by Chinese President Xi Jinping and Hong Kong’s Chief Executive Carrie Lam, and coincided with Hong", "The next Biennial should be held in the spring of 2021. The exhibition will be organized by the Museum of Modern Art (MoMA) and will run from March 13 to March 21.  The 2019 installment, titled From Eden to BAM, was held at the Brooklyn arts space Space Museum Brooklyn and featured work by sixty artists. The biennial’s inaugural exhibition, “Regional Schemes” (2019), was organized by the Asian Art Museum (SAAM) in Los Angeles and featured work by thirty-three artists from Japan, China, Korea, Hong Kong, and Taiwan. The show was curated by Dawn Toguo, curator of Chinese art at MCA, and Christopher Wool, curator of Asian art at the Museum of Modern Art.\n\n\nRARE BOOKS, a division of Simon & Schuster, has been acquired by publisher Simon & Schuster. The publisher previously announced that it plans to develop new and longer-term relationships with artists through “Theater of the End of the World: On the Scientific Study of the State,” a new ten-year, $170 million project that will be published in April 2020. The project, titled “Theoret", "The next Biennial should be in the fall of 2020.  We are already well into the second phase of the project, which is about to be completed in 2021, and the third phase is now underway. This is a complex and time-consuming process and we are hoping to be able to make the first exhibition in the new venue, the Biennial of the Living, in 2020.\n\n\nThe Pérez Art Museum Miami (PAMM) has received a gift of more than 130 works from the artist-run nonprofit group Artadia\u0097a network of artists that works in collaboration with the Pérez Art Museum to promote local, regional, and international artists through events, exhibits, and scholarships. The gift includes works by seventy-nine artists, including Sara J. Allen, Hou Y. Wen, Eugenio Canepa, John D. and Jane Doe, Lori Hendrix, Peter S. Bradley, and Tanya and Michael S. Martinez.“We are so proud to present this gift to the Pérez Art Museum Miami,” said Tina Ochi, director of Artadia. “This is a truly incredible gift given to PAMM", "The next Biennial should be about “subjectivity,” he said. “When I speak about subjects, I’m talking about subjects that, at the time of my speaking, were outside of the realm of the arts.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is considering restructuring its current exhibition-based model, which began in 1997 with the opening of “Sidney and Sundance: 28 Years of Art” on the same weekend as the Biennale, to include an event that would run from January 5 to March 17, 2020. The organization has yet to announce a date for the reimagined event, but the tentative redesign would see major new works created by artists in the event of an emergency.“This is a phenomenological event,” David K. Goldfarb, the director of the Los Angeles County Museum of Art, told the Los Angeles Times. “It’s a huge undertaking, and it’s complicated by the fact that it’s an emergency. . . . As a matter of fact, we have never done a retrospective in this fashion before. So, it’s going to be a real challenge.�", "The next Biennial should be held in 2020, and the International Biennial in 2021.\n\n\nThe Lebanese artist Nima Nabavi, whose drawings and installations often reflected his personal sense of humor, has died at age seventy. The Lebanese-born, Jerusalem-born photographer who introduced Nabavi to the medium of video, has died at eighty-five years old.Born Nima Berrada in Beirut in 1943, Nabavi studied at the University of California, Berkeley; the University of Arizona, Tucson; and the University of Ben-Gurion. After graduating in 1957, Nabavi joined the Israeli Army and served as a photojournalist in Beirut. After three years, he returned to Egypt, where he continued to work. He continued to travel to Israel and the West Bank throughout the 1960s and eventually settled in Beirut, where he continued his photography and became involved in the 1975 Palestinian revolution.While working on a series for the Beirut-based artist Billie Jean for a 1975 edition of the magazine Al-Manar, Nabavi came across the work of Yasser Arafat and decided to use it in his own work. He was hired to photograph the leader of the Palestinian Liberation Organization, Yasser Arafat, and asked to create a collage of", "The next Biennial should be held at MQ Médical de Lyon in May 2020. The project and its funding will be organized in collaboration with the museum’s board of trustees and the requester.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it will reopen to the public in March 2021. The project to upgrade the institution’s iconic Skirball Cultural District, which encompasses the Museum of Modern Art, the Los Angeles County Museum of Art, and the Los Angeles County Museum of Art (LACMA), is part of the city’s ongoing effort to modernize its urban core.The museum hopes that the reopening will encourage more people to visit, encourage a greater exchange of cultural experiences, and draw new and returning audiences. “The Skirball Cultural District is a vital cultural gathering place for millions of visitors each year,” said Marilyn King, the director and CEO of the Skirball Foundation. “We are grateful to the city of Los Angeles and the board of trustees for recognizing the value of this cultural destination in promoting the Skirball Cultural District’s revitalization.”The architectural and engineering design of the complex was jointly funded by the Skirball", "The next Biennial should take place sometime in the 2020s and will showcase the work of twenty-eight artists, including Andrea Dossa, Alessio Catellani, Carlos Garaicoa, Jörg Hollemann, and Giancarlo Marotta. The 2020 edition will be held in the Pontificia di Trisulti, in Milan, and will comprise twenty-three artists\u0097all from the Republic of Ireland.“The 2019 exhibition was a real watershed, as it opened up a new era of collaborative and interdisciplinary art and was followed by the 2008 exhibition “Grande Elegance” in Nice, France. In addition, the inaugural exhibition was presented at the invitation of the Institute of Contemporary Arts, Milan, and the Italian state.The 2019 exhibition will be held at the Museo del Prado and will feature work by forty-three artists. The exhibition was organized in collaboration with the Dallara Foundation, the Fondazione Feltrinelli, and the Italian State, which has provided funding. The collection comprises work from twenty-four countries and is housed in the Museo d’Arte Contemporanea (MAS) in the Museo del Prado.", "The next Biennial should focus on the ideals of self-determination and the importance of art and culture in fostering social progress. The information presented by the museum will be the basis for the selection.\n\n\nThe Sydney Opera House is planning to release the final portion of its newly-renovated Lotus Gallery, which was the venue for the first British exhibition of the contemporary art movement, artforum.com.au reports. The NADA Contemporary Art Center (NADA) has also announced that it will soon host Artforum’s David Blaine and Josef K. Paulson, who will be the venue for a retrospective of work by twenty-five artists, including Gustavo Dudamel, Gabriel Garcia, Jacques-Louis David, Jean Paul Sartre, and Walter de Maria, in the venue. The event will be held at the venue until January 18, 2021. The five-year, $50 million project was completed in April 2019 and, according to the New York Times, is now undergoing a major expansion. Its new 15,000-square-foot space is called the NADA Contemporary Arts Center and will house the exhibition space and the professional studio. A new six-thousand-square-foot gallery is also", "The next Biennial should take it a step further by introducing a new exhibition of new work by the currently under-recognized artists, led by an artist whose work is currently on display at the Biennial. The project, which will run for thirteen consecutive days, will explore the interconnections between theory and practice through a wide-ranging collection of modern and contemporary artwork.The new exhibition, titled “Experiment,” will be housed in the newly renovated and expanded Museum of Modern Art (MoMA), which opened in 1971 and is located near the Museum of Modern Art in New York City. The museum will also be controlled by a new subsidiary of the company, Riga Art Museum, and will be staffed by four employees. The new museum’s director, Yoko Ott, has already announced plans to create “a new space for experimentation in artist-built projects.”\n\n\nThe Museum of Modern Art (MoMA), the Museum of Modern Art, New York, and the Metropolitan Museum of Art in New York have come under fire for removing a sculpture by avant-garde Polish designer, painter, and architect Oskar Eustis from its collection. The sculpture, titled Wolf in a White Coat, ", "The next Biennial should be held in February 2021, to coincide with the opening of this exhibition. The next edition of the Biennial will commence in June 2021. The project, titled Biennial of the Sun, will investigate the relationship between the sun and the moon and will feature work by artists who are working on the unification of the sun and earth. Inaugurating the project is a special edition of the biennial, titled Biennial of Light, which will be held in May 2022.The exhibition will be in partnership with the Sun Gallery in New York, which is currently closed due to the Covid-19 pandemic. The Biennial of Light will be staged at different times of day and will be open to the public from January 15 to March 23, 2020. The exhibition will be similar to last year’s Biennial of the Sun, featuring 40 works, including paintings, sculptures, photographs, videos, sound pieces, and installations. Commenting on the project’s themes, Leila Salah, the executive director of the Sun Gallery, said: “We are thrilled that this year’s Biennial of the Sun will feature such a strong selection of work by the best contemporary artists, including some of the", "The next Biennial should take place in Basel in January 2021. The UK’s pavilion at the 2020 edition of the Biennale will be hosted by Tate Britain, which will work with independent architects to present a new exhibition. The current exhibition, “The Future of Art,” is slated to run from January 20 to April 22.\n\n\nThe National Geographic Society’s annual $5.5 billion acquisition of more than 200 cultural artifacts has netted the nonprofit organization $2.5 million in support of “cultural heritage preservation and conservation,” according to a report published by the National Association of Art Museum Directors (NAABD). The grant, which also includes $1 million for cultural heritage preservation, follows one of the largest acquisitions of art and artifacts in the country’s history, for which the National Geographic Society was awarded $2.6 billion in 2019. In recognition of its philanthropic generosity, the National Geographic Society and the National Geographic Society’s board of trustees are giving one of the richest men in United States a personal gift of $5.5 billion, Aaron Tafoya, the CEO of Safariland, an international defense and security company headquartered in Santa", "The next Biennial should be held at the Museum of Modern Art, which was chosen partly for its location and its proximity to the Museum of Modern Art. “We are also excited to partner with the Miami Art Museum to continue the work of the previous biennial,” said Richard Bishop, director of the Biennial. “This cooperation is a natural extension of our two institutions’ commitment to the Miami arts community and to our other projects. We have been working with the Miami Art Museum for almost twenty years and this is a collaborative project between two of the best institutions in the country.” The next iteration of the Biennial will take place at the newly renovated Miami Beach Art Museum from April 15 to April 21.\n\n\nThe British fashion designer and philanthropist Ralph Lauren’s estate has donated $10 million to the Smithsonian’s National Museum of Fine Arts (NMFA). The sum is nearly three times the sum spent by the artist’s heirs on behalf of their late father, the late designer Alfred Lauren.The donation follows a decade of efforts by patriarch and his son-in-law, Monty, to raise funds for the museum. The men formed the $25 million Ralph Lauren Family Foundation in 1998 and have", "The next Biennial should be staged in March 2021.\n\n\nThe Rothschild Museum in New York and Yale University in New Haven, Connecticut, have teamed up to present the annual Frontiers for Art and Design exhibition, which celebrates the history of art and design through the lens of twenty-first century culture. The first iteration of the exhibition, titled “Telling Stories,” opened on March 13 and ran through March 19. As part of the partnership, the Penn Museum of Art and the Yale University Art Museum in New Haven will hold “Making Space,” a two-part exhibition, which will focus on the history of space and will air on April 3 and April 7. The exhibition will also feature a selection of works by artists from the two institutions.The frontiers of art and design exhibition, which will be held at the Rothschild’s New York outpost, will address the themes of how art and architecture have historically intersected with contemporary culture and what the future holds for them. Those topics will be reflected in the different works in the workspaces. The exhibition will also include a “portraits of three of the artists,” which will be based on historical accounts, and will present a selection of works by artists", "The next Biennial should take place in 2020. The annual event, which takes place in late April, will open with a free concert. The exhibition is organized by the Helsinki Art Center and the Helsinki City Hall.\n\n\nThe São Paulo Biennale has announced that it is teaming up with the Museum of Contemporary Art (MCA) in Santo Domingo to present an exhibition of Brazilian contemporary art in 2020. The initiative, titled “Brazil: Photo en estática” (After the Art), will run from April 5 to April 8. The exhibition will feature more than 2,500 works by forty artists from thirty-one countries. The event will also present special projects that will be created within the museum.“We are proud to work with the Museum of Contemporary Art (MCA) in Santo Domingo and the São Paulo art scene, which is growing, to present ‘Brazil’s’s’ best,” said Kurtas Stensrud, co-chair of the biennial and director of the Museo de Artes Plásticas (MASP). Commenting on the partnership, art historian and curatorial director, João Paulo de Sous", "The next Biennial should be held in 2022.  The opening of this exhibition will mark the anniversary in 10 years of the exhibition “The Shape of the Earth:” (1943–1946), which is an early work on the theme of climate change. \n\n\nThe Metropolitan Museum of Art in New York has hired Sarah Erskine as its next director and CEO. Erskine comes to the museum from the Adlerman Foundation, where she has served as associate curator of art since 2010. Previously, she was the director of collections in the Jerusalem Art Museum.“Sarah Erskine is a seasoned director of collections who has demonstrated a commitment to the museum’s collection and employee experience in every capacity,” said director James Q. Wilson. “Her tenure has also proven her ability to take the Adlerman Foundation through a transition to a new leadership team, which we hope will help us move further into the future with an even greater sense of optimism.” Erskine succeeds Marc Straus, who stepped down after a decade to become the founding director of the Museum of Modern Art in New York, and will take up the post on January 1.\n\n\nThe Israeli government", "The next Biennial should be held at Frankfurt am Main in October 2022. The 2019 edition featured work by thirty-nine artists from nineteen countries and attracted a record-breaking twenty-eight million visitors.\n\n\nThe Metropolitan Museum of Art in New York has announced that artist-in-residence Naomi Campbell will become the next associate curator of art at the museum. Campbell joins the institution from the Metropolitan Museum of Art, where she has served as director of curatorial affairs since 2016.“The Met is thrilled to welcome Naomi back to its curatorial team and to have her join the team,” said director Christopher Bedford. “Her long-standing expertise and ability to collaborate constructively with a diverse and stimulating group of artists will strengthen the Met’s curatorial team and our program in new ways.”Campbell, who has worked at the Met since 2012, joins the institution from the New Art and Design Center, where she currently serves as deputy director of artistic development. She previously worked as a curator at the Metropolitan Museum of Art and the Museum of Modern Art in New York. During her tenure at the museum, she curated the exhibition “Dorothea Rockburne: Solitary,” which opened on", "The next Biennial should be held in the first half of the year 2020. The programme, which consists of 12 exhibitions and has been held in partnership with the Abu Dhabi Foundation for Art and Art Dubai (ADF), will thus mark the end of the artist’s first year as a curator of Contemporary Art.“We are quite excited by the prospect of presenting a new collection in the new museum that was designed by the artist, developed by him, and inaugurated by him,” said curator Mehdi. “It is a great honour to be able to contribute to his legacy.”Inaugurating the Biennale are three new exhibitions and performances, among them “The Past Lives in the Present,” which features work by artists such as the French painter Bénédicte Savignal, who is based in New York, and “Our Place,” a performance by the San Francisco–based troupe the Hot Rats, which has staged performances at Biennale venues and has collaborated with artists such as the American drummer Bob Dylan.\n\n\nThe New Museum in New York has appointed Maria del Carmen Ortiz as its new executive director. Ortiz comes to the institution from the Getty, where she has", "The next Biennial should be held in 2020.\n\n\nThe Institute of Contemporary Art (ICA) in Milan, Italy—a nonprofit organization that was founded by Salvatore Cittadino in 1933 and that serves as a major research center on the history of Italian art—has received a gift of around $1.5 million from the trustees of the Frances Piazza foundation, which was established by Frances Piazza, to create a new center dedicated to the legacy of Giacomo Paganini, the Italian avant-garde photographer. The gift is a major milestone in the organization’s thirty-year history, as the foundation embarked on an ambitious plan to create a new museum dedicated to the work of Giacomo Paganini, who was a member of the group of Portraiture artists that comprised the first international group of photographers to be recognized by the Italian Academy, in 1959.According to the Art Newspaper, the institute has identified eleven sites for the new institution, which will be built in the former cattle barns in the Piazza della Scala, and is currently preparing to unveil the first site-specific works by the artists. The institution will also work with architects to plan the new venue and to design a new pav", "The next Biennial should be held in 2020.  The museum has also released a statement about the upcoming event, which will take place in June: It is with a great deal of sadness and disappointment that the Museum of Arts & Design announces that it is canceling the 2020 edition of the Biennial. The cancellation follows a period of unprecedented uncertainty for the museum: The museum had been closed since March 13 and was postponing future programming due to concerns related to Covid-19, including the upcoming exhibition “Dancing in Time” (2019). The cancellation is a significant step in the museum’s ongoing effort to move back to a business-as-usual schedule for its programming. The institution previously announced that it was postponing the event by between seven and nine weeks. “We are acutely aware of the impact and impact of Covid-19,” said Museum Director Matthew Teitelbaum. “We are also acutely aware that we have a lot of work to do to reverse the decline in visitor numbers projected for the 2020 event. However, the interim plan we have proposed is the safest and most cost-effective.”The museum has also announced that it will now be able to", "The next Biennial should be held at the Museum of Fine Arts in Boston. “The Biennial is a critical step in the history of art to increase our understanding and appreciation of the art of our time,” said James Fadiman, chair of the committee. “This is the beginning of a new era, one marked by a new set of ambitious endeavors to articulate the most important movements of art in the twenty-first century and to present a new kind of exhibition at the Museum of Fine Arts.” The ten-year celebration, which will focus on the works of twenty-five artists, will run from October 27 to November 14, 2020 and will feature new work by the Hairy Bikers, a group that explores environmental issues through the creation of alternative ways of being. The biennial will also launch a new website, www.bbm.org, which will host regular programming, including exhibitions and talks, and will serve as a platform for new artist commissions. “This will be a defining year of the Museum of Fine Arts,” said Mark Kessler, the biennial’s curator of modern and contemporary art. “My job is not only to produce a show that is intellectually challenging, but", "The next Biennial should take place in late April – early May in 2021. The first thirty-four years of the festival have been devoted to the body and the least controversial of contemporary artists, sculptors, and their issues. Since its inception in 1961, the event has been held in Paris and has been staged in every Spring and Fall. “As a body politic, we are in a moment of extraordinary change,” said Lévy Gorvy director Jean-Pierre Blanxer. “We are dealing with a situation where the art of the body is no longer limited to the classical form, but can be found anywhere and is increasingly expressed through the virtual. Thus, we are currently evaluating the most appropriate means for its production and distribution in order to protect the integrity of the exhibition and for the programme. We hope that the Festival will remain at the heart of the contemporary body, providing a platform for its artists and for the entire field of art.”The full list of participating artists is as follows:Adam Kalselmayer (Norway)Alexander Calder (France)Cécile Bourgeois (France)Cécile Benoit (France)Cécile Bourgeard (France)Cé", "The next Biennial should be held on October 12, 2020.\n\n\nThe Kunsthalle Basel in Switzerland celebrated its centenary this year with a grand opening on February 14, 2020. The exhibition featured more than twenty thousand works by seventy-eight artists on thirteen floors, with the immersive installation of the work of Dutch-born Kiki Smith alongside the works of Louise Bourgeois, James Dyer, Carsten Jacob, David H. Christodoulou, Jean-Marie Elling, and Anne-Marie Florentijn.“The Kunsthalle Basel is an exceptional museum of modern art in Switzerland,” said Stefan Reinhold, chair of the board of trustees. “The museum is enriched by an active and dedicated collection of contemporary art, which gives the Basel an international reputation. Kiki Smith’s installation is a great milestone in this tradition: her first public work since 1999.”Last year’s show—a retrospective of work by eight female artists—was held at the Kunsthalle in Amsterdam and attracted more than 1,600 visitors. The exhibition “Inventors” was curated by Sinéad Collins, curator of contemporary art at the Metropolitan Museum of Art in New York; Sophie", "The next Biennial should be held at the Edinburgh Festival, the University College London, and the London Film Festival. The collection will be curated by Sara Afshar and will feature work by sixty artists. The first edition of the exhibition was held in 2017 and featured work by forty-four artists. According to Artnews, the festival will also introduce a new digital platform called the Biannual. The platform will allow people to submit and elect their favorite artists for a biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial biennial Biennial biennial biennial biennial Biennial biennial biennial biennial Biennial biennial biennial biennial", "The next Biennial should take place in the year 2020. Contemporary art will be presented in the form of a show, of a sort, consisting of a series of ten works, usually organized by artist and curator, with the theme of the year to be determined by the president of the biennial. The site will be selected by the president of the biennial in consultation with the artistic director of the exhibition. The Biennial will be inaugurated by the artist Nadine Béthaudë, who will be presented with a prize for excellence in the art field.\n\n\nThe National Galleries of Scotland has announced that it is planning to break away from the United Kingdom’s Department for Culture, Media and Sport and form its own entity, known as the National Galleries of Scotland (NGA). The move follows a UK government–led push to reduce the size of the UK’s national museum system and boost the public’s access to art. Although the new entity will be formally launched with the naming of a new director and chief executive in January, the centerpiece of the initiative will be the launch of a free online edition of the National Galleries of Scotland, which will be the first in the UK to launch with the", "The next Biennial should be announced in the near future. The exhibition will take place at the Cultural Centre in Seongnam, Seoul, in November 2019. \n\n\nThe Metropolitan Museum of Art in New York announced today that it has received a $3 million donation from the Haus der Kunst (HDK) in Germany. The donation was made during the institution’s centenary year, which will conclude with the exhibition “The Odyssey of Van Gogh: An Exhibition of the Best Modern Art,” which opens on November 18. The exhibition will also feature contributions from twenty-two artists, including Tanya Bonakdar, Laurie Bronner, and Adriana Cadena, and will be on view through November 22.The donation comes on the heels of the 2019 exhibition “The Metamorphoses: From Art to Art,” which is curated by Kristen Anderson-Levin, and “The Metamorphosis: MOS,” a major retrospective of the work of twenty-five artists, including Jean-Michel Basquiat, Ong Hwan Lee, and Tadao Ando. For the first time, the exhibition will be presented in India as part", "The next Biennial should be held in 2021. The date has not yet been set.\n\n\n\n\n\n\nDetailers and painting artists from the twenty-first century are returning to California to participate in the 2019 Fall/Winter Show, a “cinematic, immersive, and exploratory” exhibition that features work by thirty-six artists. Using the Instagram hashtag #fallwinter, the artists are reprising their work from the aptly named show, which is currently on view through October 21, 2019.Limited to twenty-five artists, the show will be held at the California Institute of Technology (CalArts) in Pasadena and will feature work by a great array of artists, including Amara Abdal Figueroa, Yayoi Kusama, and Amanda Ross-Ho, among many others, including Tamara Kessler, Sohrab Mohebbi, and Tracey Thomas-Williams.Adrienne Edwards, the curator of the show, said: “This year’s Fall Winter Show is a true celebration of a new era for the medium of photography, and of the extraordinary breadth and depth of the contemporary art world. It is a project of a lifetime for the artist and future generations of art-lo", "The next Biennial should be held in 2020.”The institution said more information about its plans for the future will be made available in the coming months.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has received a gift of approximately ten thousand photos by celebrated American photographer Annie Dorsen. It is believed to be the largest donation of art by a single individual to the museum, and the work consists of photographs dating all the way back to the 1930s.The gift includes thirty-six pictures taken by Dorsen at several locations in New York City between 1940 and 1945, including her studio in Harlem and her home, her studio in the Catskills, and her farm in the Catskills. The museum will also display the artist’s photographs at a special exhibition, “From the Earth to the Moon: Annie Dorsen’s Photographs,” that will open on February 7. A retrospective of her works will open on March 5.According to the New York Times, the photographer was a staunch supporter of the museum as it expanded to its current home in the East Village in the early 1950s. She bought prints of works by artists such as Ed Moses, Henri Matisse, and Pierre-", "The next Biennial should be held in 2021, and the first in 2022.   In the coming months, we will continue to work with the Biennial and the City of Minneapolis to promote the exhibition as part of our revitalization efforts and to provide tools for artists to participate in the large-scale public art. We invite all to experience the work of MoMA’s collection.”\n\n\nThe Greater Cincinnati Art Museum and Library (Cincinnati Art Museum) has received a gift of one hundred works by women artists from the family of Louise and William Pitt, who were buried in a Cincinnati cemetery. The donation includes works by forty-five artists, including Virginia Su, Elin Østvin, Lillian Albright, Maureen Armstrong, and Susan Atkins.“With great gratitude and excitement, we are thrilled to present to you the work of forty-five extraordinary women artists, who are interred in the Greater Cincinnati Art Museum and Library,” said Mary Anne Jacobs, chair of the Cincinnati Art Museum. “In addition to the most recent works, we also have a valuable collection of the earliest works ever created. We are grateful to the Pitts for sharing with us a treasure trove of early art, and to the", "The next Biennial should be held within twelve months of the date of this letter. It is our intention to present the work of Mina Agar in a timely manner and to use the work of the year 2017 to draw attention to issues of serious concern to us. We hope that the committee will take the opportunity of the Biennial to explore new ideas and to review the work in light of the current moment. It is our hope that the biennial will represent the spirit and vitality of Argentina and encourage its fellow citizens to be proud of their heritage, culture, and traditions.\n\n\nThis slideshow requires JavaScript.\n\nThe Museum of Fine Arts (MoFA) in Boston has announced that it will reopen in phases beginning in Spring 2019, with the first exhibition, “Three Generations,” taking place in Fall 2019. The exhibition will be centered around the work of three generations of artists, including Kate Hoberman, Susana Mendieta, and Salah Al Khattala, and will also feature performances, residencies, and exhibitions. The exhibition will be followed by a series of lectures and symposia in the fall of 2019.The institution also reported that it now has a new partnership with the National Geographic Society. After", "The next Biennial should focus on “Esther and the paragons of Germanic art,” the organizers announced on Sunday. The exhibition will feature forty-five works by seventy artists, including Impressionists Friedrich Eimans (1926), Todmüller Kunz (1928), and Hildegarde Duane (1930), as well as works from the New Art Movement (NAM) and the American Moderns, and will run until March 12, 2020.The 2018 edition, “The Feline Empire,” featured thirty-one works by forty-six artists. The exhibition was also held in Vienna; Berlin; Paris; and New York; and was presented by the Berlin-based organization Convoy in partnership with the German-based publisher Weise Verlag GmbH. The 2019 edition, “The Feline Landscape,” was first presented at a Berlin gallery in 2015.\n\n\nA new exhibition organized and curated by the Prussian Ministry of Culture in Cologne will open on August 7. Titled “Iskander,” the exhibition will focus on the contemporary art of Lithuania and Finland, which has been affected by the coronavirus and which have reportedly seen a surge", "The next Biennial should consider the spatial and temporal distribution of the work, the role of the work in the cultural context, the relationship between the artist and the work, as well as its relevance for the biennial. It should consider the possibility of creating a new exhibition in the campus of the university. It should also consider the possibility of creating a new exhibition within the campus that will offer the work and the materials of the biennial.”\n\n\nThe Ontario Museum of Fine Arts (OMA) in Toronto has received a $50,000 donation from the estate of the late public collector and philanthropist Robert M for his service to the arts. The gift is the latest in a series of gifts that have established a legacy of increasing the museum’s stature through the acquisition of works by artists and collectors in the OMA collection. M was a major force in the museum’s history through the acquisition of works by Doug and DeShane Paine, Richard Avedon, and Mary Cassatt, among others, and was instrumental in the acquisition of works by Bob Dylan, Pierre Cardin, and Voltaire.“The Paine-OMA partnership began in the early 1990s with the Paine-OMA Foundation, which became", "The next Biennial should be held within the next two years. For the past decade, the artist-run museum has been working with local and international partners on projects that address issues of health and wellness. The first, titled Avenir,” was held in 2016. The exhibition, which featured work by thirty-three artists, featured work by seventeen artists. This year’s Avenir will be held at the Museum of Modern Art, New York; the Bodega Ruba, Argentina; the Bodega Museum in Madrid; the Caves Museum, the Museum of Human History, the Museum of Literature, and Play, the Museum of Modern Art, and the Museum of Modern Art, New York; the Caves Museum, the Museum of Literature, Play, and Art, the National Museum of Art, Washington, DC; and the Caves Museum, the Museum of Modern Art, the Museum of Contemporary Art, Miami Beach.\n\n\nThe National Gallery of Scotland has revealed that it plans to cut twenty-five hundred jobs across its three locations in Edinburgh, Fife, and Aberdeenshire in order to reduce costs and improve efficiency in order to reduce its carbon footprint. The cuts, which are part of an", "The next Biennial should take place in 2020, according to a statement released by the biennial. The next iteration of the exhibition, titled “Fifteen,” will be relocated to the Gallery of Modern Art in London and will be hosted by the Shaw Center for the Arts in collaboration with the Broad, the Broad Art Gallery, and the Lambda Literary Festival in collaboration with artist and curator Wangechi Mutu.The development follows the announcement of a new senior position for visual arts at the new museum, which will be inaugurated in 2021. The position is currently held by Michael Stipe.\n\n\nAdvertisement\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has welcomed Melissa Martin to its curatorial team. She will be responsible for the development and execution of artistic projects and educational initiatives, including developing and providing funding for programming, and will take up the post in April.“Her impressive experience and expertise in building and executing curatorial projects, as well as her extensive curatorial knowledge and writing on contemporary art and contemporary curatorial practice, make her an ideal fit for the role of MoCA’s curatorial department,” said curator and deputy director Pedro Reyes.Martin first worked as a curator at the Venice Bienn", "The next Biennial should take place in May 2019. Artists, scientists, and researchers have also been invited to participate in a fresh air museum’s exhibition during the biennial. The first show of the new initiative, “Microscope,” will open at the Witte de Kooning Museum in Amsterdam on October 29. The biennial’s titles reflect its themes of evolution, biology, and history: “Evolution in Space: From the Microscope to the Cosmos,” which explores the connection between nature and the organic world, and “From the Microscope,” which aims to use the museum’s collection of thousands of modern and ancient Egyptian artworks to examine the relationship between the artist and the natural world. The biennial’s inaugural edition, presented by the Kunsthalle Basel in December 2017, featured work by thirty-four artists, including Allanne Hoerst, Esmond Hershman, and Ruth Macgregor. The inaugural exhibition at the Witte de Kooning Museum was held in January 2019. \n\n\nThe Uffizi Museum in Venice has appointed John McAllister as its director. He succeeds Marco Miro", "The next Biennial should take place in the summer of 2020. The 2020 edition will be organized by the Design Museum and will feature the work of seventy artists, including Nidhi Dey, Shaina Ghosh, and Jyoti Kranthal, in collaboration with the Rema Hort Mann Foundation in New York City, the Biennial Foundation, and the Foundation for Contemporary Art in London. The slumber party will be held at the Museum of Modern Art (MoMA) in New York from August 27 to September 9, 2020 and will be inaugurated by a special exhibition of work by the affected artists, entitled Titi and Tsubasa, featuring works by fifty-six artists.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a $475 million gift from philanthropists John and Melinda Gates. The gift comes in the form of a pledge to eliminate the museum’s corporate income tax. The gift also includes a pledge to invest $250 million into the museum’s endowment and to create up to 5,000 new jobs.During a ceremony at the museum on Wednesday, the duo announced that they plan to dedicate $175 million of their wealth to fighting corporate tax havens and to push", "The next Biennial should take place in 2021, with a new exhibition, titled “In Praise of Life,” alongside the current exhibition, “Where Are We Going?,” at the ExCEL Center for Contemporary Art, Paris, which will open in April. The exhibition, which will include works by twenty-two artists, will run for eighteen weeks.The seventy-third Biennial of India, which was held in New Delhi in November 2017, was also postponed, and the seventy-fourth was considered unworkable due to the Covid-19 pandemic. The seventy-seventh was canceled and the seventy-eighth and final exhibition “Live from the Feed,” which was to have taken place at the Louvre in Paris last month, was rescheduled.\n\n\nThe Museum of Fine Arts (MA) in Atlanta has appointed Jonathan Pape as its next director. Pape currently serves as director of the Fund for Contemporary Art at the Museum of Modern Art in New York and is the founding director of the newly launched Fund for Contemporary Art at the Cove, a new organization that aims to provide support for artists working in the contemporary art world. He succeeds Steven Buys, who retired last month", "The next Biennial should focus on queer theory and the persistent threads that weave its story. The theme should be “Where art, politics, and history meet.” The foyer should include a series of sculptures by the French conceptualist Janus-Antoine Baudrillard. The exhibition will be led by a curator who previously curated the first Biennial in 2012 “Art in a Different Time.”\n\n\nThe Bessies, a New York–based nonprofit that supports artists working in the arts, has announced that Ashley Madigan has won its Lifetime Achievement Award. The annual $100,000 prize, which is given annually to an artist whose work has contributed to the cultural, literary, and/or visual arts in the last four years, was established by the Bessies in partnership with the New York Philharmonic in recognition of their lifetime achievement awards. Madigan was selected for her performance in the musical theater revival, The Bessies, which premiered at the Broadway theater on January 17, 2019 and ran through March 21, 2020. The stage work, titled In the Garden, was performed by two duos, Ashley Forti and Ashley Forti-Winters. The award ceremony will take place at the Roosevelt", "The next Biennial should include an investigation of the history of the art of the Neue Biennale, and a proposal to develop a new exhibition for this year’s event.Participating artists include Pierre-Michel Basquiat, Terna Vazquez, and Peter Schäfer; the sculpture duo Vittorio and Ermanno Salmi; Sara Shelley, the influential painter; and Yokohiro Ozawa, the legendary Japanese artist who largely created works at the Kiyomizu laboratory of chemical engineering.\n\n\nThe Charles de Gaulle Foundation (CFG), a nonprofit organization based in New York City, has awarded $4.5 million in grants to twenty-nine art institutions across the United States. The funds support digital artists and designers in forty-eight states for their work in the new Strengthening the Digital Marketplace for Art, a collaborative initiative between the foundation and the artists under the umbrella of the Creative Artists Fund.The CFG, which was founded in 1990 by philanthropist Juliet de Ghebaly and multimedia artist Jorge Bautista, was awarded $1.3 million by the The Charles de Gaulle Foundation for the arts in response", "The next Biennial should take place in the fall of 2020. The biennial will be hosted by the Massachusetts Institute of Technology (MIT) in Cambridge. The creators of the new exhibition are Alexander Daller, Tanya and Iakov Zadornov, and Antonin Artak, and will illustrate the ongoing voyages of art and culture through the history of the city of Saint Petersburg. The show will feature forty-five works by thirty-six artists, including aliens, hybrid artists, and painters from the Caucasus and Central Asia.The fourth edition of the Russian pavilion at the Venice Architecture Biennale will take place in February 2022.\n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to generate more than $300 million in additional revenue by attracting more visitors through increased digital programs and offering free admission during the exhibition’s third and fourth seasons. The strategy, proposed in a five-year plan published by director Mary E. Talbot and the museum’s board of trustees on Monday, will see the museum expand its online presence through the opening of a new, 250,000-square-foot, digital-only section of the museum called The Timeline. The exhibition, which explores the evolution", "The next Biennial should be held in late December or early January.The third, in March 2020, will take place at the Arthur Ross Udvar-Hazy, in Owings Mills, Maryland. The fourth, at the Metropolitan Museum of Art, will open in early May.\n\n\nThe Museum of Modern Art (MoMA) announced today that it plans to raise $3.5 million for the museum in December, and has met its goal of $3.5 million in just over three months. The museum expects to open in the spring of 2021.“The museum has successfully adapted to a challenging financial environment since opening in December,” said museum director Neal Benezra, who also noted that the museum’s performance since opening has been far better than expected. “MoMA’s first year was a success, and we’re excited to see what the museum will do next.”Since its reopening in November 2019, the museum has welcomed more than 1.2 million visitors and has exhibited more than 1,400 works. In addition, it has acquired more than 1,300 works since its founding by entrepreneur and philanthropist Sal Albano and his siblings, Rudolf and Jerome Albano.\n\n\n", "The next Biennial should be the year of the grand tour and the future of British art, and will focus on themes including the dystopian future and the anxieties of its inhabitants, with a view to considering the future through the eyes of the artist.”The biennial’s selection committee said: “The exhibition will explore the origins and future development of modern art through the work of the artist and his contemporaries, as well as the way in which art has shaped and reshaped our world. It will also consider the role of art in the historical record, and the role of art in social change, and the role of art in artmaking and the social experience.” The biennial, titled “Avant-Garde and Modernism” and curated by artist and curator Alasdair Campbell, will open at the National Museum of Art in London on March 27 and run for twenty-four weeks.\n\n\nThe New York State Assembly has passed a landmark $4.7 billion budget bill for the arts, the creation of which will give the state nearly $2 billion to support the promotion of American art through 2021. The legislation, which was passed on Wednesday and now goes to the Senate, would allocate $1.1 billion for", "The next Biennial should take place at the V&A in London in 2022, and the biennial’s title should be “The Future Is Present.”\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that in the run-up to the reopening of the iconic Whitney Museum of American Art in December 2021, it will create one of the largest-scale open-air art experiences, designed by the artist and curated by MoMA, by creating a series of temporary platforms that will float in midair above the iconic structure.The institution will erect these floating platforms in multiple locations across the city, including on the south side of the museum, at 23rd Street and Fifth Avenue, and at Midtown Manhattan’s Grand Central Station. The platforms will be made of fifty-five thousand polyethylene tubes and will be tethered to the building’s interior by forty-one steel cables that will carry visitors through the museum.“We see MoMA as a catalyst for social change and a beacon for cultural inspiration,” said David Mullen, director of the Whitney Museum of American Art. “This is a classic case of a city built on the blood, sweat, and tears", "The next Biennial should take place in 2020 at the Pérez Art Museum in Mexico City.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that Pia Camil will become the next director of its Art of the Party, a biennial that focuses on the history of American popular art and aims to reflect the spirit of New York. In the role of curator, Camil will guide the exhibition at MoMA from February 21 to March 4, 2021.“Camil’s curatorial practice has been deeply influenced by her love of contemporary art, her desire to better understand the artmaking of the 1980s, and her desire to confront and confront the mechanisms that shape issues of representation,” said Janet D. Brown, secretary of the museum’s board of trustees. “Her work has been influenced by the modernist movement from the late 1970s to the present, and the work of her peers. We are honored to be able to welcome her to the museum and to collaborate with her.”The museum will stage five exhibitions of work by Camil’s contemporary artists: “Kiki Smith’s ‘The Breathing Life of Life” (2019), ", "The next Biennial should be held sometime in the second half of 2020. \n\nSeveral artists, including Werner Hochstetten, Paul Gauguin, and Pierre-Auguste Renoir, have been selected for this year’s iteration of the Berlin Biennale. The exhibition is now open to the public, and will run from August 23 through August 28.The exhibition will feature work by fifty-four artists, including Ai Weiwei, Carlos Márquez, Ingvild Brätsch, Pierre-Auguste Renoir, and Jasper Johns. Among the Italian and French historic artists invited to participate are Andrea Giunta, Marcella Strada, Renata Moschino, and Lucio Fontana.Other artists nominated for the prize include Leomister Gallery, El Salvador, Judith Guttmann, Jasper Johns, and Mary Cassatt. The biennial will also highlight the work of Hans von Braunschweig, Olafur Eliassen, and Oliver H. Goad. The five finalists chosen for the prize are Paul Gauguin, Mieczysław Bzdziewior, Torbjørn Eskewese,", "The next Biennial should be held in 2021, said Michela Azoulay, the curator behind Artforum’s upcoming edition of the Congress, which will be held in March 2020. “It’s important to re-imagine the exhibition space, with a sense of humor about it,” she said. “It’s not about replicating the museum, but about looking to it as a point of departure.”\n\n\nA group of French artists, writers, and academics have submitted a landmark statement protesting the Paris Climate Action Summit, scheduled for December 15–December 19. The declaration calls for France to phase out coal-fired power plants by 2022 and pledges to mobilize up to 300,000 people to protest the World Climate Change an the Paris Agreements, which were finalized in 2015 and 2016.“Paris’s Climate Action Summit is a platform for the production and circulation of climate chaos, which is the goal of Paris’s climate protesters,” Amiti Ghebrelkar, a lawyer and art historian, wrote in a statement. “Climate chaos is the climate crisis and the climate action summit is the network of protests against the Paris Agreements. Paris’s", "The next Biennial should be announced soon.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it expects to raise $500,000 for the construction and operation of a new art museum in the city. The project, dubbed the City Museum, is slated to open on the city’s Sunset Strip in 2023.The new museum, tasked with preserving the cultural legacy of Los Angeles, is being built by Santa Monica–based architects Slawomir Oskar and David Bienstock with the support of the California Arts and Cultural Fund. The civic institution aims to be an extension of the city’s cultural district, which is bounded by Wilshire, Santa Monica, and the Santa Monica Mountains. The City Museum will be located in an industrial area of downtown Los Angeles and will be flanked by museums and other cultural institutions.“The City Museum embodies two things which are going to define Los Angeles,” architect and city planner Daniel H. Weiss said. “It’s going to be a museum that makes a real contribution to the city, and it’s going to be a museum that appeals to people’s imaginations. The city and the city of Los Angeles is a me", "The next Biennial should, based on the suggestions of Alexander Panetta, be held in Tokyo in 2022.  “We are proud to introduce the first exhibition dedicated to the contemporary art of the Pacific Rim,” said Gina Raimond, director of the Biennial and the Smithsonian’s National Museum of Asian Art. The exhibit will mark the first time that Arts of the Pacific Rim will be presented in the United States. The exhibition will feature work by twenty-five artists and will be inaugurated by a new work by artist Ryuichiro Ota. It will be followed by a new work by the Mabini Art Museum, Peru; a retrospective at the MCA in London; and a public lecture series.\n\n\nThe Museum of Fine Arts (MFA) in New York announced today that it has received a gift of twenty-two works by thirty-seven artists, including David H. Koch, Paul Gauguin, Mark A. Smith, and Robert Irwin, as well as rare works from the renowned artist Lawrence Abu Hamdan. The works are part of an exhibition that will run concurrently with the third edition of the Museum of Modern Art’s “Art of the Impossible”", "The next Biennial should kick off in May 2020 and run for a twelve-month period. \n\nLenore Tawney, the director of the Los Angeles County Museum of Art (LACMA), has announced that she is quitting her position at the institution in January 2020. The museum, which assembles and displays thousands of pieces daily, has been operating without a director since Alice Steward stepped down in June. Because of the delay, the institution has been closed since March 19. “I’ve been involved in LACMA for twenty years and have seen first-hand the impact that a strong, diverse, and digitally connected museum can have on society and the environment,” Tawney said in a statement. “The institution’s transformation into a world-class research and exhibition site for contemporary art and the collections of LA’s major museums is the backbone of the city’s economy and I’m proud to have helped to transform it into an even more vibrant and innovative destination for everyone.”The museum has faced several challenges since it opened in 2009, including its first major renovation in twenty years and the construction of a new building that expanded the museum’s footprint and added more", "The next Biennial should also take place in the cities of Nuremberg, Frankfurt, and Stuttgart. “In a time when the political and cultural powers in the United States are increasingly emboldened to use cultural artifacts as weapons, we believe that the Museum of Modern Art has a responsibility to promote a more informed and balanced public debate on the museum’s exhibitions,” said Monika Gartenberg, chair of the board of trustees of the organization MUSE.\n\n\nThe Tate has announced that it is working with the Centre Pompidou in Paris to create a new platform to promote French contemporary art. Titled Les Trois Filles, or Three Fronts, and will run from March 12 to March 19, 2020, the exhibition will feature works by artists such as Jean-François Boublil, Hilaire de Bodard, and Jean-Paul Sartre. The narrative of the exhibition will advance the work of French creators in the last decades of the twentieth century, and will explore the relationship between art and politics.“The programme will also encourage the audience to reflect on the creativity and intellectual rigour of the works that were chosen, and will draw from the", "The next Biennial should be targeted at creating a new workspace for the exhibition and the collection of exhibition art in the new building, which will be inaugurated by a new work by Yoko Ono.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of more than 3,400 works by thirty-six of the seventy-five major contemporary artists in the United States. The works, which were donated by artists who are currently or will soon be located within the city limits of Los Angeles, include works by Jane Panetta, Deborah Cox, Osvaldo Dallara, Theodore DeSousa, and Sinthujan Varatharajah, as well as works by Andrea Horwitz, Susanne Vielmetter, and John Turner.The works are part of the MoCA Collection of Their Art, which includes works by the following artists:Beatriz Anaya, California’s artist-in-residence and longtime MacArthur FellowFrancisco Allegre, a Los Angeles native and MacArthur Fellow, who has worked in Los Angeles for twenty yearsOswaldo Dallara, a Los Angeles native and MacArthur FellowFrancisco Allegre Jr., a Los Angeles native and MacArthur FellowKathleen", "The next Biennial should focus on the history of the museum, its collection, exhibitions, and programs, and on the ambitious and ambitious campaigns that the museum is undertaking to connect with and engage with the city of Berlin. “In addition to the exhibition and collection, we are working to develop the Biennale as a platform for social change and to shape public awareness of environmental problems,” said Christina Hesse, artistic director of the museum. “We have created a new work in the lab for our show ‘Air,Water, and Energy: Art and Environmental Politics’” and will present the exhibition in the fall of 2020. For the 2020 edition of the exhibition, the museum will utilize forty-five works by artists from twenty-five countries in the United States and Europe—including Federico Solmi, Jeremy Deller, Tiësto Valli, Michael Kors, and Lluís Vázquez—plus eleven works that were lost in a fire in New York City in December 2020. The original exhibition was staged at the Museum of Modern Art in the United States in 2016. In 2017, it was moved to the Rockefeller Center, where it has remained ever since. The 2020 edition of the", "The next Biennial should have been held in the spring of 2020, but due to the ongoing humanitarian crisis in Syria and the need to secure funds for a permanent closure until spring 2022, the event was moved to the spring of 2022. The March 25 announcement states: The International Biennial 'Mara' is currently closed, and the work of the international team will continue as planned. The biennial will be joined by a second edition in 2020, to be staged in 2021.\n\n\nWorkers in France have begun the dismantling of the country’s nuclear power plant, which is supposed to be the country’s largest, on the outskirts of Paris. The work, which is being carried out by eighty workers, is part of a massive construction project that aims to make the Grand-Duc Jean nuclear reactor, built in 1957, operational by 2022.The work was completed in four months, and was organized by the Paris-based company Safariland, which was hired by France’s Department of Energy and Climate Change (DECC) to help with the construction of the plant. The project was designed by the environmental consultancy firm Pritzker Architecture. The demolition of the plant is the next phase of the company’s strategy", "The next Biennial should be in 2020, with the opening of the exhibition “Lorna Simpson: Biennial” next year.Artist-in-Residence Lonnie Rains will lead the biennial, which is sponsored by the Art Institute of Chicago and the Chicago Board of Education, at the University of Maryland, College Park, with the rest of the participating artists chosen by the participating arts and cultural organizations. The panel of judges will consist of Roy Koper, director and CEO of the Art Institute of Chicago; Joshua Helmer, director and CEO of the Chicago Board of Education; and artist Alice Muñoz.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has appointed Andrew F. Lee as its next director. Lee comes to the institution from the American Alliance of Museums, which he founded in 2007. He succeeds Leslie Alexander, who retired in November after a decade at the helm of the museum.“We are deeply grateful to Andrew for his leadership and dedicated service to MoA,” said museum director James Gandolfini. “Over the course of his seventeen-year tenure, he has developed and demonstrated a deep and wide-ranging understanding of the mission of the museum, both as a civic treasure", "The next Biennial should be held in the second half of the year, and the theme of the exhibition should be “Art as Sacred as Life.” The exhibition will be held at the National Museum of Art (MoA) in Washington, DC. The institution is currently closed until May 31, the last day for visitors to the influential exhibition space. After the exhibition, which will be hosted by MoA, the museum will reopen with a series of public performances and other cultural events.The proposal for the 2020 edition of the Biennial was made by arts professionals and curators David Albright and Barbara Ehrenreich, both of whom served as the core curators for the show. The exhibition will focus on the work of women artists in the United States. “Art is at the heart of our lives,” said Ehrenreich. “The work of these outstanding artists is central to our ongoing commitment to the history of art in America; so I’m honored that they are participating in this year’s edition of the Biennial. Their contributions to our understanding and celebration of the art of these United States make them one of the most important early advocates of contemporary art in the country.”\n\n", "The next Biennial should be held in 2021. This will mark the first time that the fourteenth edition, which will be held at the Düsseldorf Center for Contemporary Art and at the Palais de Tokyo, will be held outside Japan.\n\n\nTwo bodies representing the city of New York are reunifying, with one organization—the New York City Council on Arts and Culture (CACAC)—and another, the City of New York, claiming they are working together to craft a comprehensive local government budget.According to Artnet, the two bodies are collaborating on a new set of plans, which were drafted and released on Thursday, and which will outline the city’s financial future in the coming years. According to the New York Times, the revised budget is $532 billion—or roughly $10 per person, including $155 per family, with $103 billion for the general operating budget.The council’s proposal—which is based on a blueprint drawn up by the city’s Department of Cultural Affairs and is being overseen by the budget authority—is somewhat different from what Mayor Bill de Blasio and the city’s public advocate, Daniel H. Pink, had proposed earlier this year. According to the", "The next Biennial should be held in the spring of 2021. The museum will formally request the 2019 edition be canceled next month. If the festival is canceled, the opening of the exhibition will be pushed back.The museum will also continue to receive donations from visitors and will count on the supplementary income from ticket sales for future programming. The organizers say that the decision to cancel the exhibition was made after they received a letter from the British artist Sir David Attenborough, who has championed the exhibition throughout his career, calling the exhibition a 'truly great work of art'. Sir David informed the museum that it will be removed from the list of the major collectors of the exhibition and will be included in a forthcoming exhibition at the museum. The exhibition will be restored on a future edition of the museum, which is currently on tour. The British artist and filmmaker has previously spoken out about the exhibition’s exhibition in London in 2019 and its influence on his own career. In 2018, he gave an award to the exhibition at the Royal Academy of Arts in London for his documentary Behind The Sun, which was part of an exhibition organized by the British designer Rita Hassabi. The show, which was also organized by Moschino, featured work by", "The next Biennial should take place in the Fall of 2021.\n\n\nThe Asian art space Fondazione Galerie Bologna, Italy, announced today that it is planning to close its doors at the end of the first phase of its new four-year, $10 million renovation, which will expedite the opening of the second phase of the second-longest-running Art Basel show in the city. The venue, located in the heart of the city, opened on October 21, 2020 and attracted 20.5 million visitors last year. Its latest iteration was commissioned by Fondazione Galerie founder Alessandro Fittipaldi and the Italian artist Giacomo Bellini, who jointly developed the exhibition with a team of twenty-four artists.“The show has always presented a real variety of artists in a very singular way, including alongside each other and with their own stories,” said Fondazione Galerie director Luca Bottinelli. “The production is more focused than ever on creating a unique experience around a single work, and on the perspective of the artist in this case. The show also features a new narrative, which is more provocative and moving than ever.”The artists featured in the show for", "The next Biennial should be held in 2021. \n\n\nA new division of the Museums Association (MA) in London has announced the launch of two new initiatives that will provide funding and support for young curators working in the UK. “We are delighted to launch these initiatives, which will help young curators achieve ambitious and ambitious projects,” Sarah Mrsall, the director of MA, told the Art Newspaper. “The first initiative will supply funding for professional development and for the publication of a new curatorial book by a curatorial team from the London-based studio of Sally and Tanya Rodriguez, with a view to creating a new exhibition. The second initiative will provide artistic support and resources to curators in their process of moving to the United States from the UK.”The inaugural exhibition, “New Worlds,” is an interdisciplinary project organized by the Madras Arts University (MAS) and is centered around the memory of a South Asian American woman who had become the first black female president of India. The exhibition will present curatorial studies on interviews conducted by Patricia Alberia, a former advisor to the Indian prime minister, at the height of her popularity in 1992, and will include works by a range of", "The next Biennial should take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles: Suspended on June 6 after it failed to remove a carpenter’s work, the institution is now back on its feet. On Tuesday, June 7, the MCA reopened to the public, after mopping up the dust from its May 25 renovation, and has already announced plans to extend the tour this year.The Los Angeles County Museum of Art (LACMA), the Los Angeles County Museum of Art (LACMA), the Los Angeles County Museum of Art (LACMA), and the Los Angeles County Museum of Art (LACMA)-West: All three institutions will be hosting a series of exhibitions and tours this month, including the opening of “Picking Up the Pieces,” which will explore the notion of assemblage and the legacy of the California native, Ad Reinhardt, in Los Angeles.LACMA director Jen Snyder said: “We are thrilled to bring you this year’s exhibition, ‘Making Places,’ which highlights the lessons learned and the projects that are already underway to create meaningful and resilient communities. Bringing LACMA-East, L", "The next Biennial should focus on the history of the exhibition, the exhibition, and the collection, as well as the relationship between the exhibitions. The 2020 edition of the exhibition will open in the new exhibition hall at the museum on March 13. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has received a gift of fifty-six works from the Los Angeles County Museum of Art (LACMA). The donation includes twenty-five works by the artist-in-residence, an exhibition that debuted at LACMA in the fall of 2019.The works, which were donated by Jennifer Pierce, are from the LACMA exhibition “From the Ground Up: Stories from the Museum of Contemporary Art” (2019), “Interstate: A Retrospective” (2019), and “Murder on the Streets” (2019). The exhibition is curated by David Adjay and comprises twelve works by the artists, including the work “Claudia Giuliano” (2019), “Augustine Puast: Appearing,” (2019), and “Jude and the Virgin.” The artist-in-residence donation was made during a grant cycle that began in 2018.The", "The next Biennial should begin in March 2020 and conclude in June 2021. The exhibition will feature a total of twenty-two artists. A full list of the artists participating can be found here.The National Gallery of Art in Washington, DC, also announced its representation of the third batch of the biennial’s artists, held in early 2016. The show will return to the DC area in March 2021. The biennial, which has been hosted by the Smithsonian American Art Museum (SAAM) in Philadelphia since 1995, will be comprised of one exhibition, “The Self Portrait,” and one live performance. The exhibition will feature works by sixty-nine artists, including Bruno Latour, Leigh-Anne McKee, and Shilpa* with the help of the National Council on the Arts, and will be on view through March 25.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that Sarita K. Gupta has been appointed as its new executive director. Gupta will oversee operations and curatorial initiatives at the museum, which was established in 1966 by architect James H. McAdoo, and will begin her tenure in April.“We’re thrilled to welcome Sarita to the MoCA family", "The next Biennial should be held in 2020. In the meantime, the ICA and the ICA Alliance will continue to work together to support and encourage the work of the Chicago-based artists represented at the Wisconsin pavilion, as they continue their work in their final year of the program. \n\n\nThe Solomon R. Guggenheim Museum in New York announced today that the institution will honor the late American painter Thomas Heatherton with a new work of his art. The commission, called Atlas, will open to the public at the institution in October 2020. The exhibition will include ten works by the artist and will present a selection of images by Thomas Heatherton from the American series Agrarian Postures, 1929–1936. “Thomas Heatherton is a profoundly influential artist whose work has been greatly missed by many museums in the United States,” said Museum Director Michael J. Ryan. “The exhibition will showcase his distinctive ability to mix humor and grace, the surreal and the mundane, and the extraordinary and the mundane.”In the show, Thomas Heatherton will represent the American landscape with a series of painted landscapes and the artist will be shown experimenting with different materials and with the", "The next Biennial should be held in 2022.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released the list of twenty-six artists who will return to the city next year to participate in the annual Lincoln Center biennial, which will take place at the Getty Center in the summer of 2022.Along with the artists on the list are Emma Donoghue, Sasha Kalashnikova, Alex Katz, and Fernando Barbero. The biennial’s organizer, the Brooklyn-based collective Ghostly World Triennial, was also excluded from the list due to the failure of the artist to submit a work by the deadline.“The city is committed to supporting the creative, civic, and economic vitality of our neighborhoods, and we are excited to help ensure that this year’s biennial reflects that vision,” said cultural affairs commissioner Tom Finkelpearl. “As we announced in June, the city continues to work with artists and organizations to present robust, compelling, and original works of art, and we’re proud to count twenty-six artists who have contributed to the City of Lincoln Center’s 2021 edition as part of the 2019 iteration", "The next Biennial should begin in 2021 and will feature twenty-six artists from the campus.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the relocation of works by three of the city’s major museums. The guidelines, which are in addition to the city’s request for $5.4 billion for its capital campaign to keep the Museum of Modern Art (MoMA), the Bronx Museum of the Arts, and the Metropolitan Museum of Art, as well as the Whitney Museum of American Art, were issued on Friday, November 9.The guidelines state that the works be relocated within seventy-two days of the date of the submission of the city’s request for funds. A ten-day expedited review period is also allowed if the works are submitted within ninety days of the date of the request. If the MoMA, the Bronx Museum of Arts, and the Whitney are unable to relocate by the specified dates, the city can file a provisional application for a change of venue for the DCLA. If the works are moved before the deadline, they must be removed by the conclusion of the DCLA.If the works are removals that are permitted by local, state, and federal law", "The next Biennial should be in May 2020. “We are optimistic that Biennial 2020 will mark a turning point in the director’s career and in the museum’s history,” said Jacob. “Her dedication, enthusiasm, and tenacity in finding ways to bring science and art to life has made her an inspiration to many.”\n\n\nThe Morgan Library and Museum in New York has appointed Margaret A. Sokolow as its new director and CEO. Sokolow comes to the institution from the Metropolitan Museum of Art (MoMA), where she has served as deputy director for collections since 2014. During her tenure at MoMA, she helped the museum recover from the devastating explosion at the Tomah, New York, nuclear power plant, and helped shape the museum’s collection through the construction of its new institution, the David H. Koch Gallery for Contemporary Art, in the former Ford assembly plant.“Margaret is a seasoned leader and she will be crucial in guiding the museum through this unprecedented global crisis,” said David Karp, chair of the museum’s board of trustees. “The museum is preparing for a serious reopening of our institution in 2021. It is ambitious and necessary", "The next Biennial should be in 2020, and the date is still up in the air.\n\n\nAndrea Giugliano, the Venice architecture critic from the Italian organo privatea, has received a letter from Nadia Taheri, the executive director of the International Alliance of Architecture Museums, citing an anonymous source who informed her that the Italian pavilion for the 2021 edition of the Basel Architecture Biennial was awarded to an unknown architect. Taheri claims that the prize was secured through a deal between the two institutions, who have recently been embroiled in an antitrust investigation in Italy over a proposed merger.Giugliano’s letter, published in the Italian daily newspaper the Corriere della Sera on Saturday, reads: “In order to preserve the impartiality of the competition, Andrea Giugliano presented the candidate for the prize with a letter of four weeks ago. The prize committee has since received the letter of the candidate. However, since the source of this information is unknown, their investigation is still ongoing.A very interesting and at the same time a very important development is that the competition that was announced was actually an engagement. It is possible that the talent of the two applicants and the competition", "The next Biennial should begin as soon as possible and should deliver a new collection of works by artists, including Pedro Almodóvar, São Paulo, and São Paulo. It would also present a selection of work by artists from South America, including Juan Carlos Casto, Victoriana de Alvear, and Yinka Shonibare.The biennial will be divided into three parts: a participatory section, which will include local communities and be organized by the artist; a public section, which will be curated by the museum staff and curated by the public; and a final exhibition, which will be open to the public during the month of July.The museum is seeking partners for the exhibition, which will be organized as a biennial and will take place across fourteen buildings in the KRT, from the city of Portland, Oregon. The KRT is a mixed-use mixed-use project that includes a 21,000-square-foot art museum, an urban farm, offices, and residences for the museum, and an Aquarius-designed micro-greenhouse to produce local organic food. The project, which is part of the city’s revitalization plan, will create more than 200 local jobs and will also include the construction of", "The next Biennial should take place in 2021, and the next will occur in 2023. “Art is a universal language, a universal culture,” said Rivera. “A lot of these works are not practiced by anyone, but are shared by thousands. The future of art is in our hands.”Academia’s new administration has promised to reevaluate the program’s boundaries and to consider new approaches to residency and fellowship. In the meantime, the exhibition will continue to be held—and will continue to attract—even as new laws are enacted to make it harder for galleries to rent space in cities and other public spaces.\n\n\nThe Museum of Fine Arts (MFA) in Boston has approved a new $75 million renovation and expansion that will add more than 1,500 square feet of gallery space, create a new public area, and enhance accessibility. The extension is part of a $140 million set of renovations and expansions that will make the museum more appealing and interactive to Boston’s art-conscious and creative communities.The $75 million expansion is part of a $100 million strategy to reinvigorate the MFA’s collection and display, expand its educational programming, expand its public realm,", "The next Biennial should take place in the Hefei Prefecture of Japan, the capital of the Honshu Province, in the fall of 2019. Team members will be chosen by a panel that comprises Hsu, Ai, Hsu-Wei Huang, and Ji-Wei Chen, and will be supported by a grant from the National Science Foundation. \n\n\nImperial College London (ICL) has received a £32m donation from philanthropists Yoko Ono and Pilar Troiani in support of its new ten-year-old instituions, Imperial College London and the School of Oriental and African Art (SOA), in London’s Hyde Park. The funds will help support the institution’s expansion into the London Borough of Westminster and increase its curatorial staff.“The expansion into the new schools will enable us to offer a more comprehensive point of view for art, culture, design, and design-based pedagogies; to further extend our emphasis on the visual arts and culture, as well as to build on the growing international reach of our institutions,” said Polly Wall, chair of the British Academy’s board of trustees and an alumni of both schools. The grants also mean that the", "The next Biennial should be set up in 2020.  So, how do we care for one another in these turbulent times? We must nurture our spirits and understand that the only way forward is through a transformation of our societies and cultures. We must work for a more just and equal society where everyone is respected and where people in every part of the world can have a real sense of belonging and belonging alone will not do.\n\n\nThe Israel Museum in Jerusalem announced today that it has received a donation of seventeen works, which were on display during the institution’s annual exhibition “Theater of Operations: The Gulf Wars 1991–2011” at the Suez Museum in Egypt, from a Cyprus-based donor. The museum received the works from Shaare Zedek, a businessman who runs a company called TTI, from Cyprus’s autonomous region of Cypriot Cypriots for Peace, a group that offers financial support to “civil society” organizations in Europe, the Middle East, and Africa.TTI CEO Yair Hochner told the Art Newspaper the group was “very pleased by the decision.” He added that the organization expects the works to be returned to the Cypriot Cypriots for", "The next Biennial should take place in 2021, with the remainder of the work’s archives archived until at least 2024. \n\n\nLodi: Rebel Art, a new multi-venue arts space in Long Island City, New York, has announced its representation of the work of the late Italian painter Andrea Bertie. Known for his surrealist paintings augmented with colors and geometric shapes, Bertie was a major influence on the work of many future Italian artists, including Silvio Berti and Vittorio Bertolotti.Born in Rome in 1930, Bertie studied at the Academia di Modena and at the Institut für Kunstwissenschaften (IGK), in Vienna, and later at the Academy of Fine Arts, Vienna. His work has been exhibited at the Venice Biennale, the Venice Museum, the Museo dell’s Villa Borghese, the Museo dell’s Villa della Scala, the Museo del Cervetto, the Museo del Venezio, the Museo del Teatro, the Museo del Montecchio, the Museo del Vittorio, the Museum of Modern Art, Milan, the Museum of Modern Art, New York", "The next Biennial should be held sometime in the second half of next year, and the first one will be held by the end of 2020. “Today, the London Biennial is one of the most highly regarded and respected exhibitions on display at the Art Gallery,” said Olivia Barlow, chair of the board of trustees. “It is a triumph for the city and the institution that this year’s iteration will be hosted by a group of people who truly understand the strengths and limitations of the city as a whole, and who are committed to creating an environment for young people to discover and work together.”\n\n\nThe Art Institute of Chicago (Art Institute of Chicago) has received a $500,000 donation from the William and Flora Hewlett Foundation in support of its groundbreaking Whitney Biennial exhibition series. The grant, which will be used to create new programming for the exhibition series, was made on November 6, 2018, and the first part of the series, “The Future Is Now: Art and the Contemporary,” was presented by Doris Duke of York, William and Flora Hewlett, and their daughter, Amelia.Each of the three exhibition programs will feature original and selected works from the collection and", "The next Biennial should aim to “re-imagine the role of art in the twenty-first century.” The exhibition will focus on the work of women artists and examine the ways these works continue to be relevant today and in the twenty-first century. The exhibition will be hosted by architect Frank Gehry in his former home, the Museum of Modern Art, in New York from March 19 to March 21, 2020. \n\n\nArtist Salaam Naseer, whose dramatic and expertly painted, window-smashing sculptures conjured images of the contemporary and the past, has died at age eighty-two at his home in the Bronx. The New York Times reports that Naseer, who was born in Tehran in 1941, is survived by his son, Ahmed Naseer; his daughter, Salma Naseer; and his granddaughter, Kamara Naseer.Born in 1940 in Tehran, Naseer studied at the Academy of Fine Arts and the Nader Institute in Tehran before fleeing the country to enroll in the Fashion Institute of Technology, where he studied with Ezra Dalloul. In the early 1950s, Naseer relocated to New York, where he joined the sometime-loose-but-ins", "The next Biennial should take place in 2021.\n\n\nThe Southeast Asian Institute (SEAI) in Singapore has announced that it will suspend its upcoming exhibition “24 Hours in the Life of a Chinese Prostitute,” which was set to open in March, by March 15, in protest of the exhibition’s critical views of the CCP. “The exhibition, titled 24 Hours in the Life of a Chinese Prostitute,” is an interpretation of the exhibition “In the Name of a Single Mother,” which was organized by the Shanghai-based organization the Shanghai Group for Contemporary Art (SGCCC), which is affiliated to the CCP, in 2017. In the exhibition, a number of the artists participating in the exhibition—including Cao Fei, Li Bai, and Jing Xianxing—identified themselves as being victims of forced labor in the country, where they were living and working in China.“When the exhibition opened it was surprising to see artists participating in such an open work,” said the artist's daughter, Ying Yu, who attended the exhibition as part of a group exhibition that was showcasing work by Chen Minhai, Li Yanan, and F", "The next Biennial should mark the centenary of the birth of the French revolutionary Georges Bernier. The festival will include a special retrospective of the artist’s work at the Museum de la Terre in Paris and a live performance by Bernier.The biennial will be held in the French city of Lyon from April 24 to May 2, 2020. The winner of the first edition, which took place in October 2012, is yet to be announced.\n\n\nThe first exhibition of work by the Finnish artist Ivan Serpa’s three-decade career at the Museum of Modern Art (MoMA) in New York will open on March 16. Titled “Zanja and the Art of Photography,” the exhibition includes work from the artist’s 1981–82 exhibition “Imagination,” a collection that includes photographs and videos, sculptures, prints, drawings, and collages, among other media, and will commemorate the twenty-fifth anniversary of the museum.“Ivan Serpa’s work is about the context in which images are produced, about the relationship between the artist and his audience, and about how a group of people, a group of artists, can present a single image,", "The next Biennial should be held in 2020 and will include the work of forty-three artists. “The exhibition will basically be a re-creation of the exhibition, but with a new kind of dialogue, with a new kind of event, with a new kind of collection, with a new kind of experience, and with a new kind of participation,” Vasundhara Rao, the chair of the exhibition and curator of contemporary art at the Biennial, told Artnet. The event will be hosted at the exhibition space, which was partially occupied by the artist and her husband, Sudip Bandy, until March of this year, and will be held at three locations, including the Guggenheim and the Museum of Modern Art. The exhibit is limited to twenty works, and will be staged in collaboration with Sudip Bandy and his team. The show will be organized in four phases\u0097the first will cover contemporary art from the 1920s to the 1950s; the second will be a representation of the artist’s art from the 1960s to the late 2000s; and the third will be a retrospective of the artist’s art from the 1960s to the 1980s. The next Bi", "The next Biennial should be held in Italy in the spring of 2021. The exhibition will be organized in partnership with the Italian government and will be hosted at the Italian Museo de Arte Moderna in Rome.\n\n\nThe Philadelphia Museum of Art (PMA) announced today that it has received a gift of twenty-five works by independent artist Ted Halstead.PMA bought the works from the California-based artist in the spring of 2019 after he donated them to the institution. The works, which are housed in the museum’s collection since 1972, were originally acquired by Halstead from the Los Angeles County Museum of Art (LACMA), which is now undergoing an $88 million expansion, and are being catalogued as part of the institution’s ongoing effort to bring more works from the California-based artist and his family to Philadelphia.The museum brought Halstead’s works to New York in 2019 as part of a larger project that also featured the acquisition of works by Giacomo Beccaria, Peter Alexander, and their families, as well as by Louis Vuitton.“After we purchased these works, it was a privilege and a joy to present them to the public,” said PMA director Christopher", "The next Biennial should take place in 2021. \n\n\nEgyptian artist Nima Nabavi, who inspired a wide-ranging and influential art-historical narrative for women’s suffrage. She is represented by the Los Angeles–based Art Digs. Nabavi’s painting The Birth of a Nation, 1918, which has been on view at the Los Angeles County Museum of Art (LACMA) since 2007, will open a new exhibition at the Museum of Contemporary Art (MCA) in January. Nabavi’s work has been included in the following major international exhibitions:\n\nThe Museum of Modern Art, Paris (2019)\n\nMuseum of Modern Art, New York (2019)\n\nMuseum of Contemporary Art, Los Angeles (2017)\n\nThe Museum of Modern Art, New York (2017)\n\nThe Museum of Modern Art, New York (2017)\n\nThe Museum of Modern Art, New York (2017)\n\nThe Museum of Modern Art, New York (2017)\n\nNaftali Sasson Gallery, New York (2017)\n\nNaftali Sasson Gallery, New York (2017)\n\nNaftali Sasson Gallery, New York", "The next Biennial should be held in 2021.   Artist Interviews \u0097from the artist interviews section of the index\u0097will be hosted by the Yale Center for British Art, the Bodleian Library, the Stedelijk Museum, and the Institut National de France in Paris. The inaugural exhibition, “Join the Show,” will open on May 10. \n\n\nFollowing Hurricane Dorian in 2004, when the Caribbean island was struck by four hurricanes in one year, the British architect, landscape, and urban designer Nando Acosta, who is known for his environmentally conscious, red-light camera projects, created a series of interactive works that explore the large-scale social, political, and architectural effects of climate change.On a recent visit to New York, Acosta created a two-dimensional, seven-mile-long, 125,000-foot-high, carbon-neutral city in his backyard. The hybrid ecosystem, called Dorian, was modeled after the atmosphere in the Sahara Desert, where hundreds of his works are based. Inspired by nature, the artist  created  for a solo exhibition at the New Museum in New York in January 2019, a virtual recreation of the", "The next Biennial should be held at least twice a year, with a minimum of three years between the two. The institution hopes to start construction on the first building in 2020 and add 150,000 visitors to the metropolitan area annually through reopening of the museum.The exhibition will premiere the work of seventy-three artists (including Joshua Helmer, Anton Kern, John Akomfrah, Andrea Hämälä, and Anne Morte), including Lutz Bacher, Hermitude, Michael Buckley, Steven Chiu, and Elizabeth Thomas, as well as the architecture of the Pacific Rim and the South American continent. The biennial will also highlight the work and workmanship of fourteen Poles, including Wojciech Krivitskiewicz, Jakub Wojtas, and Marcz Kolta. The exhibition will be followed by the launch of the biennial’s inaugural project, “The Veil” (2019–20), a commission by Krivitskiewicz; a selection of works by Marija Gijs, a Polish artist living and working in London; and the institution’s inaugural exhibition, “The Fine Arts of the Pacific.”The institution also revealed that it is planning", "The next Biennial should take place in the autumn of 2021, with an announcement of the twenty-fifth in 2020. The fifty-ninth, which was first staged in 2008, will run from the Museum of Contemporary Art, Miami Beach (MCA), in September 2021. The seventy-ninth will take place in October 2022.The theme of the 2019 event, “Roots of Modernity:” spans history and culture with a focus on the legacy of a single lineage, the Indigenous people of Australia. The theme of the 2020 event, “Roots for Future Generations:” will explore the interconnectedness of life on earth and how these roots can shape and shape and shape again.\n\n\nThe federal government is planning to spend $7 billion to address the climate emergency in September, but some states, such as North and South Carolina, have already begun to roll back greenhouse gas emissions by half. According to the New York Times, the United States has already cut its greenhouse gas emissions by more than 80 percent since 1990, but the total number of people who are expected to be affected by the curbs is still unknown.According to the New York Times, the Trump administration has allocated $4.7 billion for the first phase of", "The next Biennial should take place in 2020. The biennial will be divided into two parts: a year-long program of installations and performances, and a “post-festival” program. In order to maximize the development of the biennial, the museum will develop and present a variety of work in the first half of the biennial, and will soon launch an online exhibition. The exhibition “Feminine” will be composed of paintings, drawings, sculptures, and installations by artists such as Ai Weiwei (New Year), Léa DuValle (January 14), Konstantin Grigoryev (January 15), and Ruben Saúl (January 15). The museum also revealed that it will hold a special exhibition dedicated to the life and work of Margaret Mitchell, the American painter, in 2020. Mitchell’s work will be presented in the form of a group show, which will be preceded by a free event at the museum, “Margaret Mitchell: The Life and Work of Margaret Mitchell.” The event will also be preceded by a biennial of Mitchell’s paintings and sculptures, “The Beauty of the World,” in 2020, and �", "The next Biennial should be held in 2021.\n\n\nFrom the original exhibition, to the current exhibition Open Eye, to the forthcoming film The Magician and the Thief, the Seattle Art Museum has welcomed over one hundred new works by twenty-six artists, including Michael Redgrave, Catarina Rich, Catherine Thomas, Peter Cookson, Scott-Marie Oostra, and Barbara Kruger. “While the museum has undergone significant changes over the past sixty years, we have maintained a strong commitment to presenting works that reflect the museum’s long history of excellence,” said Mike Guggenheim. “The new exhibitions reflect this and are sure to further our enduring vision of what an art museum should be, as well as reflect the changing world in which we live.”The exhibition’s first new project is “This Is Not a Sculpture,” which opens on March 22 and runs through April 5. The exhibition will feature twenty works by forty-eight artists, including Richard Avedon, Tracey James and the Spokes, Elin Østbye, Haus der Kunst, and Craigie Breen. The exhibition also includes “Conrad Fisker: Love", "The next Biennial should be held in 2020.\n\n\nThe Australian Institute of the Arts (AIA), the Museum of Contemporary Art (MCA), and the National Gallery of Australia have announced that they will no longer face legal action from a group of current and former employees who claimed that the institution mishandled sexual harassment complaints.The new agreement between the three museums—which also includes a number of new initiatives designed to improve the workplace climate—is part of an agreement that also outlines new workplace and employment policies that will protect the well-being of all staff. The AIA and MCA have been working with the Australian Human Rights Commission (AHRC) to implement the new policies. The AIA and MCA’s new anti-discrimination and anti-harassment guidelines will go into effect in the fall of 2020.“The AIA and MCA have made great strides in implementing the new human rights obligations in the new agreement, and particularly in making the AIA’s practices more transparent and to some degree enforceable,” said Heather Symonds, director of the AIA. “We are pleased that these new policies will help ensure an environment of equality and harassment-free work for all staff, especially after a series of bad", "The next Biennial should be held in the spring of 2021. \n\nAlthough the South African Museum of Art in Pretoria has not yet commented on the new law, the country’s Arts Council said that it is “committed to supporting and protecting the biennial programme as it relates to South Africa’s heritage and its cultural heritage, and will continue to do so in accordance with the charter of the institution.”\n\n\nThe Museum of African Art (MAS) in Washington, DC, is implementing a new set of guidelines that will address the increased levels of racist violence that have taken place around the country following the death of George Floyd, a black man who was killed by a white police officer in the line of duty last week. According to the New York Times, the new rules, which were released on Monday, are being drawn up by the Department of Justice (DOJ) in an attempt to “draw attention to systemic racism and racial violence in America.” The guidelines outline three steps that museums can take in order to prevent incidents where a “racial imbalance exists between police and the public; promote and protect the constitutional rights of all communities to peacefully assemble and petition; and provide training and technical assistance to law enforcement", "The next Biennial should make its debut in 2020. More details about its new location and the theme can be found on the website of the institution. \n\nThe Hong Kong–based artist and designer Miao-Ling has received the 2018 Chesky Prize for her spectacularly detailed installation Tired of Prison, which hewed closely to the rules of construction and cost and created a hybrid of prison and environment as a metaphor for what is impossible to reverse. Her work will be featured in the exhibition “Tired of Being,” which will take up the theme of the twentieth century and its relationship to the legacy of the former British colony Hong Kong in the exhibition “Hong Kong: After the Umbrella.”The work, which examines the collapse of the Hong Kong government in 2017, was installed on the roof of the Hong Kong Art Museum (HAMM) and opened on March 15, 2020. The newly elected leader of Hong Kong, Carrie Lam, announced that the victor’s vision for the exhibition was “a great achievement.”After years of negotiations with the Hong Kong government, the winner of the award, a Chinese national named Wang Yanhua, sat down with the Hong Kong Museum of", "The next Biennial should be in the spring of 2022.\n\n\nThe Temple Museum of Dada in New York has appointed Arash Markazi as its next artistic director. Markazi arrives at the institution from the Museum of Fine Arts in Philadelphia, where he currently serves as director of collections and exhibitions. Prior to joining the MFA, Markazi was an associate curator at the Museum of Modern Art in New York and a curator at the Broderick Institute of Art and Design in Santa Monica.“Arash is a distinguished scholar, educator, and advocate who has created and informed groundbreaking exhibitions, exhibitions, and publications,” said director Jonathan Harris. “His understanding and commitment to contemporary art and design has been exemplary. As head of the MFA’s collections and exhibitions, Arash will play a central role in reinstating Dada’s art of the surreal and its design of objects by a non-Dadaist. We are thrilled to welcome him to the Temple.”Commenting on his appointment, Markazi said: “I look forward to working with the more than seventy-five thousand people who have come to the temple over the last twelve years. It has been a source of inspiration for me since I", "The next Biennial should take place in Havana in March 2020.\n\n\nThe Istanbul Biennial has announced that Geir A. de Vorst, its artistic director, will step down after the twenty-fourth edition of the biennial, which was canceled due to the Covid-19 pandemic, in March. De Vorst told the Art Newspaper that he takes the decision very seriously and intends to exhaust every possible avenue to try to reopening the biennial. However, De Vorst said that he does not expect the biennial to reopen before mid-June.In an attempt to mitigate the financial impact of the Covid-19 pandemic, which has put an additional strain on the city’s arts community, the city council of Istanbul designated several locations in the city’s Şırnak district as temporary housing units for up to one hundred people. The planning committee approved the designs last week, and the city council is currently working on setting up a new citywide housing program, the Istanbul to Şırnak Art Residence Program, which will provide subsidized apartments to temporarily housed artists. The program is part of the city’s wider plan to promote the city’s cultural sector through public investment,", "The next Biennial should be held in the Spring of 2022. The first Grand Jury will have the final say in the selection and will consist of twenty-four artists. The decision to postpone the 2020 event was made after a meeting of the board of directors of the Biennial on March 23. The board of directors cited the “challenges and uncertainties that we face in the digital domain.” The board added that the “cautious optimism that we have had for the past twelve months has led us to believe that the future of Biennial is at hand.”\n\n\nThe National Galleries of Scotland has released the final list of nominees for the 2020 National Galleries Award, which honors people and organisations that have made significant contributions to the conservation and exhibition of art from Scotland. It also announced that the awards will now be given out under the auspices of the National Galleries Scotland (Garrison), which is headed by veteran curators Ian and Eileen Harrison.“We are thrilled to be able to announce that the National Galleries of Scotland will be awarded the 2020 National Galleries Award,” said Ian Mackay, director of the National Galleries. “This is the first year that the National Galleries", "The next Biennial should be in 2022. If all goes to plan, the museum will be able to welcome visitors in 2024. As of October 1, the museum had 3,599 visitors, a record high for the biennial. In an attempt to bring the museum closer to New York, Kelly announced earlier this month that the museum would move into a new location in Manhattan. \n\n\nBeijing’s National Museum of Art (NMA) has received a donation of 150 works from the Chinese artist Zhang Yaxuan, who is known for his massive public installations that address the political, social, and cultural conflicts of China and the Americas. The museum has selected fifty-six works from Zhang’s extensive collection and will present them in its first exhibition dedicated to the artist outside of China in July.The works will be presented in “The History of Contemporary Chinese Painting: From Oolite to Modern,” which will run from June 22 to June 28 and will be held at the museum’s Beijing outpost. The exhibition will continue the exhibition’s theme of the contemporary Chinese landscape, which focuses on the evolution of the artist’s practice, focusing on the 1930s and 1940s, respectively, with works such", "The next Biennial should take place in 2020. The biennial, which consists of two panels—one for each of the pavilion’s main themes—will be held at the Pozières Art Museum. The art used in the exhibition will be chosen by the institution from a pool of entries by artists and will be curated according to a theme developed by the museum. The public will have the opportunity to join the public artists’ panel at the museum.“The program has been a complete success,” said curator Jean-Luc Ponty. “The new conditions at the museum mean that we are only two years from a new exhibition. This is a programme that has had its time and will have its time again. The future of the Biennial is uncertain, but I am confident that we will find a way.”In addition to the pavilion, the museum houses a number of exhibitions. The Biennial of Richard Lear, a retrospective devoted entirely to the life and work of Richard Lear, will open on January 20, 2020. The first of a retrospective of the artist’s recent works will open on April 16, 2020. The biennial’s fifty-fifth edition, “Richard Lear", "The next Biennial should be held at the same location, in the same year, and perhaps on the same date as the first one. The new event should also include an extension of the annual exhibition, which will now take place on the occasion of the Grand Duchy’s 150th anniversary. The new exhibition, which is organized as a biennial, will be housed in the same building as the previous exhibition. The exhibition will be hosted by George Gentry, one of the architects of the Biennale de Lyon, and will run for four weeks, from June 5 to June 7, 2020. “The pleasure of the committee is that the decision was made in accordance with the majority of the architects who worked on the project,” said Zoë Kaldor, director of Tate Britain. “I was delighted to be able to play a part in the vision of the Biennale’s architects. Their work, for many years, has been recognized throughout the world. I look forward to working with them in the years to come.”Commenting on her appointment, Kaldor said: “I am very much looking forward to having a voice in the future of the Bi", "The next Biennial should take place in the spring of 2021.”The new event’s inaugural edition, which was canceled due to the Covid-19 pandemic, will take place at the Museum of Fine Arts, Boston and will be hosted by curator and critic Harvey Prothero. However, due to the current political climate, the exhibition will not go ahead\u0097instead, it will be moved to a new location in Cambridge. The Museum of Contemporary Art (MCA), Boston has also announced that it will move the show, which will feature new works by thirty-two artists, to the Yard. The work of sixty-three artists is currently included in the exhibition, which runs until March 14.The Yard’s new location will also include an exhibition of work by forty-six artists. The show will begin in the former MCA’s former space at 5 East Boston and will run until March 20. The inaugural exhibition is titled “Hours,” and will draw from the artist’s experience of Covid-19 and the aftermath. The show will feature 150 works by fifty-eight artists worldwide.The Yard’s new location is situated on a two-acre campus, which was renovated in 2016", "The next Biennial should be held in 2020.\n\n\nThe Art Newspaper reports that the Institute of Contemporary Arts (ICA) in London, which is currently undergoing a restructuring, plans to close its doors in March 2020 and rebranded as the Institute of Contemporary Arts (ICA) London. The decision was made in order to lessen the impact of the coronavirus and to restore the ICA’s main building, the Institute for Contemporary Art (ICA), on London’s Camden Town, on March 13.Dubbed the ICA2, the new facility will feature more than 600 artist studios and will boast a new exhibition and educational programming platform called the ICA2 Festival, which will open in March 2022. The event, billed as the ICA’s flagship new event, will include a biannual show by around sixty international artists. The inaugural edition, titled “Love & War,” was held in March 2019. The event featured work by fifty-five artists and was open to the public. The series will run once again in March 2022. The program will be organized as follows:During a question-and-answer session with the ICA2 Festival’s artistic director, Mark Lane, he revealed: “We", "The next Biennial should be held in 2020, with the exhibition marking the third iteration of the residency, which began as a way for the artist-run public space Zanzibar to reflect the city and external events for which it is now dedicated.\n\n\nThe New York State Court of Appeals has upheld the convictions of Alexander Gilkes and Julius and Etta Warren for distributing more than 40,000 images and videos depicting child pornography. The images and videos were seized from the defendants' home after an investigation that began in January 2018 and were stored in a vault that was accessible only by the two men, who are currently incarcerated at Rikers.The convictions were originally handed down in April 2018 but were stayed because of a legal maneuver known as a rehearing at the end of the year. The New York Times reports that the court found that the government had made \"false statements\" about evidence in the case and that it had failed to prove that the defendants intended to distribute the images or videos.“While acknowledging the Government’s evidence was insufficient to establish guilt beyond a reasonable doubt, we held that the jury was not instructed properly to consider evidence after a defendant pleaded guilty to this offense and subsequently to find that he had distributed child pornography,” wrote Judge", "The next Biennial should be held at the Hakone Museum in Tokyo in 2020, and the 2019 edition should be held at the Art Museum Yokohama in 2020. The 2019 edition, released on March 11, was mixed and featured work by just four artists: Chiharu Hoshine, Takashi Kawamura, and Shunsuke Kikuchi.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced its collaboration with the Asian firm Palace Art , which has been working with the institution on the restoration of the Marciano Salvatore-designed space. The partnership will not only yield the largest collection of work by the artist in its history, but also the restoration of the first exhibition ever staged at the institution in the form of an interactive installation. The work is part of MoMA’s ongoing project to re-create the Marciano landscape in a way that will engage as many of the institution’s current exhibition spaces as possible. The restoration will take place across three buildings in the museum’s complex, including a new gallery and gallery, the Marciano Room, which is currently undergoing a $70 million expansion and renovation, and the Marciano Gallery.“We", "The next Biennial should be held at the Museum of Contemporary Art in London in 2021. \n\n\nPalm Springs Art Museum in California—the fourth institution in the state to announce plans to close permanently as a result of the coronavirus and has been closed since March 11—is appealing to the public to continue supporting the museum and its programs through April 29. The request comes a day after the museum received a letter from more than 1,500 people, including many from China, India, and Africa, urging the institution to ensure a continued high level of support for the carcass disease.The letter reads: “We are writing to express our concern regarding the extensive damage to the Palm Springs Art Museum that has occurred since the Covid-19 outbreak began in late March, and we ask that you continue to support the museum financially as a result of April 29–May 1. We are requesting that you continue to take the time to review the exhibitions, collections, classes, and tours that are currently on view, and that you remember to visit the museum during the pandemic to visit and learn about new works by artists. We hope that this letter will be of use to you and your family. We appreciate your attention and", "The next Biennial should take place in the fall of 2020. The first iteration, held in 2007, featured work by eighty artists.\n\n\nThe Virginia Museum of Fine Arts (VMFA) in Richmond has received a $250,000 donation from the Rosenwald Foundation. The gift was made after a retrospective of the artist’s work, “The Blur,” was presented at the institution on October 15.Khalil Al-Amin, director and CEO of the Rosenwald Foundation, said: “The Virginia Museum of Fine Arts is a unique organization with an impressive collection of Khalil Al-Amin’s work, and our team is excited to support its efforts to present a comprehensive exhibition of Khalil’s work.”\n\n\nThe 2017 Art in America awards, which celebrate artists who have made significant contributions to American art and have been awarded the prestigious Gold Lion, have announced their winners. The awardees are Vincent van Gogh (12th), John Crowley (19th), James Cuno (20th), Susan Cooper (22nd), and Ellen Tan (23rd).The 2019 awards were presented by the American Institute of Art (AIA), the National Museum of African Art,", "The next Biennial should initiate a long-term program of exhibitions and talks on the history of art and how art can make a difference to the world it belongs to—including the history of contemporary art. It also should consider contemporary issues in relation to art, such as the fate of art and its relationship to and the development of the twenty-first century. The new program should draw from the existing museums and draw from the collections of leading artists such as Wolfgang Reimann, Jacky Tait, and Oskar Eustis. According to the artist, the new exhibition should aim for a balance between the need to present works from a wide range of cultures and should reflect the diversity of the contemporary world. The exhibition “The Future is Present,” will open in the summer of 2020 and will feature works from the exhibition “Future is Present” and will run until November 2021. The museum has set a goal of reopening in 2022.\n\n\nThe National Galleries of Scotland (NGA) has added six new works to its collection, including a “SOUTH Black Renaissance” (2019), an early depiction of the convict John Brown, and a “South Asian Renaissance” (2017", "The next Biennial should take place in 2020 in the former village of Ljubljana, which was set up by the Austrian architect Ludwig Mies van der Rohe in the early 1950s. According to the Art Newspaper, the new venue will be situated in a former textile factory and will feature work by artists such as Joachim Neugroschel, whose work was on display at the upcoming edition of the Biennial in Sarajevo, and Christian Hesse, whose work was on display in the exhibition “The Stairs in Gold” (2019), which was staged in the former Svetlana Museum. Both artists will be represented by the artist-run organization GalleryBangalore.\n\n\nThe Museums Association (MA) in London has launched an initiative to promote museum attendance. In a statement on Wednesday, the organization said it is launching a digital platform that will allow visitors to experience a museum through a digital platform, called a museum experience, within the museum. The platform will be free to the public and will be accessible 24 hours a day.The digital experience will be free, but the program will include paid admission, guided tours, and other activities that will be set within the museum and will be curated by the MA", "The next Biennial should focus on the history of art and design from the perspective of a queer person of color, and should include the work of people of color artists and designers. It should also include a discussion about how art and design has historically been considered barriers to queer people of color. “Instead of focusing on a whitewashed history of art, we should be focusing on the work of artists of color,” said Sean David, president of the Biennial. “The next Biennial should focus on the history of art and design from the perspective of a queer person of color, and should include the work of people of color artists and designers. It should also include a discussion about how art and design has historically been considered barriers to queer people of color.”The 2017 exhibition, “Queer Red & Black,” was led by Daniel H. Pink, a self-taught Chicago-based artist who is known for his ambitious, '70s queer, feminist, and LBGTQ works, and was curated by Kara Jack, director of the Biennial. The show will be presented in the fall of 2020. \n\n\nThe Toronto-based nonprofit ArtsFeed has announced that it will", "The next Biennial should examine the relationship between the non-Western art world and the Communist Party in China. In a recent report commissioned by the Panel Club for Contemporary Art Beijing, scholar and critic Ting Chiu wrote that the upcoming event “will be a platform for the discussion of the Chinese Communist Party’s development of art and culture abroad and the development of art and culture in China.” The Shanghai Exhibition Center, which is housed within the MCH Group, is also planning to expand its offerings. The project is part of the city’s long-term plan to modernize the institution and increase accessibility and accessibility features. The plan also aims to create an event space that would serve as a cultural center that would be accessible by bicycle, which is currently the center’s main street.According to a press release from the newly-formed Beijing-based Cultural Centre Alliance, the expansion would “bring together the world’s most important contemporary art collectors, artists, and institutions in Beijing.” The venue would have the capacity to host seven hundred exhibitions annually. The press release also announced that the project would include the construction of a pavilion dedicated to the Chinese modernist painter Huang Yansheng\u0097an artist whose", "The next Biennial should be held in 2021. \n\nThe highly anticipated new edition of Art Basel Hong Kong will open on August 29. The first round of the fair will run from 10 AM to 6 PM, with the final event taking place at 5 PM. The fair will be held at the venue where the Hong Kong spectacle, the Hong Kong Art Museum (HKMO), is located. Its new location will bring with it a new exhibition format, a new exhibition program, and an expanded program.“I’m incredibly excited about this new chapter in our history,” said Ted Tsang, chief executive of the company. “The new Hong Kong exhibition will be a new beginning for Art Basel, and I know that we will deliver a unique and original show this year.”\n\n\nThe National Gallery of Canada has launched a new digital platform that will allow visitors to see and purchase works by Canadian-born artist Jordan Casteel. The platform will be available on Facebook, Instagram, and YouTube beginning on October 5 and will feature thirty-five works by the artist.“Jordan Casteel’s work has been collected by the National Gallery of Canada, the Toronto Museum of Art, and the Vancouver"]