["The next Biennial should have been held in the same city as the exhibition. However, in order to “remain true to the work as previously presented, the exhibition was moved to a new venue in the Harriss, where the Biennial will again take place,” reads a statement on the organizers’ website.The Art Newspaper reports that Germany’s Federal Association of Art and Design (BAM) is urging Berlin’s state government to suspend all official engagements with the German government and to significantly reduce the annual stipend it provides to the state’s museums. The organization is also asking for the release of former Berlin state minister Holger Gerstläger, who was tapped to head the BAM in January 2019, and is demanding that the state pay $142.5 million to the museum’s creditors in the event that the organization is forced to close. Gerstläger, who stepped down months before the 2019 exhibition was supposed to begin, has since been appointed interim director of the Füssenkirche Zentral Museum für Kunst und Garten, where the exhibition will stay until January 8, 2020.The organization’s board chair", "The next Biennial should take place in 2021, when the exhibition will be renewed for a second year. “I think the artist-centered design of this exhibition is really at the core of what we are all about,” said Yuki Hoshine, the creator of the center, which he runs with his wife, Miki Yasuda, and their contractors, Tomomatsu Takahashi and Yuki Kawano, and their staff. “We are very much inspired by the work of our contemporaries, and what they are doing today, and what they are able to achieve.”The show will feature work by thirty veterans of the museum, including Takashi Tezuka, who will present work by artists such as Alejandro Campins, Philip Hutz, and Atsushi Miyao. Artists will be invited to create a new exhibition in the center in 2021, and the first exhibition of new work by a woman will take place in 2022. The second Biennial will take place in 2020, with a retrospective of the work of Ahmed Ben El-Mello, and the third will be held in 2020. Currently, the museum’s collection is based on one hundred works, and the remaining forty works are on loan", "The next Biennial should focus on the psychological effects of P.A.I. and the historic sites at the time of its founding and the following year on the P.A.I. biennial’s future. “Around the World in Eighty Days: The Intimate History of the Art in the Contemporary Art of the Pacific,” is currently on view in the biennial’s exhibition hall. \n\n\nThe Smithsonian’s National Museum of American Art (NMMA) in Washington, DC, has announced that Angelica Ma, who has served as the director of the institution since 2015, will be the next director of the Metropolitan Museum of Art. Ma has helmed the museum since 2008, when it relocated to its current location in southeast Washington, DC.Prior to joining the Metropolitan Museum of Art in 2016, Ma served as the director of the Los Angeles County Museum of Art (LACMA); the creator of the LACMA VideoArt exhibit series, which attracted nearly four hundred artists and collectors; and the cofounder of the media company Oscilloscope, which has represented artists such as Ed Moses, Lauren Vincent, and Jean-Michel Basquiat. Ma also worked as a consultant for a number", "The next Biennial should be called the Biennial of the Body, and should consist of twenty-one interviews with contemporary artists, researchers, and researchers, selected from a group of forty-five artists invited to the first Biennial of the Body at Biennale London in May, 2019. The inaugural exhibition of the new biennial, “What We See,” will open at the Museum of Modern Art (MoMA) in September.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is investigating the possibility of moving the institution’s major work, Rob Smith’s monumental sculpture The Light Fantastic, to a museum outside of the city. Smith’s work, which reimagined the history of light and the way that light was perceived in the late nineteenth century, is housed in the Solomon R. Guggenheim Museum on Long Island and is currently on display in “Light Fantastic,” the museum’s first major re-creation of the work.The Guggenheim, which has been working on the project for over a year, received a $7 million donation from the Smith family in 2017. The grant gave MoMA and the Smiths the opportunity to add", "The next Biennial should be held at least once every two years, with a minimum of two exhibitions. The artworks will be chosen by a panel consisting of Igor Kurtz, director of the Fischbach Museum in Berlin; Andrea Guarani, director of the Marciano Museum in Santa Clarita, California; and Arturo Camacho, the director of the Museum of Contemporary Art, Los Angeles. The biennial will also include a program of exhibitions and residencies, and a special exhibition of work by the artist Olaus Magnus Nein, which will be inaugurated by a screening of the film The Transporter, 2018. “The idea behind the biennial is to make a new kind of biennial, for us,” said Kurtz. “We want to create a space that is a new kind of biennial, for all of us, in which everyone can experience the art of the exhibition and the exhibition and the exhibition together.”\n\n\nAs the number of the casualties in the ongoing coronavirus epidemic continues to rise, the United States has announced that it will spend an additional $1 billion in aid to combat the virus, the New York Times reports. The total", "The next Biennial should be held in the coming months, and we will keep you updated on the status of the project.\n\n\nThe Los Angeles County Museum of Art (LACMA) is preparing to roll out a new digital platform that will allow visitors to the museum to see works on-site for the first time. The platform, called MuseScore, will give visitors a one-stop shop for information on upcoming exhibitions, special events, and programs and will be free to use.“The digital curatorial platform was created to help LACMA explore new ways to support the exhibition and programmatic initiatives of our curators and to engage with the extraordinary collections and collections experiences of our community,” said Jennifer Talbot, the museum’s deputy director and chief curator. “We are excited to see how MuseScore will impact the world we live in and how it will help make LACMA a more appealing, welcoming, and accessible destination.”MuseScore will also introduce new ways for visitors to experience the artworks and programs of LACMA’s collection in real time. The museum will begin by launching a virtual tour, which will also include a reading of the exhibition’s catalogue, during the inaugural exhibition", "The next Biennial should take place in 2024. The artist-run show is also working with a team to create a new biennial-wide survey on critical aspects of racism and the Americas. The project—which will also include a public lecture series—is expected to be completed by the end of next year.The Biennials are also hosting a number of exhibitions, including “Paperthenikos,” curated by the Turkish artist Ozturk Yalçın, entitled “Art and the Art of History” (2018); “John Cage” (2017); and “Intersection of the Modern and the Ancient Worlds: Avant-Garde and Postwar” (2017).\n\n\nThe Royal Academy of Arts (RA) in London announced that it is planning to remove a statue of Edward Colston, a colonialist and slave trader, which has stood on its grounds since 1807. The controversial monument, which was dedicated in 2015, was the subject of a 2017 exhibition at the museum, titled “Colston: A Centenary Exhibition” and was the subject of a 2018 documentary, “Colston: A Century of Contradictions,” directed by Laura Mul", "The next Biennial should be held in the spring of 2021.  The event will be staged at the newly renovated Arts and Design Museum in Manhattan, and will bring together thirty-one artists, including Hannah Atherton, Nora Blum, and Yelena Samoilova, in order to address issues such as “collective memory, the collective body, and the individual as a whole.”\n\n\nThe Louisiana Museum of Fine Arts (LMAFA) in New Orleans has been awarded a $4.5 million donation from the Charles and Lucille King Family Foundation. The gift comes after the museum received a $2 million donation in support of the construction of its new building and is the eighth for the organization in its fifty-five-year history.The gift was made by the King Family Foundation in recognition of its longstanding commitment to supporting the creation of new works by the Louisiana artists whose work has been featured in the 2015 Whitney Biennial, which debuted at the LMAFA in April. The biennial, which gathered twenty-six works in a single exhibition, is one of the largest exhibitions of Louisiana artists on view at the museum, which opened to the public in 2018. The institution has also received a total", "The next Biennial should be held at the new site of the Museum of Modern Art in New York; the current exhibition will return later this year.The sixty-second edition of the exhibition will be held at the Museum of Modern Art in New York through June 11. The biennial will also feature biennial works by artists and organizations from the San Francisco Museum of Modern Art, the Museum of Modern Art in New York, and the Metropolitan Museum of Art. In addition, an original selection from the United Kingdom will be presented at the London School of Economics. Jonathan Taft’s work, “The Hollow Light of Day,” will be included in a special catalog of the artist’s work that will be included with the exhibition, as well as in a special exhibition organized by the artist at the Museum of Modern Art, London, and organized by the MFA in San Francisco.“This is a moment of new beginnings for our city and a new frame for our history,” said David K. Levine, chair of the MFA’s board of trustees. “The biennial will introduce new perspectives and challenges to the history of our city, and present a new vision of how art can spur social change and transform", "The next Biennial should be in 2020, but so far organizers have said that it will be a retrospective of the show, as well as an attempt to address the challenges posed by the Paris Commune and a shortage of cultural exhibits.\n\n\nIn the predawn hours yesterday in Bristol, England, a ten-person team led by British artist Marc Quinn installed a statue of Black Lives Matter activist Jen Reid on a plinth that recently held an eighteen-foot-tall likeness of seventeenth-century slave trader Edward Colston—the stone effigy was unveiled by Quinn and artist Benjamin Britten.Quinn first approached Britten about the sculpture—a monument commemorating a seventeenth-century slave sold into the global gendered sex trade and located in Bristol—during a 2016 Artforum interview. The pair collaborated on the statue over the course of a year and a half, creating a work that reflects both the activist and the abstract ideals of Black Lives Matter.Quinn created the effigy to stand in the way of a planned monument to Colston, a monument that would have been located in a city park, and created a rope to cauterize the skin of Reid, a Black woman who was one of the first to be convicted of slavery offenses in", "The next Biennial should take place in Beijing in 2021.\n\n\nThe museum in Rome, the Museo Internacional de Rome (Milro di Roma), and the Museo della Scala in Castello di Garda, Italy, have agreed to jointly present the Italian pavilion at the Fifty-Ninth Venice Biennale in 2021. The exhibition, titled “Simplicity of Object,” will be held in Milan from November 4 to November 6, 2020 and will run until March 22, 2021. The Milan pavilion will be moved to Turin for the preceding weeks, during which time the premier Italian art space, the Museo della Scala, will host a special exhibition of works by Andrea Arnold, òlvaro Cattelan, Gian Carlo Cipolletta, and other Lascars.“At the end of the exhibition, the three leading Italian artists will be invited to Rome to participate in a workshop for the exhibition, which will be organized by the Museo di Scala in cooperation with the Museo d’Alto Marzio in Milan and the local architecture and design studio Bipolletta Architecture (both in Bologna) and will take place in the newly renovated Sc", "The next Biennial should be held sometime in 2020, but the organisers said it will be a priority to establish a date for the event.\n\n\nIn an exclusive interview with the Art Newspaper, a documenta Bourse in the capital of Brazil, dated May 31, 2020, O Estado de São Paulo (AoSP), the main project of the eponymous gallery, announced that plans for the first exhibition dedicated to the works of Brazilian artists have been shelved indefinitely. According to an article published by RTP, a Brazilian publication that is not connected to the magazine, the artist-run publication, the project—which was scheduled to open in 2019—was stalled due to the coronavirus.The curtain fell on the first show dedicated to the works of Renata de Souza, Terena Sousa, Ada Cioffi, and João Pessoa, among others, on August 31, 2019, following the 2014 pandemic. The show, titled “Universos de Arte Contemporáneos” (“The Universes in America”), was supposed to run from March 25 to March 27, 2020. The show opened with a public viewing of “Victory in", "The next Biennial should focus on “exposing deeply entrenched, systemic racism and white supremacy in the United States’s Smithsonian museum,” said Franklin. “While the new museum is an important step in our efforts to dismantle institutional racism, we must not forget the many courageous activists, scholars, and organizers who have made historic contributions to advancing the fight against racism and advancing racial justice.”\n\n\nTacita Dean, the founder of the contemporary art blog Reefer Madness, has been dismissed from the online magazine Artforum.com. Dean, who was a contributing editor at the publication for the past five years, was terminated in June 2019 after posting a series of articles critical of the institution. The articles were published by writer Christopher Wool in July and August 2019, two months after the US president Donald Trump was elected.Wool’s articles, which were published in between the 2017 and 2018 Black Lives Matter protests, and the months between the failed 2018 and 2020 presidential campaigns, sparked outrage and outrage among many Black thinkers and art-world elites. The controversy escalated further when Dean, who is white, retweeted a white nationalist tweet that made light of a Black Lives Matter protest. In response, Dean apologized for her use of the term", "The next Biennial should be held at some stage in the next three years, and the third in 2021. This year’s edition, which was curated by Daniel Ek, has received tremendous acclaim. The event will be hosted at Gallery 35 in New York from March 16 to March 21 and will include a retrospective of work by twelve artists, including Daniel Sheehan, Elke Tabocher, and Isabel Viñoly, and a solo exhibition of work by Ellsworth Kelly. The inaugural exhibition, “Abraham Lincoln: The Biennial of His Life,” will be at the Museum of Modern Art (MoMA) in New York from March 16 to March 21 and will include works by twenty-six artists, including James Hetfield, Sally Mann, and John King, the latter of whom also curated the 2016 edition.The 2019 festival, titled “From Paintings to Abstractions,” was organized by an international team of curators led by the Japanese artist Ai Weiwei. The first half of the exhibition will feature works by eighty-six artists, including David Hockney, Tohru Sugimoto, and Jorie Millar; the second half will be curated by the Dutch artist Jan Gehl", "The next Biennial should be held in September 2021. \n\n\nMarlene DiSarro is suing the county of Santa Barbara for $5 million after it canceled her upcoming exhibition “Marlene DiSarro: The Art of Runaway,” a two-night-long performance series that would have taken place in the city’s Muir Theater in December 2019 and January 2021, respectively. Her claim stems from the decision to close the venue—which had been scheduled for a June 30 opening—in protest of the coronavirus.According to the New York Times, the California school district will now be required to pay $10 million to DiSarro and her son Christopher, who were represented by attorney Michael Rosen, after the DiSarro’s canceled the performance, which was scheduled for September 27 and September 28, 2021. The show was slated to run two nights, with an opening reception the night of the event. The family claims the district is not responsible for the canceled exhibition, which was only a “precautionary measure,” and that they are only suing for breach of contract. Their attorney, Michael Masulo, told the New York Times that the DiSarro’s decision", "The next Biennial should be held in 2020. One of the first things the museum will do is create a new set of exhibitions relating to the life and work of Pablo Picasso, which will also explore the relationship between artists and the museum. The institution already has an exhibition dedicated to the artist. \n\n\nThe Brazilian artist Carlos Eduardo Pires has been selected as one of the twenty-eight recipients of the prestigious Prix Pictet, which honors excellence in painting. The $37,000 prize was established in 1969 by Pierre de Coubertin in memory of his late father. The museum chose Pires for his paintings, sculptures, collages, collages used as an art form, works on paper, and prints from the ’60s to ’70s, and has presented him with his award four times.The award is one of four recognized by the museum, which is not affiliated with the artist. The other two awards are the Prix Pénal and the Prix de l'Art, which are given in memory of the late Brazilian painter Jules and Michel Lelong and are named after the artist. The museum’s other two prize winners are Pablo Picasso & Michelangelo, and Nathalie Stern, and each", "The next Biennial should be held in a location that can support the exhibition of twenty-four works in a single-day exhibition. \n\nThe Massachusetts-based artist and activist Anna Wintour was named the next president of the International Union of Journalists. The organization will also choose a new president for its Board of Directors. “I’ve been critical of the leadership of the International Union of Journalists since my first appearance in 2010, and was disappointed to discover that I was the only remaining member of the board,” said Wintour, who was elected in September. 'I have long believed that the future of journalism is at stake, and that changes at an alarming pace. The truth is that there are only two things that can save the profession: more investment and reform.”Last year, the union pulled its annual exhibition “Rights & Responsibilities: A Retrospective,” which aims to reflect the work of the union in the twenty-first century, from the Bourse du Monde in Paris after it announced plans to organize a new international union. Its members voted by a slim majority to reject the move.The union’s current president, Jerome de Menem, is seeking to organize a new", "The next Biennial should focus on the relationship between art and neuroscience, the social and cultural and the natural world. It should be about our connection with nature, with our world around us and with our surroundings. We should not only be able to see the connection between art and neuroscience, we should be able to feel it. We should be able to react to it and to be inspired by it. We should be able to be connected to it and to change it.So, in the next edition of the Biennial, we will be able to see, feel, act, speak and think about the connection between art and neuroscience and, in so doing, change the world. We will be able to create a new kind of biennial, one which is grounded in science and grounded in reason. We will be able to address the questions of how art and neuroscience are linked, what we can do as artists and scientists to help ensure that we are not leaving this connection behind us—and we do not—and we do not want to.We are eager to see what happens next year, and we are confident that this will be the year when we finally get to see the first real-life results of NeuroArt. We hope that people will come together to share their", "The next Biennial should be held in 2021. \n\n\nThe National Gallery of Art in Washington, DC, has hired Katie Schatz as its new chief curator of modern and contemporary art. She succeeds Karen Higgins, who retired in March 2019 after fifteen years at the institution.“Karen did an outstanding job of building the National Gallery of Art’s collection through the acquisition of works by some of the most important and beloved artists of our time,” said David H. Koch, chairman of the Koch brothers. “Katie brings to the National Gallery of Art an extraordinary breadth of experience to make it even more of a gifted research center for the art of the twenty-first century. We are thrilled to welcome her to the National Gallery of Art.”Schatz comes to the institution from the Getty, where she was the museum’s assistant curator in the 2019–20 academic year. She previously served as a curatorial assistant at the Getty for five years and as a senior curator at the Museum of Modern Art, where she curated “The Unbearable Lightness of Being,” a panel show featuring work by Tim Farley, Jill Salter, Arturo Toscanini, and Mies van der Ro", "The next Biennial should be held in the first quarter of 2020, and the first part of 2021. \n\n\nThe Italian architect and urban planner Carsten Reimer has won this year’s Prix d’Art Contemporain (PAAC), a prestigious award given by the Association of Italian Architects to celebrate the achievements of the past thirty years. Reimer was selected for his design for the Imperial Museum of Venice, which is currently undergoing a $62 million expansion, in a poll organized by the association in September. The award was presented at a ceremony at the Museo di Alberto Facundo in Milan on October 11. Reimer’s work, titled Amarone di trasultare, or Empire State, a humble glass-enclosed box, was completed in 1989. The work—paved over the original building by Roman Abramovitch, the architect behind the so-called Berlin Design University—is renowned for its intricate, sculptural, and structural details. The museum has been transformed by the construction of a new building and the restoration of the courtyard, which is now a world-renowned art museum.The work is also celebrated internationally. Reimer was invited to present the award for best contemporary work", "The next Biennial should be held in 2022. The museum will also be closed until April 21, 2020, and will reopen April 24, 2020.\n\n\nThe Detroit Institute of Arts (DIA) in Michigan has welcomed two new members to its board: Thomas R. Kallman, who will serve on the board for three years and will take up his post in August 2020, and Paul M. Pfeifer, who will serve on the board for two years and will take up his post in August 2022. Pfeifer was elected in November, and his appointment was approved by the board of directors last month. The board of directors also awarded him a special award of $250,000.Kallman, who has been with the museum for nearly twenty years, succeeds Michael J. McElroy, who retired in April 2020 after twenty-five years at the museum. Kallman joins the board after serving as the director and CEO of the Detroit Institute of Arts (DIA) from 2010 to 2018. During his tenure, Kallman oversaw a $4.4-million expansion project, the Big Five, that added seventeen galleries, including three new spaces for art. Kallman also oversaw the reopening", "The next Biennial should take place at the Museum of Contemporary Art, Los Angeles (LA MoCA), in 2021, and will address contemporary issues in art. The 2018 show, “Uncanny Valley,” was curated by Laura Mulvey and consists of works by seventy-three artists.\n\n\nThe royal commission for the installation of the Paris-based collective the Conception Group in the city of Rennes, France, has awarded the group an additional $4 million. The commission, which was established in 2018 by the late artist Agnes Martin-Gerber as part of her “final project” for her series “Avant-Garde” (1957–58), was selected by the Rennes City Council for its proposal for a café that would join the institution’s existing République Jean-Paul. The café will be located in the building that formerly housed the Rennes Cathedral and would feature a unique entryway that leads to the residence of the late artist Jean-Luc Godard. The café will serve as the biennial’s main space. The largest works on display in the exhibition will be the work “The Castle of Cagli,” which was created in", "The next Biennial should be held in 2020. The museum’s curator of Asian art, László Marcók, told the Art Newspaper that the museum is currently reviewing the move.\n\n\nThe London-based charity the Union of Concerned Art Museum (UCLA) is drafting a resolution that would require the United Kingdom to take action against the Japanese government over the mass-shooting in Manchester, England, that occurred on May 22 and May 25. The petition, which has been submitted by the Union of Concerned Art Museum Members (UCAMS), demands that the UK cease and reverse its 'preventive measures' and begin to negotiate with Japan, including through diplomatic channels, to end the Japanese colonization of Asia.Acting in solidarity with the United States and other nations that have vowed to not allow the reopening of Japanese-run factories and to push for Japan’s withdrawal from China’s Southern Region, the Union of Concerned Art Museum Members also cite the safety of workers and visitors as the reason for the relocation.“Our delegation is deeply concerned by reports that a large-scale operation is under way at a former military airfield in the Manchester suburb of Reigate, where a new £1.5", "The next Biennial should be held in 2021. \n\n\nThe Goldsmiths, University of London, has awarded a £10,000 grant to the Ministry of Culture in support of the advancement of the field of contemporary art. The money will go to the Center for Contemporary Art (CCA), the Institute of Contemporary Art (ICA), and the 2016–2017 cohort of fellows. The Center for Contemporary Art will receive $10,000; the Institute of Contemporary Art will receive $8,000; and the Museum of Modern Art will receive $7,500. The next cohort of fellows, comprised of artists based in the UK and Ireland, will be selected by a panel of curators and scholars appointed by the Ministry of Culture. They will be chosen from a pool of twenty-six artists established by the curators and scholars in March 2018. The grantees will be invited to participate in a roundtable and biennial at CCA in November 2020. The panel will present their projects for the 2020 fellowships at the end of March 2020. The center will also receive a direct grant of $5 million for its 2020 edition.\n\n\nThe Greenwich Museum of Art in Connecticut has appointed Pamela Koons", "The next Biennial should be held in 2021, but the exact date and venue are still under discussion. The institution will be put through a rigorous selection process, with a budget of around $90 million, in order to ensure a desired balance of artists, from a broad range of disciplines. The presentation of the work of fifteen artists in a single event is a departure from the museum’s traditional programming, which consists of biennial presentations, exhibitions, and residencies. The institution also plans to introduce a new exhibition, “Artist Viewing Rooms,” in 2020, to give visitors a closer look at the work of the artists in the exhibition.It is estimated that by 2021, the biennial’s budget will be around $100 million, and the first show dedicated to the work of Kiki Smith will open in 2022.\n\n\nFollowing months of protests and a wave of resignations from leading museums over its promotion of controversial British Museum founder Sir Christopher Wool, the British Council announced on Wednesday that it is overhauling its membership and leadership. Under the new leadership, headed by chair Sir Nicholas Hoult, the Museum of London will be restructured in line with a new constitution that was drafted by former royal secretary Christopher Packer, who", "The next Biennial should be held in 2020.  Next year, a new exhibition of works by Korean artists should be held in the capital. The series will include works by the five finalists for the prize: Hwang Byung-kye (South Korea), Yooni Park (North Korea), Kim Min-soo (South Korea), and Kim Hen-kye (Japan).The 2020 prize will be presented by the Japanese artist Miki Omori at the Museum of Fine Arts in Tokyo.\n\n\nThe Metropolitan Museum of Art in New York has increased the annual fee for its annual evening performance by $5 million, quadrupling the amount that would be awarded in the event of a museum closure. The move follows a wave of closures across the United States as the region tries to cope with the impact of the coronavirus. While the number of cases has slowed, it has increased the likelihood that the epidemic will continue into next spring, when annual visits to the Met will be down by more than half.The annual prize, which honors late-comer artists in the United States, will now total $6 million. The multiyear prize, which honors under-recognized artists who have made significant contributions to their field, has", "The next Biennial should be held sometime in 2022. It will be an opportunity for Montreal’s art community to connect with and experience the city of Ottawa, which is currently undergoing a $1.2-billion revitalization plan. It will also be a chance to see and hear the works of more than 3,000 artists, including artists who have been selected for the Biennial for Art History and Art in the City of Ottawa. The 2019 edition, which received almost 5,000 entries, included contributions from thirty-six artists, including Cécile Bourgeaud, Mary Catherine Bien-Durand, Hilma Lissoni, and Anna-Sophie Mutter, as well as artists from Israel, Lebanon, and the Middle East.The 2019 edition attracted more than 2.4 million visitors, making it one of the most popular annual trips in Canada. The biennial will also feature a retrospective of the work of thirty-six artists in early 2021 and will highlight the work of twenty-five new artists in December 2021. The 2020 edition, which will feature works by forty-six artists, will be held at the St. Lawrence Art Gallery in New York City from March 7 to March 9, 2020.\n\n\nThe Museum of", "The next Biennial should be held in 2021, and the first exhibition should open in 2023.\n\n\nNew York–based artist Terrie Wilson, whose practice encompasses installation, painting, sculpture, performance, and installation, has been named the recipient of the 2017 Pérez Art Prize. Wilson, whose artworks are located in Los Angeles, New York, and New Bern, New York, was selected as the prize’s compound prize by the Pérez Institute for Contemporary Art. “Terrie’s art is an exercise in the sacred while also reflecting the restless spirit of contemporary life,” said Pérez director Victoria Preciado. “The Contagious Diseases Action Charity, the Carnegie Art Museum, and the Whitney Museum of American Art, among other institutions, are proud to support her work and to stand alongside her in supporting the work of the many artists and researchers who have made her work.”Wilson has worked with the Pérez Institute for Contemporary Art in the past, presenting a number of exhibitions, including “The Temple of Miracles: Telling Stories ” (2016), “Living in a Toy World: Painting in the Architecture of the Future” (", "The next Biennial should take place in the spring of 2021 and will be hosted at the Museo de Arte Contemporáneo de Barcelona in the city of Aragua in southern Spain. The first edition of the exhibition series was organized by the Institut de Arte du Projek, the same organization that manages the museums in the Andalusian region of Granada and Valencia.The exhibition was inspired by the Argentinean avant-garde photographer Íñigo Vargas’s 1972 Los Angeles retrospective, “Giant Steps in the Night,” which was organized by the Los Angeles County Museum of Art (LACMA), and has since been described as “a work of art in the sense of the artist’s body,” the Los Angeles Times reports. The works of twelve artists selected for the exhibition were mounted in the museum’s temporary exhibition space, the Studio Gallery, which had been converted into a public space.In the exhibition “Avant-Garde Painting in the Age of Color” (1973–1974), Vargas showed the work of María Berrada Sánchez to emphasize the importance of the medium in painting. “Paintings", "The next Biennial should take place at the Los Angeles County Museum of Art, where it will join the likes of the Metropolitan Museum of Art, the San Diego Museum of Art, and the Museum of Modern Art in New York and will be held in the Museum of Art’s new home in the City of Angels, which is currently being built. The exhibition will examine the history of contemporary art from a feminist, queer, and trans-feminist perspective\u0097one that embraces the concept of the body and the self. Additionally, the new museum will be named after the American artist and collector Montgomery B. Vance, and will be named after the 17th century English explorer Christopher Columbus. The $125 million museum, which will be situated in the old Alameda County Jail, will inaugurate with a series of performances and events while it re-creations the Spanish Inquisition. It will also include an intimate courtyard with plants and fruits that will be inspired by the pavilion’s collection and will feature performances by contemporary artists such as Alice Aycock, James Turrell, and the Puerto Rican artist Nicodimacel Medina.“The new MCA will be a home for contemporary art from a feminist, queer,", "The next Biennial should focus on a “dramatic re-working of the traditional theater as a whole.” The exhibition, titled “New Forms of Play” and curated by Van Gogh and Ingvar M.A. Nielsen, will open on November 18 at the National Forum in Stockholm. The exhibition will highlight the work of contemporary artists, including Simon Good, Myrkrüger Vorst, and Hans Jonas, and will feature new works by forty-three artists. The biennial will also include a lecture series, an exhibition of works by twenty-five artists, and an exhibition of new works. The full list of participants is as follows: * Andrew Kreps Gallery, New York: A Complete History of Eighteenth-Century Painting.  The Art of the Present, 2017–18: A Collection of Modern Artists’ Work in the Present, 2018-19: The Art of the Present, 2018-19: A Collection of Modern Artists’ Work in the Present, 2019-20: A Collection of Modern Artists’ Work in the Present, 2019-20: A Collection of Modern Artists’ Work in the Present, 2020-21: New Artists�", "The next Biennial should focus on the art of the bodies and the art of the mind. The next should examine the relationship between the bodies and the environment, with a view to discovering the universal necessity of the body in all its manifoldness. . . .And if the future requires any modification of the present, then it must be guided by realizing what the future can be.”\n\n\nThe British artist Christopher Wool, who drew inspiration from American and European visions of the American West, has died at age seventy-eight at his home in Chiswick, London. Wool’s work has been collected by the Museum of Modern Art, the Metropolitan Museum of Art, the Centre Pompidou, and the Tate, among other institutions.Born in Liverpool in 1915, Wool was raised in the Camberwell Pergamon area of Manchester and attended many of the city’s arts centers, including the Serpentine Galleries, the Tate, and the National Portrait Gallery. However, in the 1930s, after Wool married a fellow artist, he began to shift to his studio. Wool’s first major project was The Great White Road, 1964–65, an assemblage installation installation that explored the concept of a", "The next Biennial should take place in 2021. [Update: May 25, 2019, New York: The International, New York, announced that it is planning to hold the seventh edition of the Biennial in 2021. See also Artforum’s story]\n\n\nThe National Gallery of Art in Washington, DC, has created two new positions to support artists and their work. Both positions were announced today at a ribbon-cutting ceremony, which marked the institution’s announcement of its 2018–19 season, and were accepting applications only.The institution will also equip the National Gallery of Art with new landings for the Alamo’s largest building, the Pacific Theater, and will work with the city of San Antonio on the redesign of Pasadena’s downtown plaza. New glass and steel structures will be installed in the park next year, and the National Gallery of Art’s newly renovated space in the National Museum of American Art will also open in 2020.San Antonio also recently received $4.6 million from the Andrew W. Mellon Foundation, including $1.5 million for the National Downtown Partnership, and will receive another $1.5 million from the Mellon Foundation in 2021. The funds", "The next Biennial should be held in the United States in 2020.  The Biennial will be held at the US Embassy in Cairo, the Egyptian Ministry of Tourism, and the National Gallery of Art in Washington, DC.Since the nation’s history is intertwined with that of the Pyramids, the exhibition will be about Egypt’s role in the struggle for independence from Egypt. “The Egyptian Revolution of 25 June 1967 also marked the beginning of a new era as a nation, one that began on the 3rd October 1967 and ended on the 31st October 2020,” said curator of the exhibition, Marina Belen. “While the Pyramids are important, they are only one piece of the ongoing story of the Revolution and its liberation. The rest of the exhibition will be a timeline of the revolutionary years from 1967 to 2020, reflecting not only the biennial’s relationship with the pyramids but with other important historical events.” The exhibition will be curated by artist Nima Nabavi, director of the Experimental Institute of Applied Arts at the University of Cagli, Italy; Leonor Temkin, curator of the exhibition’s fifteenth iteration; and Javier Téllez-Rodrig", "The next Biennial should be held in the year 2021.\n\nThe 2018 edition of the exhibition, entitled “All in the Family,” attracted more than 2,000 visitors, including some 150,000 people in China. The exhibition was curated by Hamza Walker, who served as the exhibition’s artistic director from 2012 to 2013.  During that time, Walker organized 66 exhibitions, including the first Maus Contemporary Art Show in Osaka in 2007 and the first Chinese Contemporary Art Exhibition in Shanghai in 2009.\n\n\nThe CAAB Foundation, a Philadelphia-based charity that supports artists, arts professionals, and arts institutions, has released the list of sixty-five artists who will receive grants totaling $2.7 million this year. Among the artists chosen for the exhibition are Sidney Povich, Xianina Schaffer, Ria Salah, Joëlle Tabet, Maud Olmstead, Paul Copelin, Carol Paul, David Salter, Joan Smith, Marjane Satrapi, and Nancy Spero. The grants will also be awarded in stages. The deadline for the grants is September 30. “The foundation’s $2.7 million grant program has served as", "The next Biennial should be held in 2020 and will be organized as follows: Themes: In the Beginning and the End Avant-Garde, Computational Art, Art History, Art Therapy, Art-Religion, Art History, Art-Telling, Art-Mapping, Art-Telling, Art-Turning,Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth, Art-Warmth", "The next Biennial should be held within the next twelve months, and the final will be held in the next four years.\n\n\nThe Museum of Modern Art (MoMA) in New York has launched an online survey in an attempt to improve its retention rates for students and provides details of how it will use the data it gathers to improve its own internal operations.The online survey will ask visitors a series of questions about their experiences with museums, including how they would describe their experiences and how they would rate them. The results will then be used to help determine the most effective ways to engage with visitors and will help refine MoMA’s strategy to help students prepare for museums.In an attempt to improve retention rates for students, the Genealogical Association of America (G.A.A.) will create a database of family trees and, according to the New York Times, will compile a list of seventy thousand alumni of the university’s graduate art program. In addition, the institution will feature a visualization of the alumni’s alumni relationships on its website.The online survey will run from December 23 to January 15, 2020 and will be free to the public. It will also include a question about the best way to introduce students to art and will draw", "The next Biennial should take place July 4–July 6, 2020 at the new site of the Museum of Contemporary Art in San Francisco, which will be completed this fall.\n\n\nArt Institute of Chicago (AIC) trustees have approved a $250,000 grant to the New York–based artist and activist Camden Mayfield. The $100,000 grant was established after a group of artists and activists, led by artist Adam D. Weinberg, penned a letter to the trustees of the renowned arts institution in June 2019 stating their concerns over the museum’s handling of Darren Arnaud, a late MacArthur Fellow who committed suicide shortly after his diagnosis. “The trustees of the AIC appear to have accepted our concerns,” Ronan P. Harrington, president of the trustees, said in a statement on Tuesday. “However, the trustees will consider the letter of the artists and activists, and will consider the letter’s recommendations, before making a decision about the future of the Arnaud/Mayfield collection.”Mayfield, who was working on a new project with artist Tanya Bonakdar called, “Feminine,” which explores gender roles and female", "The next Biennial should open in 2020. \n\n\nThe American Artists’ Legacy Foundation (AALS) has announced that it is launching a new initiative that will support the work of established and emerging artists across America. The program will provide grants of up to $10,000 to artists whose practices are at risk of being disrupted by Covid-19 and will aim to create an annual grant program for artists whose practices are underrepresented in museums or whose work is currently underutilized. “The AALS grant program is a critical tool for the vital preservation of American art,” said Mary Catherine Levin, AALS’s executive director. “Through our talented grantees and our deep curatorial intergenerational knowledge, we will be able to advance our mission to help the nation’s art and culture thrive.” Last year, the foundation launched a $5 million grant program for artists. The first winners were Georgia O’Keeffe, Steven Fletcher, Jeannie Venters, and John Carlos. The project was part of the AALS’s Furthering Art and Culture initiative, which is supported by grants from the William and Flora Hewitt Foundation, the Robert Rauschenberg Foundation, and", "The next Biennial should be held in December 2021. The design committee decided to hold a new exhibition of work from the Berlin-based nonprofit Artstock Berlin, which was founded in 2013, at the museum in 2021. Its work will be housed in a separate exhibition, “Art in Motion: The Creative Economy” (2021), alongside works from the exhibition “The Future is Present: Art from the Biennial Alte Mond,” which opened in 2013. The new exhibition will also feature the work of artists such as Sabine Gauguin, Wolfgang Oechtens, and Helmut Trubner, and will be hosted by the Berlin-based collective of sculptors Dieter Cornelius and Rainer Oechtens, and the Berlin-based collective of filmmakers Carsten Kluge.The reopening of the museum will coincide with the opening of the museum’s new exhibition “Art in Motion: The Creative Economy” (2019), a collaboration between Hollis Taggart, Tanya Gersch, and Brian S. Johnson, and will also feature the highly-anticipated exhibition “Adam and Eve” (2019), which will present the work of artist and scholar Wolfgang Olsztuf", "The next Biennial should take place in 2021, which would mark the anniversary of the release of the first film in the series, Biennial 001: The Search for the Lotus. The show will have a new location and a new format: a new theme, a new exhibition, and new artists.\n\n\nThe Mall of America (MOA) in Atlanta has launched a new initiative to support local arts and cultural institutions by gifting them free tickets to future exhibitions and other programming. The program, called the MoA Artist Grant, is available to any organization that has an annual endowment of $75,000 and is made possible through a $100,000 grant from the Mall of America. Under the program, organizations can apply to receive up to $750 for the development of their arts and culture through exhibitions, performances, projects, and concerts.The grants will be given out over a six-month period, beginning in June and running through September 2020, and can be used as follows:The first round of grants, which were awarded in April, can be used towards the development of exhibitions, presentations, performances, publications, or events; the second round of grants in June, can be used towards the purchase of goods and/or services; and the third", "The next Biennial should focus on the theory, processes, and challenges of contemporary memory and how they intersect with the sacred, the contemporary, and old ways of thinking about art. “The goal of the Biennial is to create a cultural experience that recognizes the importance of the past in shaping the future,” Michel Chossudovsky, president of the French Council of the Arts, told the Art Newspaper. The new event will be hosted at the Museum of Modern Art, Paris, from July 17 to July 21.\n\n\nThe Pulitzer Prize–winning artist and activist Sohrab Mohebbi has been nominated for a $100,000 MacArthur Fellowship. He was selected for his \"This Is Not an Anti-Art Work\" series, which explores the construction of visual and conceptual frameworks through which artists develop their work, and for his 2014 exhibition “This Is Not a Painting.” The works, which were made in collaboration with the National Gallery of Art in Washington, DC, were on display during “Particular Vision: Painting on a Plane,” a retrospective of Mohebbi’s work at the gallery.The award was established in 2008 to support the artists who have demonstrated a talent for work that is", "The next Biennial should be called: “Responsible Use of Science,” meaning that scientists will be asked to analyze the damage done to the environment by industries, especially agriculture. This will include the destruction of habitats, the manipulation of natural resources, and the destruction of DNA. The theme of the 2020 edition will be “Responsibility and Responsibility-Building” and will be “Allium Sativum,” the Latin term for the climate emergency. The biennial will open to the public on September 29 and will run until November 24.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has received a $50,000 donation from the Jared Leto Foundation for the Arts (JLF), which was established to support projects in the arts, in honor of its contribution to the city’s revitalization plan. According to the Los Angeles Times, the gift follows a series of fundraising efforts that included the foundation giving $25,000 to the city’s local museums and $250,000 to institutions across the city.In addition to the foundation’s donation, MoCA donated $150,000 to the city’s arts and cultural sector, including $50,000 to the", "The next Biennial should be held in October 2020.”\n\n\nThe National Gallery in London is facing a legal complaint from the heirs of the late British arts critic Robert Thompson, who was murdered by a man who claimed he was suffering from paranoid schizophrenia. According to the New York Times, the complaint has been filed by the estate of a woman who claims her mother bought her a houseboat in Brent in the early 1980s. Upon learning of the allegations, the estate sent a letter to the court in the High Court of Justice stating that it “refuses to pay any money to the claimant unless and until the claimant complies with certain unreasonable demands by the estate.”According to the New York Times, the estate also claims that the family has harassed the estate for years with letters and emails from the estate claiming that the family needed to be restrained “from damaging the estate” and threatening to sue if the family didn’t “quietly acquiesce” in the court’s ruling. The literary arts specialist Peter Blundell, a lawyer who represents victims of human rights abuses, told the New York Times that the letters were a “tactic” that “are intended to divert the claimant’s", "The next Biennial should be held in 2021 and will be hosted at the Canadian Museum of History in Toronto. • MIDWESTAKERS, VOLUME 1 by Kirsten Albertson and Ann-Marie Tobey (Drawn & Quarterly)  (New York: Drawn & Quarterly, 2019) Artists Kirsten Albertson and Ann-Marie Tobey (Drawn & Quarterly) have partnered with art historian and curator Ann-Marie Tobey to bring the first volume of their \"MIDWESTAKERS\" series to the United States. The exhibition will feature fourteen new works by thirty-two artists, including Pablo Picasso, David H. Koch, Sofia Barozzi, Frank Gehry, Jules Bianchi, and Garry Winogrand, which will be on display in an exhibition that will open at the Smithsonian American Art Museum in Washington, DC, in March 2020.The twenty-fifth edition of the fair will be held at the National Gallery in London in December 2020. The museum will hold the event in conjunction with the British pavilion at the Fifty-Ninth Venice Biennale.\n\n\nThe Maryland Institute College of Art (MIA) announced today that", "The next Biennial should be held in 2022.\n\n\nThe Metropolitan Museum of Art (Met) in New York has received a $25 million donation from the Charles and Lucille King Family Foundation. The gift marks the first time the foundation has provided funding to a museum. The gift has also been made in recognition of the Met’s role in the fight against racism. The funds will be used to establish a new center dedicated to the Met’s legacy of African Americans and a memorial to the Met’s African American artists.“After a thorough search of the Foundation’s board and staff, the King Family Foundation decided that the Met was the right organization to provide the critical funds to establish a new center dedicated to the Met’s African American artists,” said David Samson, the president and CEO of the foundation. “The gift is a reflection of Charles and Lucille’s deep commitment to this important topic and our appreciation for their generous leadership in advocating for a central organizing platform for the fight against racism and discrimination.”The gift also supports the building of a new collection of artists’ works and the construction of a new educational facility that will include learning and research spaces to aid the Met’s", "The next Biennial should commission a group of curators and art-historians to create a new edition of the exhibition. “The Biennial is not dead,” Fabiana said. “It lives in the ongoing dialogue with the present, and with the present within the very walls of the museum.”   I asked her about the previous editions of the show (2008, 2010), both in the United States and internationally, and she said that she had not read the reviews for those editions. “I hope that the next edition is the one that will have a stronger presence in the City of New York than the last.” She added that she was “hopeful that this will be a landmark exhibition.”\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Alexandra Przybyl, a curator and former curator at the Chicago-based nonprofit Contemporary Futurists, as the new director of the museum. Przybyl comes to Met with extensive experience in contemporary art. She succeeds Kim Rorschach, who departed the institution on December 16, 2020 to become the next director of the Whitney Museum of American Art in New York, and will assume her post in April 2021", "The next Biennial should take place in 2020.\n\n\nThe French government has approved a €50 million ($55 million) plan to rebuild the destroyed Louvre in Paris, and the institution is now working with French and international architects to determine the exact layout, size, and composition of the monument\u0097which was built in 1926 and dedicated to the artist Jean-Michel Basquiat\u0097with the hopes of restoring the former museum on the city’s Seine River.The Louvre was hit by a massive explosion in December 2022, when a fire tore through the building’s underground gardens. The structure was rebuilt in two halves, a 1962 renovation completed in 2016 that restored the original facade but left the interior largely intact. The Louvre is currently undergoing another renovation, which will likely take four years, and the institution hopes to reopen in the fall of 2022.After the renovations, the décor of the former museum will be reconfigured for a new exhibition space, and new interiors and exterior designs will be created to accommodate the installation of the Art of the Party exhibition. The renovation of the building’s basement will also take place, and a new elevator system, designed by Berlin-based company KAM, will be installed.French", "The next Biennial should focus on “the history and the future of art” in the form of a “forum.” As part of the initiative, the museum will stage three exhibitions of work that are not currently on view. The exhibitions, “The Young and the Old,” “Photosynthesis,” and “Civilization” will all open in September. “I’m delighted that we will now be able to present these three exhibitions together,” said Hiromi Kurosawa, director of the museum. Kurosawa’s statement followed a symposium, organized by the museum, in which Hiroshige Iwashiro, the director of the Fujisan Museum, expressed his hopes for the upcoming exhibition. The exhibition “The Young and the Old” will include twenty new works by artists who are between thirty and forty years of age. The exhibition will include photographs by the same artists in a very different way—photographs that are usually not able to be seen together—and will be on view for the first time in December. The exhibition “Photosynthesis” will feature twenty works by the same twenty artists that were featured in “The", "The next Biennial should be held in the city in 2021. It will be led by the twenty-six-year-old Saudi artist Shahrazad, and will focus on themes of social justice and resilience.The next edition of the Art of Living, which will take place in AlUla, Iraq, will be hosted by the Lebanese-born, United States-based architect and urban planner Iyad Alloush. The ten-thousand-piece exhibition, titled “Living ‘In Transit,” will feature artworks created in cities including AlUla, Algiers, and Al-Qusayr, and will include the work of seventy-five artists. “When we think about what it means to live in urban areas, we think about the future, and the future in the city,” Alloush said. “We think about the possibilities of living within a city and its history and its history within the city. We think about the possibilities of keeping a connection with the city and what it means to be a part of it. . . . I have been invited to design cities and cities are beautiful. I am eager to see how the history of cities can be preserved and put to work", "The next Biennial should take place as soon as possible, and will include a presentation of the work of thirty-five artists, including Anna Atkins, Monir Shah, Jilani Nundy, and Patricia Ostrander, as well as new works by the artist-in-residence, a selection of paintings by the Colombian artist Nino Almendarez, and a performance by Pamela Abel. This year’s event will be organized as one continuous event, with each Biennial bringing together a different collection of works.“In its twelve years of operation, the Biennial has created and highlighted some of the most important and important exhibitions of the Arts  as well as the most important poetry, art, and literature,” said John McAlpine, director of the Biennial and the Arts Gallery. The Biennial’s director, Alex Linder, also commented on the upcoming event: “The new year brings us the opportunity to recommit ourselves to the art of our time. We are eager to recommit the Arts to our future and to reflect on our place in the world, as a great and important repository of knowledge and ideas.”\n\n\nThe Royal Academy of Arts (", "The next Biennial should be a platform for the creation of new works and a way for the public to engage with the work of independent artists and artists-in-residence.”Figure and work is pivotal to the museum’s long-term future, and this is reflected in the Biennial’s overarching vision. In a Q&A with Gallery of Modern Art curator Jason Mitzevich, director and CEO of the university, the museum said: “The new exploration of the museum’s long-standing collection, with a new set of curators and higher-ups, has just begun. We will have more to say about this in the coming months and years. We are eager to hear from you.”\n\n\nThe British artist and activist Tim Farron’s attempt to organize a referendum on Britain’s exit from the European Union has been stymied by the British parliament. On Monday, May 8, the House of Commons voted to defeat Farron’s call for a referendum by a vote of 232 to 208, and the Senate voted to override the British premier’s decision by a vote of 50 to 48. The result means that the UK will leave the European Union in", "The next Biennial should be set up in the former SSV Mainz building (the venue, which was converted into a brewery in 1982, has remained closed since March 2019). Stefanie Neumann, director of the Berlin Art Museum (BAM), described the event as “a real milestone for us.”\n\n\nMoMA PS1, the flagship contemporary art museum in New York, has announced that it will close its doors permanently on September 23, 2019, in a move that will also impact the other remaining locations of the institution, which are currently closed due to the Covid-19 pandemic. The institution announced the decision in a statement published by director Daniel H. Weiss on Friday, August 14, following a concerted performance by the band Weezer entitled “October Rain and October Wood,” which premiered at the museum in September. “While this is a challenging and unprecedented situation for our institution, we believe that the future of our institution lies not only in our factors, but in the future of the city of New York as a whole,” Weiss said. “We are grateful to the citizens of New York, our colleagues, and volunteers for their continued enthusiasm and support", "The next Biennial should take place in the spring of 2021. The 2018 event, titled “The Art of Manliness,” was held at the Museum of Modern Art, New York, and was presented by artist and curator Patrick Sian, who focuses on contemporary issues of masculinity, masculinity and art, and was organized by artist and curator David H. Smith.The museum will be marking the fifteenth anniversary of its opening with an exhibition dedicated to the history of the institution. Exhibitions include “Bertrand Goldberg and the painting of the body: an ‘art museum’ for the future’ (2017) and “Manifestations of the male body: art for the future” (2019).\n\n\nThe museum in London has designated the fifth site in its new £250 million Tate Modern complex, which opened on January 8, 2019, as the new home for permanent collections of the British artist and painter Anne-Marie Conte. It is currently being designed by the British designer Adrian Piper, whose firm is responsible for the revival of British art.Conte’s works are now on display in the British Museum’s permanent collection, which is housed in the institution’s new building on the site", "The next Biennial should be organised in the spring of 2020. The first edition, which took place in September-October, was attended by around 1,500 people in Cologne. The second edition, which was held in March-April, was also attended by a large audience. The third, which was staged in September, drew around ten thousand people to the cathedral in Cologne.\n\n\nThe National Museum of Scotland has appointed David Ashworth as its new deputy director. He will be responsible for training, developing, and equipping the museum’s collection of more than ninety thousand objects. Ashworth comes to the institution from the National Gallery of Art, where he has served as director of exhibitions for the last eighteen years. He succeeds Simon Mannering, who retired in June 2020 after twenty-five years at the helm of the museum.“David is a proven leader, a leader who has demonstrated a commitment to making the National Museum of Scotland a leading international arts institution,” said Neil Mulligan, the director of the National Gallery Scotland. “His tenure has been marked by creative innovation, forgoing traditional leadership roles and by a strong and diverse board of trustees. His achievements in this role will be of great value to the museum.”", "The next Biennial should happen before the end of the year. If the jump to the biennial is successful, the exhibition will mark the first time the museum has held two exhibitions simultaneously in the two cities. The panels will feature works by the artist-in-residence, Laura Owens, and will also include a presentation of a selection of works from the exhibition that were on display at the Museum of Contemporary Art in China (MCA) Shanghai, the new venue of the Biennale.The biennial’s theme, “Art and Nature” will be the theme of the second edition, “Biennale Shanghai,” which will open in September 2020. The exhibition will highlight the work of Anton Kern, Manfred Koon, John Akomfrah, and Edward Hopper.Inaugurating the project are a number of public programs and activities that will take place in the exhibition space. Kahn Gallery on the Hudson Yards project will host a special exhibition of work by Los Angeles–based artists who are collaborating with Kahn Gallery in partnership with the City of New York, as well as a series of performances and screenings, including performances by the Los Angeles–based group Improv Everywhere, a group comprising artists", "The next Biennial should be held at the Museum of Contemporary Art, New York (MoCA), in 2021. \n\n\nThe British Museum in New York has received a $1.5 million donation from a private collector. Courtesy of Alexander L. Blankenship and the Monell Chemical Senses Center, the institution received the donation in the form of a statue dedicated to Elizabeth Bove, the American scientist and chemist who first proposed the use of natural light to illuminate the behavior of living things.The donation was made by Alexander L. Blankenship, a senior member of the family that owns the company that owns the company that owns the British Museum in London, to the institution. The gift was made in 2016 as part of a larger initiative to support scientific research and the museum’s collection. Blankenship and his partner, David L. Blankenship, have previously donated $1 million to the museum. The couple also own the food company Nestlé, which is based in London, and have made several other contributions over the years.David Monell Chemical Senses Center director Edward Parrish-Parry said: “These contributions will ensure that the Monell Chemical Senses Center remains an important and respected cultural institution for generations", "The next Biennial should also include an Indigenous perspective by presenting projects that examine the history of art and the history of Indigenous art. The inaugural exhibition, “The Art of the Land,” will open in September and run until November 22, 2020.\n\n\nThe Mass Museum of Art in Boston has unveiled plans to build a new $200 million headquarters for the Massachusetts Museum of Fine Arts (MIT), which has been closed since March 13 due to the Covid-19 pandemic. Designed by Pierre-Auguste Barilleux, a prominent French architect whose works are often interwoven with that of other greats such as Frank Gehry and Frank Gehrig, the new building will be inaugurated by an exhibition of work by the French Impressionist and architect Claire O’Grady, titled Art: From a Size Less, “Claire O’Grady and the Mass Museum,” on display on the museum’s new Science and Art Gallery.The museum is currently working to re-create the environment of the institution by integrating the library, the galleries, and the museum into the campus, which is currently undergoing a $500 million expansion. The project is part of the $475 million overhaul of", "The next Biennial should be held in 2020.\n\n\nHoping to advance the careers of black and indigenous artists, the Museum of Modern Art (MoMA) in New York has merged two of its art departments in order to create the position of director of African American Art. The move, which was made in September 2019, follows a statement made by MoMA director Klaus Biesenbach regarding the need for greater participation from the museum in the city’s art world and culture. “Art is now an extension of life itself,” Biesenbach said. “African American Art is now an integral part of the narrative of the museum.”A biennial for art writers was added to the curatorial program in 2018. The organization recently received a gift of forty-one works, which were completed last year, from the Dorothea and Alfreda New York–based artist and collector Gbenga Gumbel. The gift includes works by twenty-four artists, including Goldberg, Derick Almeida, H.M. Menyabadi, Tawana Ahmed, Sousuke Nkanga, A.L. Alamo, and Aziz Amaya.\n\n\nThe Museum of Contemporary Art", "The next Biennial should be held in 2022. The current exhibition will return for a second edition in 2021. The proposal for the second exhibition was made by the San Francisco Arts and Artists’ Association (SFPA), which is affiliated with the Museum of California Art, in collaboration with Thomas James Robertson Gallery, the Santa Barbara Museum of Art, and the Museum of Modern Art. Closed until May 18 were the National Portrait Gallery, the Metropolitan Museum of Art, the Hirshhorn Museum, and the Turner Prize, which celebrates artists of African descent who have been nominated for a Medal of Honor.The Museum of Contemporary Art (MoCA) in Los Angeles has announced that its collection will not be moved from its current home in a way that would lessen the sensitivity with which it is viewed by the public. The institution, which will remain open through March 20, will instead host a series of exhibitions as it works to make its collection more accessible to the public. The first exhibition, “The National Portrait Gallery” will open on February 22 and run through March 28. The second, “The National Gallery of Art: The Making of an Icon,” which will be held at the National Gallery of Art from March 17", "The next Biennial should not be a moment of celebration but of reflection. Our generation is often told that it is the most important, yet it is the least developed, but most of all, the most capable. We are told that we are destined for greatness. But in truth, it is not yet time to think about our place in the world.”\n\n\nThe Museum of Modern Art (MoMA) in New York has received a donation of more than one hundred works by artists such as Rana Foro, Maud Floyd, and Catherine Hicks, as well as thousands of works by lesser known and lesser-known-to-art contemporary artists such as Walter de Maria, Paul Gauguin, Peter Klee, and Frank Stella, among many others. The works in the collection are part of a major restoration project that will restore the works of the Dorothea Rockburn Collection, which comprises more than three thousand works by artists from Italy, France, Germany, and Greece.One hundred works by artists whose works were on display in the Dorothea Rockburn Collection’s exhibition “Luna” will also be restored. The works will be displayed in the new exhibition, “The Future is Luna,” which will", "The next Biennial should be held in 2020. \n\n\nNew York’s Metropolitan Museum of Art (MoMA) has released a new initiative that will allow visitors to the museum a virtual tour of the institution. The program, “Tours in the Met,” will feature virtual tours that will walk visitors through the exhibits and the museum’s collection galleries in augmented reality.The tour will consist of a series of “ticks” that will respond to guests’ movements and will measure their experience. The virtual tour will feature five different timelines of the museum’s collection: the ’70s through the ’80s, the ’90s through the ’00s, and the “20s. The tour will also feature four different scenes that will replicate the Met’s collection galleries, including timelines of the Met’s acquisition of works by Mark di Suvero, Frederick De Maria, Robert Mapplethorpe, Charlie Chaplin, and Thomas Middleditch. The exhibition will run from November 19 to November 22.The Metropolitan Museum of Art is planning to open the exhibition, which will be housed in a newly renovated space in the museum, in early 2021. The", "The next Biennial should take place at the Württembergischer Kunstverein Berlin in 2022. The biennial is being organized by the Berlin-based designer project and the artist-run organization Wunderground and will run from January 28 to March 22, 2022.\n\n\nThe Institute of Contemporary Art (ICA) in San Francisco is planning to move from its current home in a historic building it recently renovated to become the centerpiece of a groundbreaking new public art project in the city. Titled The Gallery, the conceptual project will bring together new and established artists, including Florence El-Pouré and Jawad Adnan, and will launch with a preview performance by the Philadelphia musical group Black Angels.Originally called The Center, the new space will be located in the former John Muir building on the ground floor of the city. Designed by the firm Gensler and Meigs, with more than $65 million in funding from the City, the project will include a public courtyard, galleries, and a public courtyard rooftop garden. The architect will be aplenty: He will be helming a major redesign of the city’s historic Embassies, which will be completed in the spring of 2022 and will house the ICA’s permanent", "The next Biennial should be held in 2020.\n\n\nAnne Schäfer, a German artist who traveled extensively through North and South America in search of inspiration, has died at age eighty-nine of cancer. Her work, including paintings, collages, prints, and sculptures, is often considered a masterwork of the nineteenth century and is often considered a precursor to Imogen Cunningham’s painting Metamorphose (1929), which is considered the first work to express the emerging and dominant Mexican American artist John Martin.Schäfer lived and worked in Mexico City from 1929 to 1933. The artist had her first solo show in Mexico City in December of 1931, and her second at the Los Angeles County Museum of Art in January of 1932, a year after the latter's performance in a performance space known as the Zajas. Her third exhibition, at the Los Angeles County Museum of Art in the spring of 1933, showcased her work at the first exhibition of her work in the United States, at the Hammer Museum in Los Angeles in March of that year, and again in January 1933 at the Phoenix Art Museum. Schäfer’s last exhibition was at the Museum of Contemporary Art in San Francisco in September of that year.Schäfer’", "The next Biennial should take place in the fall of 2020, at an approximate date of November 4–November 7. The full list of participating artists is as follows:\n\n\nThe Mackintosh Foundation in London has announced that Halèille Saint-Saëns has been selected as its next president. Saint-Saëns will take up the post on November 1.Born in Paris in 1965, Saint-Saëns first studied at the Institut Pasteur in the city of Saint-Denis, Louisiana, before moving to New York in the early 1980s. After a brief stint in Paris, she returned to New York and became a director of the Mackintosh Foundation, where she has served as the foundation’s president and CEO ever since.“Halèille Saint-Saëns was chosen by a team of curators, scholars, and artists who collectively believe that she possesses the unique expertise and expertise to lead the Mackintosh Foundation through its next chapter,” said Mackintosh Foundation president Charles Mackintosh. “Her background, temperament, and passion for the arts combine to make her the perfect person for this critical task.”In addition to developing and maintaining a strong relationship with renowned art museums and research institutions across the globe", "The next Biennial should take place in the early 2020s. \n\n\nIcelandic artist and educator Birgitta Bjarnadóttir has been named the winner of the fifth edition of the Pelican Art Prize. Bjarnadóttir was selected for her work The Night Journey, 1973–76, a portrait of her late husband Bjarnadóttir, the creator of the artist-form and the modernist movement. The piece is one of several works by Bjarnadóttir that have been included in the exhibition, which will be staged at the Palace Museum in Reykjavík from November 26–January 2, 2020.Filmed by Bjarnadóttir, the film, which was produced in collaboration with the Icelandic National Museum, Theatrical Trailer, and Íslands Museum, The Night Journey, 1973–76, premiered at the exhibition “Between the World and You,” which was organized by artist and teacher Bjarnadóttir and premiered at the Palais de Tokyo in Paris in September 2015, and her first solo show at the Museum of Modern Art (MoMA) in New York in October 2018.Commenting on her acceptance, Bjarnad", "The next Biennial should be held at the new museum in the spring of 2020. \n\n\nThe Dutch artist Nari Ward has been awarded the 2020 Pulitzer Prize in art. The honor is the result of a twelve-year, multi-disciplinary project by the journalist and curator about a new kind of surveillance.In The Act of Killing, 2015, she uses photography to examine the power of surveillance systems and the privacy protections that shroud them. In the film The Thin Blue Line, 2016, Ward creates a visual language in which the actions of all the forty surveillance cameras in the city of Antwerp are mirrored.“In The Thin Blue Line, Ward uses photography to reconstruct the daily life of an average Dutch woman, which she describes as a kind of ‘parallel society,’” “from the daily routine of the house to the intimate moments of the night,” “from the absence of light in the apartment to the routine of the day,” “from the possible to the impossibility of a terrorist attack.” Her work is included in the 2018 Whitney Biennial in Los Angeles. A selection of her photographs will be included in “Feminine/Feminine: Surveillance Camera and the American Novel", "The next Biennial should be held at the Centro de Cultura Contemporáneo in Madrid in 2021, and the 2020 edition should be held in the city. The 2019 edition was held in the town of Villa Arenas, located in the foothills of the Andes, where a study group of artists staged a celebration in May.\n\n\nThe University of the Arts London (UCL) has become the latest arts institution to control the sale of political prisoners through its own website following a number of recent developments. The institution announced on Friday that it is planning to launch a new digital platform that will allow the public to buy and sell the artworks of political prisoners. The platform will be managed by a new team led by the institution and will launch in partnership with Artnet.UCL’s board of trustees appointed executive director Caroline Reid as director of the platform, which will be powered by Artnet. The team will work with Artnet’s existing endowment to overhaul the institution’s website and website design in order to make it more accessible to the public. The redesign will also help the institution meet the requirements of the European Court of Human Rights and with the aim of making London one of the safest cities in Europe.�", "The next Biennial should be held in Tokyo in 2020.While the project has been in the works for more than a decade, the delay was sparked by the unprecedented epidemic. In the run up to the exhibition, the city received an estimated 130,000 cases of the virus, which has since spread to 26 other countries, and civil society organizations were forced to adapt to more densely disinfect buildings and move their activities outdoors. Now, with the virus still ongoing, Tokyo Metropolitan Government (the city government), the Ministry of Education, and the Ministry of Health are attempting to come up with a plan that can keep the crowds at bay and keep the spread of the virus under control.According to the Japan Times, the government has released guidelines for how a person should behave if they are sick and have nowhere else to go but a hospital. Those who are able to work must wash their hands frequently and drink plenty of liquids, and they should avoid standing or sitting near sick people. Anyone who is feeling sick or has nowhere else to go but a hospital must remain at home and do not leave their belongings outside. If they must share a room with someone who is sick, it must be a shared bathroom or a private room.Anyone who is concerned about protecting their family is urged to", "The next Biennial should be held in the autumn of 2022. \n\n\nThe Art Newspaper has announced that Veronique de Karr as well as Laura Owens will join the photography team in the new role of visual arts director. Karr, a French photographer whose work has been exhibited at the Venice Biennale and the Stedelijk Museum Amsterdam, will assume her post in October. Wolter Peiffer, the director of the Jodl Gallery in Berlin, will step down to take up the post.During her tenure at the institution, Karr organized over fifty photographic exhibitions. She helped raise the profile of photography and its visual arts, and was instrumental in the acquisition of the works of such major artists as Henri Cartier-Bresson, Albert Lüpertz, Jean Dujardin, and David Salle. Karr was also instrumental in the acquisition of artworks by the following artists: Thomas Alberts, Hans Christian Andersen, Jack Hagen, Édouard Vuillard, Jean-Luc Neuer, Martin Luther King Jr., and H.M. Wyn.“Laura Owens’s extraordinary photographic practice exemplifies the breadth and depth of the team’s expertise,”", "The next Biennial should take place in 2021. In the meantime, the museum is accepting donations of works from around the world. \n\n\nA new survey of the state of modern art and its relationship to the culture of the city of New York has found that thirty-five percent of Americans believe that museums and collections are losing money—and that fifty-nine percent of museums are losing money because of the economic crisis.The Art Dealers Alliance (ADL) commissioned the study, Art Dealers Insights, which was conducted by Princeton University Press and was funded through a grant from the William and Flora Hewitt Foundation, and was commissioned by the museums and collections of the City of New York to assess the current state of the art museums in the city.“The study marks the first time the ADL or its partners have undertaken a comprehensive survey of modern art in the United States,” said Matthew Teitelbaum, director of art at the ADL and president of the trade group Art Dealers Alliance. “We are encouraged by the results: in ten years from now, the survey may well be the most comprehensive survey of modern art ever conducted.”The study, which surveyed thirty-nine current exhibitions, was commissioned", "The next Biennial should be held in 2021, with the first exhibition scheduled to open in 2021, with the first exhibition scheduled to be held in 2022.  Becky Mercer, director of the Biennial and the Museum of Fine Arts Boston, said: “Over the years, we have been inspired by the work of women artists who are at the forefront of providing a new and diverse vantage point for art history. Since we are committed to fostering a more inclusive and diversified public realm for art, we are excited to continue our work to connect the biennial and museum to the biennial’s history of providing a platform for women artists.”The biennial will focus on the history of sculpture, sculpture design, and installation, as well as the relationship between art and politics, art history, and the arts, and will partner with local, state, and federal government partners in order to create a new way of celebrating art. The new museum will operate in partnership with the Massachusetts Institute of Technology (MIT), the City of Boston, and the State of Massachusetts.The institution will be located in Cambridge, Massachusetts, and will be inaugurated by a special exhibition “Elizabeth Grant: The Right to Be Free.” The show will consist of", "The next Biennial should be delayed to mid-April, to avoid disrupting the ongoing exhibition, and will re-enter the capital city of Shanghai on April 13.\n\n\nThe Museum of Fine Arts (MFA) in Philadelphia has announced that artist Heather Campbell has been named the 2020 recipient of the Peter and Paul Kropf Legacy Artist Award. The $65,000 award, which is given annually to a nationally recognized artist, is one of two such awards given annually by the Kropf Foundation. Campbell will be given the honor at a ceremony at the museum on Friday, April 3.“I’m thrilled to be the first to announce the winner of this year’s Peter and Paul Kropf Award,” said Heather Campbell. “We believe that our work has the potential to have a transformative effect on peoples’ lives through our shared belief that art is the medium through which people can connect with their deepest innermost thoughts and feelings—a powerful tool for healing and healing art. Our installation The Savage Effect, a series of Polaroids taken from the artist’s Instagram feed, captures the artist’s creative process in a way that can help people understand and connect with art.”The performance-art", "The next Biennial should include the production of at least twenty-two works by women artists in the United States. It also said that the festival will aim to present three curated exhibitions—one for each state—each exhibition running an hour and a half. The exhibition will be led by Donna Karan and will host more than seventy artists, including Chantal Jang, John Karal, and Laura Owens, in addition to representatives from twenty-five other states.The first show, titled “Plastics of Plastic: 1960–1975,” will open at the Museum of Contemporary Art Denver on September 11. The second show, titled “Unfinished Business: Painting in the 1970s with Lynne Tillman,” will be presented by the Los Angeles County Museum of Art on October 14. The third show, titled “Art and Plastic,” will be on view at the Walter de Maria Art Museum in Oakland, California, from October 15–December 15.The full list of participating artists is as follows:Charles A. Nocito (California) Christopher Jones (New York)Diana Al-Maghrib (New York)Amanda Al-Jamann (New York)Ryan Allen (New York)Alexandra Braun", "The next Biennial should be in 2022, with a new exhibition every two years thereafter. The exhibition will also have an online version, currently on view on digital platform the Biennial Experience, and will be curated by the Saar Foundation. The project will be funded by a $1 million gift from the Saar Foundation as part of its Year of the Tiger, and will kick off in December 2019. The first event, “The Wind Shakes the Door,” was staged by the Kunsthalle Bern in March 2019 and ran until October 2020. The second, “The Green Wall,” was staged by the Museum of Modern Art in New York in October 2019 and ran until December 2020.“We are very pleased with the progress of our forthcoming exhibition and @museum_of_modern_art’s place in history as a pioneering institution of contemporary art and artists,” said Basil Poledna, director of the Saar Foundation. \n\n\nThe Japanese architect Tadao Ando, whose work was groundbreaking and embraced a multiplex conception of visual art, has died at age eighty-six.Born in Tokyo in 1943, Ando studied under Ikuh", "The next Biennial should be held in 2020. \n\n\nThe Sydney-based arts and cultural organization Architizer is launching an initiative in support of artists and their work in support of climate justice, a new report by the organization says. The program, called Climate Response, will include free, high-quality studio and exhibition space for artists and a gift shop that will sell archival works. The program will also include a residency program that will offer artists opportunities to create works in the community and will partner with community groups to develop programming.Architectural historian and curator Dusan John, who has curated the Sydney-based nonprofit Sanctuary for Artists, said: “Making art is a powerful way for us to cope with the climate emergency and to extend a helping hand to others struggling to cope. We hope that this inaugural residency will prove a model for future residency opportunities for artists in Sydney. We are excited to work with the city, the region, and the country to help create a resilient and prosperous future for our planet and artists.”John, a member of the newly established National Artists Council, said that the program will draw from the work of both established and emerging artists. The three-month residency will focus on the practices of a particular artist", "The next Biennial should be held at the Cambridge Art Gallery in the United Kingdom. The first edition was organized by the Cambridge Cultural History Society and was held in the United Kingdom from April 19 to April 24, 2019. Meyer & Russell, the art and technology company which represents Jonathan Mitchell, Peter Cook, and Damien Hirst, had already invited the artists to a New York studio to discuss the exhibition. But the engagement was cut short when the technicians who designed the show’s digital platforms were attacked by a group of people who believed that they were working with — rather than against— the artists. The attack was sparked by an exhibition of works by the French avant-garde artist Morotaku, a self-taught Japanese-born American, which was held at the London Gallery of Art in March.The attack on the exhibition was carried out by a group of people who wore masks and attacked the artists before they could leave the premises. The organizers of the exhibition, which was targeted because of its focus on pop culture, said that the attack was carried out by two or three people who claimed to be members of the group “Who Stole Equator” and that the group was engaged in “terrorizing culture,�", "The next Biennial should be held in 2021, the year of the Indian National Congress, and will be led by an interim director, Nidhi Walia, who will assume her responsibilities in the summer of 2022.Based in New Delhi, the biennial will focus on the concept of multiplicity and the emergent political, economic, and aesthetic effects of the exhibition “in the gallery.” The theme of the twenty-fifth edition of the show will be “multiplicity of work and of work itself.” The biennial will also stage a number of concerts and other performances that will be designed to achieve a multiplicity of effects: for example, a performance by the group Go Girls, which will be based in Mumbai, will feature two female artists, the artist N K Guha and the artist Sarita Gupta, performing a performance that explores the historical relationship between paintings and writing.Naria’s curator of the show, Raj Grewal, said: “The work of Sarita Gupta, N K Guha, and N M Bhagwat is a superb embodiment of the multiplicity of art. It is a work that is inspired by both the conceptual dimensions of art and the human condition; a work for the imagination that", "The next Biennial should be held in 2020.\n\n\nAs the United States works on its way to a shutdown due to the coronavirus, the Museum of Fine Arts (MFA) in Boston is partnering with Boston 2024 to stage a biennial of works by twenty-three artists in November. Dubbed Art in the City, the exhibition will be organized as a series of performances that culminate in a virtual reality (VR) museum. The first episode, titled Art in the City, will feature twenty-six works by twenty-three artists spanning the history of the medium. Curated by Thomas Lennon, the MFA’s director of arts and culture, the event will be accompanied by an immersive work by artist Jason Mraz, which will be presented in conjunction with a special exhibition of work by artist-in-residence Jeffrey Gibson, which will be followed by a biennial of performance and performance-based projects by artist-in-residence John Hoke, and artist-in-residence Jessica Valenti.“The MFA is dedicated to delivering a bold, visionary, and deeply personal vision of art,” said David H. Koch, chairman and chief executive of Koch Industries. “This visionary theme of art", "The next Biennial should focus on the work of veteran artists like the late architect Robert Irwin, whose work was featured in the monographic exhibition “Quadrangle and Modernism” (2018); as well as on current issues, including those of the digital age and the digital arts. The Museum of Modern Art (MoMA) will host a second exhibition dedicated to the work of American painter William Henry Fox Talbot in the fall of 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is launching a new fund to support artists in need of financial assistance as a result of the Covid-19 pandemic. The new fund, which will provide artists with temporary relief through the first two months of March, will feature work by seventy artists and will be organized as follows: March 28: “Artists in Need of Aid”March 30: “Artists in Need of Aid”March 31: “Artists in Need of Aid”March 33: “Artists in Need of Aid”April 3: “Artists in Need of Aid”April 5: “Artists in Need of Aid”April 8: ", "The next Biennial should be in 2021, and that was the essay’s final work. It also marks the tenth anniversary of the exhibition, and of its final year. While the exhibition has been an inspiration for the biennial’s work, it was cancelled following an incident in which a number of artists were injured in an explosion of a construction site, and of the exhibition’s opening, which took place in the summer of 2018. For Bénédicte de Bastos and Martine de Bénédicte, the exhibition’s demise marks the end of a journey that began in 1964, when the trio were just twelve years old. For Jacques Chirac and Christophe Pape, the exhibition was the beginning of an era.“The idea of a biennial is very new to us, but we have always been very keen to explore new ideas, new perspectives,” said Pape. “The biennial has given us the opportunity to create our accounts in a collective memory, to be in dialogue with other artists and with the world.”In the opening of the exhibition “The Biennial of Surrealism” in 1997, Bénédic", "The next Biennial should have been announced by now and will be held at the city’s Art Institute from September 17 to September 19. The announcement, which commenced with a statement from the city’s mayor, Charlie Hales, was made after the museum received a $750,000 donation from a wealthy collector. \n\n\nThe Museum of Contemporary Art (MoCA) in New York is planning to create ten new jobs in the media and performance sector over the next two years in an attempt to stem the city’s spiraling unemployment rate. The announcement came a day after the Museum of Modern Art announced it would lay off around seventy employees, and two days after Artnet reported that its hours will now be reduced by an average of three hours from September 9 to September 11. According to the New York Times, the layoffs were made in an attempt to “balance the budget by 2020,” but the institution’s president, Daniel H. Weiss, said that the cultural district’s staff will remain on the job through the end of the year.In a letter to staff members sent on Thursday, September 5, Weiss wrote: “We are committed to supporting the creative, technical, and administrative staff at Mo", "The next Biennial should be in 2020, but, according to the organizers, it is still possible to participate. \n\n\nThe Museum of Contemporary Art (MoCA) has appointed Anna-Sophie Cullinan as its next executive director. Cullinan comes to the institution from MAD Architects, where she has served as associate curator of modern and contemporary art since 2016. Cullinan will assume her new role in January 2021.“I’m excited to welcome Anna-Sophie to MoCA,” said MAD director Mat Lankford. “She is one of the movers behind the museum’s ambitious transformation into a world-class museum. She has been instrumental in shaping the museum’s long-term vision, in helping to shape the museum’s collections, and in establishing the museum’s reputation as an innovative center for artistic and cultural exchange in the Northwest. I’m confident that she will continue to shape the museum’s mission and direction as we continue to grow the museum’s international footprint and build on its impressive collection.”Prior to joining MAD, Cullinan served as a curator at the Seattle Art Museum (", "The next Biennial should be held in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of two rare works by Afro-Cuban artist Tuyen Pascual, who died in New York on September 1, 1965. The work, a charcoal drawing and acrylic sculpture named the **Cuban Bird,” which is based on a “starfish” (meaning “fish” in Spanish), and a mass-produced photograph, the “Babel” were part of a series that was presented by developer Gerhard Gehring and his wife, Joachim, to the museum in 2007.And on Monday, Gehring and Gehring’s wife, Ulrike, received the second of two gifts. In a ceremony held in the museum’s lobby, the couple announced that a new collection of works by Pascual would be released in 2021. “The Museum of Contemporary Art is very fortunate to have these rare works by Afro-Cuban artists, and to be able to present these works in our collection,” Gehring said. “We are already seeing the impact of drawing and painting on the next generation of artists,", "The next Biennial should be a tribute to the lives and work of the great leaders of the twentieth century—including Gorbachev, Brezhnev, and Stalin—who will discuss their achievements and the ways in which they shaped the course of their respective nations and the world. The theme of the upcoming edition will be the history and philosophy of the biennial, a process that will examine the legacy of the Biennial in the context of the Russian and European Imagination.”Stewart Coway, director of the Nara Biennale in Japan, said: “We at Nara, have been carefully and sincerely thinking through how we would present the experience of the exhibition in the future, and how we would celebrate the sixty-fifth anniversary of the Biennial with an exhibition that reflects the spirit of the past and future. I am proud to say that the results of our work, which takes centuries to complete, will be presented in a way that reflects the spirit of the nineties. The exhibition will reflect the breadth of the exhibition. The venue will reflect the depth of the collection. The program will reflect the breadth of the exhibition. The artists will reflect the breadth of the collection. The exhibition will reflect the spirit of the nineties.�", "The next Biennial should be held in 2020.\n\n\nFrieze and the Hong Kong Museum of Art (HKMA) have announced that they are collaborating on the 2020 edition of the Hong Kong Art & Art Deco (HWA) fair, which will take place in the city from March 22 to March 26. Organizers said the collaboration will bring an innovative and revitalized experience to Hong Kong, focusing on international exchange and new artistic projects.The inaugural edition of HWA, which was founded by Hiroshima-born Ming Hsien-cheong, was held in 2017 and featured more than 2,500 more works in the first half of the year than previous editions. The Hong Kong Art Museum held the Hong Kong Art Exhibition for the first time in 2019 and the first edition of HWA was held in 2016.“The partnership between Frieze and HKMA is a very important step in deepening the relations between the two partners, especially as the Hong Kong Art Museum has been excluded from the largest international fairs in the world, HWA Hong Kong, since 2017,” said Kenichi Iwashiteru, director of Frieze Hong Kong. “We are delighted to collaborate with the", "The next Biennial should be held in the next three years. The artist and curator also suggested that the show be moved to a nearby campus and said that the exhibition should focus on the work of women artists, and that the theme should be “love, fear, and anger.”A full list of participating artists is as follows:Aya Antilla, BoliviaArianne Baghoub, TunisiaAlessandra Bonin, BrazilAlfred Boudin, FranceAlfred Boudin, FranceAlfred Boudin, FranceAlfredo Beltrán, ChileAlfredo Bonin, BoliviaAlfredo Bonin, BoliviaAlfred Boudin, FranceAlfredo Boudin, BoliviaAlfredo Basso, SpainAlfredo Bordo, SpainAlfredo Boschi, ItalyAndy Bushman, TexasAndy Bushman, TexasAndy Bushman, TexasAndy Bushman, TexasAlfredo Caldas, MexicoAlfredo Caldas, MexicoAlfredo Caldas, MexicoAlfredo Caldas, MexicoAlfredo Caldas, MexicoAlfredo Caldas, ArgentinaAlfredo Caldas, MexicoAlfredo Caldas, MexicoAlfredo Cald", "The next Biennial should be held in 2022. \n\n\nThe Contemporary Art Museum Houston (CAMH) has announced that it is planning to close its doors in 2019 to complete a $50 million expansion, dubbed “Ebony & Ivory,” that will bring the institution’s collection closer to the sixteen-thousand-piece collection that dates to the late nineteenth century. Located on the third floor of the museum, the extension will include new galleries, classrooms, a public plaza, and public art installations.“Ebony & Ivory’s renovation marks a significant milestone in our history as we open our doors to the public and begin our journey to create an environment for the art of our future,” said Daniel Attie, director of CAMH. “The building’s new addition, a new sculpture garden, and a new public courtyard create a new environment for the collection that reflects the museum’s long-standing commitment to diversity and inclusion.”The project, which also includes the acquisition of land for the new headquarters of the museum, will also introduce two new programs. The first will be “Avant-Garde and Contemporary” categories. Categories that showcase artists’ practices", "The next Biennial should take place between September and November 2020. The theme of the event will be “Barbara Albright,” an important and often overlooked figure in the history of modern art. Compared to her art, she is generally remembered for her vacuous, pornographic art, and her sexless, drug-dealing art. The exhibition will also include works by contemporary artists such as Paul Gauguin, Pierre-Auguste Perec, and Aline Peacock.\n\n\nThe Canadian Museum of Fine Arts (CMA) in Toronto has received a gift of twenty-six works by twenty-four artists from the late Canadian designer Michael Gormley. The donation was made in recognition of his contributions to Canadian modernism, which include his influential The British Modernists, 1956, which was the first major Canadian exhibition devoted to Canadian artists. The gift includes an exhibition of work from the Gormley–designed The Metamorphoses, which opened at the CMA in the fall of 1964 and ran until the spring of 1967.“Michael Gormley was a joy to work with, a valued collaborator, and an invaluable resource for many, many years,” said museum director Debra Cooke. “We are thrilled to", "The next Biennial should be held next year, and this year’s edition will take place at the end of March. The biennial is currently curated by María Berrada, who will lead the initiative for the next two years. “The aim of the biennial is to build up the dialogue between the public and art, to try to make a real contribution to the improvement of the state of post-war art,” said Berrada. “It is a project that will be an attempt to promote the unity of culture and art, the dignity of art and the dignity of contemporary life.”\n\n\nThe US Department of Veterans Affairs (VA) has released a new set of guidelines for the care and treatment of veterans in an attempt to prevent the spread of the deadly coronavirus, which has already killed at least 161 people and sickened thousands more in the US state of New York, Massachusetts, and California.According to the New York Times, the guidelines outline a three-step process for treating a veteran diagnosed with the virus—1) restorative therapy, which involves the person being treated being given medications and fluids; 2) neurosurgical intervention, which involves the person being treated being immobilized", "The next Biennial should be held in Japan next year. The Biennial, which celebrates the contributions of women and girls in Chinese photography, will also focus on how art is a means of breaking down societal and cultural barriers and promoting the appearance of women.The exhibition will also incorporate events from the Taiwanese exhibition Tao of the East, which was held in Shanghai in 2013, in March 2019, and will present an exhibition of work by Qing Wei in April.\n\n\nThe Museum of Contemporary Art (MoCA) Hong Kong is launching a new online platform called 'Museum Moments.” The platform will provide visitors with opportunities to interact with works by local artists and curated by MoCA staff members, and will work with a new digital initiative that will launch in March 2020. “The museum’s new online platform will provide visitors with a new way to experience the exhibitions, performances, and events that make up the museum’s rich history,” said Tony Oh, director and CEO of MoCA. “Our design for the platform includes a curated experience that is optimized for the educational and promotional purposes of the museum, without excluding the public.”The institution recently launched a new digital platform called “Museum Moments.", "The next Biennial should open in the spring of 2021.\n\n\nThe French designer Yves Saint Laurent, whose distinctive geometric designs defined postwar fashion, will be immortalized at the Paris Museum of Modern Art (PMA) with this year’s exhibition “The End of an Age,” which will run until March 21, 2020. The exhibition, which is being organized by the Museum of the French Revolution (FMRI), will take up the question “What is the future?” In January, the French museum received a gift of six hundred photographs by Saint Laurent, whom the artist formerly identified with the name Paul-Etienne-Auguste.The artist’s work, which is often considered to be an attempt to apply the principles of geometric design to art, will be exhibited alongside a selection of works by contemporary artists such as Pierre-Auguste Renoir (2018) and Imogen Cunningham (2019), and the work of anonymous artists such as Antoine-François Cossette (2019), Leandro Cerullo (2018), and Samuel Riester (2019). The exhibition is being organized by the French Ministry of Culture and the City of Paris.\n\n\nThe Philadelphia Museum of Art (PMA)", "The next Biennial should take place at a location that is mutually accessible to the public. It should focus on the society-at-large and should endeavor to present an exhibition of the greatest possible variety of art, including architecture, sculpture, music, and film. We hope that this initiative will lead to a new understanding and appreciation of the contemporary art world and the wonders of the world around us.We would like to thank our collaborators, donors, and supporters for their attention and cooperation in the development of the Biennial. The exhibition is financed by Doris Duke-Bugge, the chairman of the family that owns the company Vassilios Bugge and the two founders of the company Delfina; the Thomas Alwyn Foundation; and the Dusseldorf Foundation for Contemporary Art.The exhibition will be hosted at the institution for the first time in the city of Dusseldorf since 1980. The exhibition will follow the contemporary art-world theme of “In the City of Dusseldorf,” which was inspired by the city’s historical center and the Warner Music Building in Los Angeles. The theme of the exhibition will be the history of the Biennial from the perspective of the founders of the company, who", "The next Biennial should be held in the fall, behind the scenes, and give the participants the opportunity to obtain a workshop on the theme, and to share their experiences. The Biennial will also publish a catalog. The show will be staged on the campus of the University of Washington. The 2019 edition of the Biennial, entitled The Quantum Garden, will be held in the city of Seattle and will receive funding from the Seattle Arts and Culture Alliance. The event will be curated by Nina Chaffee, the newly appointed director of the Art Institute of Chicago, and will take place in the museum’s R&D lab.  The biennial will also introduce the world to the newest and most powerful experimental materials. The 2020 edition of the Biennial will be staged in the city of Los Angeles, and will be hosted by Ralph Godchaux. The show is organized by the Los Angeles County Museum of Art and will unfold in phases, with the first exhibition opening in March 2020 and the second in May 2020. The 2020 Biennial will feature forty exhibitions that examine issues of science and technology, with a focus on the history and legacy of artificial intelligence, and will be curated by Green Physics,", "The next Biennial should take place in the spring of 2021 and will be led by Chairwoman of the Board of Directors, Kirill Golubov, and will introduce a new exhibition, Biennale Unseen, which will highlight works by curators who are not represented in the biennial. The biennial, which will be staged in the Pultusk region of central Russia, is scheduled to run until March 2020 and will include works by African artists, as well as by artists from the Muslim world and Latin America. The biennial’s curator, Yinka Shonibare, has also announced that the institution will no longer be affiliated with the Pultusk State Museum. The biennial will be replaced by a new exhibition complex that will encompass the entire collection of the Pultusk State Museum. The new exhibition will be organized in a similar manner as the exhibition was in the past, but will focus on contemporary art from Central and Eastern Europe.Described as a “fifth region” of Russia’s former Soviet republics, the new venue will be inaugurated by a retrospective of the work of Polish and Czech artists, as well as from the Mstislav Mirostovski in Moscow on March 5", "The next Biennial should take place in 2020. The 2019 event was held at the Santa Monica Museum of Art and attracted some 3,500 visitors.\n\n\nThe British Museum (BMA) in London announced today that Judith Butler will be the next director of the institution. The BMA has called Butler an outstanding leader and a champion of interdisciplinary inquiry. She succeeds David Cameron, who stepped down from the helm of the museum in March 2019, and will take up the post on November 21.“Judith’s appointment is a triumph for British museums. It marks the culmination of a decade-long strategy to reshape our relationship with the world, and we are truly excited to welcome her to the BMA,” said director Hayley Bond. Commenting on her appointment, Butler said:   “I’m thrilled to be coming to the BMA, a great city in the heart of the United Kingdom, where I can be part of a large international team, to rethink the future of museums by forging new relationships with local communities and forging new partnerships with the local communities in London, the region, and beyond. I’m looking forward to working alongside the talented team and to inspiring future generations of curators and scholars", "The next Biennial should aim to develop a new understanding of men’s and women’s work in the medium, and will bring together two of the most important surviving collections of American painting at the time, the Studio Museum in New York and the Metropolitan Museum of Art in the Bronx.\n\n\nThe Metropolitan Museum of Art in New York has awarded the Israeli scholar Eladat Yağbas, a leading expert in Palestinian art, with his first Pulitzer Prize. He was selected by the US House of Representatives for his research into the “Muslim Brotherhood, the Israeli occupation, and the American state” and was presented with the award by Representative Elijah Cummings (D-Maryland), chairman of the Congressional Oversight Committee, on Wednesday.The award also marks the first time the committee has awarded a prize to an American scholar in its history. The committee was formed in 2015 to investigate allegations that the Israeli military and intelligence apparatus collaborated with the Israeli government in an attempt to undermine the political and social rights of Palestinians and was chaired by Representative Eliot Engel, the Democratic chair of the House Committee on Foreign Affairs, and Representative Ted Lieu (D-California), the committee’s vice chairman.“The committee’s report has grave implications for American foreign", "The next Biennial should take place in 2020 at the São Paulo Joséfina, Brazil.\n\nThe 24-hour documentary series Artforum Live has announced that it will be taken offline until March 28, 2020. The series, which was also hosted on the digital platform Artforum.com and featured interviews with artists, writers, scientists, and other experts, included Jorge Palma-Tutu, John Tavares, and Katherine Tubridy. The first part of the biennial, “Paparazzi: A Retrospective” will run from March 20 to March 28, 2020 and will be followed by the second part, “Mémoires du Monde” on April 21 and May 8, 2020.Called both “arrivals and the culmination of my life,” the series was founded by architect and curator Sebastian Sirota and the French duo Françoise and Lévy in 2013 to draw attention to the controversy surrounding the pavilion design for the Fifty-Seventh Venice Biennale in 2012. “The exhibition which was decided upon was fragile and lacked the kinetic energy of the biennial,” Siro", "The next Biennial should be on February 23–March 12, 2020, at the KW Institute for Contemporary Art in Berlin. The event will focus on how artists create worlds outside of their channels and will culminate in a live performance on March 9, 2020 at the Württembergischer Kunstverein Berlin. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a final gift of more than one hundred works by fifty-seven contemporary artists, including Jared H. Taylor, Daria Camil, and Yvlov Kramarsky, as well as several rare works by French surrealists Jean-Luc Godard and Pierre-Auguste Renoir. The donation includes ten works by the late Greek artist Panagiotis, which were on display in the museum’s acquisition and preparation for its presentation of “Fatherland and Hell:” (2019) at the gallery’s art-world headquarters, and forty-third works by the late Italian architect Frank Gehry, which will be installed in the museum’s new facility.The works were selected as part of a $120,000 fund set up by the museum’s board of directors in recognition of their contributions to", "The next Biennial should take place in the city of Hengsha in the Guangdong province of China. The theme of the fifth edition is “The Golden Age of Classical Painting” and the exhibition will focus on the early years of the twentieth century. Despite the hype surrounding the exhibition, the event will be a mixed show, with most of the seventy artists who have participated in the exhibition. Originally scheduled to open in the spring of 2022, the event will now be held in the autumn—the dates for the inaugural edition have yet to be announced.\n\n\nArtist and activist Nadine Chateaubriand, a French colonialist who was imprisoned in Algeria for almost seven years over her opposition to the French colonial regime, has won the right to return to France. The twenty-five-year-old Algerian-American was released on May 23 after serving eighteen months in prison for “inciting national resistance,” an offense that carries a maximum sentence of fifteen years. However, in a stunning victory for human rights, France declared Chateaubriand “irretrievable” and ordered the immediate deportation of all persons she has been accused of inciting.“This is a great day", "The next Biennial should take place sometime in 2020. The ten-year anniversary of the exhibition will be marked by a special exhibition at the palace of the Empress Dowager and her son, the fifth prince of the territory of the Hanseatic Region, in the capital of the Kingdom of Jurnee. The exhibition will draw from the collections of six of the fourteen surviving members of the National Gallery of Art: the artists who are known today as the Hanseatic Designers; William of Ockham (1792–1874), who was a leading member of the British Royal Academy of Arts; the Russian architect Mikhail Baryshnikov (1795–1880), who is widely considered the father of modern architecture; and the Italian designer Angelo Stierlli (1793–1875), who also designed the Chengdu Art Museum in the 1960s.\n\n\nThe Royal Institute of British Architects (RBI) in London announced today that Miranda Allsop has been appointed as its next chair. She will be the first black member of the institution’s board and will take up the post on November 6.“I’m delighted that Miranda is going to serve at the RIBA for another eleven years,” said chair Richard", "The next Biennial should also address the peaceful transfer of power, which has been a source of tension in Brazil since it became the country’s new president in 1992. President Jair Bolsonaro, who led Brazil for the first two years of his administration, has been accused of undermining the Brazilian Workers Union (CWA) and its bid to improve workplace conditions. Since President Jair Bolsonaro’s election, there have been violent clashes between police and protesters in some of the country’s worst urban areas.The new exhibition, titled “Building Bridges: How Brazil and the World Can Build Bridges,” will take place at the Museu de Arte de São Paulo (MASP), the state government’s headquarters for arts and culture, on the capital’s favela campus in September. The exhibition will feature works by twenty-six Brazilian artists, including Amélio de Alvear, Juliet Otero, Lili Arsenale, Ana Mendieta, and Adrienne Arruda.“This is a moment of great change and uncertainty for Brazil,” said Aureliano Nascimento, director of the Museu de Arte de São Paulo (", "The next Biennial should be held in 2019. In the meantime, Arundathi has worked with the Centre for Contemporary Art (CCA) in Mumbai and the Mumbai Art and Design Biennial to develop an exhibition for the collection of the twenty-first century. The first exhibition, “The End of Art,” will open at the Twenty-Second Biennial at the museum in 2022.\n\n\nThe Center for Contemporary Art (CCA) in New York announced today that Adrian Piper has been appointed as its next executive director. Piper joins the museum from the Museum of Modern Art (MoMA) in New York, where he has served as director of exhibitions and curator since 2016. He succeeds Mark DiCarlo, who retired following a nearly five-year tenure after a $2 billion expansion at the institution.“I’ve been a fan of Adrian for a number of years,” said DiCarlo. “Born in 1978, he is a consummate collaborator, a great curator, and a tireless advocate for contemporary art. He has been instrumental in transforming MoMA into a thriving destination for contemporary artists and bringing more to the institution than ever before.”Piper will succeed Megan Finkelpearl, who", "The next Biennial should be held at the same venue and in the same location—the same date and in the same location as the previous event. The Festival will be inaugurated by an exhibition dedicated to Pablo Picasso, Cao Feng,  and Yukio Mishima, which will take place at a new venue and in the same location as the Biennial. “This is an extremely exciting time for us to launch the new and expanded Biennial and to be able to have a new partner in the city of Beijing, Beijing’s city hall, and Beijing’s museum of modern art—Australia’s first museum of modern art. We are eager to work with our partners to create a new exhibition that will bring together the best contemporary art from Australia and China and will continue to explore new artistic possibilities with China and Australia’s international artists, including László Pál, Hu Jie, Johnnie Rode, Liu Xiaodong, and Laura Owens.”\n\n\nThe Barbican Art Museum (BAM) in London has appointed Alexandra Hirst as its new deputy director. The museum has not announced its new director yet. Hirst", "The next Biennial should be in 2021. Commenting on the biennial, Daniel Greenberg, the director of the Fulbright Center in Athens and the Arts Council in Geneva, said: “The ongoing exhibition-making in Greece, while it is still at the start of a new phase of the country’s artistic development, is an excellent example of how the diverse communities of the country, particularly in cities such as Kiasma, can support one another and engage in an import-consciously cultural and participatory way.”\n\n\nThe Metropolitan Museum of Art in New York has appointed Mary Elizabeth Wilk as its next director. In her new role, Wilk will begin her tenure in 2020 as director of curatorial affairs. She succeeds David McAllister, who was hired as head of the campus’s European branch in January 2019.“We are thrilled with the outcome,” said David Karp, the Met’s director and chief curator. “Mary has demonstrated an exceptional record of curating and organizing compelling exhibitions, which we will continue to see through 2020. Her ability to ensure that the Met’s European wing is a vibrant, interdisciplinary platform for teaching and research, as well as to foster the", "The next Biennial should be held in the spring of 2020.\n\n\nThe Museum of Modern Art (MoMA), which recently underwent a $3.7 billion facelift, is currently under construction in Manhattan. The $3.7 billion overhaul includes the construction of a new 1,800-piece Gallery of Modern and restoration of the institution’s original, four-story building, which opened to the public in 1988.The project was spearheaded by architect Jon M. Chu, who recently stepped down as director of the Museum of Modern Art to join MoMA as associate curator of modern and contemporary art. “I had been involved in MoMA since 1988, and I’ve seen incredible growth in the museum since the renovation,” Chu said. “The Museum of Modern Art is a living institution that draws visitors from all over the world, and I’m thrilled to serve as the new director and CEO of the MoMA Museum of Art, both in New York and the surrounding region.”The organization’s board also appointed David Rutter as interim director. Rutter will be given a new role as chair of MoMA’s board of trustees next month.\n\n\nThe City of Atlanta has announced", "The next Biennial should be held at the first Biennial of the United States. The biennial will take place in 2022. As part of the use of a national treasure, the museum will adopt a new name and a new program. The museum will receive an additional $53 million from the sale of the Hirshhorn Museum and Sculpture Garden and will unveil a new David Adjay–designed building, the David V. DeCordova Center for American Art, on March 7.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines that outline how the cultural workers who made the contributions that made New York City a global cultural destination may be compensated. The guidelines were drafted by cultural economist Jonathan Bernstein, a professor at Columbia University, and Kate Nascass, a cultural affairs administrator at the city, and are part of a new regulation that was passed by the city council last week.The guidelines outline how cultural workers who contributed to making New York City a global cultural destination as well as to contributing to the city’s cultural heritage should be compensated.The guidelines state that the guidelines were drafted after the city’s cultural commission\u0097D'Arcy New York, which is comprised of ten", "The next Biennial should be held in 2022. Its current programme will be revisited in 2020. The fourth edition of the fair will be held in 2021, and the fifteenth in 2022. The institution has also released the full list of participating artists, which you can go here: The 2018 edition of the exhibition was held at the San Francisco Museum of Modern Art (SFMoMA), and featured work by a wide range of artists, including Lena Horne, Paul Gauguin, Thomas J. Mays, David Salle, and Paul Graham, among others. The 2019 edition, “Art and the City: Love, Beauty, and the City of San Francisco” (2019), was held at the Oakland Museum of California, and featured work by Robert Rauschenberg, Jean-Michel Basquiat, and Ed Moses.\n\n\nThe National Gallery of Scotland announced today that it has appointed Claire McLean as its new deputy director for collections and exhibitions. She succeeds Anne-Marie Watt, who has been the director of the museum since 2009, and will take up her new post on January 6, 2020.“Claire brings with her a wealth of experience and knowledge in the field of art and is dedicated to supporting", "The next Biennial should be held at a site in the city, where it will be organized as a public art project, and will be inaugurated by a concert by the cast of the documentary The Thin Red Line, which premiered at the Tangerana Contemporary Art Biennial last month and has already received a four-month residency at the museum.\n\n\nThe Institute of Contemporary Arts (ICA) in Los Angeles announced today that it will close its doors to the public in March 2020 and begin the process of mothballing the museum, which has hosted more than 5,000 exhibitions since it opened in 1983. The shutdown will allow the institute to devote more time to researching the causes of the pandemic, which has affected every facet of its operations.The ICA’s director, Klaus Biesenbach, said that the institute will not have a new exhibition staged for the foreseeable future unless the research and treatment center “starts working again,” which was halted last week due to Covid-19. The director said that the research center “will not be able to move forward without the close collaboration and constant support of the local, state, federal, and international community.”The closure is scheduled to take place March 23–March", "The next Biennial should take place in 2021. For the past decade, Museums Affairs and Landscape and Design (MASL) has been the main body responsible for managing the annual two-week event, which in addition to presenting the works of more than thirty-eight artists, also features a number of documentaries and short films, music videos, and artworks. The next edition will be held in Helsinki, Helsinki City Hall, and the National Museum of Finland in Helsinki.Ikko Pederson, the director of MASL, said: “The new mission of the Biennial is to renew the Biennial in a new way. That is what we are about: to make the Biennial with freshness and a new spirit. The importance of the Biennial in Finland, and in Finland in general, cannot be overestimated. The new partnership with MASL is a strong possibility for the future of the Biennial.”\n\n\nThe Royal Academy of Arts (RA) in London has appointed Kimono Catriona as its new chief executive. The forty-seven-year-old British designer and educator will be responsible for the development and execution of the RA’s new exhibition program, which is being led by director of curatorial affairs", "The next Biennial should be held at the National Museum of Art in Washington, DC, in 2021. The exhibition “isn’t over,” said Bridget. “It’s just getting started.” Biennial director, Karl Lagerfeldt, added: “I’m thrilled to say that the next Biennial at the National Museum of Art is shaping up to be, as exciting and unexpected as the first.”\n\n\nThe National Gallery of Canada has announced that it is currently closed for the second consecutive year. In a statement, the institution said that it is continuing to work with its staff on a three-year plan that will include more exhibitions, more community programming, and a “higher degree of collaboration.” The plan will also include more events around the country and in the city of Ottawa. The first exhibition opening in the new National Gallery of Canada was a double-decker bus tour through the institution’s collection; an exhibition about the history of painting; and an event that featured work by fifty-seven Canadian artists, including Paul Gauguin, Pierre-Auguste Renoir, Pierre-Auguste Berri, and Jean-Marie Curie.", "The next Biennial should take place in March 2020.The festival will also be supported by the Foundation Maarit Jumeirah. The organization will provide approximately $1 million for the event. \n\n\nThe Italian artist Marcella Brugnara has been awarded the Prix de l’Art, which is the equivalent of the Pulitzer Prize in art, for her latest installation—a performance-capture work that was made in collaboration with Italian architecture and design firm Gennaro Cipollino.The prize was presented by the Fondazione Prada, with the collaboration of Brugnara, Stefano Gaspo, and Stefano Cipollino, in Rome on Tuesday.Brugnara’s work, called Espresso, was made for the movie The Revenant, which premiered at the Venice Film Festival last week. It was created by the Italian architect Lorenzo Cipollino, who was commissioned to create a new kind of display space for a cinema theatre, and is based on a series of interconnected glass and steel structures that mimic the architectural form of a coffee shop or a café.Featuring Olivier Messager, Sebastian Lang, Tim", "The next Biennial should take place at the University Museum of California, Los Angeles, in 2020. A new exhibition of works by contemporary painters will be presented at the Venice Biennale in 2021. And a catalogue of works by Alfred Lord Tennyson will be presented at the London Biennale in 2022.\n\n\nThe Smithsonian’s National Museum of African Art (NMA) in Washington, DC, has received a gift of two of its historic African American artworks. The four-thousand-piece collection, which includes works by forty-six of the forty-eight artists represented in the collection, was donated to the institution by the philanthropist and collector Jim Thompson in 2017. The gift includes a pair of works by African American artists, Elijah Muhammad and John Frank, as well as a painting by Almine Rech. The donation also includes a piece by artist and activist Lottie \"Tula\" Tawny of the Black Panther Party, a nonviolent civil rights organization that advocated for black liberation.For years, the NMA has been a haven for African American art, which is protected under the 14th Amendment, which guarantees the equal protection of the laws. Last year, the institution received a record amount of art,", "The next Biennial should examine the relationship between the film, performance, and and performance and film in the twenty-first century. We believe that the Universal Archive is the ideal venue for this work.”The 2019 exhibition will feature work by seventy-eight artists, ranging from the late 1800s to the early 20th century, including Gillian Heejka, Andrew Kreutz, Griffin Cook, Kiefer and Kreutz, Hans Christian Andersen, Hans Christian Andersen, Vincent van Gogh, Derrida, Karl Jaspers, and Oskar Eustis. The exhibition will also feature work by an eclectic group of internationally acclaimed artists, including William Sott, Tata Pujari, Benedict Mitchell, Peter Orullian, and Yoshitomo Maruyama.\n\n\nThe Center for Contemporary Art (CAA) in Manhattan has appointed Mark Engstrom as its next chief executive and will begin hiring for the position in the coming weeks. Engstrom, who will assume his post on January 3, 2020, will be responsible for institutionalizing the organization’s mid-to-late-decade collection strategy and", "The next Biennial should prepare the ground for further articulations of the themes, the ethnography of the exhibition, and the proposed programs.”The 2019 event will be selected by the Oxford Festival, which will present the first edition of the twenty-fifth Biennial in 2021. The 2019 edition was staged in August. The 2020 edition will be staged in September.\n\n\nThe Library of Congress has added sixteen works by sixteen artists to its collection, including Klaus Mädek, Sam Peck, and Mary Ellen Mark. The works, which were digitized and catalogued by a team of five experts led by Wojciech Kopec, the curator of modern and contemporary art at the Museum of Fine Arts in Houston, Texas, and the Museum of Modern Art, New York, will be added to the collection as part of the restoration project.“The Library of Congress is committed to supporting the full range of artistic expression in the United States. The newly added works reflect the Library’s proven ability to build on the legacy of a very important American artist with a high degree of artistic achievement,” said Sharon Suss, director of the Library of Congress. The works were selected from a pool of twenty-nine artists who applied by the", "The next Biennial should take place in the Winter of 2020–20 and will invite more than 500 artists from the Gulf States to participate.The exhibition will also feature work by a select group of British artists, including Alan Rickman, John Aldridge, Richard Haydon, and Tracey Gordon, and will feature artists from Kuwait, Qatar, Saudi Arabia, and United Arab Emirates. The event will run from December 8 to December 10, 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has released a visual arts and design guide that aims to help visitors navigate the gallery space by highlighting the current state of the art in the museum and offering tips for navigating the collections and exhibitions in the exhibition spaces. The first section of the guide, “Topical Gallery Space,” focuses on the currently open exhibition spaces in the museum, including the newly renovated, “Topical,” between the exhibition spaces. The second section, “Foreground,” highlights the museum’s art holdings from the 1940s to the present and is organized around two themes: the history of the city of New York, and the history of the environment. “Foreground” is a virtual tour of the entire museum,", "The next Biennial should be held in 2020.\n\n\nThe $10 billion redevelopment and expansion of the Museum of Modern Art (MoMA) in New York is coming to a close with the unveiling of three new exhibitions, ranging from $50,000 to $250,000, at the institution. The first, “The Mutilated Dream: The Life and Death of Pablo” will run August 3–August 6, 2020. The second exhibition, “The Unfinished Business: Transformations and Reflections” will run August 9–August 11, 2020. The third exhibition, “The Museum of Modern Art: The Velvet Years” will take place August 16–August 20, 2020.“We are very excited to close our doors once again to the museum and embrace the cities and the city experiences around us,” said Museum Director Bart Cohen. “MoMA has been an indispensable laboratory for the creative life of New York for more than eighty years. It is now the museum’s turn to continue to meet the challenges and ideas of our times with an ambitious and ambitious program. We are eager to take on these next challenging and important years as part of MoMA’s legendary history.", "The next Biennial should focus on the complex interconnections between contemporary art and politics, society, and society’s images. It should have a meaningful composition and an organic structure that can reflect the diversity and complexity of contemporary art and politics. It should be able to organize research and critical discussions that address the current state of affairs, the flow of information, the will of the people, art.” In addition to the 2020 exhibition, the museum will stage a retrospective of Jean-Michel Basquiat’s “Sitting in the Sun,” which will introduce new exhibitions of contemporary art, in the spring of 2021, and a new exhibition of works by Noyna Haruna.\n\n\nThe Pushkin State Museum of Fine Arts in Moscow has created a new position in the Russian department of culture and has appointed an assistant curator of contemporary art. The museum also hired Anna Miroshnichenko, the former director of the Fondazione Prada and a friend of the institution’s director, Valentina Vassilevska, as associate curators. In their new roles, Miroshnichenko and Vassilevska will work with the director, Andrei Soldat, to present the", "The next Biennial should plan for an empty art museum. The museum should also consider the possibility of reopening with a new exhibition series and other programming, although the current programme is not designed to support that.As it stands, the biennial is running a few weeks behind schedule. Since the exhibition is not part of the budget for the biennial, it cannot afford to cancel the show. For the second time this year, the exhibition is not screening its work. The third time was in January, with the inaugural installment being held in March. Last year, the exhibition was closed until July. In the past, when the exhibition was cancelled, the museum was forced to postpone the launch of a new exhibition. The decision to postpone the event is not surprising, since the museum is currently facing a huge financial crisis due to the economic meltdown in 2008.The Biennale de Lyon was invited to return to the city of Lyon by Edmond Biennale, the owner of the private art museum Lisson Gallery, in collaboration with the city council, following a request from the city council last May. The city council also wanted the exhibition to return to the city of Lyon, where it has been since the institution opened in 1980.", "The next Biennial should take place at the National Gallery of Art in Washington, DC, in 2021. Hirshhorn Museum curator Lisette B. Hollebaumer said the institution is planning to hold an exhibition in the museum in 2022. In a statement, the National Gallery of Art said: “The theme for the upcoming edition of the Biennial is ‘Dreamers in the Dream.’ We are thrilled to be collaborating with the MPD and the city of Detroit to create a platform for the artists that have been impacted by the opioid crisis.”\n\nNew York City’s Department of Cultural Affairs (DCLA) announced today that it received a $220 million donation from the estate of photographer James D. Higgins. The gift comes on the heels of an award of $110 million from the Higgins Foundation, which also established the James D. Higgins Foundation for the Arts in 2017. The funds will go toward the organization’s preservation and future stewardship of the photographs taken by the famous American photographer, the great-grandson of the late American photographer and moviemaker Alfred Lyon Higgins.“James D. Higgins was one of the most important photographers of the twentieth century, being able to capture", "The next Biennial should be held sometime in the spring of 2021.\n\n\nThe Solomon R. Guggenheim Museum (S.G.G.) in New York has received a gift of seventy-one works of American art from the artist-collector John Mysko. The donation includes works by Matt Grogan, A. P. Matson, Ray Eames, Carol of Richmond, Thomas Owens, Paul Gauguin, Robert Irwin, Douglas Huls-Rivas, Tao of the East, and the artist-favorite Painter Serpa Rincón.The gift also includes a certificate of authenticity attesting to the authenticity of the works by Mysko, who was born in New York City and raised in Los Angeles, California. The monogram, which honors his parents, was designed by Museums Association of America senior director Larry Mollenu.Rincón, a partner of Mysko’s fifty-eight-year-old clientele, began collecting American art in the 1970s. Although he primarily focuses on twentieth-century artists, Rincón also has notable holdings of Eleanor Graham, Michael Chabon", "The next Biennial should be in the spring of 2021.Founded in 1912, the museum houses more than 7,500 works. Its location in the city of Los Angeles means that it is able to hold more exhibitions annually, and it has recently been working to change that by constructing a new $100 million, glass-enclosed exhibition hall, dubbed the Arts Pavilion, which will open in the spring of 2021. Ms. Gibson said that the architects of the Arts Pavilion are considering whether the Pavilion can be reconfigured to include a smaller museum and will likely present the work of a group of artists in 2017. Despite the pavilion's renovation since 2015, the pavilion will probably remain a work in progress as it undergoes a $2 million facelift.The Biennial will also include performances, residencies, and other programming, including an exhibition of the artist’s work in 2018. Its next edition will take place in 2021.\n\n\nThe French Ministry of Culture and Education has announced that it will open the country’s first museum dedicated to the art of the Arab world, the Danze-Algeria in Lyon. The institution will be inaugurated by a presentation of work by the legendary Egyptian sculptor Salah al-D", "The next Biennial should be held in 2021.\n\n\nThe British Museum (BMA) has announced that it is planning to introduce three new exhibitions at the institution in the coming years. The first, titled The Making of Hannah and Her Sisters, will return to the BMA in 2021 and will focus on the construction of Hannah and Her Sisters, a brilliant and influential group of artists. Its second, titled The Modern Museum, will be a companion exhibition to Hannah and Her Sisters and will focus on “modernity” and its transformation by the BMA into a museum encompassing a collection of more than 1,600 artworks from the collection of the BMA. The third, titled The Modern Museums, will be the first exhibition to be held at the museum in several hundred years.“Each of these shows will be the result of an innovative and transdisciplinary approach of BMA curators and artists, combined with an ambitious and ambitious plan to shape the future of art at the museum,” said Mianne Delveny, chair of the museum. “Together they will challenge the limitations of the museum as we strive to make the most of our extraordinary collection, and they will engage with", "The next Biennial should be staged in 2021. The exhibition will also include a new book, “The Power of Artists: The Visual Arts in the Making of Modernism” (2019); “On the Body: Beauty as Persistence” (2019); “Yin and Yang: The Art of Eating” (2019); “Celery: From the Art of the Garden to the Art of the Cook” (2019); and “From Chaltchib: The Art of Chocolate” (2019).The exhibition will also inaugurate a new class of courses offered by the university for students working in the visual arts, which will be presented by Professor Paula Swallow and will offer students a new appreciation of the medium. The first class will soon be held at the university and will provide students with a new well-known case study on the Egyptian artist Naguib Mahfouz, whose work examines the history of the museum in Alexandria and its relationship to the Egyptian art and culture.The show will also introduce a new setting for the exhibition, the AUVSE, a new academic program in the arts and the AUVSE Gallery, which will allow the international exhibition of the show. The first show will be", "The next Biennial should be held in 2021. The next show should be held in 2022. The next exhibition should be held in 2023. The next exhibition should be held in 2025. The next exhibition should be held in 2026. The next exhibition should be held in 2030. The next exhibition should be held in 2035. The next exhibition should be held in 2040.The next exhibition should be held in 2043.“There is no doubt that the rebirth of the Victoria and Albert Museum is at the heart of the city’s future,” said Steve Laing, founding director of the Museum of Contemporary Art. “New York has undergone a profound transformation since becoming the cultural hub of the United States, and we are committed to continuing that transformation. We will keep working to develop new and innovative ways for visitors to connect with the Museum to experience the extraordinary breadth of our collection.”\n\n\nNew York artist Pilar Otero’s monumental, four-thousand-work installation The Magician and the Thief, 2000, is now on display at the Museum of Modern Art in New York. The work, which comprised forty-two sculptures that were inspired by and performed by the artist, is a", "The next Biennial should take place at São Paulo in 2019, and the exhibition should be in the same location in 2020. \n\n\nThe Museum of Contemporary Art (MCA) in New York has appointed James McKean as its first director. He will take the helm from Todd Ruiz, who has led the museum for more than twenty years and is currently the executive and artistic director of the Contemporary Asian Art Museum in Beijing, and will take up his new post on January 5, 2020.“James’s appointment is a testament to the strong leadership and vision of the museum’s previous director, Laura Mulvey, and her vision for the MCA,” said Mulvey. “I’m thrilled that he has chosen to come to the MCA under her leadership and to continue to expand and create new opportunities for our community through the MCA’s collection and exhibition programs.”In her first public remarks since joining the institution, McKean said: “I’m excited to join the team at the MCA and to build on the important work of Laura Mulvey, the Board of Trustees, and the staff. I’m looking forward to connecting with our audiences,", "The next Biennial should take place in 2022, and the last will take place in 2023. Should the organizers of the show fail to secure the necessary funding, the show will be canceled. The organizers also cited the pressure from the public and other stakeholders as the reason for the cancellation. On Monday, the exhibition’s organizers also announced that the show would return to the Museum of Contemporary Art, Miami Beach in 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released the budget for the third and final phase of the renovation of the Metropolitan Museum of Art, which was completed in 2017 and is currently undergoing a $450 million expansion. Titled Rebuilding the Met, the program aims to encourage local, state, and federal governments to collaborate and work together to better conserve and manage cultural heritage assets and assets that will be restored in the process.“This is an exciting time for the Met, for the city, and for the nation,” said Dora Gabay, the Met’s deputy commissioner of planning and design. “The Met’s renovation is part of a comprehensive plan that will make the Met’s collection, exhibition, and performance spaces more accessible and in better", "The next Biennial should include an analysis of the artworks in question and the state of our knowledge about their recent histories. The theme of the fifth Biennial should be “The Future Is Present,” and a selection of contemporary artworks should be inaugurated. The theme of the fourth Biennial should be “Balance,” and a selection of contemporary artworks should be inaugurated. The theme of the third Biennial should be “In Defense of Memory,” and a selection of contemporary artworks should be inaugurated.\n\n\nThe Shiraz Museum in Shiraz, Iran has received a donation of fifty-six works by thirty-six Iranian artists in its current exhibition, “The Artist’s Asses,” which opened on March 3. The show, which features works by eighty-five artists, includes works by Ahdaf Soueif, Deborah Sargent, and Ali Sajwani, among others.“The exhibition reflects the vision of the founding members of the Shiraz Group, namely Esha Farah, Nima Marzukh, and Karim Rashid, who were committed to bringing a unified and rich competition to the museum for the first time"]