["The next Biennial should also focus on “natural history,” said Naima J. Keith, president of the museum. “The biennial should be a historical document of the United States’ historic journey, not a continuation of it.”\n\n\nThe Center for Contemporary Art (CCA) in New York announced today that Jodi Lynne as its director. Lynne comes to the museum from the Museum of Modern Art (MoMA) in New York, where she has served as interim director since January 2019. She succeeds Jeff Koons, who departed the institution in July 2019 after more than twenty-five years to become the first CEO of the Walt Disney Company.“I’m thrilled to be joining the CCA,” said Lynne. “The CCA is a mission of a visionary cofounder and visionary curator, Jane Panetta, and her teams. It is a legacy that I’m deeply committed to preserving and enhancing. I am deeply committed to working with artists from the CCA’s collection, as well as with artists who work in the CCA’s portfolio to expand our knowledge and collection of the CCA’s artists.”Previously, Lyn", "The next Biennial should take place in 2022. The date has yet to be announced. \nIstanbul’s National Museum of Art opened in 2007 and recently completed a major renovation that added a new 50,000-piece display dedicated to the life and works of Turkish modernists and created a new visiting gallery space. The museum will reopen in 2020. \nThe MAM Fair, which celebrates and showcases the work of a select group of emerging and established artists in Istanbul, has announced its 2020 lineup. The event will be held at the MAM Gültsıç Museum in Cappadocia from September 29 to September 30. “In the past ten years, I have participated in the MAM Fair through exhibitions organized by my private projects and through the institution of art as a whole and have been inspired by the artists who are represented in the fair that are also inspired by the institutions at the MAM Gültsıç Museum,” said Hasan Altind, director of the Gültsıç Museum. “The next edition will be a celebration of the opening of the third phase of the Akdeniz, which consists of a retrospective of the work of five young Turkish artists, and will take", "The next Biennial should take place in the summer of 2020. It will feature works from the collections of the Museums Authority; the National Galleries of Scotland; the Royal Academy of Arts, London; the Museum of Fine Arts, Los Angeles and San Francisco, and the Museum of Contemporary Art, Chicago.\n\n\nThe Bosphorus Bridge, a massive, glass-enclosed bridge spanning the Black Sea in the center of the city of Blackpool in England, has been restored to its former glory. The refurbished bridge, which carries tourists between the United Kingdom and Romania, was completed in 2015 and was placed in service by the Museum of Contemporary Art (MoCA) in London in commemoration of the anniversary of the Bosphorus Arms, a British-backed agreement that gave Romania control of the Black Sea canal and cut the United Kingdom off from the rest of the continent.The bridge, which carries 45,500 passengers a day, will also be able to handle large-scale events and international events. The design includes landscaping around the bridge and the Blackpool Promenade in the city, creating a more urban setting for the biennial. Artworks and public gathering spaces along the Thames River will be relocated and enhanced, and the surrounding area will be", "The next Biennial should be held in 2020.\n\n\nThe Contemporary Art Museum Miami (CAMM) will announce in the coming weeks the recipients of the 2020 Michael Marshall Award, which were established by the Michael Marshall Foundation to recognize outstanding contributions to the arts in Miami during the first half of the twenty-first century. The award jury will comprise returning artists, including Alysha Ahuja, Paul Graham, Jamal H. Johnson, and Rayyane Javaid, and will announce the final winners in April.“The jury’s decision to recognize and honor the work of the winners was made in the context of a cultural renaissance that is taking place in Miami,” said Kaytlin Lennon, an associate curator at the foundation. “What began as a recognition of outstanding contemporary art through the Marshall Awards in 2001 has evolved into an annual award recognizing the work of artists who have had a significant impact on art history, and who are working today to shape the future direction of the award.”The 2019 winners are:Drew Lindsay, The Low Belly, New York, 2018Michael Marshall AwardHonoring the work of Shaye R. Sims, 2019Drew L. Jackson, The Adige B. Art Museum, 2019N", "The next Biennial should open in 2020, with the exhibition “Avant-Garde Art,” which will be divided into twenty-six sections and titled “Art and Politics.” The pavilion will be inaugurated by an exhibition “Between the Sun and the Moon,” the work of the Israeli artist Haim Steinbach, which is currently on display in the exhibition “NIRIN” at the Kunsthal Charlottenborg in Sweden.\n\n\nThe Museum of the City of New York (MOM), as part of the renovation of the former site of the city’s Metropolitan Museum of Art, is launching a $500,000 fund to support projects that will improve the museum’s accessibility and accessibility needs. The initiative, which is part of MOM’s commitment to expand the reach of its collections and to promote more art in the city, was initiated with the passage of a local tax bill. The legislation defines a project as “initiated by a municipality or political body within the City of New York’s jurisdiction” and allows MOM to ask the federal government for $500,000 for the first phase of an accessibility and accessibility solution, and up", "The next Biennial should take place at the museum in 2020. The museum has announced that nine artists will take part in the event, which will take place in the institution’s new space in the city’s Art Deco, designed by architect Hisham Ben Saar. Daniil Kaba, Babar Altindar, Daisuke Tsuda, and Saima Shah will also have a seat at the museum.For the past ten years, the organizers have hosted the biennial at the Museum of Modern Art in New York. The exhibition was a stop on the first leg of the inaugural Museum of Modern Art Initiative, which was initiated by MOS Architects, the firm founded by Leon Black, and Francis Pinault, and was launched in late 2003. The fourth and final biennial, titled “The Artist’s Place” in 2010, was held at the Smithsonian American Art Museum in Washington, DC.The ten-day event will once again take place in the newly renovated Biennial Museum, which will be inaugurated by a new sculpture by artist and activist Antonia Carusone. The first exhibition, “Astrid", "The next Biennial should be held in 2020. “Artists are like any other business,” said Tadeusz Hruszkiewicz, director of the Polish Academy of Fine Arts. “After the management of the institution, whether it be at the end of the last decade or the beginning of the next, will be decided by the public.”The biennial will take place under the supervision of Berlin-based curator Volker Bode, who is also a professor at the Wunder University in Kassel and a member of the Wunderkammer Foundation, and will organize a number of activations, including a concert, a photography show, and a symposium. Its first edition, “Themes of Motion” (2019), drew twenty-six artists and was held at the Academy of Fine Arts in Warsaw. The second edition, “Themes of Life” (2018), was held at the Warsaw Ghetto Museum and was organized by the Wunderkammer Foundation in collaboration with artists Ali Hockley and Zbigniew Wojciechowski.The third edition, “Themes of Death” (2017), was staged at the Academy of Fine Arts in Warsaw and", "The next Biennial should be the nineteenth and the first will take place in the San Francisco Bay Area. The second will take place in San Francisco. The third will be held in New York. The fourth will be on October 29 and will be held at the Museum of Modern Art. The fifth will be on November 22 and will be held at the Museum of Contemporary Art, Houston. The sixth will take place in the seventeenth and will be held at Miami Beach. The seventh will be on November 27 and will be held at the Maryland Institute College of Art, Baltimore. The eighth biennial will be held in the twenty-third and will be held at New York’s Museum of Modern Art. The ninth biennial will be at the San Francisco Museum of Art, and the eleventh will be at the newly-renovated Museum of Modern Art in New York. The next edition of Art Basel Hong Kong will be held in October 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the reopening of more than 1,500 arts and cultural landmarks, including the Metropolitan Museum of Art, the Bronx Museum of the Arts, the Brooklyn Museum", "The next Biennial should be held in 2020. Current conceptual designs of the pavilions include an Earth and a spaceship on the front of the black cube, a disk-shaped structure on the back of the cube, a lizard on the front of the cube, and a female figure in a pink hat.The commissioning of the pavilion was made possible through a gift from the founder of the private company Artmic Incubator, Adam Weinberg. Weinberg, who previously owned several pieces of the private collection, and his wife, Bertha, donated $500,000 to the museum in 2017. Since then, the couple has spearheaded the commissioning and building of fifty new works by the museum.\n\n\nGreater Manchester Art Gallery (GMA) has appointed Sarah Kent as its new director. Kent joins the institution from the Royal Academy of Arts (RA). She succeeds Leece Marlborough, who has helmed the academy since 2015, and will begin her new role in March. “Sarah has played an integral role in transforming GMA into one of the UK’s leading cultural institutions and will continue to shape the museum as a leading arts institution,” said GMA director Joanna Higgs. “", "The next Biennial should be held in the fall of 2021.\n\n\nStefan Els, the German artist who designed the exhibition space Mondrian, has died at the age of eighty-two. Over the course of his career, Els designed eleven exhibitions and curated several others, including the Berlin Biennial (1977), the Venice Biennale (1978), and the Berlin Protégé (1978–79), among other venues.In a 2014 interview with the German magazine Die Tageszeitung, Els said that his collaboration with Mondrian was not a one-time deal, but a recurring one-time project, a way of achieving a more fundamental goal: to integrate art and politics.“I prefer to think of Mondrian as a laboratory, where the artist discovers and experiments with new techniques, in order to make art for art’s sake,” Els said. “In a way, Mondrian is an extension of my very life.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) is launching an effort to encourage the sharing of works of cultural heritage with local, state, and federal governments across the city. The initiative, called the Share the Pieces, program,", "The next Biennial should be held at the London Gallery in October 2020. In the meantime, a selection of twenty-five works by the artists represented at this year’s show will be presented at the Biennial in London in March 2021. This spring, the Biennial hosted Hannah Wilke, Nari Ward, and Simone de Beauvoir. The artists who are represented in the exhibition include Arsht, Angela Carter, Benedict Anderson, Kirsten Barlow, Lise Bristol, Kirsten Cooper, Lydia Cunningham, Paul Cox, Barbara Cox, ,Artie Crockett, Eva Corbijn, Natalie Cawthorne, ,Melissa DeBord, ,Thomas de Koon, ,Hannah Jacobs, ,Thomas de Maizs, ,An image from the exhibition at the Museum of Contemporary Art, New York, the Netherlands, in the exhibition “Art from the Show.”\n\n\nThe Indonesian artist and activist Katja Alga, who drew attention to the country’s religious establishment through her work, died in London on April 3. She was eighty-eight", "The next Biennial should be held in 2021. The show will remain closed until April 23. The full list of participating artists is as follows: The Black Sheep Foundation (UK) Banal (US) David Bowie (US) Fernando Bonifacio (FR) Hans Claussen (DE) Hiel Chanel (US) Lauren Chernow (US) László Danysztejn (DE) Lavinia Dickson (US) Tina Dolan (US) Tina Dolan (US) Victoria Eichhorn (US) Marita Eisfeld (US) Victoria Eisfeld (US) Brian Eriksen (US) Brian Eriksen (US) Brian Eriksen (US) Pamela Eisman (US) Stephen F. Malle (US) Amanda Falk (US) Daniel Fales (US) Daniel Fales (US) Michaela Felt (US) Christina Felt (US) Karen Haslett (US) Katherine Kane (US) Robin Leach (US) Samuel L.", "The next Biennial should be held in November 2020. \n\n\nThe British Council has invested £45 million into the future of Tate Britain, the museum’s main arts and cultural initiative, in an attempt to reduce the institution’s annual operating expenses. The capital campaign, announced on Monday, follows a series of moves by the organization that have cut costs and shifted programming in an attempt to reduce the museum’s annual operating costs.The capital campaign aims to reduce the museum’s annual operating expenses by 30 percent by 2020. The Cabinet Office of Culture and the Festival, which handles the council’s overall spending, is giving £8 million to the museum, £6 million to Tate, and £3 million to Creative England.“Tate is one of the few remaining large publicly supported cultural institutions in the United Kingdom that continues to operate at peak capacity, with around three thousand visitors a day, and we are determined to continue that trend,” David Cameron, who is leading the campaign, said. Cameron previously pledged to return £15 million of the £30 million that the council spent reducing the museum’s budget—the sum was subsequently increased to £35 million—and said that the", "The next Biennial should be staged in 2020, with the theme, “The Body and the Body Politics,” a reference to Robert Irwin’s famous essay in a Sanford-Jackson Lewis catalogue, The Body and the Politics of Life.The exhibition will feature work by seventy-seven artists, including Shaikh Omar Saeed, Zoya Umar, Ingrid Savitz, Lise Surtees, and Aurélie St-Denis. The 2018 edition featured work by seventy-six artists. \n\n\n\n\n\n\nCIRCA has released the list of seventy-seven artists whose works will be included in the fourth edition of the Los Angeles Biennial, “The Structure of Art: Contemporary Research in Film and Video” (LACMA 2020), which will take place at the LAX Museum of Art from September 18 to September 20. The exhibition will also include new works by artists whose practices are inspired by the noxious gases created by industrial processes, such as Anna Atkins, Anthony Dzubak, and Kylie Minogue.Dubbed the “science fiction subversions of film and video,” the event will take place in a former Jezebel factory in the Santa Monica Mountains", "The next Biennial should take place in the spring of 2022. The historical city of Biennale will host the sixth edition of the exhibition this fall. The first Biennial was held in 1962 and the last took place in 1988.\n\n\nTwo hundred artists, artists-in-residence, and other arts professionals are participating in a petition launched by the Museum of Modern Art (MoMA) in New York to create a new platform for cultural exchange in the city following the September 11, 2001 terrorist attacks. “The current exhibition space at MoMA is a thin veneer of cultural activity that is largely bereft of any kind of institutional connection,” the petition reads. “The current exhibition space for Artforum’s Summer/Fall 2019 edition is full of empty spaces and blank walls. It is a space that is devoid of any kind of curator, any kind of dynamic, any kind of moment, any kind of story.”The artists’ request “to return their spaces to their original purpose and to be honored and recognized for their contributions to the art world and their efforts in supporting and promoting artists.”The petition, which was spearheaded by artists Kayode Ojo, Rachel Jujuyo", "The next Biennial should take place in 2021 and will present a retrospective of the exhibition “Ateliers d’Arles” (1926–1928) at the Prado. The show will also host two additional exhibitions: “Toward a New International: Art and Politics in the Age of Stalin” and “Günther von Braun,” which will be staged simultaneously at the Paris Museum of Contemporary Art and at the museum of Germanic Art.The exhibition will be organized in two parts: stage one will focus on the careers of the three greatest German industrialists, namely Georg Fischer (1909–1975), Gustav Klima (1919–1990) and Dietrich von Braun (1901–1970). Stage two will be about the relationship between the artist and the state. The exhibition will also include the Biennial’s first edition, “Württembergische Kunstverein Westfalen,” in Berlin in 2022.\n\n\nThe Museum of Fine Arts (MFA) in Cleveland has received a gift of more than two hundred artworks from a group that includes Frank Gehry, Jack Scorsese, David Kincaid, and Ed Moses. The donation", "The next Biennial should include a presentation of the work of the San Francisco Museum of Art, curated by Kouyaku, of an exhibition of paintings by the Los Angeles County Museum of Art, curated by Patricia Arquette, and curated by the Boston-based artist Chris Atkinson. The fifty-ninth edition of the Frankfurt Biennale will take place in the German city of Frankfurt from September 28 to October 2, 2020.The curators of the upcoming edition of the biennial are Arne Glimcher, Benjamin Gneiss, Marco Cervetto, Jochen Haag, Peter Knapp, and Kasper Koenig. Commenting on the upcoming event, Fotopf, the organizers of the Frankfurt Biennale, said that the Frankfurt event will be a “socially relevant, politically charged and culturally relevant experience.” Artnews added that the event will be “dedicated to an urgent cultural crisis that threatens to destabilize and restore the cultural and social fabric of Europe.”\n\n\nThe Royal Academy of Arts (RA) in London has appointed John Sheridan, the American curator of fine arts and design, and his wife, Melissa, as curators of the 2019 edition of the National Arts Centre (", "The next Biennial should be held in 2023, and the Southbank Centre in London should also be redeveloped.\n\n\nThe Italian museum Gio Ponti has removed two early works by Swiss painter Franz Neumann—a Plexiglas, acrylic sculpture with a transparent skin, and a glass sculpture that resembled a half-eaten sandwich—after they were found to be in violation of the country’s new anti-discrimination legislation.The institution removed the Plexiglas work from display at the Museum of Modern Art (MoMA) in New York on June 2, and the acrylic sculpture from display at the Museo Nacional Centro de Artesia (in New York) on July 10. Both works were part of a “Prixigère,” which distinguishes between paintings and sculptures and states that the artist’s art must “implement the new kind of art.”According to the Art Newspaper, the institution cited the introduction of the new legislation as an excuse for the removal of two works—Pieter Marinus’s The Mummy’s Mummy, 1955, and David H. Mather’s A Dance with Death, 1936—both of which are now", "The next Biennial should take place in 2020. “For this year’s edition, we have been working hard to make sure that we have the most modern and accessible exhibition of works by artists from the most famous and most vibrant of European families,” the artist-run museum said in a statement. “We have tried to keep the breadth of the collection as balanced as possible, while at the same time introducing new and important works from the family, and from the very beginning of the exhibition we have sought to present the full range of the contemporary art from every continent.”The newly commissioned works will be presented by curators Jan and Marta Graziani, with the help of artists Joan Miró and Andrea Molaro. The exhibition, titled “From the Flux to the Flux,” will open at the Museum of Modern Art in September and run through March 26.\n\n\nFrieze, the world’s largest and most influential arts organization, has announced its nominees for the twenty-ninth edition of the The Art of the Party, an annual celebration of America’s cultural and cultural heritage that has taken place in New York City since 2013. For the inaugural edition, the organization", "The next Biennial should be held in May 2019. Deborah A.J. Liebman will serve as director of the exhibition. The biennial will feature the first exhibitions devoted to the work of American sculptors in more than twenty years and will draw from contemporary artists from across the globe. The biennial will also be hosted in Los Angeles, New York, and San Francisco and will introduce new work by contemporary artists and engage with themes of memory, self-expression, body politics, and the nature of the self.\n\n\nThe Fifth International Exhibition of the Artists of Central and Eastern Europe (BGE) in Breslau, Poland, has announced that the event will now take place from October 13 to November 14. At the conclusion of the exhibition, which will feature seventy works by seventy artists from thirty-nine countries, a new program of presentations, performances, and residencies will be launched.“At this time of global crisis, we are facing a global challenge to the core values of our societies, our common humanity, and our common humanity together,” BGE artistic director Anna-Sophia Brzywyńska said. “An exhibition dedicated to artists from the region would have been a great", "The next Biennial should take place in 2021, and a selection of the December exhibition will be staged at the end of 2021. The project, which was founded in 2007 in the think tank Guggenheim Büro, was founded by Andreas Gide and Ursula von der Leyen. The second exhibition, which was staged in 2008, is currently on view in the exhibition space in Frankfurt.\n\n\nArtforum has learned that the Los Angeles County Museum of Art (LACMA) is preparing to launch a new digital initiative, Art Guides, that aims to help artists navigate the museum’s collection by giving them information about upcoming exhibitions and public events, as well as advice on how to plan for funerals and memorials.Launched on September 1, Art Guides will work with 350 LACMA employees to help them navigate the museum by providing them with personalized suggestions on upcoming exhibitions and public events and will debut with the upcoming exhibition “Spirits: Think of Me.” The show will feature four works by fifty-one artists\u0097including Adriana Varejão, Lelia Garcia, and Cristina Medeiros\u0097and will run until December 29.João Rodrigues, the curator of the event", "The next Biennial should take place in 2020 and will be hosted by the Museum of Contemporary Art in St. Louis. The exhibition will showcase the work of a select group of contemporary artists and will showcase the work of twenty-four artists selected by a committee chaired by Manfred Kamm, chair of the museum’s curatorial board. The full list of participating artists is as follows: Agnieszka/Mona AlbersAmitis BakhtiarAmitie Moritz & Olafur EliassonArie BerenbaumAlexan Salah Alexander & Eileen M. ThompsonKaty Stroud & Sarah T. ArmstrongChristine MariscalCatherine O’Leary & Anna O. Kwame KweiColleen McConnegan & Lora Novello (c)Catherine O’Leary & Anna O. (c)Catherine O’Leary & Katja Wittig (c)Catherine O’Leary & Kiki Winton (c)Curator/spokesperson: Tom BerenbaumTina HartiganTyeyana Kasper (c)Colin MillerTroy Northgate (c)Hannah Bernard (c)Ethan Klages (", "The next Biennial should be an open-concept platform for reflection and participation in a multidisciplinary community of scholars and practitioners, centered on the theme of the exhibition. It should consider the ways in which the material and material culture of the museum intersects with our own practices and those of our communities.” \n\n\nThe Fall/Winter 2019 edition of the Metropolitan Museum of Art was canceled due to concerns over the coronavirus, which was first reported on December 6 and caused over 136,000 people in the US to become infected. The exhibition “came under intense scrutiny after a sickening incident at a Mentor Art Museum in West Palm Beach, Florida, on December 5, which left six people dead and thirty-two injured. The museum was forced to cancel all future events and move the show, ‘The Evolution of Cultures,’ to a different venue in Manhattan. Its full list of exhibitors is as follows:THE WOLVERINE BOARDPHOTO—NIRVANA, INDIAHANDED ART,PAPERWORK,SCANDAL,SHOW,SHOWCASE,SHOWCASTE,SHOWER,SHOWERCARE,SHOWERCARE2,SHOWERC", "The next Biennial should take place in 2021, with the first performance taking place in the first exhibition presented by the Biennale. \n\n\nThe United Kingdom’s Great Hall of the House of Commons has voted to become the eleventh member of the European Union to suspend all collective and individual actions and allow the Parliament to decide on the first instance whether Brexit is legal. The decision, which was taken after lawmakers voted by a huge majority—61 votes to 27—to back Brexit last week, has left the government with the power to trigger article 50 by March 22.While the decision has sparked a number of political protests, including from members of Parliament from Conservative, Labour, and the Liberal Democrats, it was also welcomed by political opponents, who say that the government has overreached in attempting to regulate the departure of EU citizens from the UK. While the government’s argument that there must be a successful transition period—which it claims only takes three years—is being questioned, the motion to suspend all collective actions in the UK was supported by a whopping 97 percent of MPs.“We are now in a crucial stage of the negotiations, with the UK negotiating a great deal of new information and we cannot see any reason why we should not be", "The next Biennial should open in 2020 and will be the first exhibition at the newly opened museum since 1972. The biennial will include a selection of curiosities created by former staffers and will feature new works by artists such as Mark di Suvero, Marcella Brugoni, and Paul Gauguin.\n\n\nThe Museum of Fine Arts, Houston (MFA) announced today that it is instituting new policies to protect the health and well-being of its visitors and its staff, and is preparing to launch an online viewing room that allows visitors to view the latest exhibitions and special projects on its collection. The new management team also plans to improve environmental sustainability practices at the museum and to incorporate new recycling and waste-disposal methods.According to museum director Ron Cuno, the changes will reduce the risks of Covid-19 and help ensure the museum’s long-term sustainability. “We are committed to being an active member of the community in helping to shape changes that heal the planet,” he said. “By implementing new and innovative ways to share the MFA’s collection with our visitors, we hope to continue to achieve that.”The MFA has already introduced new ways for visitors to see", "The next Biennial should be held in 2021. The Biennial of Women’s History will be held in 2021. \n\n\nArts and Culture Minister Ruairí Quinn has named photographer Joseph Gribbin as the next chief artistic director. He succeeds Jane Griffiths, who retired in May after a decade at the helm of the Government’s New Art Gallery at Dublin, and will take up the post in October.Gribbin, who has worked for the gallery for twenty-seven years, is responsible for representing the works of artists in exhibitions and collections throughout Ireland and is the author of several books, including Lost Art: A Graphic History (Berghain Books, 2008) and The Art of the Age: Photography in the Seventies (Iliad Books, 2019). He also curated the first annual Joseph Gribbin/Jane Griffiths Exhibition in 2007 and curated the 400-year-old exhibition of works by Anna Atkins at the Museum of Modern Art in New York in 2009.Gribbin’s first book, Lost Art: A Graphic History (1988), was nominated for a Queen’s Literary Prize and won in 2007. He also authored two other books. The first was Photography", "The next Biennial should be staged in the spring of 2021, according to organizers. The event will also be expanded upon, with two more international versions of the exhibition, which will take place in 2020 and 2021, respectively. In the meantime, the public will have the opportunity to see the work at the gallery in the Museum of the City of New York from March 21 until March 23.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that the institution will welcome visitors back to the institution for a special exhibition commemorating the initiative that launched the current exhibition season. Called The Return, the exhibition will feature work by forty-three artists and will run from March 14 through March 16. The artists chosen for the exhibition will be announced in the coming weeks.“As we approach the seventy-ninth anniversary of the launch of the Modern Exhibition, we are excited to celebrate the work of forty-three artists who have chosen to return to the museum to participate in the exhibition,” said Mallory Rubin, director of the museum. “The institution has changed so many things since we launched the Modern Exhibition, and this is an unprecedented year for the arts. We are creating new opportunities to engage audiences with the", "The next Biennial should take place in 2020.\n\nA statement from the 14th Venice Biennale said: “The organisers of this year’s Venice Biennale are extremely satisfied with the exhibition’s performance, which was very high quality and diverse, and which contained new and interesting works. The exhibition also challenged the viewer to think about how art can be of service to others and about the power of art to improve our lives.”\n\n\nThe Halifax Art Gallery has appointed Darshan Singh as its new associate curator of modern and contemporary art. Singh arrives from the Alexandra League Gallery in London, where she has served as associate curator since 2016, and will assume the role of associate curator of the upcoming season.“We are delighted to welcome this highly experienced curator to our team and to the gallery,” said Alexandra Skarstedt, the gallery’s director and chief curator. “It is an important step in her development as a curator and her ability to collaborate with our colleagues and guests in the contemporary art world and her global network beyond the gallery will greatly assist our work in preparing for our upcoming exhibition.”In addition to her curatorial duties, Singh will develop and present programming focused on the", "The next Biennial should be held in early 2020. The Kunsthaus has yet to announce a date for its first exhibition in Helsinki.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to open a new studio and exhibition space in the city in 2020. The arts space, called the Kunsthaus, will be located at 900 S. Santa Fe Avenue. The organization said that construction of the $50 million facility will begin in the spring of 2020.The new venue will be designed by architect Minna Lappalis and will be located in a mixed-use development called the Museum District. The project will include a gallery, a library, a public courtyard, and an auditorium. Construction is estimated at $50 million.“I had a vision of the Museum being a museum in my own backyard, and I wanted to create a space where people could come together to have a good time and have a voice at the Museum,” Lappalis told Curbed. “This is an extension of that vision, and that’s why we created the Museum. I’ve always wanted to create a space to have conversations with people and have them feel like they’re at home.”L", "The next Biennial should take place in 2020, and the third in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it has received a gift of twenty-nine works by seventeen artists, including Robert Irwin, Alan King, and Alighiero Emanuele, as well as a selection of architectural works, including a twenty-one-foot-long, stone sculpture by John Edmonds, an early member of the Guggenheim’s original team, which was dismantled in 2014.One of the works that will be on display in the museum’s new exhibition “Art of the Body: The Art of the Body,” will be a new documentary project, which will follow the artists as they embark on a journey that will take them around the globe. The show will also include the exhibition “Robert Irwin: Body,” an exhibition of works that address issues of health and well-being that will include a meditation on the body and will be on view in the museum until March 3, 2020.The gift, which includes a number of works that were not previously on view, was part of a multiyear campaign to display the work of contemporary artists—in addition to King", "The next Biennial should take place in 2020.<|endoftext|>Sue Winograd, who has served as director of the Walter de Maria Art Museum in New York since 2014, has announced that she is stepping down from her post in February 2020. The museum, located in the Little Italy neighborhood of Manhattan, has been closed since March 19 due to the Covid-19 pandemic and expects to be fully operational by May 2020. While the institution has been working to prepare for the coronavirus outbreak since March of this year, it has faced additional challenges since the museum opened in the early weeks of April. The state of New York filed a lawsuit against the museum in March of this year, but a judge dismissed that lawsuit in June, citing New York’s Public Health Department’s position that the state had not shown any evidence that the institution was in compliance with federal regulations.Also challenging the museum was its agreement with the state to take over the lease of the building where the eighty-five-year-old museum is housed. The lease agreement, which has been in place since 2009, was approved by the state legislature in 2017 and signed by Governor Andrew Cuomo.The state argues that Winograd breached the lease by using the museum�", "The next Biennial should take place in 2019.”The exhibition will feature work by the artists and scholars who have worked with the museum, including Hannes Sennels, Alfred H. Barr, Elizabeth Peyton, and Oliver Sacks, and will attend to the themes of the three science fiction works that were selected for the exhibition: “The Human Network,” 1966, “A Clockwork Orange,” 1974, and “The Day the Earth Stood Still.” Promising to “unify time,” the exhibition will also reflect on the role of art and science in conveying information, how the art of visual art can be used to communicate with people in the future, and the importance of science in society.\n\n\nThe Metropolitan Museum of Art, New York, announced today that it will open a major expansion of its collection of more than one hundred notable works by artists from the late nineteenth to the early twentieth centuries. The museum’s new 45,000-square-foot headquarters will boast of a new reception area, a glass-enclosed glass-enclosed environment in the museum, a dedicated space for special exhibitions, and a new large-scale installation, “An Iconoclast Century,", "The next Biennial should take place in 2021, and the first in 2022.\n\n\nArts Council England, a UK-based organization that represents more than 4,600 cultural organizations, has announced that it is reaching out to over one thousand museums and galleries in the United Kingdom to ask them to consider renouncing their tax-exempt status. The organization will also offer them the option of becoming “active participants in our review,” an initiative that aims to reduce the museum’s tax bill by 50 percent and help promote greater collaboration between arts institutions.“At this crucial crucial juncture, when UK museums and galleries are grappling with the impact of the coronavirus and tens of thousands are getting sick, I call for them to take a step that actually makes sense for them and the wider political and economic landscape.”If museums and galleries are forced to close temporarily, they can apply for emergency aid from the UK’s arts fund, the National Lottery Heritage Fund. The arts fund will give smaller arts institutions up to $500,000 to help with closing costs during the coronavirus pandemic. If the arts fund can’t help, museums that are contemplating relocating their main exhibition space—such as the National Gallery", "The next Biennial should be held in 2021, and the first in 2024. “The project was started with the request of the staff and the students who want to organize a biennial in Brussels and who are experiencing difficulties because of the closure of their college and are in a position to organize one in the capital,” the commission’s director, Johanna Benites, told the Art Newspaper. “The new project plan will solve the problems of the first biennial, which is an exhibition based on the theme of the exhibition, and will also enable us to organize a new exhibition in the capital in 2021.”The local government of Antwerp decided to remodel its existing building in the city of Antwerp (the Museum of the Modern Art in Bezeline, the Center for Contemporary Art in Brussels, the Van Gogh Museum in the French city of Strasbourg, and the Nationalgalerie des Beaux-Arts in Brussels) in 2013, following a public outcry over the destruction of the Beaux-Arts building in the city in 2016. The renovation involved the scrapping of almost two hundred works, including pieces from the Van Gogh Museum in the French city of Strasbourg, and the Nationalgalerie", "The next Biennial should be held in 2020, with the dates to be announced in 2021. The exhibition is a continuation of the initiative which first started with the exhibition “New Critical Art: Historicism” (2017) at the Museum of Modern Art in New York.It will now be curated by Sinthujan Kant, a curator based in Delhi and New Delhi, and will run from February 9 to February 13, 2021. The inaugural edition will feature the work of thirty-one artists, including Racha Shrestha, Tamika de C. and Ravi Iyer, and will showcase the work of forty-five artists, including Maria Macchi, Hasso Pliny, and Olu Miah.The prize is one of the largest ever awarded by the International Council of Art Museum Directors (ICAMD).\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than three thousand photographs by Pierre Fimin, which were purchased by the public museum in 2015 for its permanent collection. The photographs, which were acquired by Fimin through his estate, were donated to the museum as part of its acquisition of more than seven hundred works by the American painter, who is best known for creating works that", "The next Biennial should take place in 2021, but the plans for the event have not changed since it closed in 2019. The announcement included a promise to continue to engage with the community and to present a \"more contemporary and topical\" edition. The biennial was founded by the Greek artist and collector Euclid Kepes, who was assassinated by the terrorist group the Islamic State (IS, formerly ISIS/ISIL), in Athens in 2007. The event was awarded the prize for its first edition by the Museum of Modern Art in the United States in 2009.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to move nearly three hundred works from its holdings into storage following an expansion project that was funded with $188 million from the billionaire industrialist and collector Warren Kanders. Kanders is the founder of the private art conservation firm MCH Group, which has interests in including Philip Johnson, James Cuno, and Frank Gehry, and he plans to donate the works to the Smithsonian Institution in Washington, DC, in a project that will begin in 2021 and run through 2024.“This is an extraordinary project,” Kanders said in a statement. “More than twenty years ago, when MoMA was still a", "The next Biennial should take place in the winter of 2021–20, with a new exhibition of paintings by the Tunisian artist Saa Al-Kiddani\u0097a decade after his first exhibition in New York at the Institute of Contemporary Art\u0097opening on March 17. Last year, the Tunisian artist Saa Al-Kiddani won the Rabat Biennial Award for his work D-Day, which was exhibited at the Museum Stierle in Belgium.\n\n\nThe Museum of Fine Arts (MFA), Boston, has appointed Molly McFarland as its new artistic director. McFarland comes to the institution from the Museum of Fine Arts, Chicago, where she has served in various management roles since 2012. She succeeds Carol Oehlen, who retired in December 2019 after fifteen years at the helm of the museum.“Molly McFarland is one of the most distinguished curators of contemporary art in the United States,” said Carol Oehlen. “Her work has been exhibited at the Minneapolis Institute of Art (MNIA), the Boston Art Museum, the Boston Public Library, and the Boston Art Gallery, among other venues; and she will continue to be a valuable resource to", "The next Biennial should be held in the first half of 2020, with the exhibition “The Oxford Biennial” scheduled to open in the United States in 2021. The 2020 event will also be hosted by the Museum of Contemporary Art in the Arts, where it will be staged in the fall of 2021. The 2021 edition will mark the seventy-fifth anniversary of The Oxford American.“In order to achieve this, the Biennial will be a challenging and exciting festival of inclusive and interdisciplinary thought, drawing from an even more inclusive and interdisciplinary collection, with much of the best art and design coming from both America and the UK,” said Rineke Dijkstra, chairman of the company, and John D. Healey, president of the museum.Dubbed “The Third Wave,” the exhibition will feature work by artists such as Gramsci, César Morales, Hélio Oiticica, and Sam Gilliam. The exhibition’s opening reception will be held at the Oxford Union on January 9 and will run until January 11.\n\n\nThe Association of Art Museum Directors (AAMD) announced today that it has endorsed three new talent-driven initiatives that will engage with the needs and interests of Los", "The next Biennial should be in the spring or early summer. Those interested in contributing should contact the University of Amsterdam.\n\n\nThe Los Angeles County Museum of Art (LACMA) has launched an online survey aimed at helping the public understand and connect with the institution’s collection. The survey, “The Art of the Collection,” will be hosted by LACMA’s online portal and will ask visitors to trace a series of 16 works by twenty-three contemporary artists, most of whom are represented in museum collections. The survey will run for ninety days and will include questions about the works’ origins, contemporary trends, and influences.The exhibition will present the works in “A Time of Transition: Art and the Crisis of Order” (2019) and “The Art of the Collection,” both of which are currently on display in the Los Angeles County Museum of Art (LACMA), which is currently undergoing a $10 million renovation. The renovation will include the addition of an additional fifty works, bringing total curatorial projects to twelve exhibitions. The exhibition will run from March 20 to March 22, 2020.“The Art of the Collection is an important milestone in LACMA’s history as", "The next Biennial should be held sometime between February and March. Organizers indicated that they expect the venue to remain closed for at least a month.The exhibition’s theme “Human Rights” was at the core of the first Biennial, held in Abu Dhabi in 2012, and was repeated in the second, held in the United Arab Emirates, in 2015. The exhibition reopened in March.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a significant gift of more than 1,500 photographs by the American photographer Margo Heriot, which will go a long way toward securing the museum’s long-cherished vision for a new building and the museum’s location in the city’s historic Adams-Old South End. The gift, made by Allan Campbell, chairman of the Heriot/Campbell family, comes as the museum prepares to welcome the first visitors to the museum in 2021.“We are delighted that the Campbells have provided this important gift to the MFA,” said museum director Matthew Teitelbaum, who has been working with the Campbells for more than a decade to develop the museum’s vision and the vision of the building “since the late 1970", "The next Biennial should include the experiments of Sylvia Bochereau and’s “Plasmagoria,” as well as its first exhibition dedicated to the work of John Akomfrah. The 2019 edition is slated to open on March 29.\n\n\nAccording to Artnet, the Alfred P. Sloan Foundation has awarded the Chicago-based artist $60 million for his first solo exhibition of work since his death. Set to open in the city in February 2020, the show will feature work by seventy-five artists, including Jon Banks, Cristina Bochereau, Mary Beth Edelson, Paul Graham, and Richard Anuszkiewicz, and will feature works dating back to the late 1940s.“She is the original companion artist in the city’s Art Museum, and her work is reflected in the museum’s collection,” said museum director David Greenfield. “In addition to her impact on the city of Chicago, she is a pioneer and a pioneer in art history and theory. She is a pioneer in art history and theory, and a pioneer in art. She is a pioneer in art history and theory, and a pioneer in art. She is a pioneer in", "The next Biennial should be held in the spring of 2021, with the exhibition to open in the fall of 2021. The biennial will be held at the TAKO-MITSUBISHI building in Tokyo. The Contemporary Art Museum Tokyo (CAMO), which has already announced plans to move the exhibition from the institution, will stage the first exhibition in the new location in 2020. The exhibition will then return to the TAKO-MITSUBISHI building for a second exhibition in 2021.The show will be hosted by Kunihiko Fujii, who has worked at CAMO since 1998, and will focus on the theme “painting and the body: a ‘painting of the body,’” according to the New York Times. The gallery will also continue to operate as a not-for-profit organization.\n\n\nThe Museum of Contemporary Art (MoCA), the Los Angeles County Museum of Art (LACMA), and the Yuz Museum in Tokyo have teamed up to commission new works by artists such as Tyler Ayers, Sean Ghebaly, and Robert Irwin. The works will be on view in the retrospective “Over the Horizon”, which will run from March 19 to March", "The next Biennial should include new works by the artist-to-be. As of Friday, only four works had been selected to represent the exhibition, including his first retrospective, “The Breath of Grass” (2012–13), and “The Path of a Dreamer” (2011–12), as well as a piece by the artist-in-residence, Tanya Bláninka, which is currently on display in the exhibition “Bipartite: Art in the Age of Resistance.”The full list of participating artists is as follows:Artforum\n\nArts QuarterMuseum in New York\n\nCitizens Bank Museum of Art (CBL) in Pittsburgh\n\nDirk Nilsen Gallery in New York\n\nHeritage Foundation Museum in Los Angeles\n\nGeorgia O’Keeffe Gallery in New York\n\nThe National Gallery of Art, Washington, DC. Summary:The twenty-fourth Biennial of European Art, held at the Museum of Modern Art in New York from March 19 to March 21, 2019, has announced that it is having its next edition, “The Future Is Now,” staged at the Diller Scofidio + Renfro–", "The next Biennial should take place in 2020, and will be a reflection of the city’s artistic heritage. “The biennial is a working model for how we will make new public art in a city that is facing many challenges,” said Nicholas Negrete, the director of the Biennial Contemporanea. “We are following the same lines of thinking as the Biennales of the Americas, and we want to do it in a city that has the same cultural and social momentum as the new Biennales of Art and Architecture.”\n\n\nThe museum of contemporary art (MoCA) in Los Angeles is suing the city of Pasadena, California, over a half-million dollars over the closure of a local art museum last fall, the Los Angeles Times reports. The suit, filed by former customers of the institution, alleges that the closure was in violation of the Americans with Disabilities Act (ADA). The plaintiffs claim that the museum failed to mitigate the impact of the pandemic on the space by removing items that were not needed by the public and that it also failed to pay more than $2.5 million to creditors, including the artists who would have been represented by the artists’ last names.", "The next Biennial should be staged in 2022, the next in 2023, and the next in 2024, and will be on SH6 in Beijing.\n\n\nWith the exception of a brief period following the publication of a new set of rules on the sale of non-essential art in the country, which came into effect on March 16, the country has been largely quiet since the pandemic began. On Friday, the Chinese government announced that it has lifted its restrictions on exports of arts and culture, allowing more than 6.2 million items to leave the country for the first time since the pandemic began. The majority of this merchandise was art, but more than one million items were made up of household goods and other consumer goods.China’s state-run museums, which are plagued by a number of chronic health problems, have been working hard to rid the country of the virus. On Thursday, the Beijing Museum of Fine Arts (BMA) launched a $300 million campaign to rid its complex of the coronavirus, and on Friday, the museum opened its new exhibition hall in the capital; it also said it was working on revamping its exhibition space.On Tuesday, the Shanghai Museum of Fine Art announced that it had already begun cleaning", "The next Biennial should be held in 2021. Its next edition will take place in the city of Chicago, the birthplace of Francis Drake, and will run from January 5 to February 14. The museum will also host a special exhibition of works by the biennial’s curators, Howard and Rosemarie Sutton, on March 7.The new exhibition “The Future Is Present: Selected Art from the Biennial,” which was curated by Anna-Marie Witten, will inaugurate the museum. The biennial’s inaugural exhibition, “The Future Is Present: Francis Drake’s Experimental Art,” will include works by twenty artists, including Olga Albizu, Anselm Kiefer, and João Núñez, and will open at the end of March.\n\n\nThe Royal Academy of Arts (RA) in London announced on Monday that it will no longer be able to pay karaoke artists if they do not sign a new Collective Bargaining Agreement (CBA). The move follows a series of criticisms made by the Royal Shakespeare Company about the culture sector’s role in attracting young audiences and diminishing the company’s artistic output.The academy’s director, Ham", "The next Biennial should be announced in October, and the exhibition will officially open in January 2021.The full list of participating artists is as follows:Gedney GalleryDubai: Nominated by Stephanie Bailey (New York), Nominated by Matthew Booth (New York), Nominated by Michael Buckley (New York), Nominated by Thomas Chaudhari (New York), Nominated by Andrea Gartenfeldt (New York), Nominated by Randy Gallo (New York), Nominated by Domenico Dolotti (New York), Nominated by Osman Khan (New York), Nominated by Paul Graham (New York), Nominated by Benedict Kenrick (New York), Nominated by Claudia Leoni (New York), Nominated by John Salter (New York), Nominated by Sara Reznikov (New York), Nominated by Peter Schäfer (New York), Nominated by John Siskind (New York), Nominated by Kevin Trescar, Nominated by John Stevens (New York), Nominated by Robbie Sutton (New York), Nominated by Billy Lynn", "The next Biennial should take place in Bali in the spring of 2021. The next Art Basel Hong Kong edition should take place in December 2021. The 2018 event in Paris will mark the seventeenth edition of the fair, which will be held at the Palais de Tokyo in March 2022. The event will be held at the Louvre from March 15–March 17. The twenty-fifth edition, which will be held in October 2022, was originally set to begin in March. The event has also been presented as a way to introduce new art to the French market and, in the past, has been held at the Museo d’Arte Moderno in Venice. The seventy-second edition of the fair will be held in March 2024. The thirty-fifth will take place at the Museum de Beaux-Arts in Lyon. The sixty-ninth edition, which will be held in March 2025, will be staged at the Museum of Modern Art. The seventy-eighth edition, which will take place in March 2022, will be held at the Bechko Museum in Vienna. \n\n\nThe Contemporary Art Museum (CAM) in New York City has appointed Jessica Herrera as its next executive director", "The next Biennial should focus on the history of the festival and on the biennial as an institution for contemporary art in Europe. Its board will be made up of expert curators, artists, writers, and other experts from France, Italy, the Czech Republic, and Spain. The institution will also attempt to organize a competition to determine the best work of the twenty-one year old artist, and will present the works of sixty-six lesser known and more experienced artists.\n\n\nFrance and Italy have concluded a landmark partnership agreement that will pave the way for the exhibition of works by the two countries’ artists in the coming months. The exhibition, titled “From the Stone to the Mirror,” will begin with a group exhibition of works by American artist Allen Klein in June 2020 and conclude with the show “Pérez de los Muertos,” which was organized by the city of Trieste in July 2020.“France and Italy are joining forces for the first time in the twentieth century in a major cultural project that will transform the relationship between Paris and Rome,” said Paris’s culture minister Franck Riester and Rome’s culture minister, Beatrice Lorenzin. The grand opening of the exhibition", "The next Biennial should be held at the Museum of Modern Art in New York in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles recently announced that it will move the exhibition “Exhibit 530: The Modernist Movement,” a lecture series that first appeared in 1971, from its current home on Wilshire Boulevard into an outdoor space in the city’s historic Art Deco building. In a statement, the institution said that it is “committed to returning to the Garden where the first exhibitionists in the twentieth century arrived.” The move will allow MoCA to add 10,000 square feet of exhibition space to its existing campus.“The move is part of a long-term plan to create an environment for the exhibition series that will advance the museum’s mission, promote the work of the curators, and provide a forum for the public to experience and experience the exhibition space in the building,” said MoCA director Amanda Levin. The institution has also invested more than $2 million into improving the Garden. The organization spent $750,000 on restoring the garden in 2016 and $1 million in 2017, as well as upgrading the building and renovation of the gardens.According", "The next Biennial should be held within six years. “We are aware of the various concerns of our audience, who are demanding changes and further discussion,” said Diya. “We are, however, deeply concerned by the recent events in Europe, and we are acutely aware that this challenge is unprecedented in nature and scale.” The potential loss of nearly €100 million in revenue would be devastating for a global arts organization that relies on sponsorships and donations to fund some of its operations. In an attempt to compensate for the financial impact of cancelling the event, the panelists have agreed to move the exhibition forward by a year by raising an additional €10 million through a special event, “The Future of Art and Art History,” that will take place in January 2021.According to the Art Newspaper, the event will also include “added value for the sponsor,” which will be evaluated on the basis of the effectiveness of the event. The organizers said that the “added value” will be determined by a panel of art historians and curators comprising former trustees of the Biennial, organizing curator and scholar Mallikarjun Khilji; Wolfgang Pfeifer, director of the Haus der Kun", "The next Biennial should include at least four new works by the artist. The first one will introduce the public to the concept of a metamorphose, a state of continuous transformation that is the basis for many of her paintings but also those of Maurice Merak, Rineke Dijkstra, and Arne Glimcher, among others. It will also include a performance, luncheon, and a discussion. \n\n\nThe Hong Kong-based artist Peter the Great, who explored the concept of composition in his works, has died at the age of eighty-eight.Born in Japan in 1938, the son of a businessman, Peter the Great was raised in a conservative Catholic family in the rural town of Inchaku, in the Shizuoka prefecture of Shizuoka. In the late 1950s, Peter moved with his father to the coastal city of Aki, where he learned to make and paint. He went on to study at the prestigious Tadao Ando Studio in Kyoto for the next two decades and then became a member of the 是彻山 (The Great Feathers) group, which also included artists such as Tadao Ando, Yoshikazu Masuda, and Tadayoshi", "The next Biennial should be held in 2021, and the museum\u0097once described as a “monument to the sensuality of the 1960s\u0097would likely reopen as early as 2022.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it is suspending the exhibition “Spirits in the Air: From Studio to Stage,” a joint exhibition with the California Academy of Sciences (CalArts) in Los Angeles, which opened on October 6. The exhibition, which was curated by artist and curator Judy Losch, was meant to mark the 100th anniversary of the band The Band, which formed in 1951 and released its debut album, “Spirits of a Summer Day,” in 1957.The show’s director, Dan Castellano, said the show’s temporary closure was due to a combination of the exhibition’s “too-early” opening, an ongoing investigation of the history of cinema, and a controversy about the value of certain works. Considered a landmark work of art, the performance, which reimagined the role of film in the 1960s and ’70s, was one of the first works to feature the work", "The next Biennial should be held in 2022. The city has been working with the Harvard Art Museums (HAMD), Massachusetts Institute of Technology (MIT), and the Massachusetts Bay Transportation Authority (MBTA) to determine the location and the duration of the event. On January 6, the city of Boston released a statement about the biennial, which will take place on the campus of Harvard University, from Mayor Martin J. Walsh, who said: “We welcome each and every one of our visitors to Boston as we continue to design, design, and rethink our city. The new pavilion is an exciting addition to the city’s architectural heritage and our legacy. The architects of the Boston Architecture Biennial are proud to have inspired generations of Bostonians through their vision and through their design.”The exhibition will showcase the work of 150 contemporary artists, and will feature works by such artists as Anish Kapoor, Nari Ward, and David Salle. The pavilion will also include public programming, including a concert series by the Boston Symphony Orchestra, a book signing by Yoko Ono, and an art installation by the Boston-based artist Jodi Throckmorton.Other highlights include Merry Stoltz, who designed the", "The next Biennial should be held in 2020.\n\n\nThe British Museum (BMI) in London has appointed Andy Sargent as its next director. In his new position, Sargent will oversee the curation of the museum’s collection of more than 1,500 works by artists such as Pierre-Auguste Renoir, Robert Mapplethorpe, and the late British painter Alexander Mendelssohn, and will spearhead the institution’s expansion into a new building at the British Museum, the A-level.He is the second person to ever head the British Museum, after Sir David Attenborough, who served for ten years but was fired in 2016 after ten months, and will take up the post in January 2021. His appointment was part of a wider plan to relocate the museum’s collection to a new space, designed by architects HOK, and the construction of a new building to house the institution’s collection. The museum’s current building, which sits on a five-acre campus in the center of Buckinghamshire, is slated to be completed in 2022.Sargent will begin his new role with a tour of the museum, which recently celebrated its sixtieth anniversary. He will", "The next Biennial should be a personal project, and it can be. I am still working on my own portrait, and I hope to do so soon.”\n\n\nThe Haus der Kunst (the German Institute for Contemporary Art) in Berlin announced today that its first short-term contract show, “Building Blocks: Architecture in Motion,” will return to the capital this spring. The show, which will be staged in a series of architectural projects that take place across Berlin and will be presented by the Haus der Kunst and the Institute for Contemporary Art (Faktioni), will follow the exhibition “Building Blocks” in 2019 and will feature more than 350 works from seventy-six artists.The first long-term show, “Building Science: Wind, Water, and Air,” will be up in May 2020. The exhibition will take place in the German city of Kassel, which in recent years has been working to return the capital to nature. The exhibition will be curated by Wolfgang Stroebe, curator of modern art at the Rosenbach House Museum in Munich, with a selection of artists from the Haus der Kunst.The current exhibition is divided into three sections: “Introduction,”", "The next Biennial should focus on “The Globalization of Art and the Journal of Cultural Identity.” The exhibition will take place in the Banu Cennetoğlu Museum of Art in Ankara, the Modern Art Museum in Mexico City, and the Museo de Artes Estudios in Buenos Aires.Curated by the Turkish curator Beyazul Işırkkaya, “Tatarstan: From Autobiography to Meaning,” will be shown at the Art Institute Istanbul in June.\n\n\nThe Museum of Contemporary Art (MoCA), Boulder, Colorado, has appointed Kathleen Chiu as its next executive director. She succeeds Chris Muser, who retired after eighteen years at the helm of the museum in September.“We are delighted to welcome Kathleen to the MCA and to witness how her remarkable career has unfolded,” said Steve Kornbluth, president and CEO of the museum. “Her extensive experience and knowledge make her a strong candidate for this important leadership role. We are very confident that her passion and drive will help the MCA to continue to thrive as a globally recognized and admired institution. We are confident that she will continue to inspire and advance our artists and our mission.”", "The next Biennial should be held in 2020. The 2020 edition will be the first organized in Australia since 2022, the year of the Copenhagen Biennale. The venue will be curated by Marc-Axel Berlin and curated by the artist-in-residence, Reem Akram.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that its collection has been selected as a partner for the 2020 edition of the Detroit Art Fair. The event will run from April 27 to April 29. The theme for the fair will be “Connecting the Dots: Contemporary Art in the Age of Black Power” and will include works by forty-three artists who are active in the Black Lives Matter movement.The partnership agreement between the museum and the Detroit-based artist-in-residence was announced in partnership with the Black Arts and Activist Coalition (BAC), a coalition of artists, activists, and community members formed in 2017 to advance Black Lives Matter’s campaign for greater public policies and services. The alliance was sparked by galleries that had long been excluded from Detroit’s Black Art Museum (BAM), and has since evolved into a platform for artists to interact with other activists and organizers. The first event of", "The next Biennial should be held at the Miriam and Ira D. Wallach Gallery in New York, which will open in 2021. The organizers are still considering whether to stage the event in the United Kingdom, but the event is expected to take place in the spring.\n\n\nThe Louisiana Museum of Art (LMA) in New Orleans has appointed Aline Dallison as its new associate curator of American art. She will succeed Amanda Kingman, who retired following more than six years at the helm of the institution last fall.“It’s been an honor and a joy to serve as the LMA’s associate curator, and I’m honored to join the staff and board in New Orleans,” Dallison said in a statement. “As we work toward a future that both honors and protects the LMA’s historic mission and its rich curatorial legacy, I’m eager to work with the New Orleans community and the LMA’s curators to craft the kind of program that will inform and engage the city and region for generations to come.”Kingman has helmed the institution since 2005, when it was still called the New Orleans Museum of Art (NOLA", "The next Biennial should focus on the contemporary issues of the current generation of artists. “The new Museum is our opportunity to reimagine the future of art from the perspective of a contemporary artist,” said Herbert Bayer, chair of the board of trustees of the Biennial. “We are now at a critical moment for our artists: their work is becoming more and more embedded into our collective consciousnesses. The goal is to provide them with the opportunity to present it in a meaningful and provocative way.” The museum will also consider expanding the biennial beyond the museum, by developing a new generation of exhibitions that would capture the imagination and challenge the limits of art, in addition to presenting the works of emerging and established artists. The biennial will be held in 2020. \n\n\nThe Mexican state of Oaxaca has announced that it will begin phasing out the production of synthetic cannabinoids, or drugs that mimic the effects of the drug marijuana, in an attempt to reduce the country’s soaring death toll. The move is part of a global campaign led by activists and doctors to end the country’s war on drugs, which has resulted in more than 4,700 deaths since the drug was first introduced in 1937.According", "The next Biennial should be in February 2020, with the first exhibition taking place in March 2020. The biennial will be funded by the Africa Fund, which will receive grants from the Nigeria-born, London-based artist Michael Kuzma, and the Royal Shakespeare Company, which is also supporting the installation. The Royal Shakespeare Company is promoting the work of Mana Ndebele, Shawty Ndebele, and Dora Mabas, and is releasing a list of twenty-five artists who will participate in the event, which will run from March 19 to March 20. The First Global Biennial, which was established in the city of Cape Town by British filmmaker Tanya and British businessman Simon Frost, is also seeking funding. The Second Global Biennial, which will be hosted in Württemberg, Germany, in November 2021, is asking for $7 million. Originally scheduled for March 2019, the exhibition was postponed until March 20. The exhibition was originally meant to feature work by twenty-six artists, including Sifang Il, Pilar Cornejo, and Angel López Rivera, but the show was pushed back due to concerns", "The next Biennial should be held at a venue that would be a “vast, modern laboratory” to continue and expand the field of regenerative medicine, said Salahuddin. “The museum will be a laboratory for the interdisciplinary study of transformation and regeneration, bringing together artists, scientists, students and scholars in a way that can engage with our contemporary world.”\n\n\nThe Baltimore Museum of Art (BMA) has appointed Kathleen Merritt as director. She succeeds Joachim Schell, who was hired to lead the museum until his resignation in February 2020.“Kathleen’s leadership at the BMA has been transformative, and I’m proud to support her and her team as they continue to shape the museum as a flagship institution for the history of the art world,” said commissioner and CEO Christopher Bedford. “As we look ahead to the 2020–20s, we will continue to be guided by her vision and creativity as we carefully consider the future of the Museum with an open mind and a strong sense of purpose.”The museum has previously opened in the former Horseshoe Mill in Northwest Baltimore in September 2018 and in the former Comcast building in March 2019. The B", "The next Biennial should be held in 2021. The 2020 edition, “Celebrating Life,” will be curated by former curators Dorothea Rockburne and Douglas Erickson. The 2021 edition will take up the themes of 'Life After Death,” “Life and the Universe,” and “Intelligent Design”\u0097all of which the festival has previously tackled. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to reopen with a retrospective of the work of French artist Etienne Leclerc in September 2021. The new initiative, dubbed “François-Auguste”\u0097a reference to the artist’s 17th-century exposition in Paris, “Exposition de la Loi de Beauvais” (The Lofficiers), will go on view in the museum’s former home in the city. The exhibition will feature work by forty artists represented by the institution\u0097with seven pieces from the first exhibition, which opened on October 8, 2017, and ten from the second exhibition, which opened on October 9, 2018.“The exhibition is both an extension of and a continuation of", "The next Biennial should be held in 2020, when the current exhibition will be replaced by a new collaborative project between the University and the University of the Arts, and the exhibition will be relocated to the Art Gallery of Ontario until the fall 2021–26 season. The change will coincide with the reimagining of the Biennial, which recently received a $5 million donation from the Global Fund.The Biennial is currently closed due to Covid-19. The Museum of Contemporary Art (MoCA), Los Angeles, which is currently reopening, also recently announced that it will begin welcoming visitors to the museum in the spring of 2021.\n\n\nThe Museum of Modern Art (MoMA) has received a gift of $1.1 million from the Tata Group, which owns the Tata Group, the Chinese multinational conglomerate which comprises United Kingdom–based Tata Group, Indian conglomerate Hindustan Garments, and several other companies. The gift includes $1.1 million for the construction of the Tata Memorial Art Museum in New York, where the museum is currently under construction; $300,000 for the renovation of the museum; and $300,000 for the purchase of works by some 1,500 artists.The gift also includes the Tata Archives, which contain more than", "The next Biennial should present research on contemporary and contemporary art from the contemporary American tradition, as well as from around the world. This is the time of great need and challenges. And it must provide a way forward for the most vulnerable among us.”\n\n\nThe Italian city of Venice is planning to charge visitors to the historic, granite-encrusted Grand Opera House for admission to the Rock of Gibraltar, an installation by artist Kiki Smith that was created in 1967. The Rock of Gibraltar—a replica of the Rock of Gibraltar, the Rock of Gibraltar, and the Rock of Gibraltar II, the original Grand Opera House—opened to the public in 2014 and soon became a popular site for free concerts, screenings, and other events. According to a report in the Art Newspaper, the city is planning to charge visitors to the Grand Opera House for admission to the Rock of Gibraltar, an installation by artist Kiki Smith that was created in 1967. The Rock of Gibraltar—a replica of the Rock of Gibraltar, the Rock of Gibraltar, and the Rock of Gibraltar II, the original Grand Opera House—opened to the public in 2014 and soon became a popular site for free concerts, screenings, and other events. According to a report in the Art Newspaper, the", "The next Biennial should be held in 2020.\n\nIn the meantime, the Museum of Contemporary Art (MoCA) in Los Angeles has unveiled a new design by American artist Amanda Fung. Titled Aya Agrawal and the Power of Color, the exhibition is a companion work to the upcoming exhibition “Painting With Color” at the museum. Fung’s first show for the exhibition will open on October 19 and run until November 19. The show will feature work by seventy artists, including Alex Katz, the New York–based artist who painted the first work in the exhibition series for the exhibition.“The problem with the Biennial is that it’s not really a biennial,” Fung told the Art Newspaper. “It’s a series of exhibitions that is staged in houses with the hope of encouraging a dialogue between the artist and the public about the importance of painting. . . . I’m trying to push the question ‘painting with color’ forward.”The exhibition will include works by thirty artists including Robert Irwin, Susan Radcliffe, and Yinka Shonibare. The show will feature a selection of artist’s own work to begin with", "The next Biennial should be held in 2020. Previous editions will be held in 2022 and 2024.\n\n\nThe National Endowment for the Arts (NEA) announced today that it will award $500,000 grants to twelve arts and cultural organizations in twenty-eight states in the United States\u0097a record for arts-based grantmaking. The NEA is giving $100,000 to the Native Arts and Cultures Movement, which supports Native American cultural heritage and connection, and $250,000 to the Angeleno Institute, an arts incubator that works with artists and filmmakers, as well as the Lower East Side Museum in Harlem, the Museum of Modern Art, and the Brooklyn Museum.The organizations will each receive $50,000 for their pan-Indian arts programs. The grants will run through 2021.\n\n\nThe Solomon R. Guggenheim Museum in New York City announced today that it has received $148 million from the $1 trillion federal stimulus package, which was passed by Congress on Tuesday and is expected to be signed into law by President Donald Trump on Friday. The package will provide $8.4 billion for the Museum’s several hundred million-dollar renovation and expansion project, which will also include the", "The next Biennial should be held in late spring or early summer, ideally,\" the organization says. “The development of the exhibition is an important step in the development of our programme and the exhibition. However, in order to safeguard the Biennial’s integrity and to give the exhibition a fair opening we are postponing the event.” In a statement on its website, the museum said that the delay is necessary because it is examining “some important issues in the museum,” including whether the artworks in the exhibition should have been identified earlier.\n\n\nThe Museum of Modern Art (MoMA) in New York on Thursday announced that it is working with the National Labor Relations Board (NLRB) to have expired contracts terminated for workers at its five locations. The board declared last week that it was considering whether to suspend or even eliminate overtime pay and other benefits at the five New York locations where the company operates, including its flagship museum, the Metropolitan Museum of Art, and the Whitney Museum of American Art.“The NLRB believes these termination practices violate the 1935 National Labor Relations Act,” board chair Angela Clark said in a statement. “We are proposing that these practices be terminated as early as possible, and that employees be", "The next Biennial should be held in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Kenneth Cahn as its next director. Cahn comes to the institution from the Metropolitan Museum of Art, where he has served as director of development since 2011. He succeeds David St. Louis, who retired following nearly four years after he became the first director to step down following a major financial crisis.“In his new role, Cahn will play a critical role in revamping the Museum of Modern Art in the most significant way possible,” said David Mullen, the institution’s deputy director and chief curator. “MoMA’s transformation from a family-owned and operated institution to a global leader in contemporary art has been one of the most transformative stories of our time. As director, Cahn will continue to shape the museum’s trajectory as it continues to expand its digital and participatory experiences in a way that maximizes the museum’s cultural relevance and enhances the boundaries of the museum’s collection.”Cahn succeeds David Halberstam, who retired after a remarkable four-year tenure following his appointment in 2016. During his tenure, the institution expanded its collection by", "The next Biennial should be announced in the first week of April.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines on how the city should be handling the ongoing redevelopment of the Central Park amusement park. The document outlines how the park should now be rebranded as a “global City Lab.” The DCLA’s recommendation marks the latest in a series of actions the city has taken in order to push back the anticipated reopening of the park. In April, the city cut the park’s annual operating budget by $1.5 million, and in October, it imposed a temporary closure of the park after it received $2 million from the New York City’s Tide Billions Trust Fund.Mayor Bill de Blasio cited the need to preserve the park’s unique historic features as the reason behind the closures in a statement from the mayor’s office, and the city’s Department of Cultural Affairs confirmed that the guidelines were issued to the city’s Department of Cultural Affairs and not the Parks Department. Although the policy announcement does not directly address the ongoing redevelopment of the park, the city’s cultural agencies were given two months", "The next Biennial should take place in 2020, and will be inaugurated by a presentation by the team of the late architect Louis Vuitton, whose elegant, sophisticated architecture is based on an understanding of materials as the basis of a design. The show will also include a large-scale participatory reception in the town of Allegany, near the French town of Lyon, on September 6–September 8.The event will host a selection of works by seventy-eight artists, including Jan-Ølmo Nilsen, Lars von Trier, Alexander Calder, Louis Vuitton, Ernst and Laruelle, Màïs Khouri, A. I. Saarinen, and Koji Kondo. In addition to the usual programming, a number of special exhibitions will be made available to the public, including “The New York Collection” (2019); “Architecture and Design” (2019); and “A Retrospective of the Life and Death of Martin Luther King Jr” (2019).The inaugural exhibition will be held at the new Museum of Modern Art in New York, which will be constructed in a former cotton mill on the Hudson River in the city. The museum will boast an exhibition hall and a", "The next Biennial should focus on a “historical perspective,” curator and architect Antonio Lema told the Art Newspaper. “We must do this in a way that creates a space for the memory of the past and a space for our future.” The festival will be held in San Juan de Concepcion, Puerto Rico, as the capital of the United States Virgin Islands, from March 20 to March 23. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the commissioning of new works by emerging and established New York–based artists after the Metropolitan Museum of Art (MoCA) suspended the panel series “New Directions,” which was slated to run from March 15 to March 21. The show, which is based on the themes of performance, performance, performance, and performance, was selected to represent the city at the 2020 TCAF NYC, the country’s largest annual festival.“New Directions’s performance, art, and performance and performance art have been deemed ‘essential’ and thus are eligible for the full commissioning cycle,” the guidelines stated. The commission, which will last for two years, will be awarded a minimum of", "The next Biennial should be announced in the spring of 2022.\n\n\nThe Museum of the City of New York has released the schedule for its 2021 edition, “Maya’s City of Pieces,” which will showcase twenty-four work performed by forty-six artists, including Kiki Smith, Anita Smith, Simone de Beauvoir, and David Salle. Curated by Anita Agrawal, the inaugural curator of Asian art, the 2020 edition, “Reborn in a Sea of Black,” will run May 23–May 28.The show, which will highlight the cultural legacy of the city’s Asian Art Museum (AAMD), will follow the themes of the 2020 campaign, “Race, Politics, and Design in American Art,” and will present a selection of nineteenth-century works by forty-six artists, including Robert S. Duncanson, Alexander Remarque, and Josef Alberts. The museum will also include a lecture series on the history and theory of Asian art and a curated exhibition of twentieth-century art.Commenting on the 2020 theme, director Walter Thomson said: “In the twenty-first century, we are again confronted by a time of profound", "The next Biennial should take place in 2021 and will be the first in South Africa.\n\n\nThe museum’s new location in downtown Los Angeles has been reconceived as part of a $1.5 billion expansion project that will overhaul the museum’s interior and exterior in order to increase accessibility, accommodate a larger audience, and better accommodate the biennial’s projected 2019 opening.The project, dubbed the Skyscraper 2, is being led by architect John Lutz and includes the addition of two new galleries to the museum, the Skyscraper 1’s new Hewlett-Packard building, which will be completed in 2020, and an expanded collection of contemporary art, including works by Kader Attia, Tia Ghose, Yinka Shonibare, and Xiaolin Huang, among others.“We’re thrilled to announce this next phase of the Skyscraper,” said Skyscraper project director Emma Resnick. “We’ve had a long-standing plan for this building since the institution’s founding in 1936 and are proud to be moving it into the next stage of its development. This is a major step in the museum’s evolution as a whole and", "The next Biennial should be held in 2021. The means of production and distribution of art have changed, but the central question is the same: what does art do for us?”Dia Art Foundation will organize the exhibition space. The museum will organize events and other programming, including a solo presentation of work by the Austrian artist Mona Hatoum (later of the Malevich Institute in Moscow), a selection of works by Currin & Porter, and an exhibition about the development of electronic art. Its first series, “The Step-by-Steps of Revitalization,” will open in November. A second show, “The Role of Art in Society” will open in April.A third exhibition, “The Moving Picture Frame,” will open on the same day as “The Step-by-Steps” and will be directly connected to the Biennial. The third series, titled “Imageless Objects” and curated by the Hong Kong–born, London–based artist Elaine Chang, will be on view until October 5.\n\n\nThe Houston Museum of Art (HMA) has appointed Talia MacGill as the new chief executive and director of its arts department. Mac", "The next Biennial should be held in 2021. \nThe biennial, titled C++17, was organized by the C++ Standards Committee (CSC) in cooperation with the International Committee for Standardization (ICSI) and will be hosted at the C++21 (formerly known as the C++ Standard Committee), which will convene in Munich in March.The next edition of the event will take place in late June.\n\n\nThe Brooklyn-based artist Khaled Hossein has won the 2019 Betty Bowen Award for his distinguished practice of creating works of art that present a “prospect for a better world,” which was established in memory of Betty Bowen, who lived and worked in the Bronx. Hossein’s exhibition at the Brooklyn Museum in May 2018 exhibited the work of three artists\u0097Charles Atkins, Mattias Axmann, and Pierre Faure, who died earlier that year\u0097and was nominated for a Pulitzer for his coverage of the artist’s work. In this honor, Hossein was awarded the award for his “Voluntary Program.”In the award ceremony held at the Museum of Modern Art on Monday, March 20, Hossein said: “I’ve been working", "The next Biennial should be held in London, and it will be hosted by the Tate and the University of the Arts. “The museum is working hard to secure a venue for the next iteration of the Biennial, and I look forward to the exhibition’s arrival in 2022.”\n\n\nThe National Galleries of Scotland have announced that they are prepared to welcome visitors to the National Museum of Scotland (MoZ) and the National Gallery of Art (NGA) in Edinburgh in February 2020. The institutions are working together to open the museums in March. The first museum in the country to open in March 2020 is the National Gallery of Art, where the first exhibition of the month will be “Shadow Play: Modern Art in the Age of Margaret Thatcher” (March 21–March 24). The NGA will also host a retrospective of the work of a select group of Scottish artists in March 2021.The institutions said that the partnership was engineered to ensure MoZ’s 2020 opening date would coincide with the institution’s anticipated renovation of its Park View, which is currently being carried out by the Scottish firm Gerschen & Schmid. The announcement follows the announcement this month that MoZ, which has an annual", "The next Biennial should take place in the fall of 2020. The mission of the museum is to present the work of contemporary artists, and to promote the work of young artists by focusing on the work of less well known artists, and to foster a dialogue between contemporary art and the themes of the museum. After a redesign that enhances the exhibition experience and the public experience at the museum, and that also extends the collection into a new building, the museum will become more accessible to visitors. The new Biennial will be housed in a building designed by MALDI architects and will be supported by an additional $3 million from the MALDI Foundation. The biennial will be a collaboration between the Museum of Contemporary Art (MCA) Los Angeles and the Los Angeles County Museum of Art (LACMA). The design of the new building and the program of exhibitions, events, and screenings is part of a larger plan for the extension of the museum’s collection. The museum opened its current location in the former B-25 factory in 1968 and relocated to a new building in 2005. The new layout and the collection’s current exhibition space will be located near the newly renovated Los Angeles County Museum of Art, which is currently undergoing", "The next Biennial should be held in January 2020. \n\n\n\n\n\nArchitects:\n\nIgor and Olga Bishkevich\n\nResponsible for the renovation of the Kirovskaya Museum in St. Petersburg, Russia (2011) and the renovation of the Tsar Museum of the Revolution (2008); the latter project is being completed this month. \n\n\n\nThe National Museum of Fine Arts (MMFA) in Athens, Greece, has appointed Anna-Marie Tavarin as its next director-general. Tavarin joined the institution in March 2019 as director of contemporary art, architecture, and design. The appointment coincided with a major reopening of its building, the Museum of Arts and History, and the newly renovated Palazzo Veneto, and was made in the presence of President Iorgo Arrozco.“I would like to thank the president for granting me this remarkable opportunity to lead the institution,” said Tavarin, who is currently the director of the Academy of Fine Arts in Milan. “I want to extend a special thanks to President Iorgo Arrozco and the board of trustees who made this possible. The MMFA and I have been working together for eleven", "The next Biennial should be held in the city in December 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has come under fire for its decision to move the memorial to American soldiers who were executed by the Japanese during World War II from its grounds in the city. The move has prompted protests from local lawmakers, who are demanding the museum stop the relocation and return the remains to the families of the soldiers who were killed in captivity. The activists are also calling for a full and honest accounting for the 700,000 American servicemen and women who died in captivity during the Japanese occupation from 1941 to 1945, and for compensation for the families.The museum has submitted an official proposal for the museum to relocate its collection, which includes military artifacts, to the United States, but the move has been opposed by every branch of the military in Japan except the National Museum and Art Archive, which plans to temporarily store the pieces in its storage facilities. Among the pieces that have been moved are two World War II-era aircraft, both of which were originally on display in the museum’s late X Division division, and a collection of five American tanks, a pair of which were originally installed in the museum’s T division.“A major museum", "The next Biennial should be held at the Kunsthalle Künstlerhaus in Cologne from November 29 to January 5, 2021. The exhibition will also receive a grant of $500,000 for the arts and cultural sector.Following the symposium, the museum will host a reception for the guests of the Grand Challenges exhibition in late January.\n\n\nThe Queens Museum, New York, has appointed Meredith Gordon as its new executive director. Gordon comes to the institution from the Metropolitan Museum of Art, where she has served as interim director for the past three years. She succeeds Kirsten Eberhardt, who retired early in the new position, and will begin her new role on January 1, 2021.“Meredith is a strong leader of the Queens Museum and is highly respected by her colleagues and the board of directors,” said David Dan Merrick, the museum’s board president. “The museum is poised to grow and become one of the most recognized cultural destinations in the city, and her leadership will ensure that we continue to present the Art of the Party, the Museum of Modern Art and the Cooper-Hewitt, and the newly renovated Colby College Museum of Art, among other exciting projects.”Gordon came", "The next Biennial should follow the same schedule as Art Basel Hong Kong, which aims to draw twenty-five thousand visitors to the exhibition space each year. The institution will also launch an online version of its Hong Kong fair, which is scheduled to run from March 19 to March 21, 2020. The festival has yet to announce a date for the United States.  The opening of the exhibition Artforum: On Location, in New York in June 2019 was hailed as a watershed moment for the art world in Asia, where the show was held in the United States only a few months after a fire tore through an abandoned art-historical complex in Bangkok, killing at least sixty people. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for when and how museums, art galleries, and other cultural venues in the city can begin welcoming visitors again following the coronavirus pandemic.The guidelines—which were issued on December 21—require museums to reevaluate their outdoor spaces and their floor plans to ensure they have \"sufficient ventilation and air circulation\" and that they have emergency exits and ramps. The department also pointedly noted that certain structures, such as public spaces and schools, may not be able to reopen", "The next Biennial should be held in the first quarter of 2020. The board of directors of the Museum of Contemporary Art (MoCA) in Los Angeles is urging the Los Angeles County Museum of Art to move the exhibition to the California coast. The move is expected to save the museum nearly $200 million in operating costs.However, the move is not without its critics. Space will be tight at MoCA and the museum’s collection will be severely damaged. In an interview with the Los Angeles Times, museum director Christopher Knight said the museum was not considering leaving its home of more than three decades and that he thought the move would only make things worse. Knight said the museum would remain in operation in some form if Congress approves a disaster declaration and the city and county agree to divert funds from the $9 billion Redfin project and spend the proceeds on disaster relief.The move is expected to provoke new protests from environmentalists concerned that the museum will relocate the site of the museum’s original location in a city-owned area of the museum complex, and from local residents who oppose the move. The museum and the city contend that moving the exhibition will compromise the public’s safety and health and create traffic problems. Knight said the museum will be “in", "The next Biennial should also include the production of a show on Indian art. The Kingfisher Museum is already working on a new exhibition on the Rajputana art of the 17th century. The exhibition is scheduled for 2020.  Commenting on the show, Whitney president Marc-Olivier Mahan said: “We expect the museum’s collection to undergo and fulfill a significant and last-minute renaissance—and we aim to foster that. The Rajputana exhibition was not only a landmark in its respective century, but it was also an instant classic in our time. We are eager to witness how it will interact with and transform the collections of the Smithsonian and the National Gallery of Art.”The museum has also been working on a redesign for the museum. The institution has released the design for the future pavilion, which will measure 40,000 square feet and incorporate a gallery and exhibition space, but has not yet unveiled the design for the structure. The redesign will be inspired by the views of the bay from the Helvetica-clad building, and the words “Honor Thy Father” will be etched in red and black.The work will be on display in the exhibition “Honor Thy Father�", "The next Biennial should take place in the spring of 2022, according to Musée d’Art Contemporain (MCA), France’s national artistic agency. \n\n\nThe Palazzo Nazionale di Architettura in Rome has announced the inaugural artist-in-residence, who will be based in the museum’s permanent collection over the course of three years and will exhibit his or her art at times that will be determined by the museum. The project, titled “Alessandro Paretti: Art in Society.”Paretti, who will become the first artist to live and work in the museum since the building’s construction in 1954, will be based at the institution for the next three years. The biennial will take up themes of art, the environment, and technology and will include an online learning platform and a number of exhibitions. The program will run concurrently with the museum’s upcoming reopening of the Palazzo Nazionale di Architettura, which will open on March 22 and run until March 27. Paretti’s debut exhibition, “Alessandro Paretti: Art in Society,” will inaugurate the exhibition", "The next Biennial should be held in 2022 and the first in 2020. After the exhibition, which also includes a virtual reality installation, the BAMN will sponsor the first exhibition of the new series of exhibitions, “Feminist Viewing Parties” and will collaborate with the Fondazione Bataclan to create a new series of exhibitions. The new format will reveal its next work in the spring of 2020 and will begin in the summer of 2021. The presence of the principles of Materials Science and Technology in the exhibition will mark a shift in the exhibition. The preseason shows will consist of a combination of works that were selected by the gallery’s curators, including “The Atom Factory” (2015), Birgit Joos’s first solo exhibition in Europe and the United States, and works that were shown in fiction and non-fiction collections at the gallery during the end of the twentieth century. The new exhibition will be inaugurated by a new work by the German artist and theorist Grütia Banerjee, “Boden in der Anim der Künste” (The Bodies of Animals in the Cage), which will open in the Düsse", "The next Biennial should be held in 2022. The next iteration of the Games should take place in 2023. James D. Petersen, the president of the W. D. Ana, founded the Biennial in 2008 as a means to address the challenges and opportunities of urban and rural America. The inaugural exhibition, “The Warehouse Project,” was held at the W. D. Ana from March 16, 2008 to March 19, 2008; the second iteration of the Gates Project, “Making Place,” took place at the Art Institute of Chicago from March 16 to March 20, 2009; and the third and final iteration of the Games, “Making Images,” will take place in 2020. “The museum is currently collaborating with a number of artists and organizations to develop their own creative solutions to the challenges and opportunities posed by climate change,” said Mark Levingston, chair of the board of trustees. Commenting on the future of the W. D. Ana, Levingston added: “We are extremely excited that the Biennial will continue to provide a unique and meaningful context for a diverse range of contemporary artists and their work. The bi", "The next Biennial should open in 2020, with an exhibition of new work by the internationally-acclaimed artist Mandy Pidgeon at the venue.\n\n\nThe Heckelberg Museum in Pasadena, California, has appointed the British artist, screenwriter, and producer Bethany Ade as its new president and CEO. Ade comes to the museum from the Chisenhale Gallery in London, where she has served as its curator of modern and contemporary art since 2010. She will assume her responsibilities on January 6, 2021.“Bethany is a star curator who has brought a wealth of experience to the Heckelberg, and is already well-versed in the museum’s extensive collection and design practices,” said museum director Richard Handy. “She has the ability and vision to expand upon and extend the vision and legacy of the museum.” Ade previously served as a senior curator at the Hirshhorn Museum in Washington, DC, and a curator at the Museum of Modern Art in New York.Commenting on her appointment, Ade said: “The Heckelberg is a unique and dynamic collection of modern and contemporary art that combines the courage and creativity of an artmaker, with the", "The next Biennial should be held in 2020 to focus on the impact of the coronavirus on art and culture in England and Wales. The 2019 edition, titled In the Beginning, was held in the UK in March and featured work by over seventy artists. It was also the first time the museum had held a whole new show devoted to the coronavirus. The twenty-six-hour event, titled Between the World and Me, premiered at a special event at the museum on January 9. “I want to thank everyone who has been involved in shaping the future of Biennial London,” said Elizabeth Gloster, chair of the board of trustees. “We are excited to take the next steps in the development of our collection, and to continue to reach new audiences with our exhibitions and programming. It is an extremely challenging and challenging time to open a museum in London, so I am confident that we will continue to be able to attract new audiences with a truly ambitious programme.”Further details about the 2020 event\u0097which will be held in conjunction with Art London 2020\u0097and the 2019 show can be found on the Biennial London website.\n\n\nThe New York City Department of Cultural Affairs (DCLA)", "The next Biennial should, in the words of the organizers, take place in the city from August 8 to August 13. That evening, the entire archive of the exhibition will be on view, with lectures, screenings, performances, workshops, and more.The first edition, titled “Emergence: From the Margins” (2017), reopened on September 24 and ran until the early hours of the morning on September 26. The exhibition featured more than 450 works by forty artists from thirty-six countries. The current exhibition, titled “Theater of Operations: The Gulf Wars 1991–2011” (2019), is scheduled for a two-hundred-day construction.\n\n\nThe Museum of Modern Art (MoMA) in New York has instituted three new curatorial initiatives designed to improve its international aspirations. The first, an online-only residency program, will give visitors an opportunity to live and work within the museum’s spectacular new 7,000-square-foot building on West Seventy-Second Street. Titled Live at MoMA, the initiative was created by the artist-run collective MoMA Real Estate, which has served as a local arts incubator for the past three years. The residency project will culminate", "The next Biennial should be on September 18. “This is a very challenging and delicate time,” Jeffrey deSousa, the director of the Art Institute of Chicago and the Museum of Contemporary Art, Chicago, said in a statement. “We are grateful to the many communities that have welcomed the Biennials, and dream of their continued success.”\n\n\nAs the number of people infected with the coronavirus continues to rise, the British Museum in London is preparing for a shutdown that could last for weeks or months. On Monday, the institution announced that it is lowering the number of visitors it expects to have access to the Tate Modern, which reopened to the public on January 7, and is encouraging people to return to the institution. According to the BBC, the museum expects the closure to last for at least eight weeks and expects the number of visitors to drop by between 25 and 50 percent.The museum said that it has already made several changes to protect the health of visitors, including limiting the number of people allowed into the museum and limiting the length of tours and moving the galleries and the exhibits closer together. While the number of visitors will likely be slightly reduced once the refinery in Sunderland, United Kingdom, shuts down, the museum", "The next Biennial should take place in 2020. “The future of art is beyond the museum,” said Tadashi Masuda, chair of the museum’s board of trustees. The next iteration of the Biennale will focus on themes of the collective memory, on the historical connection between the world and the museum, and will take place in the museum’s new 70,000-square-foot, glass-enclosed building on the second floor of the Hirshhorn. Its 2020 theme will be “Away from the Museum,” an exploration of the idea of the museum as a place for contemplation and reflection. The museum will also retrace the steps of the sixteenth-century German artist Ferdinand Künger, whose work is currently on display in the museum’s new exhibition of paintings by Wolfgang Oesterreich at the Sundance Film Festival. The museum will display more than fifty Künger works and will present a selection of Künger’s Opus + one hundred works by other artists, including Dürer, Beethoven, and Kandinsky.The Biennale is one of the three major international events that occur annually in the", "The next Biennial should focus on the lives and work of the artists whose work is included in the exhibition, which will be titled “The Future Is Non-Existent.”The event will be held at the Museum of Fine Arts, Boston from June 7 to June 8 and will include the exhibition “Four New Artists” and “Five New Artists.”\n\n\nParis’s Gay and Lesbian Museum (GLM) has pledged to donate $2 million to the victims of the devastating terrorist attack at the Louvre in Paris on Friday, March 22, as well as to the French government in support of the Légion d’Arles’s fight against racism. The pledge, which is the largest donation made to date, follows a statement by the institution made earlier this month, where it pledged to donate $1 billion to fight racism and social injustice. “In light of the terrorist attacks in Paris, the Épine du Monde, the Federation des Organisations de l’Homme, and the National Association of Gay and Lesbian Photographers, we decided to make a radical decision,” said Georges Haussmann, the director of the Louvre. “We have", "The next Biennial should be held in 2020. The second, scheduled for 2021, will be held in 2022. The third, to be held in 2023, will be held in 2024.These biennials will be hosted by the Museums and Galleries of Ontario (MCA), which will receive $32 million; the University of Toronto (UT), which has received $10 million from the province; and the Toronto Art Gallery, which will receive $9 million.The fourth and final exhibition in the series, “Truth and Lies: The Contemporary Life and Short-Term Memory of Alice Aycock” (2019), will be staged at the Toronto Museum of Art in 2021.\n\n\nThe Italian government is preparing to take over the management of the Centre Pompidou in Paris, which has been closed since March 23 due to the coronavirus pandemic, in an attempt to revive the property. The move follows the announcement of a €2 billion plan to restructure the institution\u0097which was announced in March\u0097into a new public-private partnership (PPP) model, according to the Art Newspaper. The redevelopment, which is expected to begin in 2021, will involve the demolition of the Centre Pompidou and will", "The next Biennial should take place in Panama City from November 21 to March 20, 2020. The theme of the upcoming exhibition will be “I-am-Not,” and the inaugural event will be a celebration of the fifty-fifth anniversary of the magazine Contemporary Art. The exhibition will be organized in collaboration with the Panamanian artist and curator Sandra Porritt-González.“This is a great opportunity to celebrate the fifty-fifth anniversary of Contemporary Art with a spectacular exhibition,” said architect and curator Marta Lopes de Castro, who was selected for the role of biennial director by the biennial’s board of directors and paid an exorbitant sum of $100,000 to join the project. “Together we have the obligation to continue to foster a new kind of dialogue between art and the people of the Americas by investigating ways to connect with our native cultures through art.”The biennial will consist of twenty-two solo exhibitions, each curated by a different artist. Each show will mark the fifty-fifth anniversary of a different artist\u0097from the modernist photographer Mario Graziani, whose monumental Black Sea Landscape, 1955, was among the first exhibitions at the", "The next Biennial should focus on “Asian art,” said Piero Pascual, chair of the board. The five-day event will focus on “the history of art and design in Asia,” with the focus on the Asian diaspora.According to a statement issued by the exhibition, the group was given the opportunity to change the exhibition in a way that would “maintain the biennial's spirit of openness and experimentation.” The exhibition will also receive a new color, a new frame, and a new video installation, “In the Beginning,” in which artist Ai Weiwei creates a piece of architecture from a mixture of materials. The museum will be open for free admission on Saturday, March 8, and will host a free daylong event on March 9.The Biennial of India is now accepting submissions for its upcoming edition, “In the Beginning,” which is slated to run from March 8 to March 10. The seventy-two-minute video installation will include an original piece by India’s contemporary artists. The show will be curated by Yasmina Yusuf and will showcase works by the artists from the Mahatma Gandhi Biennial in New Delhi and the", "The next Biennial should take place in the Fall of 2020. For the past twenty years, the museum has hosted the annual Kunsthalle Basel, a gala dinner for the artists who will represent their countries at the 2020 edition. The exhibition, which was organized by the Kunsthalle Basel and the Fondazione Fabio Regis, has been replete with new works by emerging and established artists, as well as the works of the great German painter Hildegarde. During the grand opening, the museum also showcased the work of Dutch artist Jan-Bode Miller. The artist will have his first solo show in the United States since 1994 at the museum in the fall of 2020.\n\n\nKathrin Becker, the editor of the German magazine \"Das deben\", has announced that she has been accused of plagiarism by photographer Wolfgang Roos, who is currently serving a three-year prison sentence for publishing a book that falsely claimed to have been written by the German chancellor, Gerhard Schröder. The lawsuit has been lodged by German cultural organizations in an attempt to recover the $100,000 that was loaned to the book in exchange for the use of a photograph by the German chancellor. The lawsuit has", "The next Biennial should take place in Silistrada, the capital of northern Andean State of Santa Catarina, in 2022. The country’s cultural director, Félix Mejia, said: “I have a very strong idea of what the role of a Biennial should be, and that I want to do it in a way that will be relevant to the local circumstances in the country.”\n\n\nThe Bidens of the World are meeting to consider a new, and ambitious, strategy for the museum. The initiative is being spearheaded by Rebekah and Iwan B. Bidens, the parents of Marc Benio, the American artist who painted the first solo exhibitions at the Bidens’ new boutique, the Biannual Carnegie Biennial. Bidens has also been working on developing a program of art exhibitions at the Biannual Carnegie International, to be held in September 2020. The project is being led by Trevor Paglen, the former director of the New York Museum of Modern Art, and is funded by the Biannual Carnegie International, the Carnegie Endowment for International Arts, and the Carnegie Legacy Fund.“The Biannual Carnegie International will continue to be a self-", "The next Biennial should be held in Bologna in 2017 and will feature twelve artists whose work is currently on display at the museum. During the festival, all work will be accessible to the public.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that the institution will reopen with a retrospective of the work of the late Russian avant-garde sculptor Anton Chekhov. It will also inaugurate a new digital platform, called the Cinema of the Anton Chekhov Experience, which will include the artist’s films and performances. The platform will run for twelve months and will draw from the artist’s archive.The retrospective will be organized as follows: “In the Beginning,” a retrospective of the artist’s work that will be curated by the late Christopher Wool and will feature work by Jane Birkin, Julia Ioffe, Sinéad Hogg, Messages from the Daughters of the Nation, and Stephen King. Set to open in December 2019, the exhibition will continue to run throughout the year and will be staged in collaboration with MoMA.“I’ve been envisioning the platform for many years now, and its new", "The next Biennial should be the opening of a new museum dedicated to the Victims of Communism Monument in the capital of Kazakhstan. The monument commemorates the victims of the country’s totalitarian regime, which included the death penalty. The museum is currently under construction, and the date for its opening has yet to be announced. The exhibition will focus on the history of the revolutionary Kazakh cultural scene and will highlight the contributions of women artists and will include contemporary works by artists who were active during the height of the Soviet Union’s influence. The exhibition will also be centered on the Black Sea region of Tarkine, where most of the victims of the regime’s brutal campaign against dissenters were buried.The exhibition will feature the work of thirty-seven artists, including Ekaterina Makarova, Katerina Konstantinova, and Natalia Dzodan. The exhibition was inspired by the work of Ekaterina Makarova, whose stunning, semi-abstract,  Independence Day style sculptures and installations weave a powerful feminist and anti-racist narrative of resistance that is infused with a deep respect for the vision of her predecessors, who were fierce defenders of freedom; and of the women who inspired and transformed her artistic legacy.", "The next Biennial should be held in 2022.If the lineup is as expected, the 2019 event, titled “The Body and the Event,” will serve as the theme for the twenty-fifth edition. The exhibition will be held at the same venue as the Biennial and will focus on the concept of the body and its relationship to events. The exhibition will be organized by the Museo de Arte Contemporáneo in Madrid and will be organized as a five-day event.The 2019 event was held at the new venue: Mestalla Nacional de Arte Contemporáneo (MNA) in Madrid. The MNA has had a short-lived attempt to move to a new venue in recent years due to the ongoing unrest in Spain, but it is currently looking to relocate to one of the existing spaces in the city. The venue was also recently selected as the theme for the 2020 edition of the Gale of Navaluto.MNA is currently working on the design of the new wing that will house the show and will likely unveil the first exhibition of the new format in 2020. The show will be staged as part of MNA’s history, and will be inaugurated by a presentation", "The next Biennial should be held in the fall of 2020. The 2020 edition, which will be staged in Saint Petersburg, will premiere in October and feature the works of forty artists. While the exhibition format may seem familiar, the artists have chosen to focus on a new way of organizing works. “We have chosen not to present the same works the same way twice,” Yuriy Maloshov, a curator of contemporary art at the Museum of Fine Arts in Moscow, told Artnet. “The idea behind the exhibition is not to increase the number of individual exhibitions but rather to create new worlds. We will choose ten works from the fifteen chosen by the panelists.”This year’s show will consist of thirty-one works by forty artists. From the Thirty-Second Biennial of Art and Design in Helsinki, which is currently on view in the Criterion Collection in London, the artists’ works will be presented in an exhibition that will also feature interviews with eleven other artists, including Rob Tarrant, Peter Kropf, and Oskar Pfaff. The show will run from February 3 to February 5, 2020. “The show will be a real effort to present the artistic and", "The next Biennial should be held in the second half of the year. It will start with a group show of work by the artists who have participated in the first Biennial and will continue with presentations of work by all the artists who have participated in the previous five Biennials. The artist-in-residence, Yinka Shonibare, will serve as the biennial’s main presenter.“The Biennial was born to reclaim the memory of our late president, Soichi, and to create an exhibition that evokes the spirit and vitality of Tokyo,” said Masamichi Kondo, chairman of the Biennials Association. “It will preserve the memory of the previous eight years of visits to various locations in the city, and will provide a platform for the artists who have chosen to return to Tokyo. We are confident that the exhibition will produce a strong and memorable experience.”Previously, the Biennials Association has organized biennials in various cities of central Japan, including Nagoya, Osaka, and Kyoto; in the countryside of Wakayama, Wakayama Prefecture, and the south of the city; and in the cities of Shizuoka, Shizuoka City, and Wakayama", "The next Biennial should focus on the history of the exhibition hall inside the museum and its current renovation, which has resulted in a major expansion of the museum. The exhibition hall, which houses the collection of the Greek and Roman curators, architects, collectors, and other important figures of the nineteenth century, will be inaugurated by a presentation of the exhibition “Practicalities: Art and the Public Sphere”. The exhibition, which is organized so that visitors can experience the exhibition in its entirety, will be on view until December 13.\n\n\nThe 2018 Yuz Museum’s inaugural biennial, “Yuz,” has announced that it is rescheduling the event. It is instead planning to launch a digital platform, which will debut on October 9, the day of the opening of the exhibition, as a way for the public to interact with its collections and exhibit.The platform will focus on early digital artworks by women and will highlight the work of women artists who are known for their iconoclastic, yet rarely seen, exhibitions. The biennial will also introduce more than two dozen new online works by women at the museum. The first of these, a virtual tour of the museum, will be available nine days a week,", "The next Biennial should mark a turning point in the past, in that it will be the first time that the extraordinary collection of contemporary art has been presented by the British Government, at a public institution in the country, in the middle of the night, to a public gathering. This is a moment of change for Britain and the world, and for the United Kingdom. The Biennial will be the first time that the collection is assembled and presented in the country, and will be the last time that the collection is exhibited in two locations.The biennial will be organized as a major exhibition. The first half will consist of a selection of new works, curated by the curators at the Institute of Contemporary Art (ICA), London; the second half will consist of a retrospective of selected works, curated by Richard Avedon, the Director of the Institute of Contemporary Art, London; and the final part will consist of a virtual reality installation, curated by Lejla Dukovic, the Director of the new Tangerine Gallery.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles plans to move the institution’s collection from its current location on Wilshire Boulevard to the Pacific Palisades in a $225 million redevelopment project that will also", "The next Biennial should be held in the spring of 2022. Watch this space for more updates.\n\n\nThe House of the Arts, the Museum of Fine Arts Houston (HA Houston), and the Museum of Contemporary Art (MoCA) in Los Angeles are among the nearly fifty cultural institutions set for massive layoffs in the wake of Tropical Storm Harvey, the largest hurricane to hit the United States in a half century.“We are acutely aware of the ongoing impact of the storm on our community and on our artists and curators,” said David Fleming, executive director of the Association of Independent Colleges of Art and Design (AICD), a nonprofit organization that represents more than 140 schools across the United States. “We are committed to finding ways to support our artists and our students and will continue to work with schools to understand their needs and to consider their needs when making decisions about how to use their assets and our resources.”According to a statement issued by the Museum of Fine Arts Houston, the museum’s current programming will not be impacted by the ongoing hurricane and that a new exhibition, “The Art of Disaster,” will open in the fall. The museum also said that it is “currently evaluating the impact of the storm", "The next Biennial should be up in September 2021. \n\n\nThe Sociedade Internacional de Turin, Spain, is expanding its inaugural edition, which will offer more than thirty hundred exhibitions across six cities from January 5 to March 25, 2020. The exhibition will run concurrently with the upcoming edition of the Venice Biennale, which will take place in February 2020.“We are thrilled that the upcoming edition of the Venice Biennale will be set in Turin, with the new exhibitions and the new programming,” said Stefano Sollitta, the inaugural director of the exhibition. “The project at Turin is an ideal platform for the development of an international image of the city, and for the exhibition of work by emerging and established artists.” The exhibition will start with a residency program that will take six months to a year to develop and will include titles including “Theater of Disruption: The City of Turin” and “Carpe Diem: The New Urbanism.The inaugural exhibition, “Theatre of Disruption,” will present works by twenty-six artists, including Alison Hsu, Lisa Porco, Eduardo Sabatini, María Berr", "The next Biennial should be held in 2022.  The National Museum of Canada, located in Ottawa, will host an exhibition of work by French artist Marc Chagall in March 2020.  The Royal Ontario Museum in Toronto will also hold a biennial in March 2020. The institution has released a further schedule of events. In the United States, the Metropolitan Museum of Art, which is slated to open in 2020, recently announced that it will extend the opening of its inaugural season by two years, from March 21, 2020 to March 22, 2020. Private sales of art are expected to grow 14 percent in the United States in 2020, with the percentage of artworks sold in private sales increasing by 20 percent. “With the market now at a peak of $9.7 billion, there is great uncertainty over the future of the art market and its financial health,” said Gerta Gast, director of the Metropolitan Museum of Art. “We are working with a global team to address this challenge. For the first time, we have selected the next generation of Met staff to lead the charge into the future. Desigual Boisjoly, who has been working at the museum for twenty-four years, will take", "The next Biennial should draw from existing programs in the arts and humanities, including the Paine Webber Program at the University of Texas at Austin, the Bezalel Art Center, and the Ronald McDonald House in Irvine, California. The biennial’s theme, “Sustainability, Ethics, and Performance:” will be a reflection of the historical and contemporary debates around sustainability and ethics. Additionally, a new exhibition of work by artists selected from the US, Europe, and Asia will be presented. The biennial will run from February 26 to March 27, 2020.\n\n\nLawrence Hoffman, the Detroit–based artist whose work incorporates elements of wild and historic craftsmanship, and whose extraordinary brick structures and landscaping evince a vision of urban fabric and landscape that has been radically and ineffably reconceived by contemporary art, has died. He was eighty-one years old.Born in New York City in 1941, Hoffman moved to Michigan with his family when he was only three years old. The family relocated to Grand Rapids, Michigan, where Hoffman attended elementary school, but the family settled in Michigan’s Upper Peninsula, where his father took on a construction career. Hoffman’s father died when Hoffman was three years old", "The next Biennial should be held in 2020.”The biennial exhibition “Spring/Fall: Avant-Garde in the Making” will be held at the Volksbau in Frankfurt until 2023. The exhibition will focus on the work of one hundred Italian artists. The exhibition will include an exhibition of works by Steve Jones, Claude Monet, Mary Cassatt, Edvard Munch, Jean-Luc Godard, and others. In addition, a program of shows and other activities for young artists will take place in 2022.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, will implement a new $300 million fund designed to help artists in the city through its first year of recovery from the coronavirus, Covid-19. The fund will be managed by the nonprofit the nonprofit Arts Impact Fund, which has received $500 million from the California Reinvestment and Growth Fund, the California Family Aid Fund, and the California Community Foundation, and is slated to launch in the fall of 2020.“At a time when it has become ever more challenging to maintain a healthy, thriving, and rewarding work-life balance for many artists, it is essential that MoCA continue to show and support the vital", "The next Biennial should take place in 2020 and will host a series of exhibitions comprised of works from the ’50s through ’70s that will explore the history of art in the United States, including works by artists such as David Childs, Robert Frank, and Frank Gehry.The 2019 exhibition featured works by Ken Russell, Thomas J. Price, and Jerry Silver. The 2020 edition will follow a theme of “culture and emotion,” and will be based on the theme “the body and the soul.” The 2020 event will be held at the Jet Gallery in Los Angeles, which is presently undergoing a $450 million renovation.\n\n\n\n\n\n\nDavid C. Driskell, the director of the Metropolitan Museum of Art, has been hired as the next director of the Solomon R. Guggenheim Museum in New York City. Driskell will assume his post on January 5, 2021. He succeeds Karla A. Nussbaum, who has led the institution since 2004.“After a thorough search that included a public visit by the Met, David’s selection makes sense as he is a visionary leader who has the vision and ability to bring a new level of intimacy and", "The next Biennial should take place at the Museo de Arte Contemporáneo, in Madrid, in December 2020.\n\n\nSalvador Dalí, who designed the first Grand Canal in Lille, France, and the Guggenheim Museum in New York, has died at age eighty-five. He was one of the architects behind the grandiose plans for the canal, a UNESCO World Heritage site that was supposed to stretch from the city of Lille in the south to the city of New York in the north.A member of the Gay and Lesbian Community Group (GYYG), Dalí helped the Gay and Lesbian Community Center, which was located in the same apartment building as the Gay and Lesbian Museum, in Lille, organize a press conference in order to advance the museum’s plans. The venue was chosen for its proximity to the river Seine. When the Grand Canal opened in 1971, it was only one of the many grand projects that Dalí and the GYYG created together. The architect also helped the museum prepare for its opening with the construction of the Palais de Tokyo in Paris and the Palais des Nations in Paris for its restoration and renovation in 1992. While the canal went into operation", "The next Biennial should also focus on how to deliver a more 'universal' experience to the millions of visitors who will be able to visit the museum at any one time. The exhibition will focus on new work by female artists and will feature the work of twenty artists, including Kate Crawford, John Crowley, and Fyodor Dostoyevsky. The show will also include major reconstructions of the series of world events that took place between the late nineteenth and late twentieth centuries, including the Second Sino-Japanese War and the Second Sino-Soviet War.The theme of the seventy-first edition is the history of art from the seventeenth century to the present. The exhibition will open on September 28, 2020 and run through March 25, 2021. Accommodation and transportation information will be announced in the months leading up to the show. \n\n\nThe Athens Art Museum (AIM) has received a gift of twenty artworks from the late Iranian-American painter and writer Marwa Sadr, the first American to win the Sahitya Akademi award, which is given yearly by the prestigious organization. The works were given to the institution by the Sadr Foundation after it established the National Museum of the Arts in the United States", "The next Biennial should launch in 2020.\n\n\nFrieze announced today that it is launching a new digital platform, Project, that will help smaller arts organizations and individuals working in the creative and media sectors navigate the exhibition and trade fair landscape in order to better serve the local community. Titled the Library of Connections, the platform will make collaborative and curated exhibitions and presentations accessible to a global audience through a platform that will continue to evolve with the artist-in-residence program, which is currently being piloted in Chicago, and will provide a centralized point of contact for artists and organizations seeking to sell their works.“About seventy artists are participating in the first iteration of the Library of Connections, which is an extension of the artist-in-residence program, which was introduced in 2015 and has been running since 2019,” said artist-in-residence Hayley Sze, who was nominated for a Tony for his performance In the Mood for Love. “The works presented in this platform will inspire and challenge you to think beyond where you are and what you want to create. We are eager to hear what you think about them.”The sixteen 2018 finalists will be chosen by a jury comprised of Adam Dziew", "The next Biennial should take place in the spring of 2021, and the theme should be “Art and the Ecosystem.” The exhibition will feature works by twenty-seven artists, including Hans-Ulrich Plank, Peter Staudt, Alberto Barreto, Canacarelli, and James Kynaston. The event’s inaugural edition was held at the Museo de Arte Contemporáneo in São Paulo in May 2015 and was held at the same venue the Brazilian artist Isamu Noguchi finally died in 2015. \n\n\nThe Gutturm Foundation, the Berlin-based organization dedicated to research and distribution of artworks in the city of Aachen, Germany, has announced that it will end its partnership with the German state-owned Thyssen-Heinische Landes’ main collection, which has been in operation since 2006. The institution has been receiving funding from the state since the late 1990s and, to date, has distributed more than 160,000 works to Berlin, Hamburg, and other German cities.The organization, which has branches in Vienna and Berlin, said that it no longer plans to renew the contract, which", "The next Biennial should be in the spring of 2020. The following year will be the 70th anniversary of the organization. The 2019 event, Bassute, was held at the Rosenheim Museum in Berlin. The 2019 event, “March of Bones: Six Art Deco” (which was titled “Carnivalesque”), was one of the last presentations of Donatella Bocchieri’s series of two hundred photographs, paintings, drawings, and sculptures. The biennial, for which the Italian artist constructed a series of domes, was dedicated to the psychotic patient Max Yeoman. The biennial was moved to Los Angeles in 2008 and reemerged in 2011, this time with the theme “Painting in the Age of Man” (“painting in the age of man”). Among the works on display are Revolver: The Black Madonna, 1967, a photograph series that depicts the Madonna in a black full-body paint-and-ink figure, which was inspired by the artwork of Jack Davis; Salvador Dalí’s work in the style of the late artist Marcel Prouv", "The next Biennial should be in the second quarter of 2020.\n\nGeneral Museums in Berlin, the Basel, and the 2. Bauhaus were also considering postponing their fiftieth-anniversary celebrations and shifting their fifties-anniversary celebrations to the end of the year.\n\n\nThe British Museum in London announced today that it is planning to delay its celebration of its 150th anniversary by three years. The institution is currently planning to open its new campus in April 2021. Its existing exhibition space, the galleries, and the new Martian World Gallery will be inaugurated in March 2022.“These are difficult and challenging times, and I can’t imagine a better time than now to honour and celebrate our 150 years at the Museum of London,” museum director Hartwig Fischer said in a statement. “This is a challenging decade for our institutions, and we must not allow our plans for the future to be hurt by the disruption caused by the devastating pandemic.”Fischer said the delay is necessary to allow the museum to “get it right,” the first of which she said is “getting the right building,” and to “develop a plan that protects our future", "The next Biennial should take place in the US, but will be a “multi-format” exhibition, curated by a single director. The opening will be at the Museums Association (MA), in New York; the new Museum of Contemporary Art (MoCA), in Los Angeles; and the Museum of Modern Art (MoMA), in New York.The original 50/50 scorecard’s procedure was to display the work of twenty-three artists, including Charles Mingus, Ermanno Olmi, and David Levett, in order that they might be selected for inclusion in the exhibition. The court ordered that the seventy-six works be curated by a director chosen by a public vote. The ban on the exhibition was lifted by the Supreme Court on June 14 after a three-week ruling. \n\n\nInternational Women’s Day, which was originally recognized as the day to celebrate women’s rights in Japan, was moved to March 9 because of the sexual abuse allegations against disgraced Hollywood producer Harvey Weinstein, the New York Times reports.The allegations against Weinstein have rocked Hollywood and the film industry, which has for years been a bastion for women in the entertainment industry. The allegations have led some to", "The next Biennial should take place in 2020 and will include the work of twenty-four artists. The full list of winners is as follows: The Independent: Winner:  Esther Báez, Mexico City Colectivo, 2018 IndieWire: Winner:  Jorge Corrales, Atlanta, 2020 Artforum: Winner:  Jorge Corrales, Atlanta, 2020 Artforum: The Artist’s World: Winner:  Tania Vicini, New York, 2020 Artforum: The Artist’s World: A Proposal for a New Art Biennial, Whitney Museum of American Art, 2019 (The Artist’s World: 2018)The Artist’s World: Tania Vicini's Full-Length Work, New York, 2019 (The Artist’s World: 2018)Artforum: The Artist’s World: The Life and Work of Tania Vicini, New York, 2019 (Artforum: 2019) Artforum: Tania Vicini, Albuquerque, 2019 (The Artist’s World: 2019) Noticiero Arteschi: Winner:  Lara La", "The next Biennial should begin with a selection of the best of contemporary art. The theme will be “The Body in the Film,” and the exhibition will comprise forty works, including works by artists such as Lutz Bacher, T.J. Dillinger, and G.Peter Gropius.Huang told the Art Newspaper that the exhibition will give the public a new look at his work and that the upcoming show will promote the work within a more contemporary context. The show will take place in a high-end apartment building in Beijing, which is currently being renovated, and will run from February 3 to February 6.The exhibition is part of a larger initiative by the Hong Kong–based artist to foster greater understanding between China and Hong Kong. His project, which consists of a series of interconnected installations which include interspersed portraits of Chinese and Hong Kong artists, will culminate in a show at the Hong Kong Asian Art Museum (HKAM), Hong Kong, on March 7. The exhibition will also feature a special section dedicated to China’s diaspora.“The Body in the Film is a broad and dynamic work that uses a narrative structure that encompasses both the art and the life of a young woman and its great diversity", "The next Biennial should be held in 2021 and the first in 2022. The winners were selected from a shortlist of ninety-eight artists from twenty-six cities across the country. The finalists were selected by a worldwide jury comprising artists, curators, scholars, and artists' representatives from fifteen cities, including New York, London, Hong Kong, and Paris. The exhibition is curated by Tom Tugendhatcheva, director of the Bose Art Museum in San Francisco; Harriet Winograd, founder of the London-based arts space Songbird; Joel Wachs, the curator and the curator of the biennial series “Porgy and Bess;” and Gavin Brown, chair of arts at the City Museum of New York.The Art Newspaper said that in a statement, “Clemens Claessen and Stephan have been tasked with reimagining the biennial as a place where art and politics can once again converge, where our artists can enjoy the support of a large and dedicated audience.”Clemens Claessen, the curator and organiser of the biennial series announced: “The 2015 series of shows was an important step in our ongoing research and the exhibition was", "The next Biennial should be held sometime in 2021, but the dates are not yet set. The event, which will be sponsored by the museum, will draw approximately twenty thousand visitors.\n\n\nThe Contemporary Art Museum Houston (CAMH) has appointed Richard Powers as its next executive director, effective immediately. He succeeds Carolyn Quinn, who retired in February 2019 after twenty-six years at the helm of the museum.“Richard Powers is a highly respected leader, and our board of trustees are confident that he will bring the leadership and strategic vision that made CAMH such a vibrant and innovative institution,” said Cynthia Bailey, chair of CAMH’s board of trustees. “CAMH is grateful to Debra for her leadership during her tenure and for her enthusiasm and dedication to our mission. She has been instrumental in the museum’s transition to a new space in downtown Houston, and we look forward to working with her to ensure the museum is transformed for generations to come.”Prior to taking the helm of CAMH, Powers served as director of the San Antonio Museum of Art (SAM) and as a curator at the Museum of Fine Arts in Boston. He also worked as the executive director of the Griffith Museum of Art and", "The next Biennial should be held in the autumn of 2020.\n\nThe international exhibition, titled “Between the Sun and the Moon,” will focus on the relationship between the sun and the moon in the year 2114 and the year 2125, respectively. The exhibition will highlight the contributions of different artists and will showcase new works by artists from twenty-four countries. The 2019 edition, which was curated by Chantal Hoberman and premiered at the Biennial de New York, featured works by twenty-five artists, including Paulo Freire, Jochen Roesler, and Lévy Gorvy.\n\n\nSony is working with the Royal Shakespeare Company (RSC) to create the first-ever biennial of contemporary art in the United Kingdom. Titled “The Moral of the Story,” the biennial will feature ten works by contemporary artists in eight cities across the United Kingdom—Brighton, Cardiff, Durham, Huddersfield, Manchester, Liverpool, and London—on December 6, 2020. The biennial will then conclude with an audience with an artist-in-residence.Sony will commission ten artists to create the exhibition, which is part of a six-year funding round for the RSC", "The next Biennial should take place in Minsk in January 2021. The exhibition will be staged at the FSB Gallery in Moscow, which was scheduled to host the event from March 22 to March 26, 2021. The announcement of the festival’s host was made on April 6. Artforum has reached out to FSB for a statement.\n\n\nThe Christ Church Cathedral in the Czech Republic announced today that Hristo Vassallo has been appointed as its new director of curatorial affairs and curator of modern art. Vassallo will be responsible for overseeing the development of the collection, exhibition, research and presentation of contemporary art in the cathedral’s three buildings, as well as for overseeing the construction of the cathedral’s massive new Art Deco edifice, which will be inaugurated by a performance and art-making festival in December 2020. Vassallo will take up the post in March 2021, after the installation of the new sculpture garden in the cathedral in April 2021. He succeeds Hannes Gentry, who has led the cathedral since 1985, and will be responsible for ensuring the cathedral’s contemporary art collection and exhibitions are of high quality. \n\n\nThe museum’s collection of contemporary art", "The next Biennial should be held in the fall of 2020. The São Paulo-based artist Julia Reda is currently representing Santiago-born, Chile-based theater artist João Pereira in an auction of his works, which has been scheduled since March.The exhibition will feature work by seventy-nine artists from forty-eight countries and will be sponsored by the Brazilian organization Delsa, which has been working to secure the artist’s participation in its annual based-art auction. The winning artists will be given a retrospective of their work at the exhibition in the new space of the Delsa Museum of Contemporary Art in São Paulo the same year it will hold its 2019 edition. The exhibition will run at the Museu de Arte de São Paulo (MASP), until April 9, 2020, at which point the exhibition will return to the Instituto de Arte de São Paulo (BASP), and will continue at the Museu de Arte de São Paulo until 2024.\n\n\nThe National Geographic Society’s decision to slash funding for its annual \"Philosopher’s Tour,\" which has featured ninety-five archaeological and historical sites in the United States and Europe, has upset some", "The next Biennial should take place in 2020. “We are deeply grateful to the thousands of artists, researchers, and supporters who have already made their voice heard, and who have made the Biennials possible,” said the organizers of the year-long event. “Together we will continue to shape and develop our art, landscape, and ways of thinking about art. We will continue to share our knowledge and wisdom. And we will always keep pushing, to find new ways to make the Arts accessible to everyone.”\n\n\nThe twentieth edition of the Grey Cup, a major New York fundraiser for the New York City arts, has announced that attendance will be capped at twenty thousand people. The event, which has taken place annually since 2006, will see a record-breaking $2.2 billion raised. “The event’s history is full of extraordinary moments,” said event director Loring Randolph. “The twentieth edition of the Grey Cup, a major New York fundraiser for the arts, will commemorate a milestone one hundred years in the making, with the future-changing work of hundreds of artists and their families.”The event’s 2017 iteration featured artworks by Pia Cam", "The next Biennial should take place in 2020, and the second in 2022.João Pessoa, head of the Fondazione Prada and the curator of the Italian pavilion at the Venice Architecture Biennale, which opened yesterday, said: “We are currently in the process of a reopening of the exhibition at the Fondazione Prada, which is a task we are all very proud of. The project of the new exhibition is to follow the architecture and the historical material in order to develop a new way of thinking about the architecture of the museum.”\n\n\nThe Umeda Museum in Tokyo has named five new members to its curatorial team: Melissa Aso, an award-winning independent curator based in the United States; Christian Lorencz, a curator of contemporary art in Italy; Hans-Ulrich Klainboer, a curator of photography and film; and Yoshito Nakamura, a curator of Japanese art.“We are thrilled that these five talented young women have joined our team,” said Umeda president and CEO Kimi Ikeda. “Their backgrounds and interests in the arts make them uniquely qualified for the role of curating at the Umeda Museum.", "The next Biennial should be a testimony to the dedicated time and energy devoted by the museum in creating a catalogue of the history of modern art. The vision for our upcoming exhibition is indelibly linked to the work of the exhibition partners and the biennial as a whole. The Biennial will continue to be a platform for the exhibition team and the collection, while attracting and engaging a new audience each year.”The exhibition “The Work of the Artist” was staged by the Museum of Modern Art (MoMA) in New York in collaboration with Beth Dorsen Gallery and the British Museum in London. The exhibition is one of a number of collaborative exhibits that are currently on view at MoMA.\n\n\nThe Spanish government has awarded the private museum Miraflores Pérez the Palacio de Arte Contemporáneo (PACE) in Madrid an exhibition of works by Pablo Picasso and Elisa Barozzi, which are scheduled for the museum’s exhibition “Pablo Picasso: The Artist’s Body” later this year. The program will include the artist’s work in the Madrid gallery and will be presented as part of the fifth edition of the Spanish pav"]