["The next Biennial should take place in 2019.Dark Horse has announced that it is collaborating with the Italian architect Dario Catellani on a new series of exhibitions that will explore the history and the contemporary art of the city of Milan, which is currently undergoing a major renovation. The project, titled Uncranos, and will run concurrently with the upcoming Milan Biennale.The partnership between the Italian architect and Dark Horse began when Catellani was the creative director of the luxury goods brand Tag Heuer. He asked the company to design a space for the exhibition series for Milan in the former museum of the Art Institute of Chicago (IAC), and he was hired by the city of Milan in 2016, and then, in 2018, it was the venue of an exhibition titled Toledano, an homage to the Italian thinker Antonio Tezzolo. Commenting on the collaboration, Milan architect Dario Catellani said: \"We were invited to design the first exhibition as part of the plan to improve the exhibition space in the new museum. We were given the opportunity to design the exhibition space for a contemporary exhibition of the artists in the city of Milan in the former IAC museum, and we are profoundly inspired by the buildings and", "The next Biennial should be staged in December 2021. The next edition of the Biennale will take place in the spring of 2022. \n\n\nThe National Gallery of Scotland has received a donation of twenty-seven works by twenty-six artists from the collections of the two countries. The works will be launched into the new £9 million Cultural Heritage Environment, which will help the National Gallery of Scotland retain and distribute the works.The National Galleries of Scotland (NGM) and the Scottish National Museum (SNM) are planning to jointly develop a new biennial that will bring together contemporary art from Scotland and the rest of the United Kingdom. The new event will unveil its first works on Wednesday, March 14, 2020 and will take place at the National Museum in Scotland, the National Museum of Scotland, and the Scots Museum in Edinburgh.The works will be presented by two artists: Edvard Munch and Etienne Pinot. The NGM will be partnering with the National Museum of Scotland to produce a new series of thirty-five works by the artists and will present works by the six-thousand-piece exhibition, which will run concurrently with the series of Biennales in Rome and Venice. For the first time, the National Gallery of Scotland will", "The next Biennial should begin with an overview of the history of the art world, with a focus on the achievements of the last ten years, and should then present a selection of the work of thirty-three artists, including Madeline Gins, Peter Andre, Max Beck, Richard Avedon, and George Rodrigues. Selected by Biennial Director Manuela Andreotti, the biennial will be hosted by the Museo del Laboral, in Madrid; the Museo de Arte Contemporáneo de Madrid; and the Museo de Arte de Santiago.The selection committee consists of Francisco Javier Pérez, director of the Museo de Arte de Santiago; Ana María Busquets, director of the Museo de Arte de Santiago; Raimond Sarr, editor in chief of the Art Newspaper; and Agustín Pascual, director of the Museo de Arte de Athens.\n\n\nThe Museum of Contemporary Art (MoCA) in New York announced today that it will begin welcoming visitors back to the institution, following a temporary closure due to the Covid-19 pandemic, by mid-August. The institution says that it expects the reopening of the cultural district to take place sometime in September", "The next Biennial should be held at the Stedelijk Museum in Amsterdam in the spring of 2021. \n    \n\n\nThe Metropolitan Museum of Art in New York has appointed Kate Head of the Metropolitan Museum of Art, which shepherded through a $1.3 billion expansion project in 2021, as its new deputy director of exhibitions. Head has been a top adviser to the museum for more than two decades and has helped the museum navigate its way through a $3 billion reorganization, which opened in 2017, as well as months of protests by art-lovers and critics. Head will be responsible for bringing together and organizing the museum’s collection of more than 6,500 works, which comprises works that have never been on view before, and will assume her post in January 2022.“Kate has been instrumental in the museum’s development since she arrived in 2003, when the brand-new $1.3 billion Met Galerie in Manhattan served as the central hub for the collection,” said director Thomas Griffith. “It is an honor to welcome her to the Met, and I’m confident that she will continue to advance the museum’s mission with enthusiasm and a sense of humor.", "The next Biennial should be held in 2021 and will be organized at Washington University in St. Louis. The twenty-second edition of the biennial will be held at the Museum of Fine Arts in Boston in 2022. The new ten-day event will be held at the Blue Mountains Resort and Conference Center in New Hampshire. The new event will host approximately fifty exhibitions and will feature various installations, including a museum-scale installation by the Italian artist Oreste D'Hebborn. “This is a moment of great change for the art world as we know it,” said Artnet editor in chief Erik de Castro. “This year’s Biennial will be the last, and perhaps the best, the world over. We look forward to the next—and to supporting the new and the old.”\n\n\nThe seventeenth edition of the Berlin Biennale, curated by an intergenerational group of South American curators from fifty-six countries, has been renamed after the twentieth-century Colombian painter and activist Agustín Arteaga. The event, which is being hosted at the iconic Brandenburg Gate in Berlin, will now take place in the historic Präsidentischer Straße. The", "The next Biennial should be this fall. “For many artists, a festival is the only possible format to redress the world’s greatest pressing concerns, at the time of their greatest need,” said Kirsten Ahearn, chair of the board of directors of the Biennial. The Biennial was founded by the Shanghai Gallery of Art, Shanghai Contemporary Art Garden, and Shanghai Literature Festival; and the Garden was founded by the Shanghai Art Museum and the Shanghai Museum of Fine Arts.\n\n\nThe Baltimore Museum of Art (BMA) is planning to open a new, 21,000-square-foot museum dedicated to the works of African American artists in the city in 2021. The new museum will be located in the former Pink Houses, a former Johns Hopkins hospital that has served as a Pink Houses museum since 1972, and will be inaugurated by the artist and activist B.B. King and will be inaugurated by King as well as a selection of his work.“Our vision for Museum of Baltimore is to transform the institution into a shining beacon of civic engagement and cultural understanding,” said museum director Christopher Bedford. “We are entering a new era as we embark on a new, ambitious mission to shape the", "The next Biennial should be held at the Western University of Arts in Shanghai, to be held in the spring of 2022; and a new exhibition of work by the artist Mihaly Csikszentmihalyi, to be staged in the autumn of 2022. While the first show was initially scheduled for November 2019, the exhibition was rescheduled for October 2022 and the show has since been moved to September. In an attempt to secure the artist’s support, the Biennials have also increased the biennial’s budget, which was initially set at $1.5 million.The Arts Council is also renewing its longstanding partnership with the Pérez Artes in Mexico City, which has hosted the largest number of Biennials in the country’s history. The Pérez Artes, which was founded in 2005 to promote the work of young Mexican artists, announced on Monday that it would remain open, and will receive $3 million from the Biennial for its commitment to supporting the work of artists. In addition, the Pérez Artes will receive $450,000 to help retain the works of the Pérez Artes’ collection in Mexico.“After a year of representing the artist", "The next Biennial should focus on “magic realism”\u0097a term coined by artist Larry Achiampong to describe sculptures and installations that challenge traditional notions of what art can be, and can do. This year’s theme is “Chinese Painting” and will be “Chinese Paintings: The Chinese Dynasty”\u0097a painting that challenges the idea of a Chinese nation in Europe.\n\n\nTaoism’s Federa Kahane: 13 Years of Hanging. Art by Andrea Graziani. The exhibition will feature works by Antonia Clemente, Filippo Prada, and Paolo Penna, among others from the 1970s to the present. The first show, “Lego Legos: 13 Years of Painting” (September 7–November 18), will be on display until December 28, 2020.The Jerusalem-based venue will stage a retrospective of work by the Italian Sara Cataldo, Todavalli Di Cristo, and others from the 1970s to the 1980s. The show will be preceded by a solo exhibition of works by artist Mario Merz, whose work spans art history and contemporary research and is currently on display at the exhibition “", "The next Biennial should take place in 2022. The next Triennale in 2020 will take place in 2021. The next Art Basel Hong Kong will take place in 2021. The next Art Dubai will take place in 2021. The next Art Dubai will take place in 2022. The next Art Dubai will take place in twenty-six months.\n\nThe British Film Institute (BFI) in London has been forced to cancel a number of programming events and has been forced to move the first edition of the BFI London Triennial from the venue to the National Gallery in London. The move has been made in response to planned legislation that would require British museums and cultural sites to demonstrate a plan to secure the future of the 75 percent of the UK’s cultural assets that remain unutilized after the UK leaves the European Union.The BFI has been forced to postpone several programming events and has been working with the National Gallery to resolve the situation, which it describes as “complex and nuanced.” In a statement, the institute said: “The BFI is working closely with the National Gallery to understand the precise impact of the proposed legislation and to consider any options for rescheduling or rescheduling the show", "The next Biennial should take place at the Chelsea Art Museum in New York, in March 2021, and will include the work of sixty artists, including Gianluca Bernardi, Ferran Braga, Damien Hirst, Mohsin Raza, and Rirkrit Tiravanija, and will be the first to take place in the United States.\n\n\nThe Metropolitan Museum of Art in New York has appointed Sandra Cisneros as the next director of its Artist’s Colony. She comes to the institution from the Museum of Modern Art (MoMA), where she has served as interim director since April 2019.“Sandra is an accomplished curator and one of the few people in the country who has been able to grow the museum’s collection to truly international acclaim,” museum director Christopher Scoates said in a statement. “Her vision and energy are infectious, and we are proud to support her as she continues to shape and revitalize the artist’s colony.”Cisneros succeeds Anne McNamara, who was fired in April 2019 after a decade at the helm of the museum and is currently facing a number of lawsuits related to her termination. She will take up the post in January 2020. \n\n\nThe Institute", "The next Biennial should take place at the Guggenheim Museum in the fall of 2020. “The new project, ‘The Trembling Washing Machine,’ will be a work of art that follows this model,” Kathleen McDonough, the Guggenheim’s director of exhibitions and programs, told the Art Newspaper. “The exhibition will be a combination of modern and medieval techniques, reflecting the vast and varied traditions of the art world in the country. We are thrilled to announce that it will be a unique opportunity for the Metropolitan to showcase art from the local community.”The museum also announced that it will be renovating its current exhibition space, the Whitney Museum of American Art, which it has occupied since 1999, and will begin work on the renovation of the adjacent Basilica of the Immaculate Heart of Mary. The work will involve the reworking of the facade and interior of the museum, reconfiguring of the building’s east wing, and the installation of new works. The work will be a response to the exhibition “The Other,” a review of an exhibition of works by the same artist that opened at the library in 1990.The works will be presented in a", "The next Biennial should aim to address the current political situation in the DPRK. It should also focus on the contribution of Korean artists to international culture in general, as well as on the exhibition of work by Korean and international artists in partnership with the DPRK at the upcoming Biennial of the Korean People in Paris (October 4–October 6) and the upcoming Biennial of Contemporary Art (October 7–October 9).\n\n\nAs the French city of Nice recovers from a major fire that swept through a small industrial area on Monday, authorities have confirmed that there are no injuries and that the building, which houses a sorting and storage area for artworks, is safe. Though the cause of the fire is still under investigation, the authorities believe the building is at least forty years old and was not supposed to be used as a dwelling.While firefighters battled the blazes that began at a gasworks factory near the city, the surrounding area was evacuated on Tuesday morning. According to the AFP news agency, the firemen who extinguished the flames in the industrial area found no trace of the fire. “The building housed a collection of twenty-five thousand works, which were never meant to be sold,” Paris’s culture ministry director Laurent Fab", "The next Biennial should take place in 2020, but the organizers are currently monitoring the outcome of the ongoing Global Campaign for Real Estate and believe that the event will continue to take place. “It is important for us to take a hard look at our own institutional models, and think about how we might build on the work of the last six years,” said Katja Pfaff of Oxfam. The grace of the arts is a fundamental human right; it is essential that the right to it is protected.\n\n\nThe Museum of the African Diaspora (MoAD) in New York has appointed Bella Paschke as its new executive director and director of communications. She succeeds Beverly P. Carter, who has helmed the institution for the past sixteen years, and will begin her new role on January 5, 2021.“Bella is a seasoned executive who has successfully navigated the evolving leadership, strategic vision, and cultural landscape of MoAD in a decisive way,” said Carter. “Her leadership has been transformative and has impelled our team to accelerate the transition to a new leadership team, a new organization, and new programs. We are grateful for her service and confidence in this new chapter of our history", "The next Biennial should run from March 26 to March 28.  Dr. Solveig, who has been working with the Tate for four decades, said: “The exhibition of my work is not meant to be a statement of a particular theory, but a response to the question: what is life? What is the way of life? The question that this exhibition asks is the question that many contemporary artists ask themselves every day. The exhibition is doubly important in the context of a sweeping social transformation that is taking place as we speak.”The exhibition will include new works by Danish artist Anne Hegde (2017), Guadalajara-based artist Javier Muñoz (2018), and the feminist artist María Berrío (2017). The list of artists who will receive the prestigious 2020 prize is as follows:Anthea Hamilton (2017), University of the Arts LondonB. Maud Baron (2019), Crown PalladiumBirgit Baille (2019), O2 AcademyBijan Baille (2016), the Center for Contemporary Art in GenevaBijou Sattar (2017), winner of the Ivorian Academy of Arts’s Artist PrizeBianca Baille (2019), ArtforumB", "The next Biennial should be due to kick off on September 24 and will be attended by a select group of internationally acclaimed artists from sixteen countries. One hundred percent of the prize money will be distributed via the winners’ own funds, as opposed to a prize fund established by the organizers. “This biennial will be the beginning of a new chapter for the Biennale in Paris,” said Francis Grotjahn, chair of the committee of five and a former president of the Biennale. “Art is a universal language and the exhibition will give a special form to the rich and vibrant voices of artists from different countries and different continents.”Participants will be announced in mid-September and will be announced by September 21. These artists will be selected based on their performances, their future projects, and their artistic visions.The 2019 edition of the Biennale, titled “Art in the Age of Resistance,” will feature works by forty-eight artists from fifty-nine countries, including Belarus, Canada, Mexico, New Zealand, and Russia. The theme of this year’s edition, “Better Life,” addresses the future of a better world and the challenges that could arise from a return to", "The next Biennial should include an exhibition of works by the upcoming work by Maurizio Cattelan, from its collection, and “The Art of Surrounding,\" a show organized by the Montecito Museum of Modern Art in Rome. An upcoming exhibition of the works of the Italian architect Francis Pirotte will present the work of the former director of the Royal Academy of Arts, Paolo Barletta, and will showcase work by the late Italian designer Gio Ponti, who was known for designing houses and for his experimental and stripped-down aesthetic, respectively.\n\n\nThe Haus der Kunst (H.D.K.), an international contemporary art research and exhibition space in the Düsseldorf city of Graz, Austria, has appointed the Czech Republic–based artist Miloš Špoleto, who has been working in Russia for the last five years, as its inaugural artistic director. Špoleto, who is based in Stáre, a small town in the Czech Republic, will be responsible for transforming the structure of H.D.K., which is based in the Kreuzberg district of the capital, Vienna, into a research center for contemporary art.", "The next Biennial should be held at the San Francisco Museum of Modern Art.  The third biennial held at the Museum of Modern Art in New York is currently on view. The fourth biennial will be held at the Los Angeles County Museum of Art. The fifth and final biennial will be held at the Institute of Contemporary Art, Miami Beach. All five of the biennials will be presented by the American Institute of Graphic Arts (AIGA). The thirteen‐week‐long event, which will take over a hundred thousand people, will focus on a theme of “new realities,” “contemporary art,” “postcolonial art,” and the designer. The biennial will be hosted at the Museum of Contemporary Art, Los Angeles through February 15, 2020. “Each year, AIGA brings to life new and exciting works by artists whose work we appreciate, and whose work we hope will inspire us,” said festival director David Jordan. “We are deeply indebted to the AIGA staff and to the museum for their enthusiasm and diligence in supporting our exhibition program for 2017.”\n\n\nThe Museum of Modern Art (MoMA) in New York has", "The next Biennial should be held in the summer of 2021. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Erin Corbett as its next director. Corbett has been a longtime assistant curator at the museum and has been a member of the staff of the MFA since it opened in 1966. She succeeds Tina Jobian, who retired in 2018 to pursue new opportunities in academia and the arts, and will begin her tenure on December 7.“We are delighted to welcome Erin to the MFA,” said David Levine, chair of the trustees of the arts philanthropic organization. “Her background and passion for the museum and her commitment to serving the MFA and her passion to continue to push the boundaries of what it means to be an arts supporter and advocate make her perfect for the role.”A scholar of nineteenth-century American art, Corbett’s development of an interdisciplinary, interdisciplinary program, which engages with the history and theory of American artmaking, will be key to expanding the museum’s international profile. Corbett said: “In a time when it is so easy to separate artmaking and theory, it is also a time when artmaking and theory can", "The next Biennial should be up and running by the end of this year, and the first biennial will be held in 2021. Last year, the museum held just twenty-four exhibitions.\n\n\nThe West Linn Art Museum in Oregon has received a gift of forty-three works by twenty-four artists. The donation, made by collector and philanthropist Robert C. Tyson, comprises twenty-three works by artists known for their efforts to change the course of American painting during the 1930s and 1940s. Included in the donation are forty-four paintings by artists who have never previously been on display in the museum—including John Goodman, Neil Herd, Raymond LeBlanc, and Margaret Mitchell—which opened in 2009 and 2017, respectively.The museum also revealed that it purchased twenty-six works by artists who are no longer represented by their private collections. In addition to the works, the institution also acquired five works by the artist who inspired the most recent exhibition, the museum’s exhibition “Beyond Botticelli,” which is currently on view until December 13.“I’ve not had a private exhibition of this many works, and I’m delighted to see that even more artists are eager to share their", "The next Biennial should take place on the island of Manhattan in 2021, and the first will be staged in 2021. The biennial’s programming will include two exhibitions that will present the works of thirty-three artists and collectors, and the exhibition will be held in the city and will feature ten works created by thirty-two artists, including Myrna Bocchieri, Patricia Chiu, Anna-Marie Csokas, Edith Conti, and Nancy Dupuis.A selection of the works will be presented in the new exhibition, “American Painting: Modernism” (2019), which will open in September 2020. The exhibition will consist of twenty works by twenty-three artists. The collection will be included in the forthcoming exhibition “American Art: Its Rise and Fall” (2019), curated by Mark A. Williams, at the Metropolitan Museum of Art.In an open letter published on November 27, 2018, the artists wrote: “We believe that the future of art and design is at stake. Our mission is to explore ideas and to provoke questions. We hope that our new work will help shed light on the current difficulties facing designers and curators—issues that are not new but are in need of our", "The next Biennial should be held at the Institution of Contemporary Art (ICA) in Beijing from March 23 to March 28, 2020 and will be co-chaired by director Hu Jie and director Yu Shuiyao. It will feature works by seventy-five artists from twenty-six countries. “A big priority for us is to take the exhibition program to the next level,” said director Hu. “Featuring works that are not only from China, but from an international, indigenous, and national scene’s perspective, which would be a big step in establishing the Chinese art scene as a global success story.”\n\n\nThe first major Chinese retrospective of the artist Ai Weiwei’s works opened in Beijing this week, and it was also a retrospective focused on the artist’s late father, Ai Weiwei. The exhibition featured works by fifty-seven artists, including Ai’s contemporaries and fellow pioneers, Li Di and Haikusen Liu, and will be staged at Foshan Palace Art Museum until December 20.The show will be accompanied by a new book, Ai Weiwei and His Childhood, a compendium of stories from the artist’s childhood through the artist’", "The next Biennial should be staged in late November/early December. “We will be speaking to the Museum of Modern Art about the possibility of presenting the biennial in late November or early December,” the institution said.\n\n\nThe Australian Council of Classic Art (ACCA) has announced that it is withdrawing from the 2019 edition of the International Classic Art Biennial (ICB), which was set to take place in Melbourne from November 22 to January 6. The news comes two days after the organizers announced that they would postpone the event, which was to have been held in March, and instead focus on developing new communication opportunities between the United Kingdom, Australia, and New Zealand.The event was slated to include twenty galleries and eight artists from the United Kingdom, Australia, and New Zealand. The exhibition was to have been curated by Alfred Stieglitz, and would have featured works by twenty-three artists of African and Asian descent. Among the artists chosen for the biennial are Tawana Ahmed, Samuel A. Jackson, David H. Wood, and Richard Torschach.“This year’s event offered a truly groundbreaking collection of works by exceptional international artists from the last fifty years, and we were pleased to collaborate with all", "The next Biennial should be added by the end of the year, with a presentation of work by each artist in its first exhibition. The organizers are also considering the extension of the exhibition as an exhibition of the exhibition of work by another artist.In the 2015 edition of the Biennial, the works of the twelve artists nominated for the Award for Shortlisted Works were presented by Janette Laverdière, Ian Johnson and Michael Ellsworth, respectively, and were selected by a jury comprising James T. Hennessy of SculptureCenter, Vinnie Jones of Paddle8, and David Lewis (sp) of the National Gallery of Art. The full list of winners is as follows:John Akomfrah who cofounded the eponymous Chicago sculptor’s collective with his brother Robert in 1957. His first exhibition at the Chicago Museum of Art (CMA) was an “Arts of Life” exhibition in 1973 and his first solo show at the CMA in 1977. The show “The Power of Stations,” was one of three in the United States, in 1975 and 1978, and the exhibition “The Handmade Chair,” in 1976, is considered to be the seminal exhibition. The CMA", "The next Biennial should be held in the Fall of 2022. The 2019 edition, which was organized by the Committee for the Exploration and Preservation of Modern Art (CEMAM), took place in 2020 and marked the return of the Portuguese artist Joan Miró, whose work is based on a concept of the female body and the vaginal canal. According to the New York Times, the first pavilion will be dedicated to the work of the Argentinean Vítor García Místico, whose work is notable for its experimentation with photography\u0097the artist often used his Landscape to depict large-scale objects, such as the film, the canal, and the Roman Empire.The pavilion’s curator, Santiago García-Murillo, said that the aim of the exhibition is to reflect the diversity of categories that surround art, and that the work of the artists represented in it are not necessarily opposites: “For some, the body is both art and form. For others, the body is both art and poison. For others, it is both art and resistance. For others, it is both visual art and ritual art. For others, it is both performance art and poetry. For others, it is both spirituality and", "The next Biennial should be held in December 2021. The next exhibition should be held in May 2022.The latest news about the city’s arts and culture will be announced by the Museums Association, the Royal Edinburgh Military Tattoo, the Edinburgh Festival and the Edinburgh Art Festival. The ten-city show will be held at the National Gallery, in partnership with the National Museum of Scotland, in Edinburgh, the Gates of the Scottish Rite, and the Scottish Parliament Buildings. The event is being organized by the National Arts Council and the National Museum of Scotland. The biennial will feature forty-five works by forty-four artists in addition to the works that were selected for inclusion from the London-based panel of curators who were nominated by the National Geographic Society. The biennial is being organized by National Geographic, the British Museum, the Institute of Contemporary Arts, London, and the Tate. The National Gallery has also released a statement regarding the upcoming events. The statement reads: The National Gallery has been working with the National Geographic Society to develop an exhibition dedicated to the art of design, and to engage with the global zeitgeist. The new exhibition will draw from the theme “Design and the Body", "The next Biennial should be held in Milan in the first half of 2022, with the theme 'The Shadows, The Light,” according to the Art Newspaper. The exhibition will feature works by sixty-nine artists and will run for twelve weeks.\n\n\nThe UBS Global Art Market Intelligence (GEM) announced today that its second edition in the Shenzhen Biennale, curated by Arthur Rösler, has increased its sales forecast for the Chinese art market by 15 percent in the coming months. The fair, which will take place in September in Beijing, will now forecast the second half of 2022 as a period of sustained growth for Chinese galleries.GEM Shanghai will now estimate Chinese galleries will be able to maintain their business during the coronavirus epidemic, which has already been blamed for a spike in Covid-19-related deaths and a sharp fall in the number of visitors to Chinese art museums. The exhibition will also feature new projects from emerging and established galleries. “Expectations for the exhibition have changed significantly since we first announced it,” said UBS’s managing director Tobias Wong. “While we have remained vigilant to accurately forecast the Covid-19 crisis with our research, we no longer", "The next Biennial should take place in the autumn of 2020.  The goal of the Biennial, which officially launched in September 2007, is to create a new kind of art exhibition environment that addresses the issues and concerns of the present and future, the body and the soul. The 2020 event will be hosted in the Contemporary Art Museum St. Louis, the 20,000-square-foot Hirshhorn Museum in Washington, DC, and Art from the Earth, an outdoor art-making platform located in the foothills of the Blue Ridge Mountains in eastern Vermont. There will also be an exhibition of works by the artist Larry Achiampong and the theater company the Midsomer Rink in New York.Participating artists will include Alan Hirschhorn, Lincoln Michelson, Nina Lewis, and Elizabeth Manning. The exhibition will highlight the work of sixty artists and will also be infused with a cultural touch that will address issues of ecology and art. The artist-run space will be housed in a former cattle feed yard and will be located on four preexisting city properties. The theme of the exhibition is “Heart of a Nation,” a reference to the historic speech by President Barack Obama at the", "The next Biennial should be filled with the work of artists from various countries. Also, I have reconsidered the title of the exhibition, I want to focus on the work of artists who have not yet been represented here.” The rotating roster of artists selected for the exhibition will be announced in the coming weeks.\n\n\nThe permanent collection of the artist-run gallery in Paris is celebrating its thirtieth anniversary this year. Founded by the late French curator Anne-Claude Lévy-Plastique in 1967, the gallery has been housed in the same building on the Rue de Ville for more than thirty years. (The current iteration of the gallery, Lévy-Plastique Contemporary, opened in the same building in 2013.) The museum has previously held the exhibition “Lévy-Plastique: The Art of the Contemporary” in 2011 and “The Final Days of Michelangelo” in 2008. Its current exhibition, “The Last Days of Adam and Eve” will reopen in January.The biennial, which was created during a ten-month period in 1967–66, is organized around the concept of “autobiography,” or the creation of a work by", "The next Biennial should be held in the spring of 2020. The new series, which includes work by ten soloists at a time, will feature the work of a select group of artists and will showcase the work of a rotating group of artists. The 2019 edition, titled Between the Sun and the Moon, was staged by the artist-run Triennale Berlin and will run for thirty days. The artist-run Bodega Rubina/Fiorillo Madrid also recently launched an initiative that will bring together artists from the former Soviet Union and Central and South America for a series of events. The first annual Dahren Wimmer Memorial Prize, which is awarded annually by Bodega Rubina/Fiorillo Madrid and the Biennale, was established in honor of the Czech artist-activist, who mostly worked in the underground until his death in 1991. He was one of the first artists to be forgotten by the state and was one of the few to escape the Cultural Revolution. The award is awarded to the artist who has made the greatest contribution to Czech culture and to the Czech Republic. In lieu of the prize, the artist is awarded a volume of his work, The Best of Czech Writing, edited", "The next Biennial should be announced by the end of the year. The seven-day event will be held at the historic Guggenheim in Venice. The festival will present the work of seventy-seven artists, including actors, choreographers, writers, musicians, and architects. Among the key themes addressed, which will include “the body, the self, the soul, and the environment” are the body and its relationship to the environment; art and nature; and the relationship between art and society.\n\n\nThe Laundromat Project in New York City is donating $2 million to the Whitney Museum of American Art to help support the curation of “Messages from the Laundromat,” an exhibition that will examine the legacy of American art through the oral histories of seventy-eight individuals. The project, which was inspired by a performance by the artist Artur Davis at the Pearl, has selected fifty-one individuals to narrate their lives and the work of American art.The thirty-six-person selection committee comprised of Davis, the artist and curator Laurie Anderson, the curator Victoria DeJesus, and the Laundromat Project cofounder Arturo de la Peña, which is located in the basement of the", "The next Biennial should be the date of the exhibition “The Black and White of the Institutions.” The exhibition will be on view in the Hong Kong Asian Art Museum until September 16. The Hong Kong Museum of Art is currently closed and will remain closed until at least the end of May. The National Museum of Modern Art in Beijing is currently closed. The exhibition will remain on view until May 1 at the National Museum of Contemporary Art, Beijing (OMA), and will be taken over by the National Museum of Fine Arts, Taipei.\n\n\nThe Flemish-born, Washington, DC–based artist Christian Hofmann, whose intense, conceptual canvases push the boundaries of painting and sculpture, has died at age eighty-nine. His artists’ relationships with the museum of modern art in Zürich (where Hofmann was born) and the Allen Memorial Art Museum in Detroit (where he studied at the University of Michigan), as well as his own body, are well documented.Born in 1961 in Zürich, Hofmann first studied at the Academy of Fine Arts in Vienna under the titular director of the Kunstakademie from 1968 to 1972. He continued his art studies at the Academy of Fine Arts in Milan", "The next Biennial should be held in the fall of 2020. The announcement was made during a ceremony at the Miraflores Museum of Art in New York, where the exhibition was organized by the museum in partnership with the New York Public Library, which is responsible for the collection of the exhibition. The first iteration of the exhibition, which opened on December 5, 2016, featured the work of seventy-six artists. The collection will continue to be organized online through the meantime.The biennial will also include projects by Diane Arbus, Turner Prize–winning curator of the contemporary art of the Americas, as well as a selection of works by painter-politicians Javier Marí, Nava Pindell, and Maria Aland, who together comprise the Fundación Nacional de Arte Contemporáneo (FNAC), leading contemporary art museum in Buenos Aires.The biennial will present a selection of works by artists and collectives from seven countries: the United States, Australia, Japan, Mexico, Canada, and Ecuador. The show will also include an artist residency program, an artist-in-residence program, and a series of solo and group exhibitions.\n\n\nOn Saturday, the Spanish parliament voted to recognize the political independence", "The next Biennial should be a celebration of the life and work of Rosa Luxemburg and the Berlin art scene, beginning with a review and a selection of her works. Over the course of the next two years, the biennial should present a selection of new works by the artists featured in the exhibition, which will feature works by forty-eight biennial artists and writers, as well as a selection of essays by Rosa Luxemburg and other socialist and communist thinkers. The exhibition will be divided into two parts: “The Communist Party in Germany’s Third Reich’s Art Movement’s Struggle’s Struggle,” which will feature fifty-two works by artists of the communist movement in Germany; and “The Communist Party and the Workers State,” which will feature forty-nine works by socialist and communist writers. The catalogue will also feature a selection of biennial works by artists from Poland, Belarus, Ukraine, Romania, and Italy, as well as a selection of works by contemporary artists in the Soviet Union and Eastern Europe. The exhibition will open on October 10, 2020 and will run until December 31, 2020. The biennial will be held at the Museum Arsenale di Milano from January", "The next Biennial should examine the influence of the artist’s domestic environments on his artworks, and should consider the role of the artist in the development of new ideas, both for his own work and for the contemporary. There should also be an examination of the relationship between painters and their environments.Examples where and when the artist was living include his family life and his work in France. The collection should include paintings, drawings, prints, lithographs, and acrylic paintings. The selection should be led by the artist’s wife and curator in addition to the curator of modern art and contemporary art. The biennial should take place in London, in collaboration with the Tate, and at locations that are accessible to both the public and the artist. The exhibition will also be organized in cooperation with the University of Leeds. If the work is chosen for the biennial, it will open in October 2020.\n\n\nAfter the Los Angeles County Museum of Art (LACMA) and the Metropolitan Museum of Art (the Met) opened a new museum in Westwood last month, the institutions announced plans for the future of their historic buildings. The institutions have been working on the designs for more than a decade and were awarded a $130 million grant from the California Community", "The next Biennial should be devoted to “The Future of Art” (2019–2020), a twenty-five-year retrospective of Japanese artist Ikeda Ōkawa, whose work explores the world of the future through his experiments in holography. (The 2020 iteration of the event will open in Dusseldorf, Germany, and be staged by the German art institution Königstädter GmbH.) The 2019 awardees are: Ai Weiwei, Friedrich Schlegel, Arsht/Wolf, Lau Guajava, Kaptain Yousuf, Lucian Freud, Noir, and Thomas Alva Edison. The 2020 awardees are: Howard Zinn, Arts, Animation, and Art, Amadeus, Dusseldorf, Germany; Luis Chiu, Art, Design, and Architecture, Amherst, Massachusetts; Amitra Nandini, Art, Design, and Architecture, New Delhi; J. M. Polidoro, Art, Design, and Architecture, Torre Artes, Rome; Nino Rodriguez, Art,", "The next Biennial should take place in 2021.\n\n\nThe International Council for Museums (ICOM) in the United Kingdom announced today that it is backing a bill that would establish a national museum dedicated to the history of the British Empire (B.E.A.). The bill, which is currently before Parliament, would also establish an eleven-day week, raise the minimum wage to £9.00, and phase out fossil fuels.“We are pleased that the government is making genuine efforts to help the museums that are working hard to present an inspiring and informative view of our history,” said Christa Wilson, executive director of the British Film Institute. “We hope that this new museum will further the ambitious vision of the statute, and that it will become a model for how the government can support the arts in all their diversity and diversity of forms.”The British Film Institute (BFI), which is affiliated with the British Film Institute and the Royal Shakespeare Company, is working with an artist-in-residence in order to commission a new film by the British architect and theorist Kiyomi Arima. The BFI will present a free preview screening of Arima’s work at the BFI London’s new location", "The next Biennial should be held at the Van Gogh Museum in Amsterdam next March.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has appointed John Birnbaum as its next executive director. Birnbaum currently serves as the director of the Getty Research Institute in Los Angeles. He succeeds Luisa Arnautoff, who was hired as director of the National Council on the Arts last month, and will take up his new post in April.“John’s broad experience and commitment to the arts make him a strong candidate for the top position at MoA,” said MoA director Michael Govan. “His leadership and vision for the museum reflect a new kind of museum that is prepared to serve as a defining center for the arts.”Birnbaum will assume his responsibilities on April 3. During his tenure, Birnbaum will help shape the museum’s future plans, including by continuing to define the parameters for the building of the museum’s new endowment building, which will be built in the museum’s current location at 1215 Fifth Street in Manhattan.The museum—which was founded by survivors of the 1929 TWA Flight 800 crash in Long Island City, New York—is", "The next Biennial should be the architecturally inspired exhibition “The Triangle,” which will highlight the work of the Southern California-based artist and will take place at the Museum of Modern Art, Los Angeles, and at the San Diego Museum of Art. The exhibition will also include three films, three photography exhibitions, and a performance at the Los Angeles County Museum of Art. The program’s director, Mike Kelley, said the institution will present the art of the “triangle” in a way that will engage with “the roots and future of architecture,” “architecture’ as we know it, and ‘architecture’ as it is practiced today.” The Architectural Record presents the second edition of the Expo Los Angeles, which will now take place from January 29 to February 9, 2020. The event, which will be hosted by Lelong & Co., is expected to draw 1.5 million visitors.The Los Angeles County Museum of Art (LACMA) has announced its representation of the legendary Detroit-based, Los Angeles–based artist Shirley MacLaine. In addition to her work on sculpture and installation, MacLaine is an accomplished painter and sculpt", "The next Biennial should kick off in 2020 to coincide with the centenary of the outbreak. The first exhibition, “The Plague and the Matildas,” will be staged at the Imperial Theater of Art in Beijing in 2021. \n\n\nFrieze announced today that Cindy Sherman has been named director of Frieze London. Sherman comes to Frieze from Esri, where she has served as interim director since March 2019. She will take up the post in July.“Cindy is a brilliant, award-winning curator who has been instrumental in bringing the art of Frieze to fruition,” said Frieze director Sophie Bevan. “We are really excited to welcome her to the team and wish her the best at the new position. Cindy’s work in the field of contemporary art is rich and varied and sets the benchmark for what we hope will become a long-term strategy for our London galleries.”Previously, Sherman worked as a curator and writer at the popular magazine Artforum, where she curated “Cool Girl,” 2010, with Jen Miller, and co-edited Grown-Up With: Contemporary Art from the American 1970s with David Halberstam. She is also a", "The next Biennial should be held in the spring of 2019. Its director, Maria Bello, said: “In the upcoming year, the Biennial will remain grounded in the richness of life in all its forms, and will continue to serve, as an occasion for reflection on the history and future of art.”\n\n\nThe National Gallery in London has been ordered to pay more than $1 million to six former workers who were dismissed after they raised objections to the institution’s plan to move its collection to a new site on the Oxford Street campus. The six were disputing a proposal by the museum to move the collection to the city’s St Martin’s Place, a former Jewish community center on the university’s campus, in an effort to preserve its relationship with the university. During an 18-month strike, the workers—who were represented by the Teamsters Union—struck a deal with the museum, agreeing to work together on a revised proposal that would have reduced hours and offered subsidized housing to the museum staff. The union contract also states that the museum will hold a workforce consultation at least once every six months and will consult with employees about any possible changes to the museum’s operations.The", "The next Biennial should take place in the city in 2021. The current iteration of the event, which will be presented by the Hamburg-based museum in partnership with the German government, drew an attendance of only 7,500 on Saturday. “More than anything, it is General Convenience that makes the present strong-enough, a chance to give the world a new experience, a new way of looking at the future,” Wolfgang Kuehn, chair of the symposium, told the Art Newspaper. The exhibition will also present a selection of works by artists exhibiting varying levels of artistic expertise across its nine-acre space in the city. The list of invited artists is as follows:Arts: Jonas Wolf, The Boreal City, 2018Bodyspace: The Hamburg Project, 2019Bild & Rüdiger, The Spaces We Live in, 2019Bénédicte Pantin, Art and Body: Theart of Life, 2019Miranda Crews, The Future Is Not What It Used To Be, 2019Facial: Aura of Life, 2019Aria Danza, Unsullied, 2019Art: The Boring Past, 2019Hans Jäger, The Boring Present", "The next Biennial should be held at least once every two years. The board of trustees is:David H. Koch, chairman and CEO of Koch Industries; Alan B. Halperin, chair of the board of trustees of the American Civil Liberties Union; and Charles and David Koch, the brothers who own Koch Industries.Renovation of the Museum of Art is a top priority for the Kochs. In March, they announced that they will spend $550 million on revamping the institution over the next decade. The new design will include more galleries, more study rooms, and more spaces for outdoor activities and public gatherings. The museum will also undergo a $200 million expansion. The $150 million will be used to create one of the largest private collection sites in the country.In the past, Koch Institute directors have admitted to creating a 'negative vision' of the museum in order to shift public perception of the world by pointing out the Koch brothers’ influence on policy. The new contract will include a commitment to examining the Koch’s philanthropy and community impact in an attempt to understand the Koch brothers’ charitable giving and the political agenda of the organization.\n\n\nThe Royal Academy of Arts in London has appointed Deborah Gloster as its next chief executive officer", "The next Biennial should open sometime in 2021 and will be hosted by the Museu de Arte Contemporáneo, Centro de Arte Contemporáneo, Marfa, and the Museu de Arte de São Paulo.\n\n\nThe Solomon R. Guggenheim Museum in New York announced today that Jean-Michel Basquiat will become its next president and CEO. After serving as the first president of the museum, Basquiat was a voice of Harlem during the Great Depression and a leading member of the avant-garde New York School in the 1950s and early 1960s. He was also instrumental in the museum’s decision to move the show’s first exhibition, “The Situationists” (1963), to Rome, and in the museum’s acquisition of works by the New York School’s Art Workers of Motion Picture.Born in Paris in 1936, Basquiat studied at the Sorbonne in Rome and at the Art School in New York. His undergraduate degree was from the College of the Arts in Nantes; he later received his master’s degree from the Art School in New York, and he continued pursuing his art-school studies", "The next Biennial should take place in 2019 and will showcase the work of thirty artists, including Ahmet Tezcan, Mahmoud Dahoud, and Ali Ederer, and should be organized in partnership with the Museum of Modern Art, Shanghai. In addition, the museum will develop a new exhibition of works by the Dutch artist Guillaume Maisonneuve. For the upcoming season, the museum will host several new works by the Chilean artist Álvaro Paz, as well as a retrospective of the work of the German artist Jochen Riepe, which is currently on view.\n\n\nA woman who was captured on video kicking a homeless man in the head several times during a protest in Portland, Oregon, has been charged with second-degree murder after he died of his injuries. The victim, James Witt, 32, was taken to a hospital after he was kicked in the head by an unknown assailant on Saturday, August 24.According to the criminal complaint, police were called to the protest at around 10 PM on Saturday night after witnesses saw someone kicking a man in the head. After officers arrived, they found Witt lying face down by the side of a highway, unconscious and covered in blood from head to toe. He was taken to a nearby", "The next Biennial should be held in 2020. \n\n\nThe American Academy of Arts (A.A.A.) announced today that artists William Shakespeare, Mary Shelley, and Jane Austen are among the eighty-four recipients of its 2019 Award for Distinguished Contributions to American Art. The honor is given annually to an artist whose work has been a significant contribution to the cultural life of a state, city, or region. Each year, a selection committee makes the award for the same reason—to encourage the exhibition of work that has been created in the United States or its territories.“William Shakespeare, Mary Shelley, and Jane Austen embody the beguiling and vulnerable qualities of beauty and humor, and their stories and landscapes—they are at once touching and poignant, and they are deeply and brilliantly expressed,” said John Hartigan, president of the A.A.A. and the John F. Kennedy Center for the Performing Arts and director of the Kennedy Center. “Their works have enlivened the public imagination and altered our way of life in profound ways. We are deeply grateful to the A.A.A. and its members for recognizing their remarkable contributions and their dedication to enhancing the public understanding of art.”", "The next Biennial should focus on the history and evolution of the exhibition, which is currently on view through June 28, and its future plans. The Art Newspaper reported that Art Basel Hong Kong confirmed that it will continue hosting the event in a statement on Friday, June 14. Artnews reports that Art Dubai will also continue to be held in the United Arab Emirates, but has announced plans to move the event to another location.\n\n\nThe London-based nonprofit Art Fund has announced that it will donate $1.25 million to Aravosis Gallery, an independent, co-operative arts space in Salford, United Kingdom, in support of contemporary art and its artists. The funds will go towards the renovation and expansion of the arts space, which is run by two artists—Anwar Al Shimi and Hoor Al Qasimi—and an artist-run organization, Aravosis Gallery.’We are delighted to support the Aravosis Gallery as it continues to flourish and to the future of art in Britain,” said David H. Peiffer, chairman of the Art Fund board of directors. “This is an artist-run space, run by the artists and it’s very important to them that the", "The next Biennial should be held in 2021, and the earliest immediately after the end of the current academic year.”The Art Newspaper reports that the US Army Museum of Art in Washington, DC, is also planning on closing its doors as part of a much larger restructuring of the institution. The museum, which was founded in 1898 as part of a merger between the University of Texas at Austin and the University of Texas, has been working on revamping its collection and collection plans for years but finally decided to proceed with the plan last year, with the caveat that the institution’s exhibition program would remain intact. The move followed months of protests from local residents and activists, who argued that the museum’s remodelings and expansion were too radical a departure from the original vision for the museum.Many museums have recently been trying to distance themselves from the Trump administration’s policies, particularly in the arts. The Metropolitan Museum of Art, which recently announced that it was moving its entire exhibition program from New York to Philadelphia, announced that it would remain open but would engage in “structural change—” which the museum described as a “contextual rethinking of the way we think about the world.” Similarly, the Museum of Modern", "The next Biennial should be held in 2020, and the event should draw up to one thousand visitors.The exhibition will be moved to the second floor of the museum and will be scheduled to run from September 15 to September 21, 2020. The exhibition will be on view in the museum from September 15 to September 21, 2020.\n\n\nThe Museum of the City of New York has commissioned artist Ashley Graham to create a new show based on a real-life urban legend. The exhibition, titled The Magic of the City, is slated to open in March 2021. The commissioning of the work, which will be mounted in partnership with the artist, comes amid an ongoing campaign to raise funds for the museum. “My city, my city of New York, is the most beautiful city in the world, and the most important city in the world,” said Graham. “I mean that in every way. It is the essence of what makes my city special. It is the light that shines through my windows, the air that breathes through my windows, the water that swims through my windows, and that makes my city special.”The artist is seeking $10,000 for the show.  The City Council is", "The next Biennial should take place in September 2021, and will hopefully be more accessible for everyone.  The theme for the next iteration of the exhibition is “Retrospectivism” and will be “Welcome to the Future” on the fourth floor of the Museum. The museum is also planning to open a new branch of the museum in the former headquarters of the publishing giant Beasley Publications in the spring of 2021. The museum’s existing location in the Beasley building is located at 1401 S. Grand Avenue, in a former industrial zone known as the Beasley Industrial Complex. The development is being spearheaded by the company, which has been run by Matthew and Pam Beasley for nineteen years.The Beasley Museum of Art has faced several setbacks in recent years. The company had to move the show in 2017 following an attempt to raise $1.2 million by selling a portion of its remaining assets to the city of Miami. It also faced a major funding shortfall in 2018 when it only had $1.1 million left to raise. In March 2019, the museum began accepting visitors in an attempt to overcome a financial emergency caused by the coronavirus. The first exhibition in the new location, “Ret", "The next Biennial should be held between... ‎“2023 and 2028.” \n\n\nThe Museum of Contemporary Art (MoCA), Chicago, has launched two new initiatives aimed at diversifying the collections of Chicago’s contemporary art institutions. The first initiative, called the Museum of Contemporary Art in the City of Chicago (MCA Cinéma), is an online platform that will allow visitors to browse through the museum’s holdings by artist, curator, and institution. The second initiative, called the European Contemporary Art Museum (ECAM), will present several works by artists from the continent.The former was announced in 2018 as part of a $2 billion capital campaign and a $1.5 billion expansion project. During the project, MoCA Cinéma, which has a primary mission of preserving the collections and exhibitions of Chicago’s contemporary art, opened its first exhibition in the United States in 2019. In 2018, the institution also purchased works by several Chicago artists and opened a new fifty-one-thousand-square-foot workspace for the collection and exhibition. \n\n\nThe City of Los Angeles has launched a new cultural exchange program, CityBridge, that will provide $1 billion in capital and support to", "The next Biennial should be titled “Intersection of Art, Technology, and Obscurity” and should take place at the Mary Ellen Brown Art Museum in Cincinnati.\n\n\nThe Institute of Contemporary Art (ICA) in Paris has released three new curatorial projects for its inaugural edition, “For the Birds” (2019), “For the Trees” (2019) and “Hippodrome” (2019). In addition to new works by visiting artists such as El-Sennari, Poona Kotak, and Khang Nguyen and new exhibition projects by visiting artists such as Pia Camille Adès, Rintoul, and Pablo Picasso, the biennial will also feature new works by emerging and established artists, galleries, and filmmakers.“For the Birds’ is a new series, the first of its kind, for the exhibition ‘For the Birds’\u0097the biennial will collaborate with the Paris-based artist Hubert Netto to create a new works by him, in cooperation with the Institute of Contemporary Art in the City of Louvain, to mark the fifth anniversary of his career. The show will be held in June of 2020, at the Museum", "The next Biennial should focus on the history of contemporary art in Southern California, its influence on California artists, and the state’s museums and public spaces, and should evaluate the state’s collection of works by contemporary artists, including the California Academy of Fine Arts, the Los Angeles County Museum of Art, and the San Francisco Museum of Modern Art.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Nora Fu, a senior curator at the Museum of Modern Art in New York, as its new associate curator of Asian art. Fu will be responsible for linking the Guggenheim’s Asian art collection with the collections of the Museum of Modern Art and the Museum of Contemporary Art in Seattle.“We are thrilled to welcome Nora to the Guggenheim,” Guggenheim director David Kordansky said in a statement. “Her strong record of academic research and critical appreciation of Asian art, coupled with her enthusiasm for what makes art and artmaking special, makes her the ideal candidate to lead the Guggenheim’s collection and advocacy for Asian art. Her commitment to fostering understanding and understanding of the Guggenheim’s extensive collection of Asian art, both by public", "The next Biennial should be held in 2020, the board of trustees said.The nonprofit has awarded $2 million in grants to academic institutions since its founding in 1958. It receives $1.1 million annually from the general fund and $0.6 million from KIPP, which was founded in the same year as the museum.New York’s Metropolitan Museum of Art, in partnership with the Rockefeller Brothers Fund, has received $3 million in grants since the institution’s founding, and the Metropolitan Opera House in New York City has been awarded $1.4 million. The Whitney Museum of American Art received $1.1 million from the fund and $0.1 million from the general fund. The funds were used to promote the work of an alumni-led group that has been campaigning for new federal arts funding since 2017. \n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that the body art museum Brooklyn Museum has received a $1 million donation from the Doris Duke Charitable Foundation. The donation was made by collector and philanthropist Doris Duke, who passed away in January 2019. Duke’s foundation, which has supported many nonprofit arts institutions in her name over the years, including", "The next Biennial should focus on the history of the exhibition as it relates to women, specifically, the experiences of women artists, and the importance of their work in the history of the exhibition and biennial,” said Bey. The first iteration of the exhibition will open in Art Nouveau on December 2, 2020. \n\n\nThe third edition of the Minneapolis Biennial will take place in the city’s St. Paul facility next month. The 2020 event, titled “Telling Stories,” will showcase more than fifty new and existing work by forty-eight artists. Presenting a selection of twenty-four works, the biennial’s inaugural exhibition “Pillars of the Wind: A Biennial of Women Artists” will begin on November 23 and run through March 25, 2021.The show was curated by Katherine Kuhn-Diefenbach, director of the newly launched initiative Activities for Change, and will showcase the work of twenty-four women artists, including Eisa Amaral, Andrea Alberts, Igène Atamantilla, and Notre-Dame Antoinette Brandt. This year’s exhibition is centered", "The next Biennial should take place in 2021. The first, slated to take place in 2020, was rescheduled from March 28 to March 29 and will take place at the Metropolitan Museum of Art. The next will take place at the Brooklyn Museum in New York. The upcoming Fifth Venice Biennale will be held in December 2020.The next edition of the Venice Architecture Biennale will be held in July 2021. Its crew will include artists, architects, historians, politicians, and other cultural figures\u0097including Terry Devitt, the British patron of the American architect and collector Harvey Spencer; Bertrand Goldberg, a cofounder of the New York–based architectural and design firm MCH Group; and Herve Malandrino, the founder of the firm Tilo Verde.The biennial, titled “The Art of Architecture,” will also include the first live exhibition of the American artist Michael Kaba’s work in the United States. Kaba’s series, which often uses architectural forms to address social and cultural issues, began in 1971 with his first exhibition at the Smithsonian American Art Museum. His first solo exhibition at the Biennale will be staged in September 2020.\n\n\nA group of artists and collectors are suing the", "The next Biennial should be completed by December 2020.Günther Zukan, chair of the board of trustees of the Foundation Düsseldorf, the German city of Düsseldorf and the host of the first Düsseldorf Art Biennale in April 1971, said: “This year’s Biennale is a milestone for the city of Berlin and the city of Germany. It is the first time that the museum has hosted an exhibition of this scale. The exhibition will mark the Museum’s re-opening and will also include a number of new works, including “Mémoires in the Studio,” which was published by the Museum of Modern Art in New York in May 2019, and “The Future Is Present,” which was presented by the Museum of Contemporary Art in Berlin in December 2019. \n\n\nThe California Gold Rush Foundation announced today that it has created four new grants to support the arts in California through 2020. The grants—which come at a time when the cultural sector in the Golden State is being targeted by the escalating coronavirus outbreak in the United States—will be distributed through the foundation’s First State Fund,", "The next Biennial should aim to work through the themes of Climate Action, Desertification, and the Built Environment. The exhibition will also include an exploration of how art projects can help to mitigate climate change’s effects on public health, the environment, and society. “I’m excited to be able to deliver this year’s Biennale to the Manchester Architecture Biennial,” said Paul Mah, head of the Biennale team.The exhibition will be curated by the Manchester-based city-based team of Philip Pullman, Rirkrit Tiravanija, David Twomey, and Dan Trussell. The three-person team will be assisted by curator Lene Monaghan from the Museum of Architecture, London; curator Rebecca Procter; and the British artist Sally Hunt.The exhibition will focus on themes of agriculture, climate change, and art as the climate warms and dries the region. The exhibition will also include the first-ever performance by an artist, a collaboration between artist Katerina Altidore and the artist Tania Bruguera, and the exhibition will be presented by the promoter. The Biennale is a partnership between Tate, Manchester, and the Art Fund,", "The next Biennial should be in November. The theme of the 2020 edition is LIFE AND LIFE GIFTS, and the exhibition will consist of works by seventy artists, including Gabriel Garcia Marquez, Jean Dubuffet, Ursula Von Rydingsvard, and Oscar Murillo, and will also feature a selection of original works by international and Mexican artists.Movistar Gallery won the right to stage the event, which will require the attendance of an audience of at least ten thousand people, in a Spanish court. The artist-run exhibition, titled MARXISM, is part of a campaign to challenge the status quo at the country’s cultural complex, which has been under the control of the Francoist government since 1933.The court ruled in favor of Movistar, which has been fighting the institution since 2013, when it launched a protest over the construction of a new museum in the Plaza de Mayo in Madrid. After the center received around twelve thousand visitors during the event, the government ordered the construction of a new museum in the building, which contains some thirty thousand works. The organization appealed the decision, and after a preliminary ruling on May 3, the court ruled in its favor. The new institution will take up the themes of the two previous editions of", "The next Biennial should be held in 2021 and will be managed by the Museum of Contemporary Art Paris.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to lay off more than 200 employees in the coming weeks and months in an attempt to stabilize its financial situation following a series of costly and unexpected shutdowns of the institution. According to the New York Times, the museum is forecasting a $100 million shortfall for the 2020 fiscal year. “We are taking a variety of actions to mitigate the impact of the Covid-19 pandemic on our staff and our institution,” Louis Vuitton Moët Hennessy, the CEO and chairman of the company that owns luxury goods conglomerate Yves Saint Laurent, said in a statement. “In addition, we have been developing new and innovative ways of supporting the museum, including by introducing new programs and exhibitions that will help keep the doors open and the collection moving forward.”The Paris-based firm is working with MoMA to reopen the Paris Gallery of Art in 2021, but the renovation project is expected to cost around $200 million, and the renovation of the Metropolitan Museum of Art would also require funds. The Art Newspaper reports that after MoMA reopened, the", "The next Biennial should be hosted in the year 2024, when the exhibition will be held at the Museum of Modern Art in New York. “The new Museum’s exhibition program and collection will continue to evolve as we continue to present exhibitions that challenge the viewer to reconsider and reexamine the nature of being.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Jennifer Stoker as its next executive director. In her new role, she will be responsible for leading the institution through a transition period as it prepares to reopen in 2021 following a $1 billion expansion.“Jennifer is a visionary leader who has built a strong track record of developing new research and innovative exhibitions and programs to meet the challenges and demands of our contemporary world,” said Mark Goldman, chair of the board of trustees of the museum. “Her leadership will ensure that MoMA’s curatorial, digital, collection, and programming program continues to thrive under the leadership of Whitney Museum of American Art curator and curator of modern art Amelia Prigge.”Stoker’s appointment comes amid a tumultuous time for the institution as it faces a major funding crisis due to the coronavirus—the risk of a second wave of", "The next Biennial should be held in 2022. The 2020 event, titled “Toward a Biennial History of art,” was organized by the Los Angeles–based nonprofit the Los Angeles County Museum of Art. The theme of the 2019 biennial was “Gender and History,” reflecting the contemporary concerns about the three-dimensional representations of gender in contemporary art.“With a focus on the history of contemporary art, the 2020 edition is going to be about framing the history of modern art in the context of an interdisciplinary dialogue between scholars and curators,” said Jodi Throckmorton, a director of the museum. “I think the future history of art of the twenty-first century is going to be a very active and creative conversation about how art came to be, and what was done with it, and what might be done with art.”\n\n\nThe Seattle Asian Art Museum (SAAM) and the Seattle Asian Art Museum (SAAM) in Bellevue announced today that, in a joint effort, they will present “The Stranger Things”—a new animated short film by filmmaker Mike Kelley\u0097a cofounder of the Seattle experimental theater collective the Dream Factory\u0097at their five-", "The next Biennial should be inspired by the artist’s personal and historical narrative. The annual will include a narrative symposium, which will include two readings by the artist. The exhibition will be staged in collaboration with the artist’s daughter and the artist’s son, who will exhibit new works and live performances and will collaborate with the artist on a project that is part of their personal legacy. The artist’s daughter, Fatima, will create a new work based on the artist’s life.\n\n\nSwiss artist Tobias Madison, who painted the iconic blue, white, and red façade of the National Museum of Art in Washington, DC, has been appointed the winner of the $50,000 Eisner Award—a prestigious award that recognizes outstanding contributions to art history. Madison will receive the prize at a special ceremony at the museum on Saturday, April 22.The tribute was organized by the Eisner’s board of directors and Madison’s wife, Christa Madison. The award is a recognition of a lifetime achievement award, which recognizes artists whose work is comparable in both ambition and impact to Madison’s. Madison, who died earlier this year, created paintings that sometimes grapple with themes of resilience and", "The next Biennial should aim to present the most recent and interesting works within our collections, while remaining true to the spirit and vision of the institution. We will also continue to collaborate with artists, institutions, and collectors to offer them the opportunity to engage with DCM.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Courtney F. Reiner, who has helmed the museum since 1987, as its next president and CEO. Reiner succeeds Diane Rojas, who retired in April after eight years at the helm of MoMA. She succeeds David Samson, who will assume his post on January 3, 2020.“The museum’s board and staff unanimously endorsed the appointment,” said museum chairman James Steward. “Not only is Courtney a visionary leader, she has been instrumental in transforming the museum into a vibrant, dynamic platform for the art of our time.”Commenting on her new role, Reiner said: “The museum’s Board and staff shared in my decision to leave at the end of 2017 after eight years as CEO and wonderful board members Marian and Paul Mpagi Sepuya, who has been instrumental in extending MoMA’s curatorial reach and expanding", "The next Biennial should include a reflection of the history of the exhibition and “the current situation in the museum,” Boumoudon told the Art Newspaper. “This is the time of transformation. We must not let this happen again.” In a letter to the organizers of the festival, Boumoudon said: “I am really looking forward to the exhibition and to the role this exhibition will play in the concerto and I.R.E.S., as an important historical document of the biennial and in the history of the show.”Biennials, which have been held since the 1950s, are not uncommonly difficult to organize. The program for the 2017 event, curated by Matteo Bruni, was put together by a committee comprising Carlo Cicutto, the director of the Museo del Moneda; Elisa Di Finan; Damien Hirst, the director of the Centre Pompidou in Paris; and Pia Camil, the former director of the Museo del Mar, in Rome. The event’s cochairs, Aria Cipolletta, Pierluigi Cipollotti, and Stefano Cattelani, were appointed as honorary cur", "The next Biennial should be set in 2020 and will focus on the history of the art and culture of Central and South America, with a particular emphasis on the art of the New Hebrides, the Hebrides and the Shetlands. The next iteration of the Biennial will take place at the Grand Island of Cartagena, in Brazil, in 2021. The festival will present a combination of solo and group exhibitions and will be hosted at the Grand Island of Cartagena from May 21–May 24. The 2019 edition featured work by forty-eight artists, including Ana Mendieta, Oscar Narguera, Manuela Pérez, and Hélio Oiticica, and received a Biennial Award for Lifetime Achievement in Art in 2016.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced its selection of five artists for its 2020 collection, which will comprise works by artists such as Dita Von Teese, Hélio Oiticica, and Wangechi Mutu. The five finalists were chosen by an international panel comprising Helen Cammock, senior curator at the Contemporary Art Museum St. Louis; Bruno LeMoyne, director of the Museum of Modern Art in New York", "The next Biennial should coincide with the CCDC exhibition “Secrets of Life: Art and Death”\u0097a major retrospective which will examine the role of art in the social, political, and spiritual life of different countries\u0097and mark the official opening of the Museum of Modern Art.\n\n\nThe British Council, the British government body responsible for administering arts and heritage investments to Scotland, has awarded the arts and heritage group the £3.6 million ($4.1 million) Stuart Mitchell Prize, which honors those whose achievements advance the arts and culture in the United Kingdom. The award was established by the Stuart Mitchell Trust in memory of his late husband, Stuart, who was a leading member of the British Council’s advisory council on the arts and culture.“The Stuart Mitchell Prize for Arts and Heritage is an incredibly significant recognition of Stuart’s pioneering and visionary work as a trustee of the British Council,” said Stephen Deuchar, chair of the Stuart Mitchell Trust and head of the Westminster-based Mitchell Grant Foundation. “His generous approach to promoting and supporting the arts and heritage in his lifetime was instrumental in establishing the Award for Arts and Heritage in the first place. We are grateful to Stuart", "The next Biennial should be held in the autumn of 2021, in the city of Alborz, Austria, which has a population of some 6.5 million. \n\n\nOn Monday, the Museum of Contemporary Art (MoCA), Beijing, announced that it is planning to open a new museum in the capital city of China. The museum will be located in the city of Foshan, in the Guangdong province of Guangdong, and will be inaugurated in November 2021.The museum, which will allow visitors to experience the city of Foshan from the comfort of their homes, will also have a café, and it will have a library. The museum will be equipped with a viewing platform and will be powered by solar energy. Its opening will coincide with the Summer Festival of China, which will be held in November.The new institution, which will be called the Cultural Capital of China (CVC), will boast a four-thousand-piece collection, including works by twenty-six Chinese artists, a collection of works by thirty-six international artists, and a collection of works by six South American artists. According to the architects, the project will also be a new form of cultural exchange between China and Foshan, and will", "The next Biennial should be held in the autumn of 2021, at which time the selection committee will issue a verdict. “We are particularly interested in seeing how the spatial effects of the installation will affect the performances of artists from the region,” said Anna Wüsthof, the director of the Kunsthalle Basel.\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, Los Angeles County, California, launched a new digital service today that will allow visitors to view all of the works on display at the Museum of Contemporary Art, Los Angeles (MoCA), in one place. The initiative—which was born out of the financial crisis and the pandemic—will launch with a free preview day on August 2. The site will also be open to the public from 8 AM to 6 PM daily, and will be accessible by car, bike, or foot from 8 AM to 5 PM.“Creating a powerful digital platform to present the exhibition across all of the museum’s locations is a critical step for MoCA as we continue to present work in an accessible, curated way, to the public,” said Paul Graham, cochair of the museum’s board of trustees. “MoCA is working", "The next Biennial should aim to focus on the history of the exhibition and its architect, William Robertson, and how his expansive installation, which also includes the massive reconstruction of the Biennial, the National Gallery, and the Tate, is a record of the institution’s history.”\n\n\nThe Tate’s board of trustees declared that it expects to raise more than $100 million to repair damage caused by the Covid-19 pandemic and to reopen by the end of March. The corporation is currently negotiating with the UK’s Department for Digital, Culture, Media and Sport (DCMS), which has responsibility for running one of the country’s major arts institutions, over the course of twelve weeks.The board established the Covid-19 Emergency Response Fund in April 2019 to distribute $100 million to prevent the spread of Covid-19-related financial and health crises. The fund has since raised $168 million, which was allocated to various recovery and resilience initiatives, and hopes to distribute $168 million more this month. While the fund has been highly successful at reducing Covid-19-related losses, it is not yet sure if the government will pick up the tab for the full cost of restoring the Tate.The National Lot", "The next Biennial should be in the second half of 2018. In the meantime, the museum will continue to host exhibitions and events in its current form, including “The Outsider in Early Art: Art in the Now” (2018), “The Color and Color” (2019), and “Clarity and the Color Wheel” (2019). The biennial will resume with a retrospective of the work of the Swiss artist Rüdiger Kahlo in October 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a major donation from the Roman Catholic Diocese of Los Angeles. The $150,000 gift will fund the construction of its new collection center, which will be located in the same building as the museum and will include a new 750,000-square-foot gallery and a contemporary art museum.The gift was made by Archbishop Timothy Dolan of Los Angeles, who also gave $100,000 to the institution in 2015, and the Diocese of Los Angeles. In addition, the diocese committed to purchasing twenty-three acres of land in a wealthy industrial neighborhood of Los Angeles for the construction of the center, which will be completed in 2021.The $1.2 billion construction of", "The next Biennial should be held in 2022, in order to be held in the same location. The event will also feature programs of short- and long-term programming tailored to the local communities and regions of Paris.The theme of the upcoming exhibition is “Lítiment de l'art et de l'époque,” a reference to the words of artist Henri Degrelle and to the French philosopher Henri Lévy-Du-Pont (1891–1963), who founded the term “art et ideology,” which is sometimes used in this context to mean “individual and collective art and the meaning of art.” According to the the Art Newspaper, of the three biennial organizers, that the Salon d’Art Contemporain (SAC) and Midi-Norbert . . . would have featured a work by the late American artist and designer Harry Gold, the controversial work shown in the exhibition was not. In a letter dated February 21, 1992, Gold wrote: “I wanted to present ‘Art’ as an active instrument,’ a role that could act as a check on the individual, not being able to control it but being able to listen to it", "The next Biennial should be held in 2021, and the ten artists who have won the prize so far—including Škoša Miro, Svetlana Zajac, and Sveinu Mechevsky—will be invited back for a second edition at another venue.While in the capital, the Biennials will acquire their new identities, the future of the exhibition will also be decided by the city of Kraków. The next edition of the Biennial will take place in the city in 2021.“The Biennials’ success story is a story of resilience, collaboration, openness, integrity, and generosity,” said Zora. “The exhibition Biennials will explore themes such as the connection between art and life and the impact art can have on quality of life. The exhibition will draw from the collection of former winners of the Prize, giving a rare opportunity to see their work live. The exhibition is a reflection of the passionate spirit of Kraków and the city of Kraków, and reflects the excitement and excitement around the exhibition. We are so proud to be able to celebrate these twenty-six years of the Prize.”\n\n\nThe Carnegie Museum of Art", "The next Biennial should be in 2021.The 2020 event, titled \"The Future Is Present: Art, Artifacts, and Modernism in the Twentieth Century,\" will feature work by forty artists and will be held in the National Gallery of Art in Washington, DC.\n\n\nThe Swedish artist Lars-Erik Satie, who believes he is a paleontologist who studies the evolution of life forms through the lens of the '70s-era television series Twin Peaks, has been awarded an international retrospective at the Los Angeles County Museum of Art (LACMA). The show, titled “Lars-Erik Satie: Climate and the Future” (2015–), featured twelve works by the Swedish artist, including two new works on paper, one dating to 2006, and four works that were previously on display at the Museum of Contemporary Art Oslo.“The LACMA show is a very special show for me,” Satie told the Los Angeles Times. “I had no idea it would be such a big success. Stockholm is one of the most important cities for Swedish artists and this is the first time anyone had his work on paper. I couldn’t have asked for a better partner for this exhibition.", "The next Biennial should be held in 2021. \n\n\nThe Washington, DC–based nonprofit The Charles and Lucille King Center for Creative Resiliency (CKCA) announced today that Anya J. Kuzma and Evelyn Zucker have been named cochairs of its next biennial, “Away From the Wind,” which will be held at the Charles King Center from March 17 to March 20, 2020. The biennial, which will also feature performances, lectures, and other events, will be organized around the themes of “Perception: A History,” “Purity: An Evangelical Philosophy” and “Intentionality: A History,” and will feature works by forty-six artists in addition to works by artists of color.Kuzma, who has lived and worked in New York for the last twenty-five years, is a Brooklyn-based artist whose practice spans painting, video, sculpture, performance, performance-based art, performance-based media, performance-based performance, and performance-based technologies. She is currently a curator at the Museum of Modern Art in New York and has staged solo exhibitions at the Museum of Modern Art, New York; the Museum of Modern", "The next Biennial should cover the history of art and design in the city of Osijek and the broader regional region. The exhibition will also bring together artists from the province and explore the history of the university as a region. The institution will open an exhibition of the work of the same name in the spring of 2021.\n\n\nThe European Parliament has endorsed a resolution that will condemn Israel for its settlement expansion in the occupied West Bank and West Bank cities. In a vote on Tuesday, the assembly adopted a proposal that declares the expansion of Israeli settlements in the occupied territories illegal. It also reaffirms the Nobel Peace Prize winner Martin Luther King Jr.'s famous statement that 'the times demand the presence of an international community united in condemning Israeli activities in the occupied Palestinian territories.”The resolution reaffirms the European Union’s commitment to the three-state solution and to the two-state solution, which were the two-state solution’s main points of reference for the assembly. The assembly adopted the resolution after the European Parliament voted to condemn Israel for its settlement activities in the West Bank and the United Kingdom in a historic vote on January 26, 2021. In doing so, the assembly reaffirmed its commitment to the four-state solution, which was endorsed", "The next Biennial should most closely resemble the eventually cancelled 2017 event, which was held at the Metropolitan Museum of Art in New York, with an eye to enhancing the exhibition’s conceptual content, according to Artworld. The project will be divided into two phases, with the exhibition opening in July and the biennial taking place in September. While “trips” were not mentioned in the artists’ statement, the artists said the trip would be similar to the “winter” biennial. “The first Biennial was to be an extension of our ongoing journeys through life,” said Artsworld. The Art Newspaper reports that the biennial is still on track to be completed in February 2020 but will soon be moved to June.  The event, which is sponsored by the Germany-based foundation Fundação Frente, will also be hosted by the National Museum of Contemporary Art and the Nationalgalerie in Berlin. The National Collection of Modern Art and the Nationalgalerie in Berlin will be joined by the Berlin Art Museum and the BOB Museum, both of which will be launched ", "The next Biennial should be held at least a year after the legislative celebrations of the twentieth and the thirtieth congresses. The project has faced many setbacks over the years. Its first iteration, staged in 2012, was shut down in March after it was discovered that the exhibition, which explored the interrelationships between artists and their surroundings, was only a prototype. The biennial was also plagued by delays due to the coronavirus. After a second attempt, in 2017, the show was awarded a further $1.2 million, but the event was swiftly canceled. Following the 2017 event, the organizers said that they were planning to open a new Biennial of Contemporary Art at a different location around the city.  The new exhibition will be inaugurated by a solo exhibition of works by the Prague-based artist Zoran Sicheš. It will then transition to a biennial of contemporary art, which will be curated by the Czech artist Václav Havel, and will conclude with a discussion on contemporary art and design. The biennial will be held at the Museum of Art in Prague until December 2020.The biennial is being organized by the Czech Academy of Fine Arts (CAA) and will run from March 23 to March", "The next Biennial should be a success; if it doesn't, who will? I fear that much of the work here has already been lost.\n\n\nThe Saar-Gropius Rarities Museum in Stuttgart (Segal-Gropius) has appointed Markus Lüpertz, director of the Andreas Reimer Institute in Berlin, as its new director. Lüpertz was hired by the German government in May following the institution’s reorganization in June 2019, and has since been leading the institute, which was founded in 1981 in the former brewery, since its inception. “Lüpertz’s achievements speak for themselves,” said Joachim Neugroschel, the chairman of Segal-Gropius. “The director shows a wonderful ability to combine the best of both worlds.”Deana Lawson, who has helmed the institute for more than twenty years, adding fifteen new members, has been promoted to director of the Gropius. She succeeds Wolfgang Immer, who retired on December 31 after twenty-four years at the helm of the institute. “We are thrilled to welcome Daniel and Deana to the Gropius family,” said", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has partnered with the Findlay Art Museum in Miami’s partnership with the Fernando Pérez Foundation to launch a new $1.5 million fund that will support exhibitions and educational programs that address the resurgence of Puerto Rican art.“The partnership between Findlay Art Museum and the Foundation for Puerto Rican Studies was established to promote the work of Puerto Rican artists in the United States,” said Fernando Pérez, chairman and chief executive officer of the Pérez family. “The partnership is a continuation of our efforts to make Puerto Rican work relevant and accessible to a wider audience. The Findlay Art Museum is dedicated to the art of Puerto Rico and the San Juan region; the Museum of Contemporary Art is dedicated to the art of the United States. The Pérez Foundation will receive an additional $500,000 to support the incubation of the next generation of Puerto Rican artists.”An ambitious grant program for Puerto Rican artists premiered recently at the Museum of Contemporary Art (MoCA) in Los Angeles, which will receive $5 million from the Pérez Foundation and will share", "The next Biennial should take place in 2018. More information about the 2019 event can be found here. The 2018 edition of the Biennale was held at the Museum of Modern Art (MoMA) in New York. The exhibition “Enterprise: Design and the Architecture of Life for the Future” was organized by architects and their institutions across the United States, as well as the United Kingdom, Japan, Germany, and Italy. The exhibition received numerous awards, including Best of the Year by the Society of Modern Art’s Design and Architecture Literary Award, Best of the Year by the American Institute of Architecture’s Outstanding Art Exhibition Award, and Best of the Year by the Architectural Association of America’s Design Award.The Biennial, which celebrates the work of twenty-six contemporary and pre-modernists, will kick off with a special presentation of work by actor Danny Glover, who died on Monday, April 3, at the age of eighty-eight. Glover’s work will be presented in a series, “MORAL KIN,” which will run until November 3, 2020.\n\n\nThe Willem de Kooning Foundation announced today that the organization will establish an endowment for", "The next Biennial should take place at the London borough of Islington and will be led by a panel of artists and cultural figures who will include artists such as Ruth-Anne McEntee, Peter Sellars, and Joshua Helmer. The 2019 iteration is expected to take place in the summer of 2020.\n\n\nThe Fine Arts Museums (FAMs), in association with the National Trust, have launched a new £1.6 million fund that will provide immediate relief to the cultural and artistic workers whose livelihoods have been seriously damaged or destroyed by the Covid-19 pandemic. “As workers and supporters of the arts, we are acutely aware of the challenges that Covid-19 has presented to our institutions and our staff, and the damage that Covid-19 does to our communities,” said Peter Hammond, the director of the FAMs and founder of the Center for the Arts. Hammond added that the fund will not only provide immediate relief to workers whose livelihoods have been seriously damaged or destroyed by Covid-19, but will also help the cultural and artistic workers whose livelihoods are in jeopardy due to the ongoing Covid-19 shutdown, including artists, writers, and artists’ assistants.The fund is", "The next Biennial should begin as soon as possible after the festival. The first meeting of the workshop will take place on September 11.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced that Nadine Bouvier has been appointed its next commissioner. Bouvier takes the post from Diane Ravitch, who has served in the role of commissioner since 2015. During her tenure at the department, she has worked to modernize the city’s public art program, expanded the city’s Creative Capital arts fund, and increased the city’s headquarters budget.“Bouvier’s first major move was to scale back the city’s annual Creative Capital grant, which it started last spring to support artists. The move saved the DCLA $9 million a year, and it marked the first time the department cut back on the annual $10,000 award, which was awarded to ten artists annually. Bouvier also increased the maximum amount that can be given to an institution, from $5,000 to $7,500, and gave the DCLA $2.5 million to encourage the maintenance of arts and cultural sites in the city.”“Nadia Bouvier’s appointment is a great", "The next Biennial should take place in Mauritius and will be hosted by the Museums Association and the National Gallery of Art. The theme of this year’s biennial is “The Body, and the Body Art.” The exhibition will run across four venues: the National Museum of Mauritius; the National Gallery of Art, New York; the Makran Museum, Astana, and the V&A, London; and the Louvre, Paris. “We’re thrilled to be collaborating with the National Gallery of Art to honor our commitment to the body, and to present a collection of art that reflects the diversity of visual and performing arts,” said Mali-based artist Kamila Atif, who is the subject of the exhibit. Atif is one of the artists featured in the exhibition, which will consist of more than 100 works, including works that were created within the last fourteen years and first shown at the National Gallery of Art in 2010. The artist will also be featured in a Curatorial Center exhibition that will run concurrently at the museum and the Los Angeles County Museum of Art.“I’m still trying to figure out what’s next,” Atif said", "The next Biennial should focus on how women’s issues are addressed in art and how they are to be incorporated into the future of art. It should also explore how art can be a vehicle for social change and how art can serve as a vehicle for radical social change.” \n\n\nThe Sheffield Biennial has announced that Monash University’s Margot Underwood–designed Temple Grandin, which was designed by architect Peter Zumthor, will receive a total of $409,000. The work, which was commissioned by the University of Sheffield, and created in collaboration with the University of Virginia, will be on display at the Sheffield Museum of Art in England from January 27 to February 2, 2020.Entitled advertisement, the abstract installation depicts an Egyptian godhead seated at a desk in a large Egyptian pyramid, surrounded by hieroglyphic inscriptions. The work opens with a brief introduction of its temple in the form of a chart of the pyramid’s interior and concludes with a series of interludes that recall the history of the pyramid, culminating in a reenactment of Egyptian pharaoh Sobek II’s burial site.The work will be included in the exhibition “Temple", "The next Biennial should take place in 2021.A number of projects in the exhibition hall will include “Museums in the City,” a project that will examine how the collection of the National Gallery of Canada in Ottawa, Canada, has been impacted by the ongoing coronavirus outbreak. In an attempt to make the museum’s collection more accessible to visitors through mobile technology, the Biennial will feature a virtual reality experience. “At a time when many arts institutions are struggling to maintain a curatorial focus and balance between their artistic and curatorial practices, and when art and culture is being used as a vehicle for social and political movements, the Museum of Contemporary Art (MoCA) is committed to supporting exhibitions, research projects, and the museum’s collection strategy to reflect the organizational and institutional thinking of the museum’s curators,”  said museum director Nina Hendershot.\n\n\nThe Smithsonian Design Museum in Washington, DC, has welcomed two new members to its board. Frances Greco and Thomas J. Jones have joined the institution in a few months to help with the transition from the government-run to an independent organization and in the process will begin collaborating with the public on exhibitions.“We’", "The next Biennial should be scheduled for October 2019. The event is currently planning to relocate to the City of New York from its current home in the Bronx, but the move has been criticized by some local arts advocates as a compromise between the festival and the city.  The event’s executive director, Adam D. Weinberg, called the move “incompatible with the very mission of the event.” Weinberg cited the city’s relocation as the reason for canceling an earlier iteration of the show, for which the artist-run museum was hosting a residency program for emerging artists in conjunction with the city’s Public Theater. The move, which is funded by the city and the Katz Foundation, was made in order to accommodate the temporary closure of the Bronx Museum of the Arts—which is still preparing for its reopening in 2021—and to avoid disrupting its scheduled programming.\n\nThe 2017 Whitney Biennial, “The Day We Never Left,” was inaugurated by fourteen artists, including John Akomfrah, Mira Dancy, and Joseph Beuys, as well as a trio of Brazilian choreographers:  Ilia Magalena, Lis", "The next Biennial should be announced this fall and will be led by curator Cindy Sherman-Landgraf, who will be involved with the exhibition as a curator of art and design. The 2019 edition will be curated by executive director and president Chantal Benoît Ravich.The Paris-based artist Guillaume Apollina is organizing a biennial of monoculture, art, and architecture in the capital city, which he says has been largely neglected by the museum. The exhibition will feature work by seventy artists and will run from December 6 to March 26. The biennial will also include a section dedicated to clothing, a new section devoted to fashion, and a mountain of books, art, and other media. It will be titled Prize. “A Royal Conversation,” and will be supported by the Corcoran Foundation, the Global Fund for Art, and the Global Fund for the Arts.The biennial’s inaugural event will be a performance by Ezra Edins, whose acclaimed performances have been staged at London’s Serpentine Galleries, the Royal Academy of Arts, and the National Poetry Library. The show will visit the High Museum of Art in London and the Tate, and will be led by", "The next Biennial should be a celebration of the work of modern and contemporary artists. We believe that this vital time for the arts should be extended to include an open discussion of the future. The third series of exhibitions will focus on the history of the art and will take place in the first quarter of 2020. We are also proposing an extension of the Festival to coincide with the opening of the new city. The fourth series will focus on the history of the new city and will be held in the first half of 2020. We welcome any and all suggestions and are open to discussing them with you. Yours sincerely,Ditshuk ShresthaBiennial of the Arts新痚林許計春司美国司〜The new city,” curated by Kunming Wuhan, the Beijing-based real estate and modern art museum, opened in the capital’s Central Business District on September 28 and plans to stage more than 300 exhibitions and events this year. The museum is also planning to open a Warner Bros. theater in the capital’s Olympic Stadium, which houses the Chinese Olympic Committee and the Chinese National Museum, and is", "The next Biennial should take place in 2021.  The biennial will consist of sixty-four works by forty-two artists representing sixty-five countries. It will be held in the South Korean city of Gwacheon, an industrial hub in the Gyeonggi Province of Seoul.The forty-seventh edition of the exhibition will be held at the Korea Biennale Museum in Gwacheon from October 20 to October 28, 2021. The next exhibition will be held at the Gyeonggi Province Museum in Gwacheon in 2022.\n\n\nThe Lewis Collection of Art at the University of Missouri has appointed Richard Fildebrandt as its new president. Fildebrandt comes to the university from the Lewis Museum of Art, where he currently serves as associate dean for research and public art. He succeeds Mary Catherine Oates, who has been the board president of the Lewis for thirteen years and will begin his tenure in January 2021.“Richard is a man of deep intellectual curiosity and conviction, whose scholarly and scholarly-wisdom-telling ability speaks clearly of the enduring value of art and the humanities in sustaining critical intellectual and artistic inquiry,” said Mary Eichhorn, chair of the Lewis’s board of trustees. �", "The next Biennial should be held in 2022 and will undoubtedly feature works by “Art of the Real: Biennial Art from Russia” and “Art of the Impossible:” (2013–14). As the museum opens to the public in the City of Moscow, the exhibition will be curated by Rara Bircher, director of the Museum of Modern Art in Paris, and Kunsthal Aarhus in Denmark. The exhibition will be interlinked with the final reopening of the Museum of Modern Art in the United States in 2021. The biennial will be hosted by the Moscow State Museum of Fine Arts and the local affiliate of the Beijing Art Museum.A statement released by the state museum said that the exhibition will serve as a “bridge between the city and the Museum of Modern Art.” It will also include works and activities created by local and international artists, as well as a selection of works by Russian emissaries.\n\n\nA group of artists who were awarded the Order of Finland’s National Artist Award in 2017 are urging the government to create more than one million new jobs in the arts. The petition notes that the award is funded by the Finnish government, but only grants ", "The next Biennial should take place in the United States in 2022. The exhibition will include four new works by artists from ten countries and will be organized as follows:\n\nThe first exhibition, “Toledo,” will be staged at the Contemporary Art Museum St. Louis and will be presented by the artist and her son, Oleksei Nikolayevich, in collaboration with the artist-in-residence, John Akomfrah. It will be on view October 24–28, 2022. The second exhibition, “GOLDEN FALLS,” will be shown at the Miami International Art Museum in Florida and will feature works by Andreas Eskelt, Agnes Martin, Adam Pendleton, and Hans-Georg Mauser. It will open on September 28, 2022 and run until November 16, 2022. The third exhibition, “THE UNKNOWN ARTIST,” will be on view until May 23, 2024. The fourth exhibition, “LONDON, 1910–20,” will open in the UK in the summer of 2020 and run until March 21, 2021.The new exhibition program will be curated by Graham de Kooning, director and CEO of the Biennale New", "The next Biennial should be held in the spring of 2021.\n\n\nThe museum’s founding director, Doris Glimcher, has announced her retirement at the age of eighty-seven. Over the course of her thirty-year tenure at the museum, she organized sixteen exhibitions, helped to launch the careers of several early-career artists, and became a major supporter of artists such as Wolfgang Amadeus Mozart, Pierre-Auguste Renoir, and Ingmar Bergman.She most recently served as director of the European Forum for Graphics, which opened in Stockholm in 2011 and has since produced seventy-seven exhibitions, including the fifth and most recent, “José and Miriam: From the Gallery to the Theatre” (2019); “Limba: Contemporary Art from the Sixteenth to the Eighteenth Century” (2018); and “Klaus von Königsberg: Migratory Animals” (2018).In addition to her creative endeavors, Glimcher was a staunch advocate for the arts in her home country and helped shape the institution’s programming. During her tenure, she expanded the museum’s already robust footprint in the city and state of Gothenburg, which was largely", "The next Biennial should be held at the University of St Andrews in the UK. This year’s event, “After the Fall,” was staged at the Scottish National Portrait Gallery in Edinburgh and is currently on view at the National Gallery of Scotland until March 16.  Next year’s event may be staged in New York, Tokyo, London, or Stockholm.\n\n\nA group of artists and museum directors from several states are urging the Los Angeles County Museum of Art (LACMA) to open an outside studio space in its sprawling former campus, which is undergoing a $1.4 billion expansion that will include a 700,000-square-foot research and conservation center. The proposal has received support from local, state, and federal lawmakers, as well as from the Federal Emergency Management Agency (FEMA), which is currently working with the city and county on a series of mitigation steps to mitigate the coronavirus outbreak and to protect the public.“For nearly four decades, LACMA has been a leader in showcasing the work of contemporary artists, ensuring that their important exhibitions, concerts, performances, workshops, and residencies are able to continue to thrive and thrive fully funded through the region’s own resources", "The next Biennial should be held in 2020. The exhibition has faced numerous setbacks since it was founded in 2016; the first exhibition was pushed back by a year, and the last edition was postponed by two months. The next edition will be held at the Institut für Kunst und Moderne Berlin in 2021. “As we continue to explore new ideas and new ways to display art, we will continue to find new ways to bring the exhibition to people, for people, in the arts,” Kunstmuseum Basel and the Art Foundation said in a joint statement. As part of the initiative, the two foundations have committed to ­assisting the institution in its transition to a new, larger venue in the city of Krefeld. The renovation includes the installation of new, larger galleries and the addition of a theater. The institution will also dedicate more than twenty million euros to establish its own fund, the Biennial Fund, which will distribute the funds to artists and their projects.As part of the plan, the Institut für Kunst und Moderne Berlin will create four exhibitions this year: “The White Album: ‘The Anthology of American Art,” “The Anth", "The next Biennial should focus on the history of the artist-designed environment and its relationship to contemporary society. The sessions will focus on how design has transformed lives through the dissemination of social, political, and economic issues through design. The exhibition will be hosted by the Galerie Interconnecte d’Arles, in collaboration with the artist-design collective Goodfellow; the Haus der Kunst; the Institut du Monde de Paris; and the König-Bockelmann Archive, in Cologne.Participants in the 2019 edition, which will open in March, include Pablo Picasso, Jean-Luc Nancy, Zoran Reznicek, Lévy Gorvy, Michelangelo Antonioni, Frank Gehry, Pierre-Auguste Renoir, and Claude Monet. The exhibition will present eight new works by artists whose work was designed by the late French sculptor Georges Apostuil, who previously commissioned both Pablo Picasso and Jean-Luc Nancy, as well as five works by contemporary artists whose work is inspired by the artist’s own personal aesthetic. The October show will showcase work by forty-six artists whose work integrates design and architecture. In addition, the gallery will present a new edition of", "The next Biennial should be set up to address the new issues of climate change and sustainability, and to determine the best ways to bring together artists and activists from different parts of the world. This will be the last time the exhibition will be organized as a collaboration between the DPW and the University Museum of Contemporary Art in Prague.The inspiration behind the exhibition was to 'escape from our own lives and influence the future of our planet.” The exhibition will consist of a series of participational projects meant to activate and heal the planet.An example of one of the collaborative works is the “Dress of the Warrior Goddess,” a work by Louis Theroux. The piece, which is based on a painting by the French surrealist Claude-Auguste Renoir and is one of the earliest, is about a woman clad in a warrior goddess�s garb and walking through a forest where she encounters a warrior god. In a video that is part of the exhibition, the woman is shown wearing a trench coat, wielding a bow, and holding a staff.The works of the exhibition’s inaugural group are Gorilla, a work by Alexander Calder, and The Third Eye, a work by David C. Driskell. The", "The next Biennial should take place in Cambridge, England, in 2021.  The next Songstova Group Exhibition (SKG), which will be held in Zürich, Switzerland, in 2022, will be held in the autumn of 2022. The next Milan-Bicocca International Art Fair, which will be held in Milan in December 2022, will be held in December 2019. The next Venice Architecture Biennial, which will be staged in April 2020, is scheduled for March 2020. A new exhibition featuring work by thirty-three artists will be staged at the National Museum of Art in Washington, DC, in March 2020. Michael Rosenfeld Gallery has announced its representation of the Hong Kong-based artist Wang Wei. Born in Beijing in 1979, Wang grew up in the city and graduated from Beijing Academy of Fine Arts (BAFA) in 1989. He relocated to Hong Kong in 1997 and has been based in the region ever since. In 2005, he and his family immigrated to New York, where he eventually settled. He has staged solo exhibitions at the Los Angeles County Museum of Art (LACMA), Los Angeles; the San Francisco Museum of Art; and the Sherwood Forest Museum in Nottingham, England. Wang", "The next Biennial should be held in 2022, and the first in 2024. The biennial will focus on the history of contemporary art, reflecting the current zeitgeist in the art world. The program will also include an exhibition of works by the artists represented in the collection, and will include a deliberative panel discussion on the themes of the exhibition.The biennial will be divided into three parts: part one, which will focus on the history of modern art; part two, which will examine the themes of the exhibition; and part three, which will focus on the story of the collection. • A selection of works by the collection will be presented in part one in 2021. Part two will take up the theme of the exhibition in 2021 and part three will continue to focus on the collection through 2021.The Biennial will be housed at the Museo de Arte Contemporanea (MAS), in Madrid. The first exhibition—the theme “Abril del Pueblo”—was carried out in the José María Pérez building in the city, in March. The exhibition, titled “Spain’s Modern Art,” was organized by the institution as part of a comprehensive project “", "The next Biennial should decide on a theme for the theme for the first time, and the design of the pavilion should remain the same. The design of the pavilion should be a reflection of the city of Zurich and the Swiss Federal Republic. “The pavilion was designed to reflect the city of Zurich and its people, and the experience that is intended to be had by guests. To our knowledge, this is the first pavilion designed with a concept that is not an exhibition, an exhibition, or an institution,” said Jacques Davignon, the head of the design department. “This pavilion shows how the art of contemporary design can be found in every neighborhood of Zurich.” The pavilion, which was created by the artist Eva Hesse, will open on August 22 and will be comprised of two halls. The central hall will be dedicated to a new series of sculptures by the artist, which will be assembled in pairs and displayed in the back of the hall. The duo Eßwegen and Mayer will create the centerpiece piece, a monument to the artist’s life, and will unveil the work, the city of Zurich’s history, and the city’s history next month", "The next Biennial should be held sometime in the first half of 2020.Senior director of tourism at the International Committee of Museums Caroline Molloy said: “While we are grateful for the enthusiasm and intelligence with which these museums are preparing for their first exhibition, we are acutely aware that this is a nascent stage and that there will be many challenges ahead. We appreciate their commitment to working with us and our partners to understand the full implications of the exhibition, and we look forward to welcoming visitors to the museum.”The full list of participating artists is as follows:Buso y Gass, ItalyWangechi Mutu, South AfricaL-3, JapanEmmanuela Alhein, GermanyRachael Harris, USACarrie Blondwell, USACara Bradshaw, USAEileen Callaghan, USANina Cotten, USASara Cuno, USAStefano Cattelan, ItalyL-3, ItalyEbony Evans, USASusan Egan, USASara Johnson, USAMorello di Rivoli, ItalyLuis de Jesus, ItalySara Pena-Ferrer, ChileJean-Michel, FranceSara Prescott, USALouise Bihr, BelgiumEvan Thomas,", "The next Biennial should be held sometime after the start of the fall season, but should include a selection of works by emerging and established artists. Since the Biennial is a major performance and is an important vehicle for contemporary art, we believe that the best way to create a compelling experience for our visitors is to present the work first and foremost as an open-air museum with a contemporary feel. Museums in Greece and Italy have recently received a boost in funding as a result of their participation in the Art and Artifacts International (AAI), which is organized by the Arts Alliance in cooperation with the Aslaug Foundation. The AAI will present the first edition of the event on March 20. The theme of the year is \"Can Art and Artifacts’ Impact on the Future of Humanity?” The 2019 edition of the event, which was organized by the Museum of Contemporary Art (MCA) in Venice, featured work from the Mina Foundation for Contemporary Art, the Mina Terpe Museum, the Mina Theater, the Mina Museum of Art, and several others.\n\n\nThe Kunsthalle Basel (KB) in Switzerland has welcomed Konrad Hoffmann, its director of contemporary art, to its", "The next Biennial should be held in 2022. The Center for Contemporary Art\n\nThe Center for Contemporary Art (CCA) in New York City has announced that it will no longer be able to hold the annual event, which has been held at the area’s Metropolitan Museum of Art since 2009, after the fall. The news is a blow to the artists participating in the event, which has drawn more than 110,000 visitors each year. The organizers cited the event’s performance as a reason for the cancelation, which they said does not align with the mission of the museum, which is to connect people with the art of the past through programming and exhibitions.Since 2008, the Museum of Modern Art (MoMA) in New York has hosted the annual exhibition entitled “The Future Is Now.” The exhibition, which focuses on the theme of the year 2025, has been held at various locations in Manhattan, including the Brooklyn Museum, the Metropolitan Museum of Art, and the Museum of Modern Art, and is distributed by the Museum of Modern Art. The announcement follows the May 25 announcement that CCA would cease hosting the exhibition, which was organized with the support of the artist’s alliance, Artists United for CCA", "The next Biennial should take place in Los Angeles in the first half of 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Kirsten A. Moberg as its next executive director. Moberg comes to the institution from the recent departure of Mana Contemporary, where she served as the interim director since June 2019. During her tenure, she oversaw the revitalization of the museum, expanded the collection, and oversaw the acquisition of more than 170 works and over 200 artifacts in the museum’s collection.“Mana Contemporary has been a true partner in bringing this collection to our museum, and we are committed to continuing to support it with the acquisition and restoration of more works,” said Museum director Daniel H. Weiss. “Kirsten’s tenure demonstrates her proven ability to bring the museum and collection to life and her demonstrated commitment to increasing the museum’s public visibility through her programs and collaborations with artists and cultural leaders.”Moberg will assume her responsibilities on March 23. During her tenure, she will oversee the development of a new $59 million capital campaign, the “Museum of Contemporary Art,” which will launch in May 2020 and", "The next Biennial should commence as soon as possible. We will continue to support the city of Copenhagen through this difficult period and look forward to welcoming the exhibitors in the spring. \n\nDanish artist Anna-Sophie Allsop, a pioneer of color photography, died on February 24 at age forty-eight. The cause of death was ovarian cancer, which was diagnosed after the artist was treated at Copenhagen’s Royal Hospital for Sick Children in September 2017.Born in Copenhagen in 1932, The Danish artist was raised in the city of Larsen. After completing her training at the Royal Academy of Arts, she moved to the city of Aalborg, where she studied with the artist Hans Gass. In the 1960s, she lived in the coastal city of Høgstræd and in Copenhagen, where she worked on the 1960s–70s. She eventually established her own studio, which she named Astrup Polar, in 1971 and moved to the United States, where she began her series “Oscars Red,” which she began in 1976 and ended in 1989.The artist is survived by her son, Anders Jørgensen; daughter, Adriana; and her nephew, Anders Holm.\n\n", "The next Biennial should feature a presentation of the new works by the artists who are actively participating in the event, and will feature a selection of works that were exhibited at the first Biennial.The festival will welcome the works of twenty-six artists in the form of a series of solo presentations. Each artist will be given the opportunity to present their work at the biennial, which will be held in both New York and Paris in 2020.\n\n\nInstitutional Review Board member and former New York City mayor Michael Nutter, who was found dead of a suspected heart attack on Sunday at the age of seventy-two, was not an impartial arbiter of artistic merit, the New York Times reports.Rather, it appears, he used his position to advance a political agenda. In a statement published by the New York City Medical Examiner, Dr. Michael Mello described the circumstances of the death as one of \"malignant neglect.”The statement goes on to say that Nutter’s actions “seriously undermine trust between artists and those who are dedicated to their creation.” In a statement on Monday, the board of trustees of the Museum of Modern Art said they stand by their decision not to expel anyone from the institution after their investigation concluded that", "The next Biennial should focus on the history and architecture of the Piazza Navona. The former home of the Fédération Internationale de Art et Architecture (the ICA), the Piazza Navona is now a cultural destination of the Italian capital. The event will also include a re-creation of the city as it was in 1783\u0097the Piazza Navona was not constructed until later, in 1804\u0097and will feature works by artists such as Pierre-Auguste Renoir, who is also known as Renoir, and the British artist and designer Ellsworth Kelly.The new event will be hosted by the Piedmontese architect and designer Bernard Maroulis, and will be held at the Piazza Navona from February 8–26, 2020. The Painted World exhibition will be held at the Piedmontese Museum of Art for the first time in March, and will feature artworks by several hundred artists. The exhibition will take up a theme of the Piedmontese art and architecture over the course of two decades.“This is a very important and timely year,” Piedmontese curator of modernity Alessandra Fusi, the curator of the P", "The next Biennial should be unveiled as soon as possible.\n\nAs the number of people killed by the coronavirus continues to rise, the British and American governments are now trying to come up with new strategies to contain the virus. On Thursday, the Centers for Disease Control and Prevention announced new guidelines for the treatment of patients who are infected with the virus and for how hospitals should care for patients who are suffering from the virus.According to the New York Times, the new guidelines state that a person who is infected with the virus should be admitted to a hospital within 24 hours and that healthcare workers should not be caring for patients unless it is necessary to prevent the death of the patient. The guidelines also state that healthcare workers should not be caring for patients if the patients are sick, have breathing problems, are contagious, or have certain medical conditions.While the guidelines are being released as part of an outbreak that involves at least 3,500 people in the United States, the current outbreak is not as widespread as the novel coronavirus. While the novel coronavirus is spread easily from person to person, the coronavirus is spread only through the respiratory system, so people who are sick with the novel coronavirus cannot contract the virus from another person. The CDC", "The next Biennial should be held at the Furman Library in Manchester, UK, on November 13–19, 2020. In order to further integrate the exhibition into the cultural life of the city, the collection will be moved to the Museum of Modern Art (MoMA) in New York and reassembled in the library. This will also allow curator Nick Herbert, the director of the Fine Arts Gallery at the Centre Pompidou in Paris, to return to the institution.The New York–based curator will be replaced by Peter Wächtler, who has helmed the institution for a decade. Wächtler will serve as the curator of the biennial between June and September 2020.“I’m delighted that we’re moving to the future with the exhibition,” said Wächtler. “It’s a really challenging coming-together as an institution, as a community, as an industry, as a country. The exhibition will undoubtedly evolve as we continue to present exhibitions and participate in other ways. Being able to work in partnership with such a large and important collection, now, and later, is especially important. I’m looking forward to engaging with the collection, to rethinking the exhibition,", "The next Biennial should be held in the Spring of 2020.\n\n\nThe French government has banned a controversial exhibition and a movie in the capital, Paris, that challenged the country’s new president, Emmanuel Macron, in an effort to promote a more inclusive and diverse vision of France’s future. “The French state has declared that it does not support the ‘vision of a nation defined by identity politics’ and that acts must be taken to ensure that this vision is implemented,” said a statement from the president.The move comes amid a deepening political crisis for Macron, who has struggled to create a consensus for new social programs and has been accused of undermining the 2016 presidential election campaign of Marine Le Pen, the leader of the National Front, by campaigning for a plebiscite to take the protection of workers' rights away from employers. He has faced several setbacks since he took office in May. The government is currently working on a revised budget that will begin in October and is preparing for a second round of Brexit negotiations in March.Following the Paris attacks, which took place on November 13, an unprecedented wave of protests against Macron swept the country, precipitating a massive demonstration in the French capital on December 10. The weekend after the", "The next Biennial should be announced in the spring of 2021.\n\n\nThe Royal Academy of Arts (RA) in London has appointed Kate Chapman as its next director. Chapman comes to the institution from the Royal College of Art where she has served as the chief executive since April 2019. She succeeds Simon McBurney, who has been at the helm of RA for nearly fifteen years, and will assume her responsibilities in December.“I have been an avid supporter of the RA for more than ten years and in that time I have seen the organization grow from an ephemeral institution into one that is able to respond to the world around it in meaningful ways,” said Chapman. “The RA’s current artistic programme is outstanding and I am delighted to be supporting this as we move into the next phase of our history with a new exhibition and programming initiative that will be in line with the RA’s vision.”One of the new initiatives of the new director will be to collaborate with leading contemporary arts institutions in the United Kingdom to produce new works by emerging and established artists in the United States and the United Kingdom. The other two issues of the 2020–2021 biennial will be “The Art of Embeddedness,�", "The next Biennial should take place in 2019, and the exhibition will be held at the former site of the German Ministry of Culture in Berlin. The exhibition will be preceded by an ambitious project to re-create the museum’s collections from scratch, in collaboration with local communities. The new exhibition will consist of the works of seventy artists, including Svante Mächt and Oskar Eustis as well as the works of Salvador Dalí, Jean-Luc Godard, and Jean-Luc Godès, and will open in March 2020.\n\n\nThe history of photography has been enriched by a new body of work by the German photographer Walter Gropius, whose passionate, politically oriented practice combines the paradox of a photographic research agenda with a deep sense of humor. The series “Red lines” will be presented in conjunction with the twenty-fifth Biennial of Modern Art, “Kunsthalle Basel” in June. The exhibition will also feature work by the German photographer's wife, Henrike Gropius (her second husband; her first husband was another photographer, Hans Gropius); and a selection of photographs by other German and international photographers.The exhibition will feature the work of forty-two", "The next Biennial should be on January 21, 2021. Sargent’s invitation to the Marrakech conference came as the city was preparing for the coronavirus to hit the region. The coronavirus has infected more than 2,300 people worldwide and caused at least five deaths.The art world has been impacted by the virus—Sargent curated a show at the Pérez Art Museum in Madrid last week that included works by artists such as David Attenborough, Wangechi Mutu, and Hans-Georg Brand. Earlier this week, a show at the Brooklyn Museum was closed because of a safety concern for visitors from China. \n\n\nThe European Commission has released guidelines on how the 27 member states can avoid a repeat of the current crisis by expanding social distancing across their territories, limiting travel by air, and working together more closely to ensure the universal availability of healthcare and services. The document, released on March 5, outlines eight steps that should be taken by all member states, including the UK, to reduce their carbon footprints and tackle climate change’s impact on their economies. Commissioner ŜMonica Scher, who spearheaded the initiative, said: “These steps will help", "The next Biennial should be held in the spring of 2021.\n\n\nThe London-based arts organization the National Galleries of Scotland have agreed to donate the licensed arts space the Albion Art Museum (also known as the Albion City Gallery), an office and exhibition space located in the city of Glasgow, to the Royal Shakespeare Company (RSC).  The move will allow the RSC to expand its online viewing room and to create an additional twenty-four-seat space at the museum.  The new space will also house a national collection of contemporary art, a center for contemporary art, and an author’s residence. “This is an incredible opportunity for the National Gallery of Scotland, and we are delighted to partner with the RSC, not only to develop new and exciting works for the new site in the exhibition hall, but also to support the creation of a new archive that will reflect the extraordinary breadth of the Scottish story,” said John Ó Haigh, director of the National Gallery of Scotland. The newly acquired space is situated in the historic city of Glasgow, which is considered to be one of the most beautiful cities in the world, and will inaugurate the National Curator�", "The next Biennial should take place in early 2021.\n\n\nNorway has appointed Norway’s Sveriges Radio and Prints, which recently changed its name to Norway’s new national radio and print magazine, the New Nordic. The New Nordic will be launched in the city of Oslo and will center around a single artist: Mogens Sandström. Sandström is known for his work Sveriges Raag: Jagekonska, 2014, and Sveriges Bräd, 2017, which are jointly presented by the artist.The artist will be featured in the first issue of the magazine, which will be published by the National Museum of Modern Art in Oslo, on September 8. The second issue is slated to be published by the Fridericianums Museum in Bremen in 2022. The Sveriges Raag exhibition was also selected as the theme of the seventeenth edition of the Danish Contemporary Art Fair in Copenhagen. The event will feature work by fifty-one artists and will be held at the Norstedtag in Copenhagen from September 25 to September 28. The Fridericianums Museum will stage the event in September 2022.", "The next Biennial should take place in 2020.\n\n\nArts and Culture Minister Evgeny Lebedev has appointed Aleksandr Fakhariev, the deputy director of the State Museum of Fine Arts, as the new director of the F. Hall of Fame in the Russian city of Saint Petersburg. In his new role, Fakhariev will work closely with the Georgian Minister of Culture, Giorgi Ghebakhiani, and the mayor of Saint Petersburg, Vladimir Medinsky, to bring the institution’s collection of works by artists such as Felix Magid, Robert Smuts, and George Regin.Fakhariev, who has served as deputy director of the museum since 2016, was appointed in September after the minister of culture, Giorgi Borotra, received a proposal to organize the new biennial. The proposal was made in the run up to the 2020 Olympiad in Moscow, which will take place in March. The deadline for participating artists was June 15.According to the minister, there were several factors that drove the decision. “The F. Hall of Fame is a multinational institution with an important permanent collection of work by artists such as Konstantin Remarque, Vladimir Redy, and", "The next Biennial should take place in 2020, and it will take place in the city’s Basel, Switzerland; in the privacy of its own premises. “We are delighted to announce the opening of the new biennial, the first of its kind in Europe, the United States, and the United Kingdom, in October 2020, in the city of Basel,” said Markus Schwabe, chairman of the Frieze Group. The event will be hosted by the Institute of Contemporary Arts in Berlin, which has been working to complete the renovation of an old garage since 2004. The institute, which has installed more than 1,500 works since it opened in 1950, completed the renovation of the museum in 2020 and moved the exhibition, titled The Future Is Present, to a new site in an area of the museum that is currently unused. The launch of the new commission—which will be hosted by the Kunsthalle Basel—was also delayed by a year because of the Covid-19 pandemic.In the new exhibition, the artists who will be presenting works in a biennial will be predetermined by the participants in the first edition of the exhibition, which is scheduled for September 2019—the artists chosen", "The next Biennial should, in my opinion, be about the photographic collaboration of artists and researchers and should examine how the interaction of a research museum with the university is important for the university in the future.”\n\n\nWith the opening of the biennial “The American Artist” in the city of Atlanta, Georgia, the Museum of Fine Arts (MFA) has celebrated its 150th anniversary with a major expansion and renovation. The $30 million redesign, which incorporated an exhibition hall, auditorium, and galleries in addition to the main building, added more than 10,000 square feet of gallery space, a library, and a museum-like experience in the central courtyard.The redesign also included the addition of seven new galleries, including the Margaret and John Gottschalk Contemporary Art Center, the John and Cindy Mitchell Contemporary Art Museum, and the Peggy Guggenheim Collection. The Guggenheim and the Mitchells will share a new 25,000-square-foot space in the museum, which is being constructed in partnership with the Atlanta-based firm of W.G. Blau, and will open in 2020.“The MFA has been a significant force in the community it serves for more than sixty years, and we", "The next Biennial should be held at the Palace Theatre and will be guided by a committee of academics and curators, comprising Sir J. Paul Getty, Dean Satterwhite, and Richard Flello, in collaboration with David Winant, who will be a professor at the University of Washington, Seattle; Leigh Bennett, curator of contemporary art at the Museum of Modern Art; Charles Miro, director of the Walker Art Center; Andrea Smith-Stryker, director of the Museum of Contemporary Art, Los Angeles; and Sofia Vergara, director of the Museum of Contemporary Art, New York.\n\n\nThe Museum of Art (MoA) in New York has received a $750,000 donation from the Andrew W. Mellon Foundation. The gift comes in the form of a gift certificate signed by Mellon and his son Andrew W. Mellon Jr., and is the culmination of a six-year effort to raise funds for the museum. “Andrew and I are honored to have had the opportunity to work with the Andrew W. Mellon Foundation and to be able to present these gifts to MoA,” said Andrew W. Mellon. “In recent years, we have become increasingly concerned with", "The next Biennial should be held in the spring of 2021.\n\n\nThe twentieth edition of the Fifty-Eighth Venice Biennale, curated by Fernando Rojas and Thomas Dolores, has announced that it will not be held in Milan in 2021. The event was canceled due to the pandemic. The organizers cited the financial crisis and the economic difficulties that the country is facing as the reason for the move.“The first exhibition this year was the installation of three new workworks by the artist, ‘Phosphérima’ in the Venice Gallery. The show was an attempt to step up the pace of the exhibition in the next Biennale. However, due to the high number of visitors and the limited number of works on view, the exhibition was also overshadowed by the pandemic,” read a statement by the organizers.They added, “The exhibition was also affected by the exhibition of Russian artist, Nadezhda Tolokonnikova’s exhibition ‘The Painted World” at the Museum of Modern Art in New York last fall. The show was not included in the 2019 edition of the biennial, and its exclusion was widely criticized.“We have been thinking about how to", "The next Biennial should be held in the spring of 2020 and will be held at the Biennial Center in Innsbruck, Austria. The inaugural exhibition, Art in Motion, commemorates the tenth anniversary of the institution and will open on March 6. The biennial will be held at the Fernádio Cattelan Museum in Venice until June 1. The next exhibition will focus on “solidarities” and “statistics” with works by artists who have had a retrospective in the Italian city in the last few years. The show will be accompanied by a book, a film, and a performance.The opening of the show will be marked by a special exhibition of work in the ongoing series, “Piano Concerto,” which is a tribute to the production of the Italian composer Claudio Cattelan, who won the prestigious Prix d’Art Contemporain de Lyon in 1966. The exhibition will be curated by Cecilia Acconci and will feature works by thirty-six artists from Italy, Austria, Brazil, France, Germany, Italy, and the United Kingdom.The exhibition will resume with an exhibition of works by the opportunities identified", "The next Biennial should take place in the US here in 2020.\n\n\nThe Art Newspaper, an English-language art journal published by The Art Newspaper, an arm of The Art Newspaper and a subsidiary of The Tyburn Group, has been acquired by MediaVentures, which has been seeking a buyer for the company that publishes the monthly magazine for more than twenty years.MediaVentures acquired the company from the German newspaper Süddeutsche Zeitung, which was acquired by the New York Times publisher and global media titan Arthur Jafa in 2016 for $110 million. The deal was finalized in February and marked MediaVentures’ acquisition of the last edition of the magazine, which was launched in 1994 by two brothers, Dieter and Erich Jaffe.The acquisition of the company was contentious from the start. It was considered a slight against the original founders of the publication, Friedrich and Heinz Jaffe, who were active in the art world in the 1980s and were considered the founders of the future of art publishing.“The move has led MediaVentures management to question their own long-held strategy of acquiring art from established and growing companies, and has also been perceived as an attempt to make a quick buck,�", "The next Biennial should take place in the fall of 2020, with an exhibition lasting four weeks and taking place during the summer months. The event will be hosted by the architects; the University of Milan, the University of Cagli, and the National Museum of Fine Arts of the Republic of Korea; and will employ a total of twenty-eight artists.The live event, which will unfold across thirty-five exhibition spaces in the Museum, will make use of a number of technologies including drone photography, 3-D modeling, and virtual reality. The exhibition will also incorporate a number of works by contemporary fiction and nonfiction artists, including Lana LaAnge and Alex Hirschhorn, and will consist of the works of seventy-three artists and collect their works in a series led by Hiromasa Hitsuji, the curator of the exhibition, titled 13. Art in the Arts will stage its second edition in the Palais de Tokyo, in the spring of 2021, at a date yet to be announced. The event will be organized by Artforum, a leading nonprofit arts organization in Paris, and will be hosted by the twenty-three-story Perrotin in the city of Paris.\n\n\nAfter the nineteenth floor of the Museum of Modern Art", "The next Biennial should focus on incorporating the work of modern and contemporary artists, whose practices reflect the dynamic contemporary world, and should also reflect on the ways in which art history is interrelated with other social and cultural histories. The theme of this year’s biennial should be “Creativity and the Art of Life” to emphasize the importance of art in the unfolding of creative life and the ways in which art can animate the spirit and shape people’s lives.\n\n\nThe Jebus-Tutu Museum of Art in Abu Dhabi has received the first donation of $5 million in its recent fundraising campaign. The $5 million was made by the U.S.-based foundation art conservation charity Art Rescue. Its $1 million gift was made in recognition of its work to conserve the works of Asian artists, who comprise one of the largest collections in the museum’s collection.The donation was made by David M. Hennessy, director of Art Rescue, to the Jebus-Tutu, which was founded in 2008 by the late philanthropist Dr. Abdullah bin Zayed, in recognition of its work to conserve the holdings of the late Malaysian philanthropist Gen. Tan Sri Zulkifli. Hennessy described Z", "The next Biennial should be held at a location that could support the exhibition, such as in a museum or gallery. \n\nAdvertisement\n\nThe Museum of the City of New York (MCA) is providing additional funding to support the relocation of the Museum of the City of New York’s collection to a new facility. Located at 168 East Forty-third Street, the new museum will be designed by the firm Gensler and will be built at 86 East Forty-sixth Street.“With this new partnership, MCA and the Museum’s trustees have successfully reached a new milestone in our history: they have united to create a new grant program for the Museum of the City of New York,” said Mark Loizeau, chair of MCA. “Together, the trustees and MCA, we are pleased to announce that this will be a unique partnership. We have seen this as a long-term strategy throughout our history, and it is exactly what the MCA has been working towards for years: a new kind of partnership.”Since its inception in 1979, the partnership has helped raise the collection for more than seventy years. The move coincided with the expansion of MCA’s holdings, which", "The next Biennial should be held in 2020.\n\n\nIsabel Toledo has been appointed the next president of the Museum of Contemporary Art (MoCA). She succeeds Christopher Wool, who departed the institution in March 2019 after twenty-six years to become the first African American president of the United States.“I’m honored to be joining the exceptional team at the Museum of Contemporary Art (MoCA) as they continue to expand on their mission of celebrating art with a new generation of scholars, artists, and organizers who bring new experiences and new perspectives to the museum,” said Toledo. “Over the past twenty-six years, I have spent my career at the Museum of Contemporary Art (MoCA) developing innovative and compelling exhibitions and programs for the museum and its audiences. I am deeply concerned by the museum’s transformation as a nation, one of the most dynamic cultural institutions in the United States, and am confident that Isabel will move us forward through a range of different approaches, including exhibitions, education, and research, in recognition of her enormous contributions to the museum.”From 1998 to 2007, Toledo served as a curator and writer for the Museum of Contemporary Art Chicago. The following year, she was named curator of the late collector", "The next Biennial should be held in 2020. It will also be the last. \n\n\nThe Somerset House Museum in London has appointed A.J. Clay as the new director and CEO of the Somerset House. Clay will be responsible for the care and renovation of the institution, which is currently undergoing a major overhaul, and will assume his post in August.“We are delighted to welcome A.J. Clay to the team of the South East as he continues to push forward the theme of the Biennial, of the violence that surrounds us and how we respond to it,” said Elizabeth Anagnos, chair of the board of trustees. “His knowledge and passion for art and philosophy, combined with his commitment to supporting artists, creates a perfect match for the South East.”The biennial, which will be held in the renovated Victorian mansion on the south bank of the River Thames in London from May 15 to May 19, 2019, will bring together sixty artists\u0097including Mira Dancy, Cécile Blondel, Antony Hudinsky, and Antony Williams’s final installation, The Last Men on Earth. \n\n\nThe Los Angeles County Museum of Art (LACMA", "The next Biennial should be held in 2021.  The program will be led by Laurens-Henrijke and Dorothea Rockliff, who will work collaboratively with local artists, institutions, and collectors to create a new platform for collaboration and exchange.  The new venue will host the inaugural exhibition in Helsinki in December 2020. The platform will be developed further in collaboration with the Helsinki Museum of Art in collaboration with the Helsinki Conservatorium of Music in collaboration with the Helsinki State Archive of Art in December 2020 to create the new exhibition in Helsinki in June 2021. The studio will be located at the Kappelartokotokotatte in Kaunas, Finland, and will host a residency program in collaboration with Kappelartokotokoten in August 2021. The program will be hosted by the Kappelartokotokoten studio and the Helsinki Conservatorium of Music on the ground in the Kültelänä, and will include the exhibition of the artist-designed works of the studio to coincide with its theme event.“The announcement was made by the artists themselves, Laurens-Henrijke and Dorothea Rockliff, both of whom are known", "The next Biennial should be held in May and it will then begin the countdown to the event, which will celebrate the last day of the seventy-sixth Congress of the International Association of Chiefs of Arts (CAFAD) in May 2020. The 2019 edition, titled “Art of the Twenty-Fifth Century” and curated by Lisa Marie Fitzgerald, marked the first time the artist “was able to work in a space that was not a museum’s primary focus.” The 2019 event, which drew around 1,500 visitors, will be followed by a biennial in November 2020.\n\n\nThe United States House of Representatives voted yesterday to establish a national museum dedicated to the study of the contributions made by African Americans to the country’s history and its economy, and to authorize $1.2 trillion in aid over the next two decades. Introduced last year by New York representative Peter King, the Museum of the African Diaspora (MAS) in Harlem was delivered a historic victory by the full House of Representatives on Monday, after it passed a bill that will provide more than $2 billion in aid over the next two years.“MAS’s bill is a historic first, coming"]