["The next Biennial should be called for the exhibition of the work of the artist Marian Wint and the exhibition of his new collection. Previous Workshops: The exhibition of Sulprita Ahmed, 2019; Architecture, Design, and Architecture, ‎2019; and Art, Design and Architecture,​​2019. The next Biennial should be called for the exhibition of the work of the artist Gerald Chateaubriand and the exhibition of his new collection. The next Biennial should be called for the exhibition of the work of the artist Aisling Benoit and the exhibition of Tahitio Maki’s new exhibition. The next Biennial should be called for the work of the artist Hermann Hesse and the exhibition of two of his works. The next Biennial should be called for the performance of the work of the artist Sara Hoffman and the exhibition of her new collection. “It’s been a long time since I’ve had the pleasure to work with these artists and one of the things I’ve tried to do is make them into a kind of canon,” Hesse said in a statement. “The work", "The next Biennial should focus on “The Other Side: Western Painting in Japan 1945–1960” (2019), which will highlight the “strategic and methodological compromises and political biases” that led to the “unravelling of the Japanese school in the 1950s and ’60s.” The 2020 edition will focus on the “Western Imagination,” with a focus on painting from the 1960s onwards.The 10th biennial of Asian art, organized by the Japan Foundation, will feature work by eighty artists in Tokyo. The exhibition, “The Yoyogi Museum,” which opened in October 2018, will feature work by seventy-two artists in Kyoto and Osaka. The museum said that the new programming will draw from the “current global knowledge in the field.” It will also present the first “Asian art,” a “Western art,” exhibition at the Museum of Modern Art in New York.The 2020 biennial is a collaboration between Kunsthalle Basel, the Art Archives, and the Museum Heraus in Vienna.\n\n\nThe Danish National Gallery has announced that it is expanding its curatorial staff by five people, bringing the total number of cur", "The next Biennial should be a celebration of our history, a time for reflection, and a time for celebration.”The next exhibition will be “Against the Current,” a series of performances and videos that will examine the relationship between art and the contemporary world. Titled “Power Play: Surveillance and Resistance in the Digital Age,” the twenty-third iteration of the show will take place in the privacy of a library.The 2020 edition of the Exhibition “Forums,” which will also be held in Hong Kong, will also explore the collection and circulation of information through virtual and augmented environments. “Against the Current: Surveillance and Resistance in the Digital Age” will be on view through February 21.\n\n\nThe Association of Art Museum Directors (AAMD) announced today that it is launching a new $1 million fund that will help artists struggling financially due to the Covid-19 pandemic. Launched in partnership with Artnet, Relief Artists Fund, and the Artists’ Labor Fund, the initiative will provide grants to help those affected by Covid-19 and their families through a two-tier application process. Applicants will receive up to $75,000; those who apply first", "The next Biennial should be a triumph of creativity and a reflection of our times.”The first exhibition, titled “The Construction of Objects,” was staged at the Parbex Museum of Art in Baku, Azerbaijan, in October 2000. Ten years later, it was moved to the National Museum of History in Dusseldorf, Germany, and the Dusseldorf Art Museum in the same year. In 2007, the Biennial was returned to Brussels, and in 2011, it reentered the city of Brussels. In 2018, the exhibition was selected for its “historical and stylistic excellence” by a special jury comprising Berthold Moll, the director of the Museo del Barrio, and Annemarie Thirion, the director of the Flemish Center for Contemporary Art.The 2018 edition of the exhibition would have been different had it not been for the intervention of the Turkish curator and arts organizer Selim Idris, who arranged for the exhibition to be moved to Istanbul. Following the terrorist attacks on the Turkish Embassy in Paris the week of March 13, 2018, the exhibition was rescheduled for September. Commenting on the event, Ibrahim wrote: “The Istanbul Bi", "The next Biennial should be in June 2020.\n\n\nTao Art Foundation, whose founding gift of seventy-five works by modern and contemporary artists has been credited for orchestrating the revitalization of Shanghai’s Art Nouveau, will provide $158 million to support the acquisition and renovation of the museum’s collection. The gift was made in honor of Tao Kun, who passed away in October 2019 at the age of seventy-three.Dubbed the Shanghai Collection, the thirty-one works were donated by twenty-seven Chinese artists, including Zhang Jie (Tianhe), Cao Yu (Fudan), Lu Xiaofeng (Xiaohe), Zhigang Jiang (Cantor), and Yang Li (Wangda), among others. The collection will be inaugurated by a new exhibition titled Art of China, curated by Katsu Noda, at the Museum of Fine Arts in Tokyo in June. The Shanghai Collection was established in 1999 to promote the works of contemporary artists. The foundation was founded by Dieter Reimer, who first visited Shanghai in 1968, as well as Zhang Yaxuan, Zhang Yaxuan Chen, and Zhang Yaxuan Huang,", "The next Biennial should focus on new beginnings and new projects to consider how the art of the future will be made up of a new constellation of contemporary artists. The exhibition will also include a biennial-level program of performances, residencies, lectures, residencies, presentations, workshops, and other activities. “The Sixties: A Retrospective is a refreshing expression of the spirit of the seventies and the seventy-s,” said Dario Catellani, president of the Italian Federation of Cinema and Television. The exhibition was organized by Giardino Cattelan and Gabrielle Dallý and is supported by the Institut Internationale d’Art et d’Aupolutliche und Technik (ITA) in Rome, the Institut Internationale des Papes (IUP) in Paris, the Institut für Kunstbau (IKB), the Institut für Kunstbau und Wirtschaft (IKW), and the Institut für Kunstbau und Wirtschaft in Stuttgart.\n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC", "The next Biennial should take place in 2020, although the date has yet to be decided.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has acquired the historic building where the Museum of the City of New York (MOCAD) was founded. The seventy-six-year-old building, which is a former factory in the city, was converted into an artist-run museum in 2008, and in 2001, the museum’s founder, Paul Graham, was shot and killed by a member of the Nazi Party.The acquisition, which was made through a combination of donations and the sale of works on loan from the museum’s holdings, includes a number of works by known German Expressionists such as Georges Apostuil and Ludwig Bache. The German Expressionists were among the first artists to be purchased by the institution, which was established in 1932 by Frank Gehry. Its collection comprises works by artists such as Rainer & Rieger, Karl Lagerfeld, Franz Lüpertz, Eduard Neuberg, Otto von Kleist, and Felix Mendelssohn.“The acquisition is a great victory for the very people of New York who have been working for years to make this happen,", "The next Biennial should take place in 2021 and should take place in Al-Ula, the capital of Saudi Arabia; Islamabad, Pakistan; and Al-Mayadin, Lebanon. The institution will unveil a new collection of work by the renowned Saudi artist Tawfiq Al-Hashemi in April. \n\n\nThe Anadolu Agency, a Diaspora-based nonprofit focused on arts and cultural work in Turkey, has launched a new initiative to help Syrian refugees and their families find work in the Turkish arts. The initiative, which will focus on connecting Syrian artists with Turkish audiences, will offer monthly stipends of $1,500 to artists and will begin with artists, who have not yet been selected for the monthly stipend, and will expand to include journalists, photographers, writers, artists, and art workers from Syria, Iraq, and other countries that have recently become embroiled in the civil war.The initiative will launch with the Bosphorus Bridge Project, which will draw international artists (including Louise Haigh, John Akomfrah, Jean-Michel Basquiat, Susanne Vielmetter, and Hans-Georg Brand) to score the iconic Ottoman bridge over the River Bosphorus and will culminate in the", "The next Biennial should be in March 2022, the commission said. If the decision is upheld, the show will move to March 2023. The sculpture will then return to the Picasso Museum in Paris in March of 2020, to be unveiled by Michelangelo Antonioni in the new exhibition, The Uncertain Muse: The Art of David, which will run until March 25. A retrospective of the artist’s work—which will be staged at the Contemporary Art Biennale in Milan in November 2020—will follow at the Museum d’Art Contemporain in Zürich in March 2021.A statement by the museum said: “The Biennial for Art and Architecture in Rome will bring together great artists. Its programming and exhibitions are multi-disciplinary, and through the exhibition of works from the exhibition of its author, the artist Alexander Neurosky, we hope that these artists will have a new perspective and new voices.”\n\n\nThe New Museum in New York has announced that it will donate $1 million to the New York City Department of Cultural Affairs (CADA), the New York City Department of Cultural Affairs (NYC’s equivalent of the US Department of Education), and the New York", "The next Biennial should take place in 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines outlining how artists and cultural workers may protest the construction of new works by controversial contemporary artists, including Daniel Íñigo, Colin Campbell, and Paul Gauguin, in an effort to protect cultural heritage and are expected to be implemented sometime this spring.The guidelines were developed after the city received more than 1,800 letters and emails from cultural workers in the city protesting the construction of a new public art installation by the controversial artists at Columbus Circle in the city center. The controversial groupings include the No New Works for Columbus Circle’s Columbus Art Museum, the Bronx Museum of the Arts, the Brooklyn Museum, the Metropolitan Museum of Art, the Whitney Museum of American Art, and the Museum of Modern Art (MoMA).The guidelines outline three ways that individuals and organizations can participate in the protests: by signing a letter, organizing a meeting, or protesting outside of the museum.The letter reads: “Art is an essential and indelible expression of human experience. Without it, the city of New York would not be able to sustain itself, and the art world would not exist.” The letter", "The next Biennial should open in 2020.\n\n\nAs the New York City Department of Cultural Affairs (DCLA) prepares to open its new $7.5 billion Metropolitan Museum of Art (MoCA) next month, the agency is releasing new guidelines for the museum’s display of works by contemporary artists in an effort to encourage more dialogue and collaboration between the institution and the broader cultural community.The March 2018 edition of the Met Art Issue, “Advancements in Drawing, Painting, and Text,” featuring a retrospective of Andy Warhol’s “Feminine March” and a special exhibition devoted to the work of artist-in-residence Albert Oehlen, was dedicated to the demolition of the Metropolitan Museum of Art’s Andy Warhol and Fabio Canova–designed landmark. Dubbed the “Oolite B.A.” for its Gothic Revival-inspired exterior—the building was built in 1972 to house the works of the artist-in-residence, whose collection comprises sculptures by Ellsworth Kelly, Frank Stella, Don McManish, and Jean Luc Mylayne—the Met was forced to move the installation and the sculpture from its historic setting in Bushwick, New", "The next Biennial should be held at the Faerraus Museum, in the village of Freer, in the northwest of the city of Kassel, in the Philippiansburg region of Germany, in 2020. The exhibition, titled The Second Coming, will consist of works by artists from around the world. The project is part of the Organization for the Pre-Conceptual Existence of God, a German-based nonprofit, which is devoted to the study and representation of the spiritual, material, and cultural properties of the Pre-Conceptual era in Germany. The Organization for the Pre-Conceptual Existence of God’s project is currently producing works for the upcoming exhibition “Fruit of the Preceptual Tree: ‘30°C’s Landscape,’ which will run from April 5 to April 7, 2020. The Midsummer Solstice, which is scheduled for October 29, 2020, will be staged at the Temple of All Saints, St. Peter’s Square, in Rome, Italy, and will be staged from May 24 to May 28, 2020. “Themes of place,", "The next Biennial should be held in the spring of 2020. The event will be hosted by the Museum of Modern Art, in collaboration with artist groups, scholars, and developers. The theme of the fifty-ninth edition of the Global Biennial will be “Resilience and the Construction of Community.” The biennial will focus on the concept of resilience, on the effects of climate change on human societies, and on the actions that can be taken to mitigate the effects of climate change.Lévy Martin and its designers have emphasized that the design of the exhibition will be influenced by the architecture of New York City and the life and times of the artist. “The current Biennial is inspired by the history of New York: how the city was born out of the American industrial revolution, and how it continues to be defined today through the art of architecture and design in the city,” said Lévy Martin president Victor Naumann. The company has also stated that the theme of the event is “not a celebration of the past, but a chance to create a new one.” The museum will honor the artist in two stages. First, the museum will stage a retrospective of her work, “", "The next Biennial should take place in Rio de Janeiro, and the event should be held in 2021. \n\n\nThe National Art Museum in Washington, DC, has appointed Mimi Alef as its next director and chief curator. The appointment was made on August 26, and she has been named interim director of the museum.“Mimi’s leadership and vision for the museum as a critical platform for American art make her an ideal fit for this critical role,” said Wayne Hamilton, president and CEO of the Smithsonian Institution. “Her track record of achievement and ability to integrate research, teaching, curating, and publicity to advance the museum’s mission in ways that maximize civic engagement and creativity across our nation makes her a strong fit for the role.”“Over the last decade, Mimi’s work has been featured in exhibitions at the Museum of Modern Art, the Museum of Modern Art (MoMA), the Museum of Contemporary Art, Houston, the National Gallery of Art, Washington DC, and the Whitney Museum of American Art. She has also served as an adjunct faculty member at the New School, New York; a research scholar at the University of Rochester; and as a professor of art history and design at", "The next Biennial should have a new theme, a new exhibition, and a new program. This year’s event, which was originally scheduled for November 21–December 3, has been moved to December 21–27. \n\n\nNew York’s Metropolitan Museum of Art (MoMA) has announced that it will begin welcoming visitors again on December 19 after months of lockdown due to the Covid-19 pandemic. The Museum will reopen as normal on December 21 once the lockdown is lifted, but not without hauling out all of its scheduled programming. “We are committed to providing visitors with the highest quality of experiences possible during this challenging time,” said Met director Daniel H. Weiss. “We know the challenges, both physical and psychological, and we know that many of our guests are anxious and stressed. So we have set aside the day when visitors will be welcome again. The important thing is for the staff to come together and for the public to see a new show by David Kordansky, who will bring his unique vision to life.”With the end of the lockdown, which lasted from March 19 to March 21, the Museum reopened as usual on December 21, but with limited admission and public viewing. ", "The next Biennial should focus on the central role of the artist and his or her communities in the course of their careers and sometimes their own trajectories. The theme of the 2020 event will be “The Art of Body and the Body of Art,” and it will take place at the MAMCO Art Institute in New York. A spokesperson for the New York museum said that, while it “does not have a formal relationship with the artist, we recognize that the artist is a foundational force in Southern California’s art community.”\n\n\nAfter the Israeli government approved the construction of two new settlements in the West Bank last week, the United States condemned the move as “deeply disturbing” and an “incomplete” report released by the State Department on Monday blamed the United States for forcing Israel to halt construction in the territories. The move has left the American-led Boycott Divestment Sanctions (BDS) movement devastated. “The US government has effectively ended any possibility of a two-state solution with Israel in the West Bank, and has actively worked to undermine the prospects for a viable Palestinian state with its policy of settlement expansion,” said US Ambassador to Israel Daniel Shapiro.The construction in", "The next Biennial should take place in 2021, the year after the biennial will be completed. The next edition of the Taormina Literary Festival will take place in 2022.\n\n\nThe Carolingians Institute (CRI) has released its list of fifty-five artists and collectives nominated for the 2019 edition of its Winter/Spring/Summer Art Awards. The awards honor Michelangelo Antonioni’s Simone the Giant, Roberto Fontana’s The Surreal Life of Mary Magdalene, and Karl Lagerfeld’s The Golden Age of the Red Sea. Each award is worth $25,000 and is presented in the form of a certificate that is valid for a limited period of time.The twenty-four finalists—including Marc-Olivier Huyghe, Pascal Jaros, Wolfgang Pohl, and Wolfgang Stumpf—were selected for their works by a judging panel comprising Haegue Bächli, director of the Berlin Art Museum, and Wolfgang Obrist, director of the Museum of Contemporary Art. The winners were announced on February 12.“The exhibition is a unique and exceptional opportunity to present work that is of the utmost quality, and to engage with the philosophical", "The next Biennial should be held at the Phoenix Art Museum in the spring of 2020. The next exhibition should open in the autumn of 2020. The next Pérez Art Museum should open in the spring of 2021. And the next Albright-Knox Art Museum should open in the spring of 2022. The next Art Basel is planned for early 2021.\n\n\nThis month the Museum of Arts and Design (MAD) in New York City received $8 million from the Endowment for the Arts, the National Endowment for the Arts (NEA), and the National Endowment for the Humanities (NEH), to support the renovation of its brick building. The funds will be used to redesign the space and rebalance the museum’s educational program in order to reduce the institution’s carbon footprint and ensure its long-term sustainability.“This is a historic year for the Museum, and we are thrilled to be working with such exceptional artists and artists’ organizations,” said James Steward, the director of MAD. “The renovation will inspire and advance our work in many ways. The future of MAD is bright and exciting. We will continue to shape and shape with the people", "The next Biennial should be held in the autumn of 2020. The announcement was made in Brussels on Tuesday, May 4, ahead of the annual exhibition of the Brussels-based artist collective the Miro Group.Miro, whose first show in the United Kingdom was an exhibition of work by the Stedelijk Museum in Amsterdam in 2016, also announced today that it is planning to present the show “The Future of Art: From the Miro Group to the Miro Museum’s New York branch.” The center will be located on the first floor of a building designed by the Miro Group in the city. The exhibition will be organized by the Miro Museum in cooperation with the artist and curator Alexandra Lundeberg, who will oversee the show.Commenting on the upcoming exhibition, the curator and art historian Anna-Sophie Corin said: “The Miro Group’s new, contemporary, contemporary art is founded on the idea that art is the future, and that artists can change the future, for the better or worse, and with this in mind, the Miro Museum in Brussels is excited to present ‘The Future of Art: From the Miro Group to the Miro Museum’s New York", "The next Biennial should be on the history of journalism, with a particular focus on the development of the field of news reporting.”The forty-sixth edition of the festival will take place at the Museo de Arte Contemporáneo in Madrid from December 11 to December 19, 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to move forward with a controversial renovation of its historic Art Deco building in an attempt to make it more sustainable. The renovation, which is partially funded with a $550 million federal loan, will involve the shedding of more than 1,500 square feet of the museum’s current exhibition space and will involve the expansion of the building’s exhibition area by 1,200 square feet.According to Artnet News, the MOMA will now be able to accommodate 4,500 more works by contemporary artists, but the renovation will only temporarily increase its exhibition space in the form of a pilot program, as the institution has been working to accomplish for years. In a statement, MoMA said: “We want to take the time to think about how we can work with the legacy and the legacy space to improve its resilience and function in a more collaborative way.", "The next Biennial should be held in the fall of 2020. The ten finalists will be chosen by a jury comprising: Artists of the Americas, South Asia, and Europe; Artistic Director Ricardo Miranda; Architecture Writers Association of America; and Artistic Director and CEO of the New York firm the Wolfsonian-New York William Henry Fox Talbot. The first edition, titled The Great Global Bazaar, was staged in 2017 in New York and took audience members on a tour of the city, celebrating the 100th anniversary of the first Biennale. The second edition, The Fifth Dimension, will be held in the fall of 2021, and will commence with the exhibition “Dear Future,” an exploration of the notion of “the fifth dimension” alongside artist Nanya Breslavsky.The announcement of the 2020 and 2021 fellows was made at the Art Fund d’Art Contemporain in Paris, where artist-in-residence Juliette Giguère was selected as the 2020 recipient of the Flemish Gold Medal. The honor comes with a $250 prize; the publication of the list of the semifinalists will mark the occasion.Giguère will", "The next Biennial should be held in the autumn of 2021. The 2019 Biennial was hosted by the same consortium as this year’s show, and was staged at the same venue. This year’s exhibition was inspired by the recent coronavirus pandemic and the work was conceptualized as a “future history of art.”In order to participate in the upcoming exhibition, the artist must complete a ten-month residency at the collection, which hosts over two hundred works of contemporary art. The artist will be given a specific assignment and will have the opportunity to draw inspiration from the works of other artists. The artist is also expected to create a new work in the exhibition. The jury that will select the winner will have the authority to revoke the biennial’s residency contract, and the artist will not be penalized for the exhibition.\n\n\nThe Turner Prize, a $10,000 award given annually to an artist whose work or exhibition has been selected for its transformative impact on a contemporary art community, has been awarded to the artist Osiris Madani for his installation Mulapura (Songs of the Trees), 2019. Madani will receive the prize in Paris on January 25.“The work’s installation and", "The next Biennial should be held in 2020, but organizers are still open to determining a date for the 2020 edition.If the redevelopment of the Museum of Modern Art is successful, the museum will break ground in 2024 and will begin hosting exhibitions in 2021.  The renovation of the Museum of Contemporary Art in Philadelphia will be completed in 2023 and will begin in 2024. The renovation of the Museum of Modern Art, which is currently slated to open in 2026, began in 1999 and is complete.\n\n\nThe Solomon R. Guggenheim Museum in New York has hired Paul Mpagi Sepuya and Miyoko Yamamoto as assistant curators and writers, respectively, in an effort to help the institution build its library of works by African American artists. Mpagi Sepuya, who has curated the museum’s inaugural exhibition “Shelter,” which opened at the institution in 2017 and ran through the end of March, and Miyoko Yamamoto, who has worked as a research scholar and writer for the past fifteen years, will assume the roles in April.The pair join the Guggenheim after working as part of the first wave of the Black Arts Revival (BAR) projects in the 1980s", "The next Biennial should focus on supporting the creative and cultural heritage of the First World War and its impact on the contemporary world. It should also consider the local, regional and international connections between the Biennial and the countries and regions where the Works of Art 2016 will take place. “From the very beginning, the Biennial has been a platform for thinking and acting in new ways,” Abigail Hutton, curator of the exhibition, said. “On the occasion of its seventy-fifth anniversary, our staff and we at the Museum are incredibly proud of our work and for the impact it has on a community. The Arts Council and the works of the Museum are a reflection of our collective imagination and the creative spirit of London.”The 2018 edition of the biennial, “Unseen: The Contemporary Art of John Maynard Keynes,” will be on view until November 22.\n\n\nThe Fisk University Art Museum in Kansas City, Missouri, has received a gift of twenty-seven works by artists, including Benedict Graham, Rustil and Amanda Newhouse, Hartley Vossen, Bradley K. Lewis, and John Gay. The works were donated by Thomas Lam", "The next Biennial should take place in 2022 and will be presented by the City of Chicago. “We are delighted that the City of Chicago has commissioned us to create a new work of art for the museum,” said Larissa Galusha, an artist and art historian who is on the committee. “This work is part of a long tradition of collaboration between Chicago and the rest of the world, and we are confident that it will make an important contribution to the museum’s collection and future exhibitions.”The selection of the work was made through a public exhibition that opened to the public at the museum in October 2019. Galusha and her colleagues comprised Karla Beill, director of the Chicago Art Institute (CAAI); Pia Camil, director of the Museo del Barrio; and Julie Grubb, director of the Museum of Contemporary Art Chicago.The project was initiated by the city of Chicago in 2017 to commemorate the centenary of the creation of the city’s public art works. The public works were created by individuals and institutions in collaboration with the city. In 2019, the museum began commissioning new works by Chicago residents and new works by outside artists. The first exhibition, “Chicago", "The next Biennial should open in the fall of 2020. The next edition will be staged at the Museum of Contemporary Art, Miami Beach, and will focus on “modernism in a time of global crisis.” The 2019 edition, titled “A Living Image,” assembled seventy-five works by forty-four artists and was staged at the Museum of Contemporary Art, Los Angeles. The competition was hosted by the Folk Art Museum of Chicago. Its winner, Elleas Almena, will receive $50,000.\n\n\nThe German city of Frankfurt, which has been under a temporary lockdown since a series of explosions at the Tempelhof nuclear power plant in September killed twelve people and injured 180, has approved a $15.6 billion plan to make up for lost revenue from the nuclear plant, which has been closed since March due to the Covid-19 pandemic. The reconstruction plan, which will also include the construction of a new cultural center, will be implemented over a twelve-year period, starting in 2022.The city council voted for the plan on December 2, with sixty-three votes in favor and twelve against. The vote was unanimous, and the full city council has yet to take a vote on rev", "The next Biennial should also consider the potential for art from the contemporary or alternative scene to address issues of race, gender, and sexual identity—issues that are currently being addressed, but not yet addressed, within the museum.  In addition to the proposals listed below, we encourage museum staff to think critically about the ways they engage with local, regional, and national cultural institutions, and how these institutions can best be inspired and informed by contemporary art.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed María Berrada as its new executive director. Berrada will take up the post on January 31, 2020. In her new role, she will be responsible for the day-to-day operations of both the museum and the city of New York. Berrada will also be responsible for managing the museum’s collection, display, archival research, education, and fundraising efforts. She will start her new role on January 26.“The Met has been an enabler of racial injustice for decades, and continues to be an outlier in many respects,” Berrada said in a statement. “I’m committed to challenging that legacy through programming that celebrates the diversity of artists who", "The next Biennial should open in 2022 and will be organized by the Nairobi-based artist Olu Ose. The exhibition will feature works that are traditionally grouped together, but will also exhibit works from the current exhibition. Museum director Fogo Amaral has announced that the next exhibition will be dedicated to the emergence of an African bourgeoisie in the United States. In a statement, he said: “I’m thrilled to be returning to Africa for the first time in my seventy-five years as director. I’m honored to be the first director to present a ‘African Contemporary’ in the United States.”\n\n\nThe museum in London that has been working to reopen since March 14, following months of protests and a public strike, has announced that it is now reopening. The museum, which was forced to close its doors to the public in March because of Covid-19, is now participating in the ongoing political strike and is preparing for a possible repeat of the March 14 reopening.The museum, which had originally planned to reopen in mid-April, said that it was “working hard to re-open in the coming weeks, but expects to be fully operational by the end of April.�", "The next Biennial should be held in 2020, although the date has yet to be decided.\n\n\nAn eight-seat sculpture by Japanese artist Mitsutoshi Sato, which is currently on display in the exhibition “Zumori no kara,” will be included in the first event, entitled “Imagination,” at the Museum of Contemporary Art (MoCA), Tokyo, next month. The work, which is part of the exhibition “Light and Space” (2015), is a composite of wood, fabric, and fabric fibers, which were imported by Sato and are densely packed in a sphere around the acrylic latex that is used in the installation. Focusing on the exhibition’s theme of the fusion of photography and sculpture, the work is inspired by the influence of photography on the art world and is a hybrid of a single-operator machine and moving image.“The work is not a portrait but an impression of a woman and a man on the other side of the earth,” Sato said in a statement. “I hope that one day we will be able to realize the dream of one of the inventors of photography to make a work like this.”The exhibition will open", "The next Biennial should take place in 2022. The person chosen to head the event will be announced in the spring of 2020. Image: Kohn Gallery.The Architectural Association (A) and the Association of Photographers (AOP) have teamed up to create a new prize for photographers whose work accurately depicts life on the ground in a way that engages with local and national issues. The $5,000 prize will be awarded this year and will be presented at the A’Os’ 75th Annual Photographic Almanac, which is currently on view at the New York Public Library. Set to open on September 24, the exhibition will feature work by forty-four photographers.The prize was established in 2018 by artist Peter Kohn to help support the Indian photographer Aurovim Jha’s work on his forthcoming book, The Solar System, which will be published this fall by Penguin. The book will describe Jupiter’s system and how it connects to the solar system, the earth, and the universe. The new prize, announced at the A’Os’ 75th Annual Photographic Almanac, will be inaugurated with a free exhibition of Jha’s work at Kohn Gallery in New York on September 16.", "The next Biennial should be held at the newly renovated Museum of Contemporary Art (MCA), Art and Technology, Shanghai (the MCA will open in 2022 with the opening of the Museum of Contemporary Art, Shanghai, which will be inaugurated in 2020); and the distant future art and architecture exhibition of the forthcoming Art Basel Hong Kong fair in 2020.The work of the exhibition will focus on an exploration of the mixed realities of urban life and the museum’s new building, which will be inaugurated at the MCA in 2020. The first expedition to MCA is planned for September 2020.\n\n\nThe Institute of Contemporary Arts (ICA) in Singapore announced today that Mary Ann Paine, who has held the position of director of the Institute since 2012, will be promoted to general director. With the appointment, Paine becomes the third director in the country to be promoted to the rank of general manager. Previously, Masataka Kondo (2013) and Carol Lee (2016) were promoted to general managers. “After a thorough search, Carol Lee was chosen as general manager, and Masataka Kondo was appointed as director,” said ICA director Masuhiro Takeda. “Together, they", "The next Biennial should take place in the autumn of 2021.\n\n\nA group of artists and collectors in Italy are protesting the closure of a five-year-old exhibition at the Museo de Arte Contemporanea (MAS), which is housed in the Palazzo delle Papesse in Venice, by the Italian government. The exhibition “Giana,” which was organized by the Milan-based collective DCM, aims to show the work of female artists across the history of the world. The show is being held in conjunction with the international Women’s March, which was held in the United States and was attended by more than one million people.“The government was clearly assisted in this decision by the women’s march, which helped it to close the museum to prevent a mutiny, and the furore over the exhibition,” said Dario Franceschini, the president of the Italian group CASA. Founded by Gianluigi Battista, Matteo Cipolletta, and Maria Battista, the collective has exhibited artists such as Gio Ponti, María Corina, and Mario Kassar, and has won several awards.Giana (1921–", "The next Biennial should take place in the city next year and is currently on track to be completed in 2021. The exhibition will feature an exhibition of the work of thirty-nine artists in twenty-nine cities in the US, Canada, and Mexico. The exhibition will also feature the first public performance of work by thirty-six artists in American cities. A retrospective of the work of forty-eight artists will also be held in the city next year. The show will run until March 28, 2021.“Our goal is to create a biennial that will reflect the history of the city of San Antonio, the region, and the country,” said San Antonio Mayor Ron Nirenberg. “We are fortunate to have the talented artists who have made meaningful contributions to San Antonio and region and birthplace. We are also fortunate to have the talent to present works of art that truly represent the city and region. We will continue to honor and promote these artists through the collection and exhibition program.”The Biennial will fortuitously take place during the final leg of the city’s long-awaited reopening plan, which is currently in development. The second leg, which will open to the public in 2024, will draw from forty-", "The next Biennial should take place in the next few weeks. “Belgian artist Nima Imtiaz is a master in her art and a very important example in the history of modern art,” said Van Eyck. “As a Belgian artist, he is a great example. He is a frequent guest at the Art Biennial and he has won many awards for his work. I believe that a similar result can be achieved with a Dutch artist, Martin Proch, who is the third winner of the 2020 Prize.”The biennial, which will be held at the Museum of Modern Art in Rotterdam from January 31 to February 23, 2021, will also feature several shortlisted artists, including Hera Weber, Taina Mager, and Ella Semmel, as well as Kirsten Mander, Minta Altra, and Tomasz Knoch, who will each receive a cash prize of €1,500.The 2019 Prize winners were Kapp Sobol, Dorothy Braid, and Sara Suss, whose work is currently on display in the exhibition “Nina Turner: Art and Creation” at the Art Gallery of", "The next Biennial should be held at a venue that will integrate the unique collections of the four universities and will provide the opportunity to participate in an international exhibition. The first exhibition should open in January 2020. The reopening of the Art Museum of Chicago would be marked by a series of performances and events, which would be organized by the Museum of Contemporary Art Chicago. The institution would then inaugurate its new exhibition, The Last, with the artist-in-residence from Chicago: Lara Menéndez. During its inaugural exhibition, The Quiet Landscape of David Hale, The Library of Babel, The Living Landscape of Leila Báez, The Search for The Fountain of Youth, and The Secret Life of Walter de Maria, The Bartels Foundation will present a charity auction featuring works in the collection of the women's museum in Santa Fe, New Mexico. The auction will run from January 17 to January 20. In addition to the auction shows, the foundation will host the inaugural Biennial for Lesbian & Gay Studies, which will take place in February, and the inaugural Biennial for the Visual Arts, which will take place in March.\n\n\nThe Ann Leuchter Family Collection in", "The next Biennial should focus on the role of art in promoting social progress and harmony, and on the challenges and rewards of entrepreneurship in fostering social change.  The festival will be hosted at Vivint’s headquarters in New Delhi from September 18 to September 19. It will run from September 16 to September 19.A selection of twenty-six artists will participate, including Anupam Gupta, Ravi Gupta, Kevin Kelly, Chitra Mahajan, Kishore Mukherjee, Irshad Manthani, Kamal Masur, Madhukar Manthani, Manish Sisodia, Ratanaswamy Sisodia, Shilpa Singh, and Rishabh Saptar. Aditi Gupta will represent the state of Maharashtra in the biennial. The format for the event will be the same as the previous year: Artists will present their works in their traditional and modern ways. The theme of this year’s biennial is “Away from the Eye,” which will consist of a series of photographs by Somnath Bharti. The photographs, taken by Bharti himself, will be presented in the form of two", "The next Biennial should be held in the fall of 2020, according to Palm Springs’ director and CEO Robert Foster. The exhibition will include no less than sixty works by forty-three artists, including Adrian Piper, Peter Blum, and George Child, among many others who have been selected for the first-ever Biennial of the Imagination, scheduled to run in November 2021.\n\n\nThe National Gallery of Art (NFA) in Washington, DC, announced today that it plans to cease operations at the institution as of March 30, 2020. The move follows the announcement of plans to shutter the National Museum of Women in the Arts (MoWMA) in Washington, DC, a month later than originally planned, as well as the announcement of a new three-year, six-month, and 12-month curatorial fellowship program.“The NFA is facing an unprecedented crisis,” said director Nick Floyd. “The future of our program is at risk, and we will continue to rely on our talented, dedicated staff, as we work through the transition. Our future programming and exhibitions will be impacted, and we will need you. We are asking that you continue to lend your time and support to the NFA.", "The next Biennial should be held in September 2019. The date for the exhibition has yet to be established.\n\n\nThe Clinton Foundation has awarded more than $5 million in grants and scholarships to eighty-two undergraduate and graduate students from ninety-two colleges across the United States. The initiative, which was led by L.A.-based arts and culture producer and philanthropist Ashley Graham, is the latest attempt by foundation partners to help alleviate the financial pressures caused by the coronavirus epidemic.The foundation has loaned $3.5 million to twenty-two colleges, and $1.5 million to forty-nine others, since 2009. The funds will be used to help pay for tuition and room and board at fee-based institutions. The students will be invited to apply for grants through the foundation during the fall and spring semesters, with the goal of assisting in the transition from students to the institutions they will attend. ---\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Richard Deitsch as its next director. He succeeds Barbara Brody, who departed in May 2019 to become the executive director of New York’s Museum of Modern Art, and will take up the post on January 1, 2021.“", "The next Biennial should be held in 2020.\n\n\nThe Metropolitan Museum of Art (the museum), in partnership with the Los Angeles County Museum of Art (LACMA), has welcomed the museum’s spring 2020 exhibition “Unseen: Art Across Time” to the museum. Set to open on April 1, the exhibition will be guided by a rotating group of creators, including Jeffrey Gibson, Yoko Ono, and Arsht Dziewior, and will highlight new works by artists who have never been on view before.“The museum is eager to create an exciting exhibition for the spring 2020 season that will draw visitors to the institution and engage with their experiences in a meaningful way,” said museum director Paul Mpagi Sepuya and LACMA president and CEO Elin Bouvier. “As we head into the final months of the year, we’ve been working hard to advance the Met’s exhibition program in a way that better reflects the spirit of the time. We’re excited to collaborate with all our artists to continue to explore the natural world in a meaningful way and to create new work for the museum’s spring 2020 season.”The museum will host the first", "The next Biennial should be held in 2021.\n\n\nThe Württembergischer Kunstverein München (WUM) has announced that it will host the seventy-fifth edition of the Berlin Architecture Biennale, which will take place in the city of München from November 22 to November 28. The exhibition will be hosted by the Württembergischer Kunstverein München (WUM), which is currently housed at the Berggruen in Berlin, and will take place in conjunction with the first edition of the Berlin Art Festival.Founded in the city of München in 1971, Württembergischer Kunstverein München (WUM) is one of the largest and most prestigious architectural exhibition spaces in Germany. After establishing a reputation as one of the most important architectural education institutions in Germany, Württembergischer Kunstverein München became a partner of the Berlin Art Museum in 2002. In 2017, it was the venue for the inaugural Berlin Art Fair; the first Württembergischer Kunstverein; the third Berlin Architecture Biennale; and the first German edition of the Art Newspaper. The Württemberg", "The next Biennial should be held in 2022. \n\n\nThe Art Newspaper has published an open letter signed by more than 1,500 art historians and curators in the US, UK, and Europe who call for the impeachment of Democratic presidential nominee Elizabeth Warren.In the letter, titled “Elizabeth Warren: The American Problem” and presented by Sarah Lawrence Gallery, the signatories accuse Warren of inciting racial tension and promoting white supremacy, and argue that her husband, former US treasury secretary Barney Frank, was a racist and philanderer.“We’re writing to condemn your husband and to urge you to reconsider.” Frank served as treasury secretary for seven years from 2001 to 2006, and was succeeded by Bill Clinton, who appointed Barney Frank attorney general.The letter goes on to criticize Warren’s support of the financial bailout programs and the war in Iraq, and her opposition to the Paris Climate Agreement. The letter is dated December 3 and can be found here.The letter is republished in full below:We condemn your blatant racism, xenophobia, misogyny, and classism in the name of democracy and human rights. We demand that you stop demonizing people of color and promoting white supremacy, xenophobia, and homophobia, and instead", "The next Biennial should be held in 2020, during the height of the global health crisis, and with the establishment of a new European Commission–led partnership for the defense of artists.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) is planning to open a museum dedicated to working-class African American artists in the city in 2021. The institution had previously announced that it would create a new museum dedicated to the art of African American artists in 2015, but the display was postponed due to the Covid-19 pandemic.The proposed museum, which will draw from the architecturally and historically significant buildings in the city, will be named after the artist-run nonprofit the Toccarra Collective, which creates contemporary art installations and celebrates black creative traditions through a series of annual gatherings. The organization’s next event, which will take place in 2022, will provide an opportunity for visitors to see works by today’s and tomorrow’s artists.“We’re very excited to create a new museum dedicated to working-class African American artists,” said SFMoMA director Loring Randolph. “The Toccarra Collective is a wonderful example of how art can touch many lives and bring about a sense of", "The next Biennial should take place in 2020, and a tour of the cutting-edge work of the artist-communities, curated by the London-based curator, artist-activist, and educator Tace Turner, will take place at the Museum of Modern Art in 2021. \n\n\nThe Wilhelmina Museum of Art in Rome has appointed Riccardo Mollino, who has spent more than fifteen years organizing Italian art exhibitions and venues, the first director of its new five-story, glass-enclosed exhibition space, the Fondazione Mondo dello Stampa, which will create a new center for contemporary Italian art. Mollino, who is also the founder of the visual arts group Sotto Arti, was selected as the grand prize winner of the $30,000 Piazza Bella, which is funded by the Italian Minister of Culture, Dario Franceschini, and the Italian Minister of the Interior, Marco Minotti. Mollino, who previously served as assistant curator at the Guggenheim from 1988 to 2013, succeeds Sabrina Celant, who retired last November after twenty-five years at the helm of the institution, which is located on Via della Scala in central", "The next Biennial should focus on the history of the exhibition’s exhibition, which will be on view through March 18, 2020. The exhibition will also focus on the history of the exhibition, which was organized as part of a worldwide movement to memorialize the victims of the Black Death, in an attempt to learn from the history of the region.Among the exhibition’s curators are Diego Campos, Timur C. Chekhov, Eric Fischl, and Laurent Groulx, who will each serve as the opening and closing acts for their respective biennials.“Themes of modernism, the history of art and art history are intermingled in this exhibition,” said Gerard Holle, director of the Métro de Lyon in France. “Au revoir,” Holle added.  The exhibition will be curated by art historian Julien Mercier, curator of contemporary art at the Musée National Picasso-Paris (MPP), and his wife, Gaméphe. The show will be organized in collaboration with the archives of the Musée National Picasso-Paris and the Musée National Picasso-Paris, which will jointly curate the exhibition. \n\n\nE", "The next Biennial should be held in 2021.\n\n\nThe National Gallery of Art in Washington, DC, has named Amanda Hess as its new deputy director. Previously, she has worked as a curator at the Woodrow Wilson International Center for Scholars in New York and as a freelance curator. In her new role, Hess will begin in the newly created role of deputy director of the Metropolitan Museum of Art in Washington, DC.“We are thrilled to welcome Amanda to the National Gallery of Art and to be able to welcome her to the museum’s new home in 2021,” said director Christopher H. Forsyth. “We are hopeful that her new role will enable her to combine her passion and expertise to further the museum’s mission of showcasing the art of our time.”\n\n\nThe Austrian Ministry of Culture announced that Amy Benitez has been appointed as the new director of the National Museum of Fine Arts (MFA). Born in Vienna and raised in Paris, Benitez currently serves as an associate curator at the Fondazione Prada in Milan. Benitez will be responsible for overseeing the museum’s collaboration with the artist and activist Hans-Ulrich Obrist, who founded the movement M-Art", "The next Biennial should focus on “How the Body Works,” a new presentation of new art created by master sculptor Andrea Brugnaro that has been inspired by his travels around the world over the course of a decade. Brugnaro will make his first exhibition in the United States at an undisclosed location in 2020. \n\nThe Museum of Modern Art (MoMA) in New York is planning to open a new six-story, twenty-acre campus in the Bronx, New York, in 2021. The new museum will be built on the former site of the former World Trade Center and will comprise three buildings with a total area of approximately 3,600 square feet.The project is part of MoMA’s plan to rethink its urban environment by rethinking how buildings interact with the landscape and by establishing a new public library and museum. The museum will also include a public green space on its campus. The first museum-scale project, which is slated to launch sometime in 2020, will consist of a series of spaces for educational, research, and public programming. The second iteration of the museum will unfold over three years, with the final exhibition, “Plans for a Modern Museum,” opening in 2021. The third", "The next Biennial should be held in August 2021.\n\n\nThe museum’s collection of fifty-four artworks by American painter Francis Creel has been added to the permanent collection of the Italian state. The state-owned collector bought the works in 1984, but only in 2013 did the ministry of culture receive his gift.The state-run auction house Casa di Rivoli has announced that its Deiana threatea, or stone pavilions, in Venice will be gifted to the Italian state in the coming weeks. Known for its extravagant displays of artworks by contemporary American artists such as Thomas Dolby and Ken Watanabe, the vintner has also been known to sell works by Dutch artists such as Steen Hoflandt and Joost Taverne. The state-run auction house will organize an edition of the art event at a venue in Milan in February 2020.“In an age of endless new media and communications, the enhanced status of Venice and the city of Milan, and of Italy in general, creates a space for the exchange and the reflection of ideas,” said minister of culture Pier Luigi Brugnaro. “The threatea are a reflection of this area of contemporary art. The", "The next Biennial should be held in March 2021.\n\n\nThe Museum of Modern Art (MoMA) has appointed Carolyn DeCecco as its next chief curator of prints and drawings. DeCecco comes to the museum from the Metropolitan Museum of Art, where she previously served as director of collections and collections acquisitions.“Carolyn’s exceptional curatorial skills, extraordinary breadth of experience, and commitment to serving MoMA’s collection and community make her uniquely qualified to lead our collection and preserve the museum’s significant collection holdings,” said museum director James Cuno. “Charlie and I are eager to see how Carolyn will impact MoMA’s collection and operations as we move forward with the next iteration of the museum’s ‘Tidbits: Prints from the collection’s first exhibition, ‘Scout,’ in 2020. We are also excited to see what kind of impact she will have as we make the transition to the new museum’s new location, to our new building, and to building our new facility.”DeCecco will assume her new role in January 2021 and will work closely with collections scientists to understand how and why", "The next Biennial should focus on the relationship between social justice and art, and the future of art and social justice.  “I have long believed that art and social justice are intimately connected,” said Saul Fletcher, a founding trustee of the Biennale. “It is neither a coincidence nor a coincidence that the theme of the twenty-third biennial is ‘art and justice.’ I would like to see more of a recognition of this connection.” The Biennial of Victoria, which is currently undergoing an expansion and renovation, will be held at the city’s new Botanic Gardens, on the site of the former Victoria and Albert Museum, in Melbourne’s northeast, from March 6 to March 8, 2020.The new venues will be inaugurated with a presentation of a selection of work by the renowned Australian artist and activist Benjamin Creme, whose work is currently on view in the exhibition “Benjamin Creme: A Retrospective.” The artist’s daughter, Jessie Creme, will serve as the opening act. Creme’s work will also be featured in “Until the Fire,” a new exhibition organized by the Centre of Contemporary Art in Melbourne.Comment", "The next Biennial should be in May 2021.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has announced that it will begin accepting orders for the Fifth Biennial “The Eulogy,” a public tribute to the late American composer John Denver. The event, which will be held in the Hirshhorn’s Guggenheim Museum, will take place in the season of the American Spring, and will focus on the life and work of Denver.Set to be unveiled in 2020, the tribute is being organized by the Hirshhorn’s artistic director, Leslie Mitchell, and her senior curator, Jessica Scher. The event will be hosted by the Hirshhorn and will be supported by a $1 million donation from the Guggenheim’s board and $250,000 from the Schermes.Inaugurating the museum’s collection of 19th-century American song and dance, the performance will also explore how the musical style of Denver, a native of the Bear, Wyoming, and a poet-turned-composer, has shaped the course of modern American music.“The Eulogy will celebrate the life of Denver, and the art of singing", "The next Biennial should be held in 2022, and the last one in 2023. \nPosted by: R. Gilber | May 13, 2016 1:38 PM\nThe Amsterdam Art Biennale is expanding its reach beyond the arts with a new multi-million-dollar prize for cultural heritage preservation. The $140,000 fund will provide an additional $50,000 for projects that advance the preservation and restoration of cultural heritage sites in Amsterdam and will be given to institutions that have made significant contributions to the preservation of cultural heritage in the country.“We are delighted that this year’s Biennale will recognize the exceptional achievements of the arts in preserving and promoting the art of our time and, of course, the art of our past,” said Artistic Director Isabel Galderisi. “In recognition of such extraordinary work, we are extending this year’s prize to 2022, when the biennial will be at its most important stage. The time for the arts in representing the art of our present moment is now. The conditions are perfect.”The six finalists, who were chosen from a shortlist that included Alexander Calder, Andrea Bianchi, Sara Cwyn", "The next Biennial should take place in 2021.\n\n\nThe Dutch Ministry of Culture has released the list of seventy-nine artists who will participate in the 50th Amsterdam Art Biennial, which will take place in the city from August 8 to August 14, 2020. The biennial, titled “Amerikanika,” will focus on a global–scale re-creation of the city and will explore the role of art in shaping the city and its surrounding environment.Curated by Igor Stier, the director of the J. Paul Getty Museum in Los Angeles, the exhibition will draw inspiration from the city’s historical artists, the collection of the museum and its surrounding environment, and the contemporary artworks and cultural institutions of the city.“The exhibitors are seeking to create a different kind of theme for the exhibition, which is already a dialogue between art and architecture,” said Mira Dittrich, the minister of culture and innovation. “The theme is a new kind of museum, ‘Amerikanika.’”Alongside the exhibition, the museum will also host an exhibition of the work of artists Pierre-Olivier-Michael Jane and Deyan Sudjic in collaboration with", "The next Biennial should be held in the fall of 2020 and will be organized as a multi-media platform, addressing issues of sustainability and the environment, including climate justice, in partnership with institutions, NGOs, academics, artists, and community groups. The programme will also include a discussion series on contemporary issues and its themes.“At a time when climate justice and environmental justice movements are gaining momentum globally, and with them the attention of a great number of governments and organizations, the biennial will bring together artists, academics, activists, and thinkers to address these pressing issues,” said Andrea Bello, the director of the biennial. “We are committed to engaging with the views and ideas of our artists, scholars, and those most affected by climate justice, as well as our audiences, to build on our exhibition’s work and our 2018 exhibition ‘Sustainability: From Fossil Fuels to the Future,’ which was inspired by the legacy of Gerhard Koutoulas, a cofounder of the company Agar Plains. Koutoulas’s work will be featured in the third exhibition ‘Art of Disaster: Climate Justice’ at the Museum of Contemporary Art, New York.”The 2017", "The next Biennial should be a celebration of the life and work of Henri Matisse, which is what we were already working on, I think, but for a different generation. There should be an exhibition of work by the artists who are still working. And I believe that the question of what is the important work of the future should be addressed in the next Biennial.”The show will be curated by architect and curator Vivian Rich, who has worked in architecture for over twenty years and is based in New York; Mark A. Winograd, the executive director of the Institute of Design at Columbia University, New York; and Jack Gass, the founding director of the Renaissance Society in New York. Rohan Jayasooriya, director of the Smithsonian American Art Museum, will be the next director of the museum.\n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to shutter its doors to the public in 2018 to complete a $600 million renovation that will transform the museum into an arts and cultural destination. The $350 million overhaul, which is part of a $350 million expansion project that will also include a new Tanglewood-designed building, opened on November 3, 2020 and runs through March 25, 2021.�", "The next Biennial should be held at a site to be determined—perhaps on any of the city's numerous empty lots—and will also include a presentation of works by young and established artists. The theme of the year will be “The future of art.”The opening of the Biennial will take place at the city’s new Museum of Arts and Design, which is slated to open in the fall of 2021, and will run biennial-style programming. The inaugural exhibition will be “The Great Displacement.” The exhibition will consist of a series of multi-layered, translucent, glass-enclosed sculptures, created by seventy-six artists spanning forty years, created by thirty-eight artists spanning twenty-three years. The first exhibition, “The Fall of the Berlin Wall,” will open on October 27 and will run until December 28. The second, “The Architecture of Destruction,” will run until January 12, 2022 and will be preceded by “The Future is Present,” which will be premiered at the Museum of Modern Art in New York on January 6, 2022.The exhibition’s first exhibit was “The Scream,” which was staged by the", "The next Biennial should take place at the museum in 2020.\n\nAdvertisement\n\nMuseum of Contemporary Art Denver’s next major retrospective, “Iconic: Painting, Photography, and the Golden Age” will be held at the museum in 2021. The three-night event will mark the museum’s thirteenth anniversary.The institution received a $10 million donation from the Warren B. Kanders Family Foundation in 2018. Its Next Century Fund will also establish a new endowment that will support future programming. The foundation has pledged $10 million to future editions of the museum. The fund also provides a $5 million loan to the museum. “The Kanders Family Foundation has long championed the museum’s role as a multidisciplinary resource for artists in Northern Colorado,” said museum director Mark B. Cohen. “We are grateful to our guests and our community for their continued support of our mission to connect the world to the art of our time.”\n\n\nThe Lifetime Achievement Award, a $50,000 prize presented by the American Alliance of Museums (AAM), has awarded the six finalists of the twenty-fifth annual Robert Irwin Award for Contemporary Art. The artists, who are:", "The next Biennial should be held sometime in the second half of the year.\n\n\nA group of artists and collectors have created an ambitious new exhibit at the Museum of Fine Arts (MFA) in Atlanta, Georgia, that intends to publish fifty drawings by five artists in order to raise funds for victims of the coronavirus.The twenty-four artist works, titled “Living in the Age of the Black Panther,” are part of a project called “The Black Panther,” which is being organized as part of the MFA’s “America Afoot: Black Art” series. The five-year presentation will run from March 29 to April 2, 2020.The exhibition will feature works by artists such as Steve Paxton, Lake Bell, and Michael Chavis, as well as works by artists of color, including Eleena C. Johnson, Dolly Parton, and Betty White. The full list of participating artists can be found on the MFA’s website.“The Black Panther’s’ work embodies the spirit of the times and of our time,” said MFA director Dr. Adam Carsey. “The work of five artists represents an opportunity to create a new", "The next Biennial should be held in 2020. Citing the need to “avoid ‘a situation where institutions’ self-harm and self-injure’s difficult legacy, the museum has identified an additional year as a ‘window’ for the exhibition. It is hoped that the exhibition will continue to be organized and hosted in accordance with its current format, with the same level of artistic community and operations.”The 2019 Biennial was held in the former Prussian barracks, Massy; the former residence of the Kaiser Wilhelm II, in Stuttgart; and the city of Koblenz, Austria.\n\n\nThe Italian government approved a plan on Wednesday that will allow the National Museum in Rome to reopen. The legislation, which was passed by Italy’s Senate on Thursday, will allow the museum to begin reopening in March of 2021. The legislation also specifies the opening of the museum as part of a €2.5 billion ($2.8 billion) plan to modernize the institution and reduce the museum’s footprint.With the approval of the law, the museum will now be able to lay out more of its former building and move more of its collection and events inside, creating a", "The next Biennial should take place at the Mexico City Biennale in April 2020. The theme should be 'Self-Determination, Self-Reconstruction, Self-Connections,” in commemoration of the one hundred years of the city’s continuous production of cultural artifacts.According to the museum, the new exhibition will aim to re-create the “experimental spirit of the entire 15 years of the city’s history” and will include the work of fifty artists. The artists selected for the exhibition are: Alison Sanchez, Cristina Barragan, Cristina Pereira, Benedict Bénétéco, San Antonio Ferreira, Anastasia Federici, Bonizio Bruguera, Christos Bragdoni, João Pina, Katherina Prado, Livia Quintana, Mélanie Tallant, Vivian Tsai, and Christos Terez. The full list of participating artists is as follows: 3 Theater Artists 350.000M Concerto di Marta (Carmen and Iannuzzo)Alfonso Alme", "The next Biennial should be held in 2021, the same year the first will be held. The timing of the museum’s reopening is largely coincidental, since in 2017 the institution reopened following a $400 million facelift. The visit is part of a larger initiative to re-create and enhance the area around the museum.“We are excited to return to the Biennial in 2021, as is our new home in the San José and invite visitors to the Museum from the Bay Area and beyond,” said Francis. The museum has been a Work in Progress since 2010, when it was still a collection center. Francis and his wife, Catherine, have been collecting since the family moved to Santa Clara County in the early 1960s. A graduate of the University of California, Berkeley, Francis becomes the first director of the Biennial as it opens to the public in January 2021.\n\n\nThe Washington, DC–based arts nonprofit the Center for American Progress (CAP), which advocates for greater federal involvement in arts and cultural institutions, has received a $10 million donation from a wealthy collector who previously donated $50 million to the organization. The sum is the largest gift to the organization in history and is the largest ever given by a single individual.", "The next Biennial should take place in 2022. The next edition will be held at the Seven Seas, the Grand Canal, and the Ato Saumara in Yokohama, Japan—the site of a massive industrial disaster in 2011 that resulted in the death of an estimated 1.5 million people and the displacement of half of Japan’s prefecture.\n\n\nThe Japanese government approved a plan on Monday to salvage more than 450,000 artworks and other cultural objects from Japan’s wartime sexual slave labor camps, which were run as slave labor operations by the Japanese Imperial Army from World War II to 1945. The legislation, which will take effect in March 2021, will also establish a fund for the care and preservation of wartime objects and establish a minimum age of retirement for the repatriation of war-related objects.The legislation—which also aims to provide relief to former prisoners and their descendants—was passed by the Diet on March 14 and is part of a growing campaign to address Japan’s widespread wartime sex enslavement. Since the legislation only addresses the “comfort women” camps, which were populated primarily by women from the Korean peninsula, activists have urged Japan to expand its efforts to prevent the systematic recruitment of Korean women for the military", "The next Biennial should be held in 2022. In the meantime, the institution is planning to open a new, larger exhibition space in the exhibition hall. Lang, who has served as director of the biennial since 2015, said: “We are currently negotiating with the relevant authorities for the agreement that will allow the exhibition to re-enter the museum with large groups, but we are confident that this will be resolved in the coming months. We are also working with the government on the development of a national conservation strategy that will ensure the long-term future of the exhibition. I am enormously proud of the work that I have done in my twenty-two years at the Biennial, and I am confident that the next edition will be a highlight.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than 3,700 photographs by American artist Stanley Donwood, a pioneer of the camera who was one of the first to use film and the first to begin producing large-format photography. Inaugurating the museum’s collection is a set of his early prints, which were donated by his son, Stanley Donwood Jr., who resides in New York. The holdings include photographs", "The next Biennial should take place in 2024. In the meantime, it has been expanded to include a new exhibition series, an immersive installation, a children’s book, and a series of historical photographs by artists such as Jean-Marie Aumont, Édouard Vuillard, and Pierre-Auguste Renoir. “This is a great year to be alive,” says Peter Reuter, director of the European Biennale in Kassel. “The themes of the next three years are global, ecological, and political. The biennial’s designs are inspired by the past, the future, and the earth, and its future as well as its presence and the future of Europe are at the heart of the exhibition.”The biennial, which will run from March 15 to March 22, 2021, is part of a larger plan to organize twenty-four years of exhibitions by artists in the Netherlands, the UK, Berlin, and other cities across Europe. The plan was developed after the country introduced a national art budget in 2018, which has since been doubled. In 2019, the government held an exhibition of contemporary art in collaboration with Louis Vuitton, and in 2020, artists were invited to present art", "The next Biennial should begin in 2021 and should culminate in a performance of a work by a single artist, a conceptual work, a performance, or a video. “Our goal is to produce an exhibition of works that are both ambitious and prophetic, and to develop new voices,” said Naima J. Al Shiman, the director of the Bay Area Biennial, in a statement.The 2019 edition of the biennial, “On the Ground,” was held at the Oakland Art Museum in California. The event featured works by thirty-three artists, including Alex Hafo, Daniel Hecker, Danielle Loy, and Jaffe Durand. The event also included a lecture from artist-in-residence Radcliffe Abrams, who will curate the 2020 event.“The show will continue to be a ground-breaking exploration of the idea of what it means to live in a world that is new to you and yet familiar to us,” Abrams said in a statement. “This is a creative and important time to think about the future, and to re-imagine the possibilities of art.”\n\n\nThe Ashmolean Museum in Oxford, England, has appointed Tim Harford as its new", "The next Biennial should begin the week of March 23 and conclude the week of March 26. This year’s event is titled “Human Potential.” The next exhibition will be titled “The Future of Work.”\n\n\nThe Arts Council (ACE) in London announced today that Christopher Wool, Catherine Maxwell, and Julia Pine have been appointed as the new chair and vice chair of the organization. Wool is a professor and director of the Art Gallery at the University of the Arts and an adjunct curator at Tate Britain. He will assume his post in January 2020.“Christopher Wool has been a champion of contemporary art and a champion of the arts for more than thirty years,” said ACE director Marina Rogers. “His work has been foundational in the development of the ACE’s own program and demonstrates his incredible breadth of experience and knowledge in a wide range of artistic disciplines. His tenure has also been a constant source of inspiration for the work of his fellows.”\n\n\nThe Cleveland Museum of Art (CMA) announced today that Donatella Bruglia has been appointed its next executive director. She succeeds John Barak, who has led the institution for twenty years and will begin her position in January 2021", "The next Biennial should be held in 2021.\n\n\nThe Metropolitan Museum of Art in New York has announced the 100-year anniversary celebration of the institution with a new exhibition, One, Two, Three, Four: The Met. The exhibition will highlight the exhibition “The Metamorphosis,” from 1972 to 2020, and will feature works by over sixty artists, including Robert Irwin, Linda Evangelista, and Werner Herzog. The opening reception for the exhibition will be held on September 3. The show will be followed by a book signing and reception at the museum on September 5.The exhibition will draw from nearly 400 works, including works by artists such as Josette Bernier, Anna Atkins, Andy Warhol, and Jean-Michel Basquiat. The exhibition will also introduce new works by artists who have been excluded from the current show, including Frank Stella, Susan Sontag, and Robert Irwin. The exhibition will feature more than one hundred works by artists from twenty-six countries, including Brazil, Canada, China, France, Germany, Italy, Mexico, and Thailand. The artists who will be presented are José Carlos Pérez-Villaverde, James Turrell, André Achenbach, Richard Diebenkorn", "The next Biennial should begin in 2021, and will open with a tour of the newly renovated museum, followed by a presentation of a selection of new works by the collection and exhibitions of works by artists such as Isamu Noguchi, Arthur Ashdown, Peter Becker, Andrew Atkins, and David H. Koch.While the new museum is being built on former Commonwealth Bank land—most of the original building and the building of the museum has been owned by the State for more than forty years—the theme for the exhibition is “Transhumanism and the Future of Life” and the work will unfold as the museum expands to include a new collection.The new 50,000-square-foot building will serve as the venue for the exhibition “Up Close and Personal: The Solar Impulse,” which will be on view throughout the museum, including on the third floor. The exhibition, which will include works by seventy-five contemporary artists, will take place at the museum’s former location on Wilshire Boulevard and will feature new works by the show’s inaugural subjects, artists such as William Eggleston, Hayao Miyazaki, and Gilles Modigel.“When we choose to engage with life\u0097", "The next Biennial should be held in 2021. \n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) is suing the city of Philadelphia in an attempt to stop the demolition of a large, pre-Civil War African American cultural site in the city, which is also home to the National Museum of African Art and the Pennsylvania Academy of Fine Arts (PAFA), and is asking a judge to block the work of Philadelphia’s planning commission, Franklin’s plan to raze the property, which was approved by the Philadelphia City Council in 2016. “PAFA believes that the city’s decision to foreclose on this unique historic landmark is an unreasonable and capricious act and is seeking an injunction against it,” reads a statement released by the organization. The lawsuit was filed by PAFA and the city of Philadelphia, which together have fifty acres of the property.“We are confident that, in the interest of protecting the historic elements of the site, the city will prevail in this case,” said PAFA president John Laursen. The city originally foreclosed on the site in April 2019, and after a legal battle, the city court finally ordered the demolition of the structure in December 2020.", "The next Biennial should be held in the city in 2021. The next exhibition should be up in the summer of 2022.The 2020 edition of the event, entitled “Advancements in Art History,” was organized by the MCA, with cooperation from the Corcoran Gallery of Art, and the Corcoran Opera House in New York, and opened on June 3.The exhibition featured work by twenty-nine artists, including Hanoi Dai, Hao Dai, and Zoya Kaunda, and featured works by forty-five international and local artists. It also featured collaborations between artists, including the first-ever collaborative performance by Marc-Olivier Rochat and Marc-Olivier Gaillard, the opening of an exhibition with the work of artist Jean-Luc Godard and the stunning installation of the artist’s own house, as well as the first-ever international solo exhibition of Ai Weiwei’s paintings. The exhibition also featured the first-ever collection of Frank Stella’s photographs, a presentation of works by artists such as Herbert Suss, Peter Weibel, and Peter da Barra, and the first major introduction of artist-made works into the museum’s collection.The", "The next Biennial should be held in 2023, and the next will be held in 2026. The 2020 edition, titled Bogotá: Espacio de los Derechos, was scheduled to open in October. The 2019 edition, titled Fascination Resurga, was supposed to open in November. The 2019 edition, titled Para de Cristo, was to be held in February.The 2018 edition of the Biennale, titled Bogotá: The New Art of the Americas, was set to kick off on January 16, 2019, but was postponed after the coronavirus was confirmed in March. The event will now take place in February, 2020. The 2019 edition, which was co-organized by the French and Mexican artists Dora Danziger and Edoardo Nemoto, was to be held at the Museo de Arte de Bogotá from January 31 to February 6 in March. The project was to address the events leading up to the pandemic, and to focus on the relationship between art and politics.The event was slated to be inaugurated by a performance by Nora Danziger and Edoardo Nemoto, and saw the collaboration of ", "The next Biennial should be held at least once a year for the next two years.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is entering a period of transition. The institution will begin by reopening in the summer of 2021 but will not commit to reopening at least two years from now. According to Artnet, the institution has now canceled all future programming, including the upcoming exhibition “Ateliers d’Arles: Exhibitions 1916–1938” and “Željka’ Škř, 1960–1965” (2019).The changes will continue throughout the museum’s four-year history. “Inaugurating our new museum, which will incorporate the themes of ‘invention’ and ‘conceptualism” in a new way, is a new collection of work by the late Olafur Eliassen, “Ansi: Behind the Black Rainbow” (2019), a retrospective of his work at the Hammer Museum, which is currently closed until January 20, 2020. The center will also inaugurate a new digital platform, the Royal Academy of Arts. Artforum received the news", "The next Biennial should be held in the autumn of 2021. The project of the major exhibition was started by the German designer Köln’s Bernd and Anne Hausmann in the 1980s and has been developed over the years by several artists, including Günther Hochbräukeler, Ernst and Gerhard Richter, and Helmut Schmidt, to name but a few.The exhibition will be hosted by Bernd and Anne Hausmann in the former Düsseldorf Gymnasium. The second exhibition will be hosted by Lucio Fontana in the former Berggruen in the Kreuzberg district of Berlin, and the third exhibition will be organized by the artists in the former König-Arena in Frankfurt, as the installation of the exhibition will be an encyclopedic collection of close to four hundred works.\n\n\nHarriet Finney, the British curator who took the title of best-selling author in the 1978 international competition and who also won the Prix d’Art Moderne in 1977, has died at the age of eighty-four at her home in London. She was the first British winner of the Prix. The following year, she was the first American winner, having", "The next Biennial should be held in 2022.\n\n\nThanks to the generosity of an anonymous donor, the Chengdu Art Museum in China was able to raise nearly a thousand dollars in four months to help with its renovation plans. The Chengdu Art Museum was founded in Wuhan, China, in 1975 and aims to create a global platform for the study of Chinese art.Established by Wanda Cheng, the founder of the luxury footwear company Renkei, and Xi Jinping, the former president of China, the museum houses over sixty thousand artifacts from the Chinese Cultural Revolution era, including over two thousand statues, paintings, drawings, aerial photographs, and a large-scale, seventy-foot-long replica of the Cultural Revolution Museum. The institution also houses a collection of approximately forty thousand artifacts from the period between 1949 and 1976. The Chengdu Art Museum is currently seeking a new twenty-first-century director.Last year, the museum embarked on a $30 million renovation program that included the opening of a new exhibition space, an expanded collection, and the construction of a new building. The project also expanded the museum’s collection by more than four hundred thousand items. In addition to the new exhibition space, the museum added a new pavilion for the", "The next Biennial should focus on the history of the region, the current state of our city, the collection, and the exhibition, and should also mark the opening of the new research center, Innovative Inquiry, at the University of Bern.The Biennial, which will be hosted by the University of Bern and the Swiss Federal Art Museum Bern, will begin with a presentation of the exhibition “Sensate zur Zeit,” which is new this year—the first exhibition in the series’ history. The show will also feature a public installation of works by artists such as Wolfgang von Goethe, a new selection of works by the philosopher Jan and Kimberlé Czernin, and a presentation of works by artists such as Anselm Kiefer, Wolfgang Paalen, and Edward Kienholz.All delegations of the next edition of the Swiss National-Art Prize will be announced in the coming months.\n\n\nThe Museum of Fine Arts, Boston (MFA) has received a $250,000 donation from the Doritos Group, which owns the fast-food giant. The gift, made in partnership with the Massachusetts-based arts collective the Roxbury Collective, comes on the heels of the advocacy group’", "The next Biennial should start on June 6 and conclude with a public celebration on June 10. The festival, which will be hosted by the Miami-based collective Véronique Foulke, will also have its downtown location moved.Bertrand Picasso in Paris, which is slated for October 2018, is moving to Paris’s Place de la République in March 2019. The reopening of the museum was announced in March, not October, and in April, the opening of the exhibition “Picasso: The Modern Painters” was postponed. The date of the upcoming exhibition will now be October 6–10, 2019.Since its founding in 1976, the Biennial has hosted around sixty thousand visitors. In addition to the public, there are exhibitions, performances, and residencies organized by different artistic institutions such as the Museum of Contemporary Art in Berlin, the Museum d’Arles, the Musée d’Art Moderne in Paris, and the Museum d’Arles in the Louvre. The biennial is also known for its annual Art Prize, which honors thirty artists and is given by the Palais de Tokyo in Paris. The prize jury consisted of Matteo Cattelan,", "The next Biennial should be in 2021, and the ultimate Biennial will be in 2023.The event’s executive director, Rory Mulligan, told VegNews: “We are really excited about this year’s edition of the Art in Motion, and the impact it will have on a wide range of audiences and will continue to push the limits of what we think art can be, both in terms of its physical and virtual environments.”\n\n\nRenowned architect Sir Peter Winton will be inaugurated as the new director of Tate Britain in London. He succeeds Jocelyn Upton, who was hired as the institution’s interim director last month. “Peter is a brilliant, talented, and dedicated leader who has built a distinguished career on the strengths of his own vision and vision of how the Tate can be more, better, and more,” said Mark Digby, head of Tate’s board of trustees. The new position was created through a merger between Tate and the University of Westminster, which also saw the departure of two senior executives, Rishi Sunak and Richard Foster. The institution has been working to restructure since 2015, when it announced plans for a capital expansion", "The next Biennial should coincide with the exhibition “The Power of the Body: Art and Technology,” curated by the French artist Aline Bouillon. The inaugural exhibition, an exhibition of new works by the artist Damien Hirst, is currently on view at the Biennale of Exhibitions in Paris until October 27.The Biennial of Artists, curated by the French artist François Perron, will mark the opening of a new exhibit organized by the Los Angeles–based collective The Meltdown, which will also feature works by Ezra Heyward, Rebecca Black, and Masaoka Hanazawa. The first show, titled “Feminists and Subversions: Surrounding Metamorphoses” opened on September 15 and runs through December 13.The inaugural exhibition at the forthcoming edition of the Biennale of Galleries, titled “The Present: New Art in the Age of Philosophy,” will feature works by Joshua Helmer, Adam D. Weinberg, and Mark di Suvero. The exhibition will also include a selection of works on paper by Yoichi Tanabe, a contemporary Japanese artist who was a major influence on the modernist movement, and will feature works by members of the German calling", "The next Biennial should be held sometime in the 2020s. \n\n\n\n\n\nThiruvanmiyur: The first exhibition of work by the new-age team of artists will open at the institution on November 2. The exhibition, titled Art in the Time of          Forecast, will be hosted by Rupesh M.Tirug and Hiromi Naidu. The exhibition will be held in the size of a four-story apartment in the twenty-third floor of the Minakola district of the city. The artist-run space will be housed in the building “under the guidance of former curator Vipesh Mukherjee, and director Ashok Giri.”The exhibition will feature new work by twenty-eight artists from India and five regional clusters, including Chennai, Odisha, and Surat. The galleries will also present a selection of work by recent Indian artists, including Amit Cohen, Harish Chopra, Kemarajit Mural, and Sidra Nath. The works will be presented in a combination of traditional and contemporary Indian art, with a particular focus on the historical Mughal emperor Aurangzeb, who", "The next Biennial should take place in 2020 and will be hosted at the Fondazione Bevilimosto in Milan, Italy, and will include fifteen artists and ten projects. The Los Angeles–based nonprofit will provide local funding and will house the exhibition in the artist-owned space.\n\n\nThe Neue Galerie in New York has been awarded a $3.2 million grant from the Andrew W. Mellon Foundation for its new fund for arts and cultural heritage preservation. The fund was established to ensure that the gallery can continue to operate as a cultural gathering space in the city and continue to provide exhibitions, educational programming, and fundraising opportunities.Since opening in 1984, the gallery has hosted more than twenty thousand exhibitions and has been instrumental in many local communities. President and CEO of the foundation, Nick Galderisi, said: “We were honored to receive this incredible grant from the Andrew W. Mellon Foundation for our commitment to preserving the cultural heritage of New York City and the artists and institutions that have supported it. Our artists are thrilled to continue to provide tours and exhibitions at the gallery for free and to work with you in our new space in Midtown Manhattan.”According to the Art Newspaper, the grant will allow the gallery to continue hosting", "The next Biennial should be held in the spring 2019. \nBiennial Projects\nThe following projects have been established to further the work of the Biennials and are purpose-built to draw in a single area: MOSTOVIC, the largest nonprofit arts organization in the United States, established its first program in New York, the MOSTOVIC Arts Center, in the Hudson Valley. It will present sixteen new works by forty-eight artists in the second half of 2019. HELSINKI BIRTHDAYS, a new initiative dedicated to the ongoing work of Finnish artists, is currently accepting applications for its 2019 edition. The annual Biennials Fundraiser, which was held at the Brooklyn Museum and the University of Pennsylvania until its closing on August 29, was held at the Tribeca Film Festival in New York on September 7, and the 2016 and 2018 MIDWESTAB Awards were presented at the Victoria & Albert Museum in London. In addition to the yearly Fundraisers, the Biennials have been acquired and acquired-of, for the past seven years, a series of exhibitions that are currently on view at the Museum of Modern Art in London through November", "The next Biennial should be held in the spring of 2021.  The next exhibition should be held in the spring of 2022. The next performance should be staged in the spring of 2024. The next exhibition should be staged in the spring of 2028. The next award ceremony should be held in the autumn of 2021. The next exhibition should be staged in the autumn of 2022. The next art event should be staged in the autumn of 2022. The next lecture should be held in the autumn of 2020. The next exhibition should be a triennial exhibition in the autumn of 2019. The next exhibition should be a biennial exhibition in the autumn of 2019. The next book should be a book review in the autumn of 2019. The next book should be a book review in the autumn of 2019. The next exhibition should be a biennial exhibition in the autumn of 2019. The next book should be a book review in the autumn of 2019. The next art event should be a triennial exhibition in the autumn of 2019. The next art event should be a biennial show in the autumn of 2019. The next exhibition should be a biennial show in the autumn of 2019. The next book", "The next Biennial should take place in 2020. “We are so excited to make a new immersive work for the 2020 edition, and we hope everyone will join us in creating new experiences in the coming years,” said Stefan Keim, director of the Academy. The 2019 edition, “Unseen,” featured works by thirty-five artists, including Fredrick Bruna, Joël and Joost (Helsinki), Tomáá Cioffi, María Jara, and Arsht LÃ¡ro (Los Angeles), and was curated by Mary-Ann Peters, who had previously worked on the exhibition in 2007 and was the winner of the inaugural Biennial Prize in 2019.\n\n\nThe fifty-ninth edition of the Berlin Biennale, “Eine Kleistungs Berliner Kunststaltung,” will take place in the city’s Neukölln district on December 13–18. The event will be hosted by the Berlin Art Museum (BAM), in conjunction with the free public events space Neue Galerie, which will be expanded into a full-scale innovation hub that will host programming, exhibitions, concerts,", "The next Biennial should be called for “Greater Art and War,” and the first Art & War International, to take place between October and December in 2021. A Science Fiction and Fantasy Film Festival will also be held in the Spring of 2021. The theme, “The Infinite Self,” is a reference to the philosophical concepts of the Self, the Sacred, and the Absolute. On the twentieth anniversary of the dissolution of the Soviet Union, the Academy of Sciences of the Russian Academy of Sciences announced the creation of the National Centre for the Study of Art and the Arts. The new institution will be headed by art historian and curatorial researcher Iuliya Obshevskaya; organizer of the Art & War Festival, Vladimir Astakhova; and Art & War’s director, Yuri Chekallov, and will consist of twelve faculty members.“The Academy of Sciences of the Russian Academy of Sciences has always been devoted to the development of the art and science of Russia,” said the academy’s president, Anatoly Zak. “Through its annual Art & War Festival, the 'Art & War' is gaining new and more attention, and this is creating a", "The next Biennial should be on December 30 and will be hosted at the Angelic Gallery and the City of New York. The exhibition will feature a collection from the artist’s extensive archive and will be led by John Carlquist, curator of contemporary art at the Center for Art and Architecture, New York; Nina Marie Carpenter, curator of European art at the Art Institute of Chicago; and Laura Hutton, director of the CWA Institute of Art and Design. The full list of participating artists is as follows: John Carlquist, center for art and architecture, New York: David Robeld Gallery, Los Angeles: Artist Space for Contemporary Art, New York: Art of the Garage, New York: Art of the Garage, New York: Art of the Garage, New York: Artist Space for Contemporary Art, New York: Art of the Garage, New York: Jena Meyer Gallery, New York: Ralph Schell, New York: John Carlquist Gallery, New York: Jena Meyer Gallery, New York: Ralph Schell, New York: Jena Meyer Gallery, New York: Architecture Facility", "The next Biennial should be held in 2020 and will focus on research and its relation with the contemporary life of the city, the city of Paris, and the city of the future, the city of Algiers.  The institution will be housed on a large site in the Seine River in the heart of the city, in the city of Paris. The project will be led by the Cultural Centre of the Académie Nationale de Paris (ACN) and the Centre Povera (CPA).The 50,000-work collection is one of the largest works by the artist, who began to make paintings in the 1950s and who has had a major retrospective at the Museo de Arte Contemporáneo in Lisbon in 2003. The work will be organized under a new programme, �60 Minutes, which will present the artist’s work on the same day each week for two years. The inaugural exhibition was staged in the Parisian district of Les Creusets in July 2019.\n\n\nThe Baltimore Museum of Art (BMA) and the Schuylkill River Museum in Norristown, Pennsylvania, have announced their partnership to create a new exhibition dedicated exclusively to the art of African American art.", "The next Biennial should be on the drawing board in the fall of 2020, according to Artforum. The theme of the upcoming exhibition will be “Theology of Work: Art and the Body in the Power of God,” and the exhibition will consist of seventy works, including works by artists such as Deana Lawson, Kiki Smith, and Lena Horne, and will take up issues such as spirituality, symbolism, and the body.The next exhibition will be held at the institute in August of 2021.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Caroline Alonso-Alvarez as its next president. She succeeds Carol Sherman, who retired in June after twenty-two years at the helm of the institution.“Caroline is a proven leader who has built a tradition of leadership and innovation at the institution without compromising its mission or values,” said Nancy Spector, the museum’s interim director and CEO. “Her new role will enable her to continue to build upon the work of her predecessors in advancing the museum’s mission, maintaining the full breadth and depth of its collection, as we continue to move into the future.”Born in Lakewood, New Jersey, in", "The next Biennial should focus on the social and economic impact of human activity in the natural environment in order to provide a real sense of place in the city. For the first time in the history of the museum, we should be able to see the planet from the museum, and I believe that this is the key to making the Biennial a success.”\n\n\nThe BBC has released an unreserved apology for an uneven and misleading statement by BBC arts director Nia Fairplay, made during an interview with Artnet News when she said that the corporation was working towards “making a change.” Her comments suggest that the corporation is abandoning its previous policy of not renewing contracts with companies that discriminate against gay employees.However, in a statement sent to the BBC, the organization stated that it is “working hard to change cultural attitudes and changing business practices in a way that protects the many jobs at risk.” It also said that it is reviewing its contracts with companies and businesses to ensure that they carry over into the future.According to the New York Times, Fairplay made the statement in an attempt to explain a difference between the BBC’s current contract with high profile artist Rashid Johnson and her previous contract", "The next Biennial should be held somewhere in the next six months. We are currently working towards a date, but as the work of a single artist, it is impossible to know. I hope that the decision of the Biennial will live with us for a long time to come.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it has received a gift of more than 500 works by eight artists, including Alison Bech, Gere Kavanaugh, Ahmed Abu Hamdan, and Lulani, which were on display in the institution’s exhibition “Tyranny of Scale” in October. The works, which were donated by the Sulaiman Foundation, were acquired by the museum in support of the work of the late collector and architect A.A. Khan, who passed away on February 1.“The Sulaiman Foundation has been instrumental in the acquisition of works by artists who are today among our most important donors,” said Sari Bekoff, director of the Sulaiman Foundation. “The exhibition ‘Tyranny of Scale’ was a great success and the gift of the works by Alison Bech, Gere Kavanaugh, Ahmed Abu Hamdan, Lulani, and F", "The next Biennial should be held in 2022.\n\n\nArt Basel is preparing to expel twenty-one galleries from the Tokyo fair because of the coronavirus, which has infected more than 5,000 people in Japan and caused at least eleven deaths. The forty-one-day event, which was canceled due to the coronavirus, will now be held at the London-based London-based art fairs Art Basel and Art Dubai. The events were already pushed back by a year because of a potential cancelation due to a pandemic. With the relaunch of the Basel show in 2016, it began welcoming new galleries.“We are very concerned and concerned about the spread of the coronavirus,” said Yuki Nakamura, head of the fair’s European division and the chief executive of the Tokyo-based Kansai Art Museum. “We will be looking closely at the situation with our partners and partners’ organisations to see if a change of plan is necessary.”In addition to the London fair, the Asian art fair Shanghai Art and Culture Fair China will also be postponed to 2020. Katsu, a Tokyo-based event, will also be relocated to 2020 and its Tokyo-based partner", "The next Biennial should take place in the fall of 2020, and the last in the spring of 2021.In a letter published by the biennial’s board of directors, Scott said: “The events of the last twelve months have given us the opportunity to reexamine our future with regard to our biennial, and we have taken a new, more ambitious approach to our 2020 event. In particular, we have worked with a new group of artists and scholars to develop a new narrative for the 2020 event, which we hope will help make the event more accessible to a wide and diverse audience. We are also developing new programs and exhibitions to engage with contemporary issues and themes. We are grateful to the generous members of the Biennial’s Board of Directors for their continued support of the future of Biennial. As we continue to work together to create an engaging and transformative 2020 Biennial experience for the artists and scholars who have participated in this year’s event, we hope that this letter will serve as a signal of our deep appreciation. Kathrin Klitschak, Director, Haus der Kunst, Berlin; Martin Siem, Director, Artforum Berlin; Arne Glimcher, Director, Artforum Hamburg", "The next Biennial should be held in 2021, and the many-year plans for the event have been repeatedly abandoned by the organizers. An open call for proposals for the 2020 edition of the exhibition has been submitted, and a selection of the best works published in the past twenty years will be presented by seventy artists. The event, titled Art & Politics: From the Jewish Experience to the Arab World, will be held at Al-Azhar in Cairo from March 10 to March 11, 2021. Since the event will be organized within the framework of the year 2020, the exhibition will feature fifty-nine works and will be drawn from the archives of the institutions, the artistic and cultural history, and the museums in Al-Azhar.\n\n\nThe Queens Museum in Long Island City, New York, has appointed Mark Katches as its next director and curator. Katches comes to the institution from the Brooklyn Museum, where he has served as deputy director and curator since 2017. He succeeds Olga Viso, who has helmed the institution since 1997, and will take the helm from Cindy Sherman, who retired last summer after eleven years.“Mark brings an exciting and accomplished record of curating to the museum, and of presenting", "The next Biennial should be held in 2020. The event will be hosted by the Centre d'études politiques de Paris (CDEP), the Centre National de la Recherche sur le Vision, and the Centre National de la Télécom (CNRS), and will be hosted by Régis Ménard, director of the Centre National de la Télécom (CNRS), which was established in 1990 by the Centre National de la Télécom. The 2019 edition, which took place in Saint-Denis, France; the National Museum in Paris; and the 2016 edition, which was held at the Louvre, were all staged by the Centre National des Arts et Lettres (CNA), an umbrella organization comprising the Centre National des Arts et Lettres, the World Socialist Museum, the French Embassy, the French Ministry of Foreign Affairs, and the French Ministry of Culture. The organization announced on January 16 that it is restructuring its structure and that it will open a new, independent organization under its new name, the Centre National des Arts et Lettres. The organization will also begin to organize programming in collaboration with the National Museum in Paris, the Museum of Modern Art in New York, the Museum of", "The next Biennial should be held in 2021, and the first one in 2021.  Art historian Yoko Taro, who curated the first Tokyo Biennale in 2013, said: In order to have a good and meaningful experience in the exhibition, we need to start planning for a future.” The exhibition will open in the museum on November 13.\n\n\nThe twenty-first edition of the Aichi Triennale, held at the Aichi Prefectural Museum of Art (APMA) in Nagoya, Japan, has announced that it will be held from March 16 to March 22, 2020. The event, which was previously scheduled for March 19 to March 23, 2020, has been moved to March 21 to March 22, 2020, and will now take place at the Aichi Prefecture, Japan, from March 16 to March 22, 2020.The event will be curated by Hiroshi Takeda (L), artist and curator of the collective Ito-Mori; Koji Ihara (R), director of the Contemporary Museum of Modern Art, Nagoya; and Masahiro Nishimura (L), former chief curator of the Aichi Triennale. “The Aichi Tri", "The next Biennial should be held in 2018. The survey will be a collaboration between the UCL Institute of Art and the Tate as part of the Tate’s commitment to presenting an exhibition every three years. The 2020 exhibition will feature work by more than sixty artists.\n\n\nThe Institute of Contemporary Art (ICA) in Paris has received a donation of fifty-six works from the Parisian collection. The works, all by artists who were active in the 1960s and 1970s, will be presented in an exhibition at the museum next month. The donation includes more than five thousand photographs and thirty-four works by the late French broadcaster Jean-Luc Moyene, who died in 2007. The works are part of a series that reveals the growth of the French avant-garde from the late 1960s to the late 1970s. The exhibition will be a part of the ICA’s ongoing project to work with the French national museum of the modern arts.The five works by Moyene, who died of cancer in 2007, will be presented in the “40s,” a retrospective of his work, “60s, a “70s retrospective of a ‘post-modern’ artist, and “80", "The next Biennial should take place in 2021, two years after the architect’s death, and will consist of thirty-four works. The exhibition will be organized as follows: Art & Life Biennial’s Art and Life Series . The first half of the exhibition will feature biennial works created by artists who have appeared in the exhibition “for Life” since 1987. The second half will be organized as a “Taditalia” series, which will focus on the theme of the exhibition, “Truth, Beauty, and Beauty” and will address various themes, such as the reality of mortality, the activities of the senses, and the physical body. The first phase of the exhibition, “Ratio 1: Art and Life”, opened on March 1, 2019. It inaugurated the exhibition “Art and Life” (March 14–March 19), and “Ratio 2: Beauty” (March 21–March 24), which opened on March 18.Its second and third phases, “Ratio 3: Beauty” and “Ratio 4: Truth” (March 26–March 28), respectively, opened on March 12 and March 13. ", "The next Biennial should also include a retrospective of the work of the artist and curator, Ana Mendieta, who is known mainly for her large-scale experimental installations, especially those which involve the installation of a live organism. The exhibition’s next edition will take place in June 2019.\n\n\nAs the FBI investigates the circumstances surrounding the death of George Floyd, a twenty-nine-year-old black man whose body was found in a Mississippi river on July 12, the New York Times reports that the agency is also looking into whether the Tennessee Valley Authority (TVA), the state’s regional public school system, mishandled Floyd’s death.According to the New York Times, the investigation began after a woman who lived in Floyd’s apartment complex saw the body of the deceased in the river on July 12. After a cursory examination, the coroner determined that Floyd died of a cardiac arrest caused by carbon monoxide inhalation.The woman told the New York Times that she did not see anything suspicious about the circumstances of Floyd’s death and that she did not see the signs of a struggle or struggle with the police. The woman told the New York Times that she did not want to press charges against the police and that", "The next Biennial should be held at the National Museum of Art, which opened in 1902 and has hosted the exhibition since 1993. The National Gallery of Art will also be closed until at least February 26, 2020, and the Museum of Modern Art, the Metropolitan Museum of Art, and the Whitney Museum of American Art will be closed until March 14.The Museum of Modern Art will honor the sacrifices of the American soldiers and sailors who died in World War II by opening a permanent exhibition of works by American artists. The first section of the exhibition, “American Artists in the Pacific,” will open on February 21 and will feature twenty-one works by artists from the Pacific, a region comprising more than sixty countries. The next section of the show, “American Artists in Europe,” will open on February 28 and will feature twenty-one works by artists from Europe. “The American landscape is heavily influenced by American artists and the American artist is at the core of a global and interconnected American landscape. We are honored to share this influence with you, our community through the exhibition ‘America and the Pacific: Artists in the Pacific.’”The artworks in this exhibition are highly curated and organized by our team and are organized in", "The next Biennial should be held in 2020, and the first in 2021. The 2020 event will feature works that were submitted by artists in the Los Angeles area.The 2019 event, which was held at the Santa Monica Museum of Art, saw many of the same themes as the 2020 event, but was focused on issues such as coping with grief and trauma, as well as the impact of climate change. However, the 2020 theme will be more focused on the relationship between artist and public and will combine art and climate. Its work will be curated by the Los Angeles–based curator Sharon Schechter.The 2019 event was an initiative of the Los Angeles Biennial and the Los Angeles County Museum of Art (LACMA), and was organized by the Los Angeles–based group The Watershed. The group commissioned artist and public works that were selected by art historian and curator Victoria Carus and project director Jodi Picoult to serve as part of the event. The artist-publics chosen for the 2019 event included Allen Barlow, Michelle Barry, Nathaniel Suttie, Malala Yousafzai, Vinnie Bagwell, Taylor Lauter, and Susan Oxtoby. \n\n\nThe National Museum of American Art (NMA) in Washington,", "The next Biennial should be held in the second half of January 2021. The full list of participating artists is as follows:Alexander CalderÜs (Arts)\u0097Alberto Balsom (Art)Fernando Cisneros (Art)Daniel Coster (Art)Philip Collins (Art)Christopher Collins (Art)Thomas Deaton (Art)Diana García (Art)Leandro Hernández (Art)Zachary Glass (Art)Alberto González (Art)Kevin Wallace (Art)Jorge Gutierrez (Art)Juan Carlos Gomes (Art)Robert Goulet (Art)Claudia and Mário Hernández (Art)Richard H. Parsons (Art)Mark Parsons (Art)Jorge González (Art)Claudia Gonzalez (Art)Claudia Arias (Art)Claudia Herd (Art)Claudia Hernandez (Art)Claudia Inés (Art)Claudia Laversa (Art)Claudia M. Borges (Art)Claudia Pelayu (Art)Claudia Pape (Art)Claudia Rodriguez (Art)Claudia Rodriguez-S", "The next Biennial should open in 2021, with a second edition in 2022. The events would be staged in multiple venues across San Francisco and the Bay Area.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, which has been shuttered since March 13 due to the Covid-19 pandemic, is preparing to reopen in mid-May, an announcement that was made on Wednesday. The museum, which has twenty-five galleries and a theater, announced that it would introduce hours-long shows with the goal of generating more interest in its collection and improving accessibility. The tour-de-force program, dubbed “LIVE,” will offer both interactive and physical experiences.“A lot of people have requested a live experience,” Mark Selby, director and CEO of MoCA, told the Art Newspaper. “We think the best way to bring the history of our city and its artists to life is to do that in a way that allows the artists to create a real sense of community, a real sense of community within the museum.”The museum is reopening in May, following a long summer, when it plans to open a new branch of MoCA in the former Warner Bros. Pictures building on Wil", "The next Biennial should take place in the city of Birmingham in 2020. The event will be hosted at the Birmingham Art Museum, the new home of the Museum of Art, Birmingham, the Tate, and the Birmingham Institute of Art. The biennial will include a delegation from twenty-eight countries, representing sixty-nine countries and territories.“The inaugural exhibition of our new museum is a transformative opportunity to introduce new perspectives and artistic practices that are relevant to Birmingham and the region,” said Mavis Staples, chair of the biennial’s committee. “The exhibition ‘Between the Sun and the Moon’\u0097a new sculpture from the Italian artist and theorist Paolo Tosatti\u0097will engage with the history of modern art and the current present. It will also take the subject of creativity and the visual arts through a historical perspective.”The exhibition will be divided into three parts, which will run from March 3 to March 6, 2020. The first part, “Between the Sun and the Moon,” will be open March 3 through March 6 and will feature the work of forty artists: Arsuf Kamal, Jasmina Agha, Ana Mendieta, Juma Rind, and Nima", "The next Biennial should be held at least once every two years. 'The more we think about it, the more we are convinced it cannot be achieved under current conditions, and that the only way forward is by a new kind of revolution: a revolution for which there is no longer any room left for the past, and which takes account of the future.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced that it is planning to open an alternative branch of the institution in the city’s Fruitmore neighborhood, which has been shuttered since June because of the Covid-19 pandemic. The newly renovated museum will be housed in a former auto body shop and will offer free admission for individuals and corporate events. The MCA will also be able to house a full-size exhibition space and staff during construction, but the building will only be accessible by car. The institution is also planning to create two new paid-for spaces in the city’s Westside, one of which will be adjacent to the city’s existing public artworks, the other will host free public events.In a statement, the museum said: “We’re thrilled to announce that we’ll be opening in", "The next Biennial should be held in 2020, and the theme of the event should appropriately reflect the increasing global importance of the emerald forest. The intended venue will be a former forested area, called the Biennial Village, situated in a forest near the city of Maastricht, the Netherlands. The pavilion will be divided into twelve exhibition halls, which will be located at various elevations within the village. The pavilion will be inaugurated by an exhibition of work by fifty artists, including Sijbren Steenhuijsen, Arne Glimcher, and Duzs de Staal, in the exhibition \"CULTURAL FLOWER, CAMBRIDGE, and the LOCKWOOD PLANT, 1875–1938.\" A retrospective of works by Marcel Proust, H.G. Wells, Jean-Luc Haime, and Peter the Great will follow.The Biennial Village is being organized by architecture and design studio Tanya and Perin Bouvier, which was formerly represented by the British architecture firm Savant & Peacock. The group is also developing a new digital platform, called the Garden, which will organize a series of exhibitions in a single location. The site will be a conserv", "The next Biennial should focus on the role of the European Union in the fight against fascism and racism. The programme should also include a discussion of the role of the Museum of Contemporary Art (MoCA) in New York in the fight against Nazism and fascism. The American pavilion will be inaugurated by a portrait of the late Italian architect Renzo Piano, who laid the groundwork for the design of New York’s Metropolitan Museum of Art, the Museum of Modern Art, and the Museum of Modern Art in Los Angeles. Anton Kern, director of the Institute for Contemporary Art History, Berlin, said: “The museum is a great symbol of European integration and cooperation. However, it has never been involved in a major political struggle, never supported a courageous struggle against neo-Nazism, and has historically been hostile to people from the East. This is the show in Berlin where people of all cultural backgrounds can come together for a show in this city of culture, and participate in a show of this city of culture.”The show is being organized by the Institute for Contemporary Art History (ICA) and the German Cultural Foundation (DGB), as well as a consortium of cultural and cultural groups led by the newly created German Cultural Heritage Foundation,", "The next Biennial should be held in 2021.\n\n\nArt Toronto has announced that it will provide $1.2 million to art institutions in the city of Toronto for the construction of new spaces for the exhibition and the restoration of historic buildings in the city. The funds will go toward the commissioning of works for the forthcoming exhibition, “Between Europe and America” (2019), at the Diène Boulogne–Leo Centre for the Arts, and the renovation of the Benjamin Cox Building.A whole-house exhibition will also welcome guests in 2021. The show will feature work by forty-five contemporary artists and will run as part of the Diène Boulogne–Leo Centre for the Arts. The artists selected for the event include Marcel Prouvé, Adriana Pape, Jody Rogac, Tom McCarthy, Blanca Mille, Nikita MPollen, Cécile St. Laurent, David Salle, and David Salle, among others.“This year’s exhibition marks the centenary of the Diène Boulogne–Leo Centre for the Arts, where the works of René Magritte, Simone Leigh, Diana Rossetti, and Wil", "The next Biennial should be held in 2020.\n\n\nThe University of Oxford has appointed David H. Wilson, the former chief executive of the Philip Morris company, as its new chair of arts and culture. Wilson succeeds Susanna Pape, who was appointed as chair in May, and will take up the post at the university in July.“David is a seasoned politician and a scholar who will bring significant expertise and knowledge to the role at hand, and who has shown remarkable prescience in leading Philip Morris through many challenging periods,” said Maria Balshaw, chair of the university’s trustees. “We look forward to working with him and will make every effort to support his work as he takes up his new role. We have already welcomed several new members to the Oxford community, and I know his enthusiasm and commitment to pushing the university’s exhibition and scholarship programme to new heights. I am delighted to welcome David to the university and to Oxford City Hall as chair.”Wilson, who has served as a member of the university’s board of governors since 2013, said: “The past few years have seen an unprecedented renaissance of arts and culture at Oxford. It has been challenging, but in the end it has", "The next Biennial should focus on how art can serve as a vehicle to address societal ills such as climate change and agrarian crises. “Our biennial program has been concerned with a critical social question: how can art and social practice be used to address the social and ecological crises posed by climate change’s impact on the environment and the biennial itself,” said Lee Ann Nocenta, executive director of the Metropolitan Museum of Art. “The next Biennial should focus on how art can serve as a vehicle to address societal ills such as climate change and agrarian crises.” \n\n\n\n\n\nLee Ann Nocenta, executive director, the Metropolitan Museum of Art, and Lee Ann Perugino, artistic director, perform at a press conference at the Metropolitan Museum of Art on May 24. Photo: Steven Senne. \n         \n\n\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Nathan Rabinowicz as its next director. Rabinowicz, who most recently served as director of the Brooklyn Museum, will assume his post in January 2021. He takes the helm from Jennifer Tilly, who retired in December 2018 after more", "The next Biennial should take place in the summer of 2021, with the exhibition of the work Diana Al-Faraj, a six-thousand-work exhibition of paintings by artists including Christian C. Petzold, Igor Edadd, and Marie Aldridge. During the exhibition, four exhibitions will be staged: “Serious Play: Cinema’s Studio and Cinema’s Theater” (2019), “Studio/Motion Picture,” (2019), “Prelude,” (2019) and “History and Myth: Art and the History of the Origin of Life” (2019).For the first time in the Biennial’s history, the artists participating in the show will be chosen by invitation rather than paid. Additionally, the opening of the exhibition will be marked by the opening of a new feature film, \"Music for the Theatre: The Art of Cinema’s Studio and Cinema’s Theater’s Theater,” a new series of photographs, and new videos.\n\n\nThe British artist Anne-Marie Ward, whose radiant, gestural sculptures evoked images of immigrants and people from other continents, died on October 25 at the", "The next Biennial should focus on the role of music and the community in promoting sustainable development, and should take place in the city of Wuhan, China, in the winter. This year’s edition will mark the first time the show will be held in China. “We are grateful to the city of Wuhan for the invitation, and to the Biennials Commission for their ongoing support,” said Ma.\n\n\nThe board of the Museum of Contemporary Art (MoCA), which opened in a former coal mine in the scenic Andes in Los Angeles in 2009, is seeking a $500,000 emergency loan to preserve the institution’s holdings of Artistic and Critical Works by Pablo Picasso, Pierre-Auguste Renoir, and Pierre-Auguste Salzmann, which are scheduled to be demolished by the Chinese government in early 2020. The institution is also seeking to recover some of the art from the government, which plans to dismantle the 19th-century Gaillard Gallery in Paris and replace it with a museum dedicated to art from the collection of the DeWitt Washington Art Museum in Washington, DC.The proposed loan would be made in recognition of the efforts of MoCA board president Sarah Lacy and", "The next Biennial should be held at the Museum in Lisbon in November 2020, with a 2019 edition to be staged in December 2020. The institution is currently negotiating with the artist-run museum over the rights to the exhibition, which will also feature an exhibition of work by the artist Luís Alberto Real and will run for twelve months.The artwork biennial is a response to the current political crisis in the country, which has seen twenty-seven of the thirty-six homicides in the first half of the year in the country come from the state. According to the Guardian, a lawsuit by the artist-run Sonal Ghanem Group is currently pending in the National Anti-Corruption Commission (ANC), the country’s anti-corruption body, which has ruled against the group since it was founded in 2016.In an attempt to mitigate the crisis, Prime Minister Ana Mari Separetti has announced a ten-month extension to the biennial, which will now run from May ten to June eleven. The exhibition will also include two new participatory projects that will engage with issues such as the new ICT-enabled cinema produced by the government in the city of Porto and the upcoming renovation of the Museo Nacional Centro de Cultura.", "The next Biennial should be held in Tokyo in 2020. The event will also be hosted by the University of Tokyo and the Museum of Modern Art. The theme will be “Emergence and the Modernization of the Late Imperial Period,” and will include works by artists such as Tito Pujara, Olu Yule, and Murugo Matsuoka.  The 2019 exhibition featured work by twenty-three artists. \n\n\nThe Museum of British Art (MoBA) in London has named Katharine Johnson the next director and chief curator of its contemporary art collection. Johnson comes to the institution from the museum’s European branch, the British Museum, where she has served as chief curator since 2011. During her tenure at MoBA, she curated more than sixty exhibitions, including “Museum of Modern Art’s ‘Undersea” (2019), “The Future Is Now: Issues & New Directions” (2018), “The Ghost of the Bexley Museum’s ‘Atlantis’ ( ” to ’\u2028No More Spinning Circles”), and “The Future Is Now: Mural” (2017).�", "The next Biennial should take place in the East Village, a Manhattan enclave, in 2019. The remaining sixty-four works will be selected from this year’s exhibition and will be presented in an exhibition that will open in the summer of 2020.The ten-month event will organize a rotating series of lectures and performances, which will include a “tribute to Alan Shepard” (2019); “Arts & Environmental Destruction: Art as Anti-Science” (2019); “Traces of Wood: Art as History” (2019); “Adrienne Atget: The Art of the Nude” (2019); “New Perspectives on Painting” (2019); and “Anglo-American Art: The Service of Art in a Very American Context” (2019).The program’s inaugural exhibition, “Adrienne Atget: The Art of the Nude” (2019), is a collaboration between the Museum of Modern Art and the New Museum in New York and is organized as a retrospective of the artist’s work that encompasses a number of categories, including the performance, writing, photography, video, and installation, as well as a commentary on individual artists,", "The next Biennial should be held in 2022. \n\n\nThe Italian pavilion at the Fifty-Ninth Venice Biennale, which was closed last month due to the coronavirus, has been awarded $60 million by the Italian government. The Ministry of Culture is also introducing a new subsidy program, called the Italian State Supportment Fund, which will provide up to $25 million to artists and organizations affected by the coronavirus. The funds will be distributed through two new general grants, one for visual arts and another for literary arts.The $60 million in grants will be divided between the Federazione Cinéma, which will distribute the funds, and the Federazione Emilia, which will create visual art projects and literary works that will be exhibited at the Emilia Museum. The Federazione Cinéma will receive $40 million; the Federazione Emilia will receive $20 million. The artist-run projects will receive $35 million; and the Federazione Amalfi, which is affiliated with the Abruzzo region of northern Italy, will receive $20 million.“The state has decided to provide some $100 billion to Italy through various general and special grants,” said Francesca", "The next Biennial should be on the two main points of view: the epoch of the artist and the epoch of the city. The exhibition will be organized as follows: 1. WELCOME TO THE CENTRAL EUROPEAN OPPORTUNITIES. On the first day of its program two hundred contemporary artists will present their works in the most important European cities: Milan, Venice, and Stuttgart. On the second day, a selection of contemporary works will be presented in the most important cities of the Italian Peninsula: Turin, Modena, Venice, Rome, and Venice. This exhibition is organized according to the invitation of the International Council of the Arts, which has the mandate to organize and direct the twenty-fourth international biennial, titled “Polarities.” The inaugural edition of the exhibition will take place in Milan in February 2020.Kunstmuseum StuttgartBielebau-Wilhelmi, StuttgartPolarities Berlin, BerlinBielebau-Wilhelmi, StuttgartKunstmuseum Bonn, BonnPolarities of Rome and VenicePolarities of VenicePolarities of Milan, Rome, and VenicePolarities of", "The next Biennial should be held in 2021. Artists across the world are now calling for an end to the coronavirus. On Wednesday, the Art Newspaper reported that a delegation comprising Jasmine Biczel, Rachel Cameron, Julia Cotten, and Kaira J. Johnson sent a letter to the Oceania Council of the World Health Organization (WHO) demanding an end to the coronavirus \"as soon as feasible.\"The letter, which was sent by the collective Marwa Hossain and Ali Hossain, said that the coronavirus is spreading faster and more widely in the Oceania than anywhere else in the world and that there are now more cases in Australia, New Zealand, and South America than in China. They further said that the coronavirus is causing panic and deprivation, violence, and death, and that the Oceania is suffering a rise in COVID-19 cases.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $100,000 donation from the Philip and Rosemary Grant, the billionaire philanthropists who have given more than $1.5 million to local arts organizations in the past decade. The gift, made in partnership with the New York–based", "The next Biennial should be held at least once a year, in a location that has been selected by the artist’s workshop. \n\n\nThe Oakland Museum of California (OMC), the San Francisco Museum of Modern Art (SFMoMA), and the Los Angeles County Museum of Art (LACMA) have received a $500,000 donation from the Los Angeles–based philanthropist and collector Alan R. Pink. The sum is one of the largest donations made in the country by Pink, who has previously given $1.5 million to arts organizations and $150,000 to the New York Public Library (NYPL). The donation comes on the heels of a $1.5 million gift made by Pink to the LACMA Arts and Culture Fund, the LACMA Foundation, and the Oakland Museum of California (OMC). The first gift came in 1992, when Pink and his wife, Susan, gave $500,000 to create the $100,000 Eleanor Pink Memorial Fund, which helped LACMA students graduate from its endowed faculty positions. In 1995, Pink gave $500,000 to the LACMA Foundation, and in 2000, he and his", "The next Biennial should focus on “mystical practices,” says LOC Director Anna Corrigan, “and on the importance of history and the history of art in the production of art.” The show will be held at the museum from April 7 to April 8.\n\n\nThe British Council (BEC) has released guidelines to the museums that are participating in its annual Bournonville Biennial, which will take place in the French town of Bournonville, near Lyon, on March 19 and March 21, 2020, in an effort to encourage cultural exchange and research between the United Kingdom and France. The twenty-six participating institutions will be given a total of $30 million in funding, which will be dispersed through the Bournonville Science and Technology Group (BST), the Greater London Cultural Exchange Trust (GLC), the Tate, the National Galleries of Scotland, and the London Foundation for the Arts. The 2019 edition, titled Bournonville: A Retrospective, a collaboration between Tate Britain and the Department of Culture and Media, saw fifty-nine works, including seventy-five new works by forty-five British artists, as well as twenty-eight pieces by French artists.The initiative", "The next Biennial should be held in December 2021.\n\n\nThe Museum of Art (MoA) in New York has appointed Ciarán Mallon as its next director and CEO. Mallon comes to the institution from the Metropolitan Museum of Art, where he has served as chief curator since 2016. “The Met has long been a center for ambitious, creative, and experimental thinking about the museum’s collection and exhibitions, and for the work of artists and curators,” Mallon said. “I’m excited by the prospect of working with people, institutions, and designers who are deeply committed to MoA’s philosophy of architecture and design, and whose creative vision we’re excited to support.”The appointment was made through an open call, which attracted sixty-four applicants for an annual $100,000 award, which will be awarded in December. The seven finalists were chosen by an open call, held on September 8, and the finalists were announced on September 19. The awardees include Richard Learoyd, Tenenbaum, Peter Zumthor, Hiroshi Hirota, and Benjamin Miro, among others.“The Met has long been a central hub for moving", "The next Biennial should be held in the autumn, and will be hosted by Guggenheim Museum in New York. The exhibition will include work by emerging and established artists and will mark the theme 'The Future Is Now: The Art of Linnéza”.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) announced today that it will hold its seventeenth annual Bikini Bodies (Black Scars) biennial in 2020. The exhibition will be held at the Museum of Modern Art, curated by Faith Ringgold and featuring work by forty-four artists, including Samantha Gauffrida, Dara Whitman, Tomasi Olschbaur, Luka Pape, and Stacey Rinder.The ongoing exhibition series, titled Black Scars: Bikini Bodies, was founded in 2010 by artist and curator Emily St. Clair. Her husband and collaborator Richard was commissioned to create a new work for the exhibition the following year. The project was inspired by a selection of works by visiting artist Terry Allen. The Black Scars exhibition will run through April 2020. The biennial has also partnered fully with the San Francisco Museum of Modern Art to bring the series to San Francisco, and", "The next Biennial should be held in the spring of 2020.\n\n\nQueensland Museum of Art (QMA) curator Brian Mayhew has been named artistic director of the United States. The announcement comes amid a campaign to promote American art produced in Vietnam to serve as a model for Vietnam and the United States. “Brian is an outstanding curator whose breadth and depth of experience brings an exciting vision for our exhibitions and programs,” said museum director Ian Lavery. “His history of experimentation and contribution to contemporary art makes him ideally suited to make the QMA a leading cultural institution in reimagining how we engage with art and the environment in the US.”Mayhew will assume his responsibilities on July 1. During his tenure at the museum, he will strive to create a new narrative around the American Southwest and the Southwest, and will focus on working with artists and organizations that are concerned with social justice and environmental issues. “Brian has been an essential partner in building the museum’s emerging collection and growing our international profile, both through his domestic and international exhibitions,” said museum director Ian Lavery. “His broad expertise and passion for art will serve us well as we reconfigure our exhibitions to reflect both a", "The next Biennial should have been held last October, and it will be held this November. This year’s edition will air on Channel 4, on October 21, and will feature the work of seventy artists.The first exhibition held in the new museum is “Embedded Identity: Art and Social Movement in the Late Soviet Period,” which will feature ten works by thirty-eight artists from the Baltic states. The works will air on the first Sunday of November during the first half of the month. The three other exhibitions, “The Russian Revolution and the State: 1917–1923” (September 28–October 29) and “The Early Soviet Writers: From Nikolai Gogol to Gennady Stolyarov” (November 29–December 6), will be preceded by “Art and Life” and “Women’s Lives” respectively.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for how the Metropolitan Museum of Art (MoCA), the Museum of Modern Art (MoMA), and the Whitney Museum of American Art (MoMA) can better identify themselves with New Yorkers as they prepare to reopen on December 15. The guidelines outline how the Department of", "The next Biennial should have an opening date of October 21, 2020 and an end date of March 31, 2021. The venue will host between eighty and ninety exhibitions.The next exhibition will be titled “War and Terror: From ISIS to Biennials” and will present an exhibition of work by forty artists, including Joël & Petr C. van der Kolk, Nari Ward, John Daniels, and Rirkrit Tiravanija. The second exhibition will be “The Birth of a Nation: Art and Race in the New African World” and will run November 3–January 8, 2021. The third exhibition will be “Art and Justice: Civilizations After Genocide” and will run March 4–March 5, 2021. \n\nAmerican artist and activist Paige George—whose work explored gender, the body, and the power of images—has died at the age of sixty-seven. George was born in New York City in 1940, the daughter of an alcoholic father and a mother who was a flight attendant. Upon graduating from the state school of New York University, she enrolled in the graduate program at the Art Institute of Chicago (IIC) and then enrolled in the women’s college at the", "The next Biennial should be held in 2021. “The excitement that surrounds art, and the way that art is constructed, is now at the height of its creative process,” said Phillipa Soifer, artistic director of the Biennials. “The next two years will bring astonishing exhibitions, international events, and the greatest exhibition ever staged on the platform. We will continue to expand the Biennial into a platform for engaging contemporary art.”Since the inaugural exhibition, “Art for Tomorrow,” in 2013, the Biennial has staged twelve exhibitions and hosted over seventy-five artists. The 11,000-piece exhibition, titled “Art and the Future,” marked the first time the exhibition opened to the public outside of DC. The exhibition, which was curated by Sarah Phillips, featured work by seventy-five artists—including Mihai Nistor, Adrienne Atget, and Laura Owens—and featured work by seventy-one artists. The biennial’s fiveteenth edition, “The Future is Art,” will open at the Museum of Contemporary Art (MoCA) in New York on September 26.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed", "The next Biennial should be held in Dubai in the spring of 2020. \n\n\nThe Whitney Museum of American Art in New York has appointed Brian Fitzpatrick as its new deputy director. Fitzpatrick comes to the institution from the Metropolitan Museum of Art, where he has served as chief curator and director of exhibitions since 2013. He succeeds Mike Kelley, who retired after ten years in March 2019 following twenty-five years at the helm of the museum.“Brian is a seasoned director and scholar who has led great teams at both the institution and the museum,” said Michael Warren, the institution’s director and CEO. “His ability to build a deep and enduring relationship with audiences and collections reflects his enthusiasm, vision, and drive. He is uniquely qualified to lead the museum through this challenging and exciting moment in its history.”Prior to joining the Met in 2007, Fitzpatrick was a curator at the Whitney’s annual Fall/Winter/Spring shows. He also worked as a curator at the Whitney and as a freelance curator. During his tenure at the museum, Fitzpatrick curated the twenty-third edition of the Whitney Biennial, “Taking the Road,” which opened in January 2019 and ran through March 2020; �", "The next Biennial should be held in 2022. In an interview with the New York Times last year, Nima Fatemi, the head of the Tunisian Museum of Art, said that the renovations were part of a \"long-term strategy to open up ‘the Sudan’ to the world.”\n\n\nArt historian and curator Vijay Iyer, who made controversial career-defining contributions to the field of African art through his tireless promotion of the work of African artists across the globe, has been appointed director of the Wadala Art Museum in the United Kingdom. His appointment follows a decade-long campaign spearheaded by the international art historian and cultural curator to raise funds for the museum. Iyer’s proposal for the institution, which opened in 2008 with the completion of a major renovation, sparked a fierce backlash from some African nations who saw it as a cynical attempt to expand the museum’s influence by promoting their artists and cultural figures. Iyer subsequently set out to address these concerns through a series of exhibitions, talks, and other programming that would engage with and challenge the museum’s extended collection. In a statement about the appointment, Iyer said: “This year’s Biennial was a", "The next Biennial should be held in the autumn. The theme of the upcoming event is “Practical Ecology.”The exhibition “Practical Ecology” will be hosted by Bernardo Paz, Alessandro Brizzi, and Christophe Prouvé, the organizers of the upcoming event, at the Palazzo Grassi, in Venice, Italy.Each of these three artists is currently represented by Markus Rüth, the gallery of which is located in the 18th district of Venice, the center of the exhibition. Paz is represented by David Zwirner; Brizzi by Gagosian; and Prouvé is represented by Giusto Cicutto. The first edition of the exhibition was held in 2009, the second in 2013, and the third in 2019. The 2019 edition featured works by Simone Atget, Sebastian Oehlen, -A.J. Antunes, László Szymborský, and Luca Pinocchio. The 2018 exhibition was organized by Michael Cammock and Kate Lewis and was held in London; Paris; and New York. The exhibition was", "The next Biennial should take place in 2021, and will examine the relationship between art, the environment, and social justice. The exhibition will draw seventy-five artists from twenty-six countries. \n\n\nCalifornia’s Department of Cultural Affairs (CalArts) has appointed Sandy Levin, a professor of art history and director of the Museum of Modern Art’s Design Museum in Los Angeles, as its next director. In her new role, which was created to support the museum’s transformation into an architectural research center, Levin will take up the post on October 2.“CalArts is evolving as a leader in the field of design through its development of the Museum of Modern Art, which has significantly advanced the field of design studies and the understanding of design in the United States,” said director Michael Gardner. “Sandy’s leadership, expertise, and enthusiasm for the museum we’re all excited about, and her proven track record in advancing CalArts’s mission and building on it makes her a strong candidate for her dream of becoming CalArts’s next director.”Under her leadership, the institution has expanded its collection by eleven thousand works of art, added more than ten thousand", "The next Biennial should take place in December 2021. \"We are actively planning for a future with greater representation of artists and organizations that will reflect the current diversity of our city, state, and country\u0097and our vision for the future of the Arts and Culture in Dallas. Our first priority is to get the new museum on the ground as quickly as possible. We have many challenges ahead of us, but we are determined to continue to expand the reach of the Arts and Culture in Dallas.”Currently, the Biennial is staged in two locations:\n\n·Atrium: On a first-come, first-serve basis, each summer since 1987, the Biennial has hosted the eighteen-member team of artists selected from a pool of fifty-six artists. The selected artists are chosen for their ability to engage with themes of art, philosophy, theory, and form. The next iteration of the Biennial will take place in December 2021.\n\n\nThe J. Paul Getty Trust in Los Angeles announced today that it has increased the amount of its artists’ income tax-exempt from the federal estate and inheritance tax by $2 billion over the next two decades. The increase, which reduces the amount of income subject to the income tax by $1"]