["The next Biennial should focus on the history of the collection and dissemination of the art, and should be open to the public. ”\n\n\nA group of artists, designers, writers, and other cultural producers have launched an outcry over mass surveillance practices that have been exposed since the September 11 terrorist attacks. The campaign, launched by the campaign, launched by the artists, designers, writers, and other cultural producers has been led by the group PEN American Center and the artist-run news site Artforum. The movement has since been joined by hundreds of other activists, including John Legend, Ashley Tait, Laura Jane Grace, Jane Panetta, and many others, in demanding accountability for the US government and police forces involved in mass arrests and unlawful stops. There have also been calls for the US Congress to pass a series of bills that would address racial bias and police brutality. On Wednesday, lawmakers introduced a bill that would require greater oversight of local police departments and strengthen training programs for officers. It remains unclear whether the bill, which has bipartisan support, will pass the Senate, where it is currently stalled.In a letter addressed to President Donald Trump and signed by fifty-three PEN activists, the letter reads: “The last several", "The next Biennial should also receive a significant boost from the City of Toronto, which will contribute $2.5 million to the project, as well as another $1 million from the province. According to the Canadian Press, the funds will go toward creating a new arts and culture district on city property. The Civic Arts Centre (CAC), a few blocks south of the city, will also receive a $300,000 infusion of funds. \n\nThe Hirshhorn Museum in Washington, DC, has taken the first steps in revamping its campus in an attempt to make the Hirshhorn more welcoming to LGBTQ+ communities and people of all backgrounds. The move was made in order to connect the museum with the Smithsonian American Art Museum, which also recently announced plans to remodel its campus in an attempt to attract more LGBTQ+ visitors.“While the Hirshhorn has always been a place for LGBTQ+ audiences, our new approach brings the Hirshhorn closer to the LGBTQ+ communities it has always been a beacon for,” said David Miller, director of the Hirshhorn. “We will continue to listen to and reflect on the many voices of LGBTQ+ artists and scholars and continue to think critically about the role of art in community.", "The next Biennial should be held in Shanghai, and it should be curated by Alain Guiraud, a professor at the École des Hautes Études en Sciences Sociales in Paris, and the former director of the Central Library in Paris. Guiraud is currently working on a new exhibition at the Centre Pompidou in Paris, and he will also present a lecture on the history of the museum in 2020. The exhibition will be organized as a book, a gallery, and a workshop. Guiraud believes that the new Biennial will help the museum to realize its vision of a twenty-first century museum, housed in a world-class building in a contemporary cultural center in Beijing.The opening of this new pavilion will mark the first time the two museums have been in the same city in more than sixty years. The pavilion was created to meet the demand of the Chinese, who have been seeking an international exhibition centered around the history of modern art in the north. The museum will also include a new collection section dedicated to contemporary art, a museum dedicated to the history of Chinese art, and a program of seminars and talks.Guiraud hopes the new Biennial, which he describes as a hybrid of modern and contemporary,", "The next Biennial should be held in 2021-22, and the forty-ninth biennial in 2022. This marks the first time this historic exhibition has been staged in South Africa since 1993.\n\n\nThe Palais de Tokyo in Paris has unveiled the inaugural selection of the 1,500-piece collection of art created by the German-American artist Georg Baselitz. Titled “The Unfinished Life of Man,” the exhibition was curated by Alexander Hofmann, who is director of the Kunsthalle Bonn, and will run over twelve weeks. The show will exhibit work by sixty artists, including Ludwig Kiele, Joachim Neugroschel, Erich Marcuse, and Jean-Luc Méliès.“The show is a continuation of my practice of introducing new works to make them accessible to a wide audience’s experience of the art world,” said Baselitz. “I hope that this exhibition will encourage a new kind of appreciation of art that is not afraid of challenging conventional notions about what art can and should be.” The opening of this show marks the twentieth anniversary of Baselitz’s show “The Unfinished Life of Man” (2013),", "The next Biennial should be held in 2022. \n\n\nThe European Parliament has approved a resolution calling for the UK to leave the European Union by June 29, the deadline for the United Kingdom to put in place necessary legislative and administrative changes to its domestic economy after it leaves the bloc. The resolution, which has 396 signatures from forty-six countries, has been introduced by two other petitions, one from the Italian parliament and another from the French parliament. The Italian petition calls for the UK to leave the EU by June 29, arguing that the country is leaving the single market, without which it will only be able to opt out of the trade deal. The French petition, which also has 396 signatures, says that the UK must suspend Brexit negotiations and immediately reverse Brexit legislation, including a bill that will give the British Parliament the power to invoke Article 50 of the Lisbon Treaty, which will trigger the formal European Union–United Kingdom treaty.According to The Guardian, the resolution is supported by twenty-six EU member states, which have until now been closed to the public, including Germany, France, the Czech Republic, and the UK. The United Kingdom is currently negotiating its Brexit deal, and only a few weeks ago, the UK issued a formal Brexit exit bill. The document", "The next Biennial should take place in 2020. The first Biennial was held in 1985. The next will be held in 2021. The last Biennial was in 1993. The next will be held in 2020. The first Biennial was held in 1985. The next will be held in 2021. The last Biennial was in 1993. Artforum has reached out to the Hungarian Ministry of Culture for comment. \n\n\nThe National Gallery in London announced today that it plans to open a new twenty-first-century research center in the city, which oversees more than six hundred artworks. The Elizabeth Kendall Gallery will be built on the site of the National Theatre, which currently houses the British television series The Thick of It, and will bundle the two institutions into one building. The center will host programming in both languages, including English-as-a-language programming in both languages.The center will also host performances, lectures, and other events in both languages, and will boast a restaurant, cafes, and bar. The Elizabeth Kendall Gallery has partnered with the BlackRock and the National Lottery to create a new £50,000 prize for the 2016 thirtieth edition of The Thick of It, which will be presented by", "The next Biennial should be held in 2020 and will be scheduled in Copenhagen, the capital of Denmark.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $25,000 donation from the Claude Monet Foundation. The organization has given $10,000 since 2011 to the institution in an effort to advance its efforts to become a sustainable museum.“We are thrilled to receive this tremendous gift from the Claude Monet Foundation,” said Tina Haggag, executive director of the foundation. “With the $25,000 today, we have already begun designing a new facility that will support our mission to inspire and educate through the exhibition and exhibition of works by the artist. We are confident that this new gift will help us achieve this goal.”Award-winning artist and filmmaker Eli Wallach, a senior curator at the Museum, was selected for a lifetime achievement award by the foundation. It is the second time the institution has given a lifetime achievement award to a contemporary artist. The first award was in 2012, for a work by Nina Turner. Wallach will receive a $50,000 lifetime achievement award in December. He will also receive a $10,000 donation in recognition of his contributions to art.", "The next Biennial should be the same as the last, with the same number of galleries and the same number of artists, and should be held in the same place. The five-day event should include the same programs, the same artists, and the same sets of exhibitions. In addition, Biennials should be organized in such a way that they would be accessible to everyone.  The decision to suspend the collection was made following the death of director Helene Berndt, who was sixty-seven. The festival’s immediate successor, the Folkloristungbau, is currently staging a biennial of contemporary art in January 2020.\n\n\nThe Rothschild Fund, the London-based charitable organization that has provided nearly $6.1 billion to arts institutions and cultural institutions since it was founded in 1986, has announced that it will no longer invest in arts and cultural institutions and will instead focus on developing new ways for organizations that are struggling financially to stay afloat.“The Fund’s new strategy is to invest in the future of our institutions in a way that minimizes the impact of the economic crisis on the future of the arts, and provides the funds to support the creative and creative-thinking activities of the institutions", "The next Biennial should be titled “Intersections of Art and Politics” and will launch in the spring of 2020. The exhibition will be organized as a dialogue between art historian Alex Katz and philosopher Jan/Bienzke Meegeman, a former director of the Kreuzberg Museum of Art. The event will also host special programming and a public art installation, and will showcase the work of more than twenty artists working in both contemporary art and politics.“The new work of the Künstler-Bienzke Meegeman, ‘Transatlantic Travel and the State of Europe’ will allow you to travel through a number of interlinked and interdisciplinary spheres,” said Meegeman, who is also director of the Royal Academy of Arts and a professor of history at the University of Vienna. “Her interdisciplinary approach will help you understand the state of contemporary art in a new way.”\n\n\nJohn Archibald (1914–1990) and Irv Gump (1927–1990) are being honored as the recipients of a National Medal of Arts and Sciences. Located in the Smithsonian’s National Museum of African Art, the three-time Oscar winners were selected", "The next Biennial should take place in the Winter of 2020–20 and will be in the Biodiversity Research Center of the University of São Paulo, Brazil. The exhibition will be organized in the same way that the Twenty-Fourth Biennale in Berlin, which was organized in the Autumn of 2016, and will run from February 17 to February 20, 2021. The event will host an additional exhibition, Sustainable Landscapes, in 2020, but the event will not be affected by the pandemic. The Biennial of Baden is also hosting a series of talks and residencies to mark the occasion.The exhibition will be accompanied by a book and a digital collection that will explore the history of contemporary art and how artworks have contributed to shaping the history of the region from the Middle Ages to the present. The exhibition will be curated by Pilar Corrias, the director of the Institut d’Art Contemporanea Ecológica (ICA), in collaboration with Mariana Alves, the director of Biodiversity Research Center of the University of São Paulo. The collection will be housed at the Biodiversity Research Center of the University of São Paulo and will be organized as", "The next Biennial should be held in 2022. The announcement follows the recent first exhibition of work by the Boston-based artist Paul Gauguin, which opened at the Rosen Gallery in New York in November. In a statement, the museum said: “Each year we strive to present a new work of art to commemorate the biennial and to take advantage of the extraordinary collection of art in the new exhibition, ‘Curation 2: The Art of Narratives,’ as well as the unprecedented exhibition that will be presented at the Museum of Modern Art in 2020.”\n\n\nThe British government approved sweeping tax and welfare reforms on Wednesday that will reshape the United Kingdom’s public finances in a way that will benefit the arts and the fashion industry—but leave the rest of the economy—and will place significant restrictions on the number of people who can claim housing benefit.The UK’s Arts Council estimates that the measures, which were passed by parliament with overwhelming majorities, will lead to a $12 billion revenue loss for the 2020-21 financial year. The Council also says that the £7.4 billion in savings that may be realized by the UK’s arts sector under the new framework will be offset by a significant drop", "The next Biennial should be held in 2020. The current exhibition, titled “The Art of Assistance,” will be inaugurated by an exhibition in 2018 of works from the collection of Vijay Mallya.  The Biennial will take place at the Hong Kong Biennale Center (HKBC), which is affiliated with the State Government of Hong Kong, and will run from March 13–March 16.“I want to thank all of our colleagues who have worked together over the past two years on the design of this exhibition’s collection. It is an honor to present to our guests the collection exhibition ‘The Art of Assistance,’ which is the work of a team of fifteen artists, including Wang Wei, Zhao Wei, Li Wei, Zhenya, Ming Wei, Jie Wei, Yi Wei, Lu Wei, and Zhong Yuyu,” said Hong Tsean, the organizer of the Biennial. \n\n\nThe São Paulo Biennale has announced that it will continue its celebrations with a special exhibition dedicated to Brazilian design, organized by a team of curators led by", "The next Biennial should be in November 2021. The first, “The Power of Pictures” (2019), closed in March and featured nearly ten hundred works. The upcoming exhibition, “The Death of a Model,” will be on view until October 24. The Biennial will be held at the Museo de Artes Plásticas in Madrid and is supported with a grant from the Kleptocracys Foundation. About the Biennial: Themes that pollute the environment and harm health are often neglected and ignored in the art world. Through a combination of experimentation, critical reflection and action, the artist is able to create a new reality that removes the limits imposed by existing models of landscapes, materials, and ideas. Pace Gallery will stage a presentation of works on oil and gas exploration from its new $4.7 billion acquisition of the artist’s body at the New York Art Institute in September. The show’s inaugural event, “Rising Water,” will be held at the New York Public Library in October. Hall of Fame artist Paul Gauguin was a close friend and collaborator of Robert Anton Wilson, and the two worked together on several projects together. The", "The next Biennial should have a premiere exhibition of works by young artists. I hope that it will further develop the exhibition program of the team of Kunsthalle Basel and will give the young artists a new environment. The Art Newspaper is currently encouraging artists to organize events in support of the exhibition. The exhibition will be on view February 9–March 13, 2020 at the Kunsthalle Basel and will be inaugurated by Jas and Marcus Beck. \n\n\nPrints and sculpture by Jerry Lee. Courtesy of the artist and the Kunsthalle Basel. \n\n\nThe Institute of Contemporary Arts (ICA) in Paris announced today that artist-activist Jerry Lee has been named the recipient of its 2019 Paisa Award. The $34,000 prize is one of the largest prizes for a French artist. Lee, who lives and works in New York, has been a passionate advocate for artists for more than fifteen years. He has organized numerous shows at the ICA in the past, including “From Paris to Rome” (2015–16), “Paris in the City of L'Arles: Art and Politics” (2016), “Paris Unseen” (2017), “Port", "The next Biennial should focus on the industry’s relationship with the city of Vancouver, which has experienced an influx of foreign art, and will consider “carried interest, transparency, and the grid system,” Joyce Sherman, chair of the art committee, said.\n\n\nThe deCordova Foundation has received $750,000 in support of its campaign to build on the foundation’s long-standing commitment to support artists in emerging markets. The gift includes $100,000 for the arts and cultural sector, including $30,000 for local, state, and federal governments; $50,000 for individuals; and $75,000 for nonprofit organizations. “The foundation’s support of artists and arts workers has been a major factor in the deCordova’s long-term trajectory,” said foundation president and CEO Steven DeCordova. “This gift ensures that the foundation will continue to support artists in our communities, and further our work by supporting artists and organizations in their ongoing efforts to make a meaningful contribution to Vancouver’s arts landscape.”Over the years, the foundation has given more than $5 million to local artists’ organizations. It also established the", "The next Biennial should include the opening of the new site “Daisaku Museum of Art” (the latest incarnation of the museum is currently under construction), an exhibition of the 70th anniversary of the institution, and a lecture series in collaboration with the university. The inaugural edition of the biennial will showcase new works by twenty-seven artists\u0097including Nara Atkin, Tannah Rhys-Davies, and Alexander Calder\u0097next spring.The inaugural iteration of the biennial, which was organized by the polytechnic university of Tokyo (Tsukeko) and the Tokyo Metropolitan Museum of Art (Met), was held in March. The exhibition featured works by black and Latino artists, as well as a selection from the artist’s previous shows. The new exhibition will be curated by the biennial’s director, Satoru Iwai, and will take place at the newly opened Daisaku Museum of Art, Tokyo.\n\n\nThe National Gallery of Scotland has appointed James Cook as its new director. He succeeds Ann-Marie McEnery, who has also helmed the Tate, and will take up the post in March 2020.“Jamesʙs appointment is a significant development", "The next Biennial should be held in 2021 and will be sponsored by the Institute for International Exploration (IEE) in collaboration with the Institute of Contemporary Arts (ICA) in Paris and the Palazzo Vecchio in Venice.The major consolidation of the Biennial over the past years was made possible through the generous instrumentation and exhibition sponsorship of the Foundation for Contemporary Art (FCA) in Paris, the Ducenage in Milan, the Donatella family, the Musée des Arts et littéraux in Paris, and the Saatchi Gallery in Venice. It also involved the generous cooperation of a number of museums, including the Musée d’Art Contemporain (DAN), the French Ministry of Culture, and the Palazzo d’Arte Moderna in Rome.\n\n\nThe National Foundation for the Arts (NFPA), a private nonprofit organization based in Portland, Oregon, has awarded Michael Porter the Joan Mitchell Award, which is named for the late American folk singer. Porter, who passed away at age eighty after a long illness and a long battle with cancer, is one of the few living artists to have been nominated for the Mitchell Prize. He was chosen by a committee chaired by the late artist and musician", "The next Biennial should take place in 2021, at which point it will be four years since the last exhibition, titled “Sculpture from the New World.” Though the festival will still have a year left to run, organizers are preparing for a long hiatus, explaining that the show is not scheduled to resume until 2024. Earlier this year, an exhibition of contemporary art at the museum, dubbed “The Future is Present,” was canceled due to the Covid-19 pandemic. The museum is also working to establish new partnerships with museums and academic research institutions in the US, which are currently closed as the country works to limit the spread of the virus.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has received $2.7 million from the Covid-19 pandemic relief fund. The sum is the largest sum ever allocated by the US government for a museum, and represents nearly 75 percent of the $2.2 million it will award to institutions through the Covid-19 Emergency Response Fund.Established by Congress in December 2016, the fund is a $1.5 trillion stimulus package that provides $1.2 billion in relief", "The next Biennial should include a fifty-two-hour special on the history and development of the laboratory,” said the organisers of the Annual Exhibition, which beheld a total of fifteen exhibitions in the past eight years. “We are convinced that the future of the museum lies with the collaboration of the many museums that are striving to make inroads into the lives of the people.”  The next exhibition, entitled “The Birth of a Nation,” will be at the National Museum of Art, where the Smithsonian’s exhibition of the seventeenth-century slave rebellion, “The Virginian Rebellion: The Birth of a Nation,” will open in January 2021.The museum’s exploration of the role of African Americans in the US through the exhibition of work by the emerging generation of artists will be presented by the artist Lillian Horne. The twenty-first-century exhibition “Theater of Operations: American in the Struggle for Freedom,” will be at the New Museum until February 21, 2021.\n\n\nThe Museum of Arts and Design (MAD) in New York is now accepting proposals for its next edition, which will take place in January 2021. The process of selecting a theme", "The next Biennial should be held in 2021. The first is scheduled for October, 2020.\n\n\nThe Metropolitan Museum of Art in New York has unveiled its newest artist-in-residence, Marc-Olivier Watteau, a French artist whose work incorporates dense geometric and sculptural forms and a nomadic lifestyle in order to explore the relationship between the individual and the environment.Born in Paris in 1959, Watteau is a painter whose hybrid approach to canvas and sculpture often incorporates rural life and the natural landscape, as well as man-made objects such as buildings and landscapes. His series “Masculine Machine,” 1951–1998, is a near-future vision in which industrial machinery meets art.While at the Met, Watteau produced paintings that draw from folklore, contemporary life, and mythologies, as well as paintings that express the conflicted and the vulnerable around the body and the body parts, such as the penis and the vulva. He has exhibited the work in at least five underground exhibitions, including at the SculptureCenter in New York in 2004 and at the Hong Kong Biennale in 2007.On his forthcoming show, “The Last Picture: Marc-Olivier Watteau”", "The next Biennial should aim to form a new method of purpose-built artworks; to foster a new appreciation of the history and the artistic legacy of Japanese art; to extend its reach to the United Kingdom and the United States; and to present a new selection of works by Sadao and Kiyomasa.The first exhibition, “Ao 20kara:” will be held at the Tokyo Metropolitan Museum of Art (IMAM), where the first exhibition of Ai, held in June 1976, was held in December 1977, and will invite visitors to experience Ai’s first exhibition in the United States—the show, “Be/longing: Contemporary Japanese Art in America”—as well as “AoI: History of an Exhibition,” a survey organized by the school of art at the National Museum of Modern Art in Tokyo from 1955 to 1975. The last event, “AoI: History of an Exhibition,” opened on September 18, 1976.The new exhibition will feature works by seventy-five artists and will run for ten weeks. Ai will reopen to the public on December 29 and again March 15, 2020.\n\n\nNew York’s Metropolitan Museum of Art (Mo", "The next Biennial should be held in 2021.  \n\nThe Los Angeles County Museum of Art (LACMA), which has been the subject of constant controversy since it moved into a new building in downtown Los Angeles in 2017, has announced that it will not reopen to the public until February 20, 2022. The reopening of the Tate and the Getty Villa, the Museum of Contemporary Art and the Metropolitan Museum of Art, and the Solomon R. Guggenheim Museum, which occupies an adjacent building on Wilshire Boulevard, was delayed by a year due to the Covid-19 pandemic.A statement released by LACMA reads: “Despite many recommendations from the Festival’s Board, the Museum’s management determined that reopening in February 2022 would be the best course of action. We at LACMA stand by our decision, and we hope that it will serve as a signal of sanity for future presidents of the museum.”The decision also follows the announcement that the Metropolitan Museum of Art in New York will reopen to the public in March 2022, and that the Los Angeles County Museum of Art (LACMA) will reopen to the public in the spring of 2022. The Los Angeles City Council voted to extend the", "The next Biennial should be held in 2020, the Art Newspaper reports. The format will revolve around a community-based exhibition where selected works from the exhibition will be presented by a select group of artists. The exhibition will also include the first public performances of works by artist‐in‐residence Jacknife Jnr.The biennial will be organized as a platform for artists to present their work and will feature a selection of works from the collection of the New Museum and its New York branch. The biennial will also feature public programs, performances, readings, and other events.“I’m looking forward to exploring the rich and diverse legacy of the Biennial,” said Jodi Binney, the former director of the Art Institute of Chicago and current president of the Art Museum Chicago. “The Biennial is seen as a milestone in the development of contemporary art and in the history of the museum. The exhibition will highlight the work of some of the most important artists of twentieth-century American art and will give a rare insight into how artists have expressed their art through paintings, prints, sculptures, drawings, photography, and video work.”The biennial is organized as a series of visits to selected sites over the course of eight", "The next Biennial should take place in 2020 at the earliest as Buenos Aires is now already preparing for its first event this year\u0097the first was held in 2019. In the meantime, New York’s Metropolitan Museum of Art will stage a major retrospective of its collection next month, and the Museum of Modern Art in New York is currently working on a new series of exhibitions dedicated to the history of dressmaking.\n\n\nA group of artists and collectors are suing the Metropolitan Museum of Art in New York over the museum’s decision to remove a work from its holdings by a man who allegedly raped a 14-year-old girl at the institution in October 2013, Artnet reports.As the plaintiff in the case, Michael McAllister, a white-haired, bespectacled man with a goatee, sat in the witness stand in federal court in Brooklyn on Wednesday, his lawyers confirmed that the artist’s work, a performance called Sexual Response, was removed from the museum’s collection after the court determined that the work lacked artistic merit. The case, which was filed by the artist’s husband and the artist’s daughter, was settled without admission of liability last year.“We want to make it", "The next Biennial should be held in 2021, and the first edition will be held at the Beehive Art Museum in Schenectady, New York, in 2021. The show will be a revival of the twentieth-century, with themes including immigration, urban life, and transformation. The full list of participating artists is as follows:Benoit MandelbrotBenoit Mandelbrot (France)Benoit Mandelbrot (France)Benoit Mandelbrot (France)Benoit Mandelbrot (Germany)Benoit Mandelbrot (Germany)Benoit Mandelbrot (Germany)Benoit Mandelbrot (Germany)Benoit Mandelbrot (Germany)Benoit Mandelbrot (Germany)Benoit Mandelbrot (Germany)Benoit Mandelbrot (Germany)Benoit Mandelbrot (Germany)Benoit Mandelbrot (Germany)Benoit Mandelbrot (Germany)Benoit Mandelbrot (Germany)Benoit Mandelbrot (Germany)Benoit Mandelbrot (Germany)Benoit Mandelbrot (Germany)Benoit Mandelbrot (Germany)Benoit Mandelbrot (Germany)", "The next Biennial should focus on “artistic practice” and “the relationship between art and society,” the statement reads. The event’s 2020 theme is “Art and the Biennial: The Dynamics of Representation.”The thirty-third edition of the Art and the Biennial will be held at the MCA in Rome from November 27 to November 29, 2020. The event will also include two pre-camps in the city of Todi, Italy; two seminars in Palazzo Vecchio in Venice, Italy; and a special exhibition of work by artists from the Americas.The twenty-ninth edition of the Art and the Biennial, which was organized in a Milan studio in 1998, will be held in the Italian city from May 24 to May 29, 2020. The show will also feature the work of sixty-seven artists from fifteen countries. The exhibition will also feature works by forty contemporary artists and will open to the public for free.\n\n\nThe Autoneghetti di Modena, Italy, has appointed Stephanie Frei as the first director of the museum. Frei will be responsible for guiding the organization through its first phase of construction, construction work on the museum’s first external", "The next Biennial should be held sometime in 2022. \n The ninety-second installment, which would have featured work by fifty artists, was cancelled over the objections of the galleries. “The exhibition was canceled because of a criticism in a book published by the United States scholar Steven Hamm,” Maarten de Bruijn’s art director, told the Art Newspaper. “As soon as the European Commission made a decision to cancel the artwork, Artforum and the De Beers Foundation signed a statement on behalf of the artists asking for a rescheduling of the exhibition. We were in touch with the commission to try to understand what their situation was.”The artist-run New York gallery where Guebbi is based has been working toward securing a venue for the show since March. Alternately, the artist-run Joslyn Gallery in New York has been working to have the work exhibited in the United Kingdom and the Museum of Modern Art in the United States. The London-based firm which represented Guebi in the UK has also been working to have the work shown in the United States. The works featured in the exhibition were chosen by the jury—which consisted of Marta Bonig and Pablo", "The next Biennial should address the issues that have defined and unsettled our time, from climate change to the consequences of our actions.”The theme for the 2019 edition, “Theater of Operations: US Military Operations in Iraq,” was altered slightly by the Pentagon. The media-warfare video game Battlefield 1—adapted from the Battlefield series of games by DICE and Dontnod Entertainment—will now be set in a fictional Iraqi city known as Fallujah, and the second half of the exhibition will now feature visual artists and designers. The exhibition will also include new essays by the artists, including Egyptian-born, American-based artist Gia Sola, who lives in Minneapolis, and Palestinian-born, Brooklyn-based artist Samer Khouri, who also works in New York.In the video game Battlefield 1, players assume the roles of the Iraqi army, police, Red Cross, and the British Army, and engage in a strategy-based multiplayer game where each player controls a squad of soldiers. The Iraq War and the War on Terror film trilogy, by British director Scott Derrickson, will also be shown. The exhibition will be hosted by the US-based nonprofit Center for the Arts, the London School of Economics", "The next Biennial should be held in 2021, and the first two artists chosen will be José Campos, and Oscar Salvador Dalí. The first exhibition, titled 'José Campos: From Vida to Vida” (2017), was staged in the artist’s hometown of San Lorenzo, where the artist resides. The second exhibition, titled “Oscar Salvador Dalí: The Future is Present” (2019), will take place at the Salone de Las Americas in Bilbao.\n\n\nThe twenty-third edition of the Købenbækdalsæ National Art Biennial (KnaBi) is currently underway in Davos, Switzerland, and will be held from March 15 to March 17, 2021. The event will feature twenty-one artists, including Oliver Svendsen, Paola Ferri, and Justin Hayward, among others from twenty-eight countries, and will be organized in collaboration with the Købenækdalsæ Museum in Copenhagen, which will serve as the main exhibition space. “The show is an extension of KnaBi’s mission to bring together a diverse group of artists and create a new", "The next Biennial should mark the thirtieth anniversary of the opening of the National Museum of Fine Arts in Paris. The homage should be commemorated with a large-scale exhibition of works by the biennial’s creators. The exhibition will also include photographs, sculptures, videos, and audio works by the artists, which were gathered for the Biennial of Beauty.The art of the exhibition, entitled “Irregularities of Nature” and organized by the National Gallery in Paris, will be on display throughout the Biennial of Hair, which will be held in an open-air venue in Paris’s Saint-Jean-de-Duc region, from January 29 to February 3. The exhibition will feature ten works by the artists in tandem; the opening of the exhibition will coincide with the inauguration of the city’s new museum of the same name.The National Gallery will present the works in its first exhibition devoted to modernism, “Nude with a View,” with three new works by the artists appearing in the exhibition. The work, which will be on display at the institution for the first time, will be a nude painting by the French artist Richard Assmann. The work will be accompanied by an exhibition of Ass", "The next Biennial should be held in 2020. For the first event, the artists will be selected by a jury comprising Fanny S. Johnson-Laird, Michael G. Walton, and Josephine Fox, and will be presented with a platform for their works to be exhibited. An open call for proposals will be held before the Biennial’s September 23–September 26 opening. Nina Turner-Parry, chair of the exhibition’s advisory group, said: “The need to provide an exhibition of work by female artists is urgent; there is a great deal of work to be done. We are committed to working with and for women artists, and to the majority of artists who have won this year’s prize. But we acknowledge that this will be an ‘inevitable, inevitable, inevitable transition,” and a new biennial will not be in place for another five years. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of fifty-six works from the collection of the late artist Lawrence Abu Hamdan. The donation includes thirty-nine works on paper, ten works on canvas, and thirty-one works on paper and acrylic.Abu Hamdan�", "The next Biennial should be held in 2021. The final edition of the exhibition will be held at the Museum of Contemporary Art Los Angeles (MCA) in 2021. The museum has yet to announce a date and an opening date for the fair.\n\n\nA group of artists and activists are protesting the closure of a Singaporean museum by the country’s new defense minister, Mr. Kah Chuan Ngai. They claim the move violates the country’s international human rights commitments, and is in violation of the Singapore Cyber-Security Agreement, which was signed in April 2019 and which outlines the sharing of information and cyber-security information between the United States and Singapore.The sit-in in Singapore’s Quarantine & Autoclave (QAC) was held in protest of the country’s new national security bill, the Cybersecurity Information Sharing and Protection Act (CISPA), which passed the Senate on Monday. It is now expected to be enacted into law by President Joko Widodo, who is currently in the process of expanding the country’s power. According to the New York Times, the law will give the government the power to shut down suspected pirate sites and block websites suspected of being linked to terrorism and", "The next Biennial should be up and running in 2020. In the meantime, we are working with our partners and the relevant authorities on how we can support the museum’s work and how we can give our visitors the best possible experience. In future years we hope that the exhibition will become a platform for the collection of works by women and underrecognized artists and that more people will come to see our exhibitions.\n\n\nThe Pérez Art Museum Miami (PAMM), the Museum of Fine Arts and Design (MFA), the Miami Beach Art Museum, the Museum of Contemporary Art (MCA), and the Art Museum of Chicago are among the cities that have signed an open letter protesting the construction of a new 1,500-seat stadium for the Miami Dolphins. The organizers of the exhibition “We the People” said that the stadium will be “intersect'd with a highway that will bring traffic to our neighborhoods and create overcrowding.”The letter reads: “The proposed new stadium for the Miami Dolphins in Coral Gables poses a number of challenges. First of all, it will be a public housing project. Unfortunately, this means that it will be surrounded by housing projects and businesses, which will negatively impact the local community", "The next Biennial should be set up in the autumn of 2021 to address the current state of affairs, as well as to have a major retrospective of the work of the former director of the Institute of Contemporary Art (ICA), Florence, which was closed until the end of August. “We must adhere to the spirit of the original vision, which is the theme of the 2020 edition, ‘In Praise of Life,” The Artist’s Circle said in a statement. “The new edition will focus on the significance of art and art history in shaping contemporary life and will reflect an innovative and bold new attitude, which aims to break from the status quo and to create a new kind of world, a world of artists.”\n\n\nThe eighty-fifth Venice Architecture Biennale has announced that it will no longer take place this year, instead focusing on finalizing its books and presenting titles on social media. The decision was made in response to the coronavirus outbreak, which has also affected the European Commission and the Royal Institute of Arts in Brussels, and the Davis Museum in London. The exhibition is expected to run from March 16 to March 20, 2020.“The creative community is facing many challenges at the", "The next Biennial should be on December 21, 2020, and the exhibition will take place at the Louvre from January 26 to March 20, 2021.The new exhibition will be a reenvisionation of the first one, which was organized by the French artist and theorist Jeannette Camille Camille (1890–1972) at the Louvre in March 1968. The exhibition will also introduce new works in collaboration with the artist and her collaborators and will include the exhibition of work by artists whose work will be retitled “Exhibitions.” The catalogue will feature work by artists from around the world in an effort to organize engagements and discussions with the biennial’s alumni.“We are committed to the development of the Biennial as the most important exhibition of its kind in the country,” said Olivier Mazoum, the head of the exhibition program. “The new exhibition will introduce the Biennale to a new audience who will have the opportunity to follow the artists’ development over the last thirty years.”\n\n\nThe Government of the United Arab Emirates (UAE) has released the results of a study of ten thousand individuals from twenty-one countries across the Middle East and North", "The next Biennial should be in March 2021, and the third in June 2021. The actual dates of the two events will remain the same.\n\n\nThe Milken Institute in Manhattan has appointed Kate Knudson as its next president. Knudson comes to the institute from the New School, where she has served as associate dean for the last three years. She succeeds Carol Brown, who has served as director and chief curator since 2010, and will take up her post in January 2021.“Kate brings a wealth of experience and knowledge to our institute,” said director Kathrin Hochberg. “As we move into the next phase, we are eager to work with her to further the research and teaching agenda of the institute, while carefully implementing the new institutional leadership and the broader direction of the institute. We are confident she will continue to advance the Milken Institute’s research and build on the museum’s reputation as an international leader in contemporary art.”Knudson previously served as a curatorial assistant in the Department of Prints and Drawings at the New School, where she worked for ten years under the tutelage of George and Victoria Milken. During her tenure, she was instrumental in establishing the institute�", "The next Biennial should take place in Tokyo in the spring of 2020.  Pace Gallery is also planning to expand to a new venue in the city in the coming years. The theme of the 2020 event will be “Art and Politics in the Age of Trump,” according to Stephen Deitch, president and CEO of the company, which has locations in New York, Hong Kong, and Seoul. While the new space will not be named, the building, which will be built on the seventh floor of the Metropolitan Museum of Art in New York, will be named after Pia Fries, the German artist and painter whose life and work is dedicated to the idea that art is a vehicle for political change.Fries’s work is considered one of the first postwar examples of the “art of politics” and examines the political implications of art in a post-coup, “antiracist” Germany. It will be presented in a retrospective of Fries’s work, entitled “The Art of Politics” at the Museum of Modern Art in New York next month. In a letter to the public, Fries wrote: “I want to emphasize how my choice of the name \"P", "The next Biennial should be held in the spring of 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Laura Kugler as its next executive director. Kugler comes to MOM from the Manhattan Museum of Art (Manhattan) where she has served in various roles, including director of public engagement since 2016. After working at the institution for a year as a curatorial assistant, Kugler joined MoMA in 2018 to serve as director of public engagement. She succeeded Kirsten Brown, who departed in the summer of 2019 to head the Metropolitan Museum of Art. Kugler will begin her new position on January 1, 2021.“Laura has been an integral participant in MoMA’s transformation into a highly recognized destination for contemporary art,” said Michael Govan, director of the Metropolitan Museum of Art, in a statement. “Her work has been used to inspire and improve the Met’s collection and to push the boundaries of contemporary art and contemporary design. She will be a great addition to MoMA’s board and staff and we welcome her to the team.”Kugler will assume her new responsibilities on January 1. She will work closely with MoMA’", "The next Biennial should be held in 2020.\n\n\nA group of artists who have worked together for years in concert to create works of art are suing the city of New York, accusing it of discriminating against them by excluding them from future grants.The lawsuit, filed in federal court in Manhattan on January 6, accuses the city of violating the Americans with Disabilities Act (ADA) by denying them early access to the $7.3 billion third biennial of its NYC flagship, which is slated to open in March 2021. The suit claims that the exclusion violates Section 504 of the Rehabilitation Act of 1973, which prohibits discrimination in federally funded activities.“The plaintiffs herein claim that they are being discriminated against because of their race, color, religion, national origin, age, sex, sexual orientation, and disability,” the complaint reads. “The defendants acknowledge that such activity is currently being practiced on the part of the City’s employees’ and acknowledge that the City’s employees are engaged in various activities that are not currently prohibited by the ADA. However, the defendants contend that since the City did not include the participants in this particular event in the 2020 Annual Report, they are refusing to recognize the City’s obligations under the", "The next Biennial should be held in 2020. Whether or not the first exhibition will be a success will depend on how the newly appointed directorate of exhibitions, design and architecture, and curatorial policy take up the work. “I extend my congratulations to the artists, designers, curators, and organizers of this year’s exhibition,” said Ada Colau, chair of the board of trustees. “It has been a great year for the arts and design in Brazil. We have had a successful Carnival, the Rio 2016 Olympics, and our first-ever Creative Brazil Day, which was celebrated by the greatest country in the world. We are now at a turning point in the history of Brazil in that we can now begin to see the full impact of our partnership with the government and the nation.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed John Gatings, who will assume his post in January 2020, as its next director. Gatings comes to the institution from the Los Angeles County Museum of Art (LACC), where he has served as director since 2014. During his tenure, he has organized sixteen exhibitions, including “Theater of Operations: The Gulf Wars 1991–2011�", "The next Biennial should be a combination of performances and presentations by artists from the media and the history of science disciplines. It should also include the exhibition of the work of the most recent artists in the group Biennial 5. This exhibition will be open for fifteen days only, on 10 October 2019.\n\n\nThe Canterbury Art Gallery (CAG), New Zealand, announced today that Jacopo De Sanctis will become its next chief executive officer. De Sanctis will take the helm of the institution from Kim Wallace, who has served as chief executive of the CAG since June 2019, and will begin his position in October.Prior to joining the CAG in 1998, De Sanctis was a curator at large-scale art exhibitions, including the Venice Biennale (2006), the Marrakech Biennial (2011), and the Auckland International Biennale (2017). He also worked as a research editor at the journal Art and History for several years.Commenting on his new role, De Sanctis said: “I look forward to working with the many talented and dedicated CAG staff and supporters, and to driving the CAG’s artistic and educational mission as we continue to present compelling exhibitions and programs in partnership with the local community.�", "The next Biennial should be staged in 2020.  In a letter to the government published on March 2, the artist said: “We are acutely aware that there is a serious and pressing need for urgent action to protect the biennial’s cultural assets and to ensure that the legacy biennial is viewed as being of the greatest international stature and enjoyed by the greatest number of people. The biggest challenge for us is that the programme is scheduled to run from May to November 2021. This means that we will not be able to present a full and timely exhibition of the work of the outstanding contemporary artists, and will therefore also not be able to celebrate the very year of our art. I hope that this letter will be of some assistance.”Prior to joining the museum in the 1970s, Keren worked as a curator at the Museum of Modern Art in New York and as a freelance curator. She has represented Israel at the Venice Biennale twice, in 1987 and in 2009. The latter exhibition was staged in Tel Aviv and the United Kingdom, and the former was at the National Gallery in London. \n\n\nThe National Museum of Canada’s collection of endangered and extinct animals has received an unexpected gift of two new members:", "The next Biennial should be scheduled for March 2021. It will be a celebration of the ten-thousandth anniversary of the establishment of the National Museum of Fine Arts in Washington, DC. The museum, which occupies a former munitions factory, will be inaugurated by a series of exhibitions that will highlight the exhibition history and the artists who selected it. Founded in 1912 as a branch of the Smithsonian, the museum has a long-standing program of contemporary art exhibitions, including the tenth iteration of “Noël Carroll: Life and Death” (2019–20); “What Is Modern Life?” (2020); and “The Encyclopedia of Art” (2019–20). In addition to the museum, the city of Washington, DC, and the Smithsonian Institution, the cultural hub is home to its Public Garden, the American Museum of Natural History, the National Museum of Women in the Arts, and the Smithsonian American Art Museum.“We are humbled, honored, and excited that National City Center will feature in the next edition of the Art in America brand,” said National City Center director David J. Zankel. “The museum’s rich history and contemporary art-making provides a perfect", "The next Biennial should be held next year.  Like the previous two, the event will feature work by thirty-three artists and will run from September 17 to September 19. The twenty-seventh will be held in October 2019 and the twenty-ninth will be held in November 2020.\n\n\nThe Netherlands has welcomed twenty-six artists and organizations to the country for the biennial “Myths and Stories,” which will focus on the representations of mythologies and legends in Dutch art. The exhibition, which consists of forty paintings, sculptures, installations, performances, and videos, will run from October 12 to October 14 and is curated by Ugo Rondinone. The event is being organized by the Flemish-based organization J.A.R.F. (Joint Action for Research and Freedom) and will be held at the École des Beaux-Arts in Amsterdam. The biennial will focus on the themes of power, hierarchy, and the body. The participants include Erik Satie, Andre Ghebaly, Eva Langenbrun, and Fotopassa, among others.“This is a remarkable year for Dutch art and we are thrilled to be able to", "The next Biennial should be held in Marrakech in early 2020, with an opening of the exhibition, the first show of the new initiative, “Between Continents: Art and the Body in Contemporary Art,” curated by Maja Paumgarten.Athletes and fans, whether inspired by the bodies of the artists and athletes they cover or inspired by the artists themselves, have always been at the core of Biennials. The new activities will engage with the bodies of contemporary artists, with the understanding that these bodies are not always the same. The fair will include talks and panels by artists, as well as a selection of works on display in the museum.The theme of the 2020 edition is “Entropy,” and the theme of the exhibition is the body and its relationship to the environment. “Theatre of the Body: Body and the Environment in Contemporary Art” will open on May 22. \n\n\nLiz Kate, the artist-in-residence at the New York Public Library who drew immense public attention for her stunning installations such as Body of a Woman, 1955, a bronze sculpture in which nude human and animal bodies seamlessly intermingled and intermingled, has died at age seventy-", "The next Biennial should take place in 2022. “We want to emphasize the importance of the craft in the city, and we want to give the new project a new dimension,” said designer and chairman of the institution, Bernardo Cipolletta. “Our artists are already working on new projects for the next Biennial, and we will continue to push for their creative participation.”The exhibition will be centered around a new work, entitled “Relic Worlds: The Art of Life,” that will be based on the artist’s daily life, and will open on February 29 and last until March 8. \n\n\nThe Chicago-based nonprofit The Museum of Contemporary Art (MoCA) has launched a new series of free public programming designed to draw visitors to the institution’s three historic locations, including the Museum of Modern Art (MoMA), which is undergoing a $3 billion expansion; the Contemporary Art Museum Chicago (CAM) and the Renaissance Society in Chicago (RSC), which will reopen in October 2018; and the Quad Cities in Minnesota, which reopened last week after being closed since November.The free public programs will offer a glimpse into the life of a small community in Chicago and will explore", "The next Biennial should start on October 28 and last twenty-four hours. “I can’t wait to see what the next Biennial will bring,” said David Miliband, chief executive of Tate Britain and a trustee of the 2020 edition, which will be held at Tate Modern from March 13 to March 20. “I can’t wait to see what the next Biennial will bring, and I’m not going to wait to see what the next Biennial will not bring.”While the event will be hosted at the museum from March 12—the date on which Tate’s board of trustees originally set out to shutter the institution—the museum’s director Maria Balshaw says that the museum is “looking forward to welcoming the public back to Tate Modern’s new location in 2021.”\n\n\nArt historian and curator Jim Lee, an American-born, Hong Kong–based artist and curator whose explorations of Japanese and Chinese art and the relationship between the two countries have been influential, has died at age eighty-eight.Born in Chicago in 1939, Lee studied painting at the University of Chicago and studied under the Korean-born, Manila-based artist Kim Seo-", "The next Biennial should take place in the city in 2021. The event will now be hosted by the Württembergischer Kunstverein (WU), the Friedrich-Alexander-Stiftung (BAH), the Federal Office for Culture and Sport (BOT), and the Mayor of Berlin, Berlin. The event will be hosted by the Berlin Art Museum (BAM), the Federal Criminal Academy, the Museum Muzeum für Kunst, and the Museum der Linke. The inaugural event will focus on the legacy of the artist-in-residence (MIP), who died in 1989. The biennial will continue to honor the MIP family through a series of exhibitions, performances, and other events.The biennial will mark the third anniversary of the project. The project began with the construction of a new art-historical residence for MIP, which was inaugurated in 2009, and has since brought together groups of artists from around the world. The artist-in-residence, an elderly artist who lived and worked in an apartment in the Kreuzberg neighborhood of Berlin, will be honored in a ceremony that will take place in the Kreuzberg town hall on May 13, 2021.\n\n\n", "The next Biennial should take place in 2022. The exhibition will include works by the artists participating in the first exhibition, as well as works that have not yet been exhibited.  The next exhibition—which is also being organized by the Johan de Bruijn Foundation (the Dutch organization dedicated to the collection of contemporary art)—will be held at the Amsterdam Flea Market in March 2022. The next exhibition will be held in the Netherlands in October 2022.\n\n\nThe National Gallery in London announced today that Maureen Ryan has been appointed as its new chief executive. Ryan comes to the institution from the Chicago Cultural Center (CC), where she has served as interim chief executive since October 2018. She succeeds Simon West, who has led the museum since 2007.“We are delighted to welcome Maureen to the National Gallery, and could not be more excited to have her onboard,” said Marc Glimcher, director of the National Gallery. “Her expertise, enthusiasm, and vision for the gallery make her a strong candidate for the top job, and we look forward to working with her to bring the National Gallery to life.”Called a visionary leader, Ryan has helmed the museum since 2014. During her tenure, she led the board", "The next Biennial should be held in the Autumn of 2020. The exhibition is currently on view through December 15. The first Biennial, entitled “Anthropocene: From the Earth to the Moon” (2019), was organized by the Los Angeles County Museum of Art and presented by renowned architect Chester B. Jones, who won the 1986 and 1989 National Architecture Biennials. The Biennial was preceded by the inaugural Biennial of the American Indian, which was staged at the Smithsonian American Art Museum in Washington, DC, in 2016 and will be staged at the Museum of Contemporary Art (MoCA), Los Angeles, in 2021.\n\n\nThe Metropolitan Museum of Art in New York announced today that it is severing ties with the controversial Israeli-American philanthropist Ron Lauder, who was found guilty of fraudulently obtaining $2 billion in donations for the museum last year, and that his role in shielding the controversial megapastors from scrutiny will result in the institution being taken over by the J. Paul Getty Trust, the Los Angeles County Museum of Art, and the San Francisco Museum of Modern Art.The Los Angeles Times reports that the three organizations—the Los Angeles County Museum of Art (LACMA), the San Francisco Museum of", "The next Biennial should be announced in January. The first round of entries will be selected by the jury in March. The art of the 2020 edition will be revealed in December.\n\n\nThe Museum of Modern Art (MoMA) in New York has brought Stephen Friedman and Fernando Alfonso-Santiago to its headquarters in the city to collaborate on a new project. The duo will create a movable installation titled “Pigments of Light” on the building’s facade. The installation will consist of sixty-nine interconnected pigments, each comprising a neon-colored metal wire that will be suspended in midair by a pair of metal cables. The sculptures will be created using techniques that involve the manipulation of a rotating metal disc with a pipe, which will be tethered to the exterior of the museum and suspended in midair by two cables.“We’ve been working on this project for about two years, and it has taken us to two different stages in our process,” Friedman told the Art Newspaper. “First we tested the materials with a couple of hundred different combinations of pigments and saw how the colors and shapes worked with the pigments, then we tried to find materials that were stable for long-", "The next Biennial should be held later this year. If and when the exhibition returns, it will include a selection of works by the artists who participated in the first exhibition, “Heat and Fire” (2019).\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released two new exhibitions about the 2016 Covid-19 pandemic. “The Cool Death of Antiquity: The Future Is Now” and “The End of the World as We Know It.” and will open at the Los Angeles County Museum of Art (LACC). Both shows were curated by Tamara Henderson, who announced that they will open on August 16 and August 18 at the Los Angeles County Museum of Art (LACMA).“I’m excited to present these two shows in the United States and internationally,” Henderson told Artnet News. The first show, titled “The Cool Death of Antiquity” (2019), will feature artworks by artists such as Felix Gonzalez, Max Hetzler, and Gavin Brown, and will be on view until September 11. The second show, titled “The End of the World as We Know It,” will open on September 14", "The next Biennial should be held in 2020 and will be hosted by the Museu de Arte de Madrid and supported by the Spanish Ministry of Culture. Artforum has reached out to the organizers for comment.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it has received $1.6 million from the Cecilia and Edythe Broad Foundation for their cocurated “Making New Art,” which marks the three-year anniversary of the foundation. Over the course of twenty years, the two founders made a series of bold artworks, including “The Reflection of a Mountain and a Sea,” which was exhibited at the Venice Biennale in 1999, and the final exhibition of their multi-venue exhibition series, “Cecilia and Edythe: The Great American Painting” (2019).In a gift made in memory of the foundation’s founding donor, James Dean, who died in December 2019, the museum has acquired seventy-five works by the founders, who were active in the 1960s and 1970s in both New York and Los Angeles. The works are currently on display in the exhibition “Telling Stories,” which", "The next Biennial should be held in the spring of 2020 and should undergo a reopening of the museum every two years. The newly appointed director, Amira Anwar, said that the institution will be ready for visitors in 65 days. While the biennial will feature works by seventy artists, it will also feature work by shortlisted artists and will be organized around themes of the year: 2018, 2019, and 2020.\n\n\nThe Newark Museum of Art, the New York institution founded in 1986 to serve the Newark community, has received a gift of fifty-six rare works by artists such as Robert Irwin, David H. Koch, and Ed Moses as part of the institution’s forty-five-year collection. The gift includes works by artists whose works are not currently on display in the museum—e.g., David Ortiz, Michael O.M. Barlow, and Leon Ulam—and the museum said that it hopes to open the works to the public as soon as possible.The gift is part of the institution’s commitment to preserving the work of the museum’s distinguished recipients of the Ed Moses Prize, which are Michael O.M. Barlow, Julia Bonen, and Marilyn Minter, who will be celebrated", "The next Biennial should be held in 2022. \nTania Bruguera, the mayor of the capital city of Buenos Aires, has announced that the city’s historical landmark, the Plaza de Mayo, will reopen in 2021. Originally scheduled to reopen in 2018, the plaza has been closed since May 24 because of the Covid-19 pandemic. The reconstruction project, which involves tearing down the plaza and replacing it with a forty-one-thousand-seat, museum, is estimated to cost $150 million.The campaign to re-open the plaza has been supported by the city of Buenos Aires, the Buenos Aires Foundation for the Arts, and the Arts in General. “The future of Plaza de Mayo is at stake,” said Mayor Jorge M. Tinari. “This is a critical moment, a critical moment when we must act decisively and resolutely to ensure that Buenos Aires is not left behind in the fight against Covid-19.”\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has announced that it is reopening on April 5, 2020, following a $1 billion expansion and expansion. The museum’s inaugural schedule includes adding more than 2,", "The next Biennial should be held in the spring of 2021. The exhibition, entitled “The Magician and the Thief,” will feature work by twenty-eight artists, including Harald Szeemann, Martin Chiel, and Renata Catellani, as well as a selection of works from the exhibition “The Abstract Expressionism,” which will be staged in the fall of 2020.\n\n\nThe Chinese government has suspended the construction of a new cultural monument commemorating the 1937 Chinese Revolution, as the country attempts to erase a campaign of mass arrests and political violence that occurred just over a year ago. The cultural center is slated to open in 2020, though it will be a while before the city of Wuhan, in central China, gets its first visitors in more than sixty years.In March 2019, a group of Western artists and activists, led by Hanna Wang, claimed that the monument to the revolution would violate China’s sovereignty. The activists succeeded in convincing the Chinese government to temporarily suspend the construction of the monument, and to temporarily remove the guerrilla map of the country by Zhao Yiqian, a Chinese former official who was imprisoned for inciting ethnic violence. The government responded by imposing restrictions", "The next Biennial should therefore be a 'whole new world', with elements of art and technology combined in ways that will challenge the notion of the exhibition as an extensive museum collection and as such, the Biennial as it were.”\n\nThe biennial will be hosted at the Museum of Contemporary Art (MoCA) in New York from March 23 to March 27. The event will feature a selection of artists, including Nikko Tanevalli, James Turrell, Juanita C. Gutierrez, and Frances Quarles, among others from USAID and the State Department, and will examine the themes of climate change and the global economy. The exhibition will feature work by fifty artists, including Julio César Morales, Agnes Martin, and Ricardo Orozco; the collection of artworks by José Miguel Pérez-Villar, Alexander Calder, and Gerardo Campos; and work by Yoko Ono, Arsht, and other contemporary artists.\n\n\nThe New York City Department of Cultural Affairs (DCLA) is expanding the city’s homeless shelter system, increasing the number of available beds and increasing the hours of services, which will now be accessible from 9 AM to 5 PM on weekdays. The", "The next Biennial should be a reflection of the United States and will be a mix of new and established artists, thinkers, and arts professionals. The exhibition will also present\n\na larger vision of life in the United States inspired by the themes of the Biennial. To achieve this we will introduce a series of immersive and immersive-like experiences in which artists\n\nattempt to create works that are both visual and relational in their presentation of the art of the future. The exhibition will also include a series of public programs that engage two-way dialogue with the artists and the city of Washington, DC.It will be held at the Smithsonian American Art Museum (SAAM) and will run until November 29.\n\n\nThe Miami Beach Museum of Art (MBMA) is expanding the scope of its collection with the acquisition of fifteen works by artists who have not been on display in its five-decade history. The acquisition includes the works of Iris Ackerman, Walter de Maria, Thomas Deaton, Michael Ola, and Ruth Benedict.“Museumgoers have been able to see these works for so long that it is hard to imagine that any of them will ever be seen by the public again,” said Marc Glimcher, chair of the", "The next Biennial should be held in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is preparing for a shutdown following a major renovation project that will shift its exhibition space on the second floor of the museum into a new exhibition complex. The $450 million expansion, entitled Kelsey Haynes: The Arts and the Streets, will include new galleries, spaces for education, and public conveniences. The complex will also boast an interpretive center, an artist studio, and an artist residence.“We are currently reviewing the design of the new exhibition spaces and are evaluating the impact of the renovation on the existing exhibition spaces,” said museum director Marc Glimcher. “There will be a period of transition for the general public that will be essential to the museum’s ongoing exhibition programs and programming.”Glimcher said the renovation will also shed some 150,000 square feet of the museum’s current exhibition space. The overhaul will require the removal of approximately 160 works by seventy-four artists and a selection of contemporary art, including Henry Goodman, Charles Bukowski, Jacinthe Anson, Jocelyn Ise, and Christo, among others. The museum is currently working with", "The next Biennial should take place in 2021, and the next should be in 2023. (The last two years were devoted to the construction of an exhibition hall for the Los Angeles County Museum of Art. The first Biennial was held in 1968.\n\n\nThe Toronto Biennial, which has been on indefinite hiatus since March 15 due to Covid-19, has announced that the thirty-fifth edition of the event will take place in the city from September 13 to September 20, 2020. The twenty-fifth edition, entitled “October/November 2020,” will continue to be organized by the Toronto Art Gallery (TAG) and will be held at the Closed Gallery on Dundas Street West from September 13 to September 18, 2020. The venue will be inaugurated by a presentation of a new work by artist and activist Sayfullo Iglesias, entitled Loose Ends, which was presented by TAG and will be presented by Aorowicz Gallery on September 15.The full list of participating artists is as follows:Oddity Camera, Toronto: Oddity Camera will return with new works by artist and director Ingrid and Ramón Barrientos.\n\nThe Los Angeles County Museum of Art (", "The next Biennial should be held sometime between March and May 2020. This event is part of a larger network of events, exhibitions, and other programming that have been organized by the City of New Delhi.The biennial will focus on “The Unseen Landscape: ‘The Art of Life Worlds in Transition,’” a collection of works by a number of South Asian artists that was recently acquired by the City of New Delhi. The exhibition was staged in collaboration with the artist group ArtreCore and will be on view until November 22.Commenting on the works, Sohrab Mohebbi, an artist-in-residence in the Biennial, said: “This exhibition is a powerful statement of hope for a new kind of theart, which might emerge out of the current global system, even as it stumbles toward disintegration. The art of life, which comprises life-forms, processes, and landscapes, is at the heart of our work and our city.We hope that the city and the biennial will become a new model for the art of life in India and beyond.”\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Rosy Soltan as its first", "The next Biennial should be held in 2022, and the first with a budget of $90 million. The exhibition, titled The Search for Art, will feature artists who are currently in the process of making a work of art. The site of the museum is to be located in the city of Milan, Italy, and is expected to open in 2022.\n\n\nThe Danish director Lars von Trier, whose returns-starred films are the foundation of the visual arts and whose work embodies the spirit of the modern era, has died at eighty-eight years old. The international director’s work is also the inspiration for the film Hurt Locker, which won an Oscar for best documentary in June 2019; and the documentary The Seventh Seal, which premiered at the Venice Film Festival in October 2014 and won the prize for best feature film in December 2015.In this edition of the Artforum, Klaus-Peter Biesenbach, the director of the Contemporary Danish Film Festival, said that von Trier’s films have been “arguably his most important and enduring work.” The director said that the work has “drastically affected and developed themes that are deeply relevant to us in the twenty-first century.” The full list", "The next Biennial should be a celebration of the twentieth century, in which the programmes for the event will be made available online, in various forms, for the first time. The exhibition will take place in the city of Biennale di Roma, the capital of Italy, from March 26 to March 29.\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Andy Barry as its next director. Barry, who has served at the institution for twenty-six years, succeeds Larry Fink, who retired in May after twenty-six years at the helm of the museum.“Andy has been a beloved and trusted leader of LACMA since he took the helm, and he has been instrumental in transforming the museum into one of the most respected cultural institutions in Los Angeles,” said Mark Burak, chair of the institution’s board of trustees. “Under his leadership, LACMA was transformed into an international leader in the presentation of contemporary art, and he has been instrumental in expanding the museum’s collection and its online presence. We are grateful for his work and look forward to his continuing to shape the museum’s mission and vision.”During his tenure at the helm, Barry oversaw the renovation", "The next Biennial should take place in December 2020. As the event is currently on hold due to the Covid-19 pandemic, the first exhibition of the new series, titled “BARGAIDS,” will be held in March 2021.The new exhibition, which will be hosted by the New Museum in New York, will take place in the former warehouse’s former location on West Twenty-Second Street. Almost immediately, the building will be transformed into an art museum. Designed by Rem Koolhaas and Genschroeder, the institution will house six galleries and a deluxe exhibition space. The museum is currently undergoing expansion and renovation, and the new space will include an exhibition area, a cafe, and a 1,300-seat theater.The Biennial will be held at the new site, which is currently being developed by David Guggenheim–Woods, in conjunction with a $2 billion expansion project, the modernization of the New Museum. The new museum will open in 2021.\n\n\nThe Cleveland Museum of Art (CMA) has added two new artists to its curatorial team: artist-in-residence Mona Hatoum and Moroccan-born, Paris-based designer and educator", "The next Biennial should focus on developing a new conceptual model of the arts as a tool of social change, and how art should engage with, change, and live on as part of the ongoing process of transforming society.”The 2019 event will take place in the Bálint: Haus der Künste in the city of Freiburg, Germany. The exhibition will be organized by the Bálint Foundation, the Bálint Museum, and the Bálint Archives, and will take place in conjunction with the biennial “Kunstverein Berlin” (2019).\n\n\nIn an unprecedented move, the National Geographic Society has announced that it plans to sell off its English-language magazines to private interests. The magazines will be auctioned by National Geographic Discovery, a subsidiary of the private company Clear Channel Media, at a fee of $1. The sale includes all copies printed in the United States during the last twelve months. As part of a $4.5 billion restructuring of its business, the company also said it will sell some of its intellectual property.“For more than thirty years, National Geographic has been dedicated to exploring the wonderful world around us, and for decades now, the", "The next Biennial should both educate and showcase contemporary cultural traditions. The exhibition should offer a platform for the regional and international artists and show how art can be a vehicle for social change. The exhibition will be curated by Florian Nohl, director of the Württembergischer Kunstverein Berlin, and will bring together artists from across the world. Its theme will be “Art in Context” and will delve into the art of art in general, such as how art can serve as a vehicle for liberation. The exhibition will be organized as a hybrid between a retrospective and a solo show. Nohl and his team will have the final decision to change the theme of the show. “The most important thing is to build a real historical memory for this exhibition, which is why we are working so hard to create a three-dimensional and dynamic experience,” said Nohl. The newly founded organization, the Markus Biennial, will take over the Tübingen Biennial and will host a collaborative exhibition on the history of urban planning, curated by a group of designers from the design and architecture fields, in June. The inaugural edition, entitled “Architecture” will include works by Brazil", "The next Biennial should be held at the Museum of Modern Art in New York, in 2019.  The event will be hosted by Museum of Modern Art and will be held in conjunction with the biennial’s fifty-eighth edition, “The Present.” The museum will also host the first-ever Biennial of the Arts in the city of New York in 2020.Displaying its collection of more than three thousand artworks and artifacts from the historical Spanish Inquisition through a series of exhibitions that will take place in the museum from January 19 to January 25, 2020, the museum will be transformed into a museum of the ancient world.The institution will also host a number of exhibitions dedicated to the collections of the artists represented in the exhibition, including a display on the life and work of Willem de Kooning and an exhibition on the screenplays of Terence Blanchard. The exhibit will be organized in such a way that visitors will be able to enter and exit the museum as they wish. \n\nAs the number of people drowning in Superstorm Sandy continues to rise, New York Governor Andrew Cuomo declared a state of emergency and started rescues. On Monday, Cuomo declared a state of emergency in all of", "The next Biennial should take place on the Museum of Modern Art’s campus as soon as possible, to be held in the fall of 2020. The institution has already committed to hosting an exhibition of work by artists such as Wayne Campbell, Margaret Mitchell, and Robert Irwin.\n\n\nThe London-based arts organization the London Foundation (LFA) has announced that it will soon be closing its nine-year engagement with the company responsible for the naming of Great Western Railway stations in the United Kingdom. The organization’s former director, Patti Smith, has been appointed interim director. Smith will take up the post until a successor is hired.“LFA was never in a position to dictate which station names were chosen and do not want to influence in the first place,” Smith told the Art Newspaper. “We are now asking the question of whether other companies should be asked to make similar decisions, and whether they should be allowed to influence naming decisions. This is a problem that we as a society must address. We may want to name stations after famous people, but what about stations after stations that have never had a passenger?”In a letter dated January 14, the foundation said it was “concerned that a[n]", "The next Biennial should be in 2021. \n\n\nThe five-year anniversary of the 2008 financial crisis, which has gripped the globe ever since, was marked on Tuesday by a meeting of the board of trustees of the prestigious Fall/Winter Institute in New York. The organization, which has hosted dozens of major exhibitions over the last twenty-five years, decided to suspend operations in an attempt to lessen the economic fallout from the pandemic.“In light of the global health crisis, the board has decided to delay the opening of the Fall/Winter Institute until at least the end of December, thereby providing an additional year of support to the already struggling artists who continue to use this space,” reads a statement issued by the institute. “This move will allow the institute to be held in the coming months at a more appropriate time to help the art market and the art world continue to thrive.”The announcement follows a series of actions taken by arts professionals, including Jay-Z and Beyoncé, as they lobbied for the design of the annual retrospective, “We Ride,” to take place in January 2020. Among the artists whose works will likely be included in the show, which will be curated by Mario Bech and curated by L", "The next Biennial should take place in 2021, and the exhibition should open in the autumn of 2022.\n\n\nThe Los Angeles County Museum of Art (LACMA) is planning on reopening in November 2020 following a $63 million expansion and renovation. The institution, which was forced to cancel the 2020 season after it was threatened with a lawsuit from the California Nurses Association, will reopen in two stages. According to the Los Angeles Times, the construction of the new building, which will occupy approximately six hundred,000 square feet, began in 2015 and will be completed sometime in 2021.“We want to re-create a new experience for visitors to LACMA,” board chair Tom F. Avantz told the Los Angeles Times. “This is a historic institution that has celebrated its 150th anniversary with a major expansion in 2021. We are very excited to see how the new space will change and enhance on the historic grounds, and the community, for whom LACMA is the heart.”The $63 million expansion, which began in 2018, includes the construction of a new gallery and a new experience for visitors. The redesign, which has been implemented in collaboration with the architects Herzog & de Meuron, aims to add", "The next Biennial should open in the spring of 2020. “The exhibition will feature contributions by seventy-three artists from twenty-five countries, including China, France, Germany, Italy, Japan, Somalia, Russia, and Surinam, India, and will take up themes such as the degradation of art and culture, colonialism, and the contemporary artist,” said Museum director Nicholas Cullinan. Inaugurating the new exhibition will be the exhibition “art and politics,” a discussion with Michel Foucault and Simone Leigh that will explore the relationship between art and politics, art and religion, art and politics, and art and science and religion,” and a new book, “Chronology: From Manuscript to History” (Dietrich Reimer & Fabian Neukölln).The six-story museum is currently constructing a new exhibition space, “The House,” that will sit within the newly renovated Central Library, which will include a new exhibition of work by fifty artists from twenty-six countries and thirty-one different cities. The exhibition will be staged in the library and will run from March 3 to March 8, 2020. \n\n\nThe Museum", "The next Biennial should have also taken place in the autumn. However, in an interview with the New York Times in November 1995, Feigl, who was then the chair of the committee, noted that the institution had been “working to postpone” its event, since October 19. The news was not unexpected as it followed the cancellation of the “Milk and Honey Show,” a “great exhibition,” in the spring. The biennial’s next edition will take place in the autumn of 2021.\n\n\nThe Pérez Art Museum Miami (PAMM) has received a major donation of $2.5 million from the Weston family, which owns the Weston Group, in recognition of its commitment to supporting art conservation. The donation, which brings the total contribution to $3 million, will be used to establish an Endangered Art Fund and will go toward creating awareness and increasing support for conservation efforts.The funds will also provide a new platform for conservation scientists and conservation organizations to share and exchange information and tools and will allow PAMM to set up an online public registry of all the works it owns that are at risk of extinction.The Weston Foundation has created the Endangered Art Fund to facilitate conservation", "The next Biennial should take place in the spring of 2020. “I’m very excited to be working with my talented team, on this exciting project, and to continue to advance the history of the Museum, with an ambitious exhibition and program,” said James Pindell, president of the institution. The biennial will also include the first‐ever public performances of works by contemporary artists. The opening of the biennial will be marked by a commemorative exhibition of the works of the biennial’s other founders, Phil Collins and Rainer Telter, with artist Renzo Piano. The exhibition will include works by artists such as Carsten Licht, Torbio Saarinen, and Thomas Mather, as well as works by artists who have never been on view, such as John Akomfrah, Njideka Akunyili, and Bogdan Biczel, among others.The exhibition will be curated by David Breslin, director of the Montreal Museum of Fine Arts; Adrian Cho, director of the Metropolitan Museum of Art; and Louis Daguerre. The selection of works from the Biennial will be led by Anne-Marie Drahi, director of the Museum Nationale de la", "The next Biennial should take place in Tokyo. The first, which will be held in 2022, was postponed because of concerns over the coronavirus. The proposed 2021 event will take place between January 17 and January 19. \n\n\nAmerican photographer Paul Gauguin, whose oft-composed abstract portraits embodied a vision of landscape and its frame, has died at age eighty-eight.Born in New York City in 1937, Gauguin was drawn to the city by its abundance of natural beauty and its vibrant nightlife. In the 1940s, he moved to Paris, where he studied under Henri Rousseau, but eventually settled in New York, where he began his career as an artist-photographer. Gauguin is known for his use of light, dark and shadow, two of the major themes in his photography. He eventually shifted to creating abstract compositions that manifest both sensuality and rigor, reflecting the work of the avant-garde of the 1970s. The result is a string of works from which to understand a city so grand and complexly made up.“The City and the Land is the most important work of Gauguin’s career,” Christie Larsen wrote in the May 1989 issue of", "The next Biennial should bring together artists from over forty countries, including the United States, Australia, and Berlin, and will take place in May 2020.\n\n\nItalian artist Davide Laversa, whose practice was inspired by the work of the late Italian designer Gio Ponti, has died at seventy-six years old.Born in Milan in 1935, Laversa studied at the prestigious Gelazzu Righetti in Padua, the Prada Institute in Turin, and the School of Fine Arts in Venice before graduating from the University of Genoa in 1956. After four years at the school, he returned to Milan and the School of Fine Arts for a year to study under architect Beppe Candovitz, who would later start the design house Zarello Dalla Lana.The next year, Laversa designed a piece for the 1960 Venice Architecture Biennale, replacing sculptor Piero della Francesca's model for the pavilion. His work was featured in the 1971 exhibition “La Strada della Vittoria” at the Giardini in Turin, and was included in the biennial’s “50 years of design in Italy” (1966–67) and “70s", "The next Biennial should be held at Fridman Art Museum, New York, in 2020. The next Art Basel, held at the Art Deco-era Fair in New York in 2020, is expected to take place in 2021. And finally, in the spring of 2022, the first edition of Art Basel will come to the city of Mumbai. The Art Basel India Submissions and Collections, Mumbai, is currently on display in the exhibition hall at the Art De’s New Delhi headquarters; the event will resume in the fall. Last year, Art Basel India was awarded a prize for its partnership with the Indian government. The exhibition was inaugurated by artist Arpad Ghebaly, who was nominated for his work  The Birth of a Nation. The show, which features work by forty-two contemporary artists, including Sidraj Kno, Girolamo Rist, and Vijay Nara, will open at the Art Museum on January 7 and run until March 27.\n\n\nThe British Film Institute (BFI) in London announced today that Emilia Clarke has been appointed as its new chair of contemporary art. Clarke will succeed Christopher Wool, who is retiring", "The next Biennial should take place sometime between December and March 2020. The 2019 edition, titled “Blood, Sweat, and Tears” was hosted by the New York–based nonprofit Artspace and was curated by Jean-Michel Goldin; the inaugural event, titled “The Species Question: What is a Biennial?,” was held in February 2020, but was cancelled due to the Covid-19 pandemic. The 2019, the Venice Biennale, featured artists such as Joël Andrianomearisoa, Olafur Eliasson, and Lydia Massey. The 2019 edition of The Species Question: What is a Biennial? featured work by twenty-eight artists and will be presented at the Museum of Modern Art in New York from March 23 to March 27. Artists previously selected for the 2019 event include Anouk Alhanan, Fatosdagdag, Nari Báez, Fadosilm, Hélène Bourgeaud, Simón Cardoso, and Sebastian Chiu, who will each receive $10,000 for their work.  The 2019 iteration of the festival, titled “There Is Nothing New Under the", "The next Biennial should be held in 2021.  The 2021 edition would be staged in 2020 and would focus on topics related to the life and work of Pablo Picasso. A selection of the artist’s works would be presented in a three-dimensional format. However, the event’s organizers say that the biennial’s interactive elements will remain intact. However, the event’s organizers are unsure as to whether the biennial will still be able to go forward as planned even if all of the necessary approvals are in place. “We are also not able to present the biennial in its entirety without the support of the city, state, and federal governments of Madrid and Valencia,” said José Manuel de la Calle, director of the Biennale de Spain, in a statement. The Madrid branch of the Biennale de Spain had originally planned to suspend the exhibition in mid-March and reopening would have taken place in September. However, in the days leading up to the announcement, thousands took to the streets of the city to protest the exhibition, leading to clashes between pro-democracy protesters and anti-austerity protesters.As Madrid residents became increasingly concerned for their safety and the safety of their", "The next Biennial should take place in 2022.\n\n\nThe Hirshhorn Museum, which has been closed since March 13 because of Covid-19, has appointed Steven M. Berman as its new executive director. He succeeds Anne-Marie Brennan, who has served as the Hirshhorn’s deputy director and chief curator of the past two years, and will take up the post in January 2022.“Steven’s breadth of experience and expertise makes him ideally qualified to lead the Hirshhorn through this tumultuous moment in its history,” said Carol Ehrlich, the museum’s director and CEO. “His commitment to supporting the Hirshhorn’s work with innovative and creative approaches points to the enrichment of the Hirshhorn’s curatorial vision and our audiences’ interests.”Berman’s recent curation projects include the exhibition “The Human Journey: From Mice to People” (2019) and “The Art of Eating: From Food to Eating” (2018), both at the Art Institute of Chicago. He also curated “Mice’ Eating” (2017) at the Art Institute of Chicago, and “How Does a Machine Make", "The next Biennial should be held at Haus der Kunst, Frankfurt, in December 2021. Museum in Tokyo just announced its design for the 2020 edition, which will stage twenty-nine works by twenty-three artists. The exhibition is being organized by the Tokyo Metropolitan Museum of Art (TMM), as part of its Tokyo 2020 initiative. The twenty-four artists chosen for the exhibition are:Yazhi Shino,「Dumb and Dumber” (2019);Stephanie Cunhui,“Feminine and Feminine: Contemporary Art and Gender in China” (2019);David Hsu, Insomnia, (2019);Olivier Trietto, (2019);Mariko Takeda, Born to Die, (2019);Brittany Tuitsano, Born to Die, Spring 2019, 2019;Eliot Newcombe, The Game of Art, 2019); Sara Wunder, Passion, 2019);Mariko Takeda, Born to Die, Spring 2019, 2019;Diana Wong, Rose, Autumn 2019, 2019; and Sari-Lee Witt, Born to Die, Spring 2019,", "The next Biennial should take place in 2020.”Cindy Nelson, chair of the Arts Council, added: “I’m thrilled to say that the next Biennial will feature a truly innovative mix of artists. We look forward to the first show of its kind, with an international team of curators, artists, historians, and researchers, and to the next in the series, which will include more than fifty artists and thinkers.”\n\n\nThe International Council for Museums (ICA) announced today that it is raising its 2020 executive prize. The $35,000 award is being given to Paolo Barbieri, the Italian artist who made the first drawings of structures in his studio in Rome in the 1960s, and is being presented in collaboration with the Italian government. Barbieri, who is known for his sculptural approach to architecture, landscape, and landscape art, has been designated the 2020 laureate of Italy. The award ceremony will be held at the Palazzo delle Papes in Rome on March 14. Barbieri will receive the award during a ceremony at the ICA headquarters in Rome on March 12. The ICA was founded in 1949 as a Rome-based association dedicated to contemporary art and architecture.\n\n\n\n\n", "The next Biennial should focus on the large-scale international and domestic exhibitions of Ellsworth Kelly’s paintings,” said Kunsthalle Basel, which has hosted the show since New York’s Whitney Museum of American Art closed its doors on September 2. The exhibition is currently on view until March 29.\n\n\nArt and Design Shanghai (ADTS) has announced that it will launch a new digital platform that will help artists and designers worldwide improve their online presence. The platform, which will be launched in April 2020 and launched by ADTS’ curators and administrators, will allow artists and designers to submit their online exhibitions for free. The platform will also host auction sales, meet-ups, and other activities.“We are excited to be launching this new platform, especially since we have been working on it for almost two years,” said ADTS CEO and founder, Ashish Bhagat. “It’s been an uphill battle to develop a platform that would be effective and affordable for galleries and designers, but we believe we have managed to do so. As a result, we believe it is the right time to launch the platform and to launch something new, something that can help artists and designers achieve their creative", "The next Biennial should be held in the spring of 2021. The event will be hosted by the Biennale de Lyon in the city of Lyon, France, and will take place in the city of France (Le Monde), located near the Rhone River, in the Alps of France.The exhibition will take place on three continents—Europe, North Africa, and South Asia—with the theme 'Reflections of a Wounded World: The Art of Healing and Redemption in the Age of Black Death.” The exhibition will also include artworks by artists such as Mira Dancy, Alighiero Celant, and Albert Oehlenhut. The exhibition will run for twelve weeks and culminate with the reception of “Daughters of Light,” an exhibition of work by artists such as Jean-Michel Basquiat, Mark Halperin, and Chantal Mojra, at the Leilaus Film Museum in Amsterdam next February.The exhibition is part of a yearlong project by Biennale organizers to explore new ways of organizing major art events. The project, “The 60th Anniversary of the Biennale,” is being organized in partnership with the artist-run organization the association Pé", "The next Biennial should take place in the summer of 2021. We are currently reviewing the venues and will be able to share more information in the coming weeks. The upcoming Guggenheim Biennale was initially scheduled to be held in the spring of 2022. The venue will be reopened for the first edition of the Paris Biennial in the fall of 2021.\n\n\nThe Museum of Tolerance (Museum Tolerance) in New York has appointed Amanda King as its new director. She succeeds Frank Gehry, who retired following a decade at the helm of the museum in 2017, and will begin in her new role on January 6, 2020.“We are deeply indebted to Frank Gehry for his enormous leadership, his vision, and his outstanding achievements,” said Museum Tolerance director and CEO Peter G. Panetta. “It is especially meaningful that he has chosen to lead the museum into the future through a four-decade strategy that includes an innovative program that advances the museum’s mission to foster a better understanding of the history of African art and explores the potential of cooperation between the institution and other cultural service organizations and institutions.”King, who comes to the institution from the San Francisco Museum of Modern Art (SF", "The next Biennial should take place in Spring 2020. In the meantime, the current exhibition, “Inside the Life and Death of the Artist,” has been closed since November 2016. The current exhibition, “The Audience,” held at the Art Institute of Chicago from April 23 to April 26, 2020, is open for public viewing through March 31. The new exhibition “Intersection,” will be presented in conjunction with the 2019 Public Art Universal—the theme of the 2020 edition of the event is ‘Inclusion,’ and will open to the public on April 10. The new timetable for the show will be announced in the coming days. \n\n\nThe Toronto Art Gallery (TAG) has announced that it is planning to open a new public area in downtown Toronto’s Toronto District, known as the T.D.A., on May 6, 2020. The 30,000 sq.-ft. venue will be designed by architect David LaChappelle and will be inaugurated by a free concert featuring twenty-one artists, including Sarah Dessen, Anish Kapoor, and Rita Mae. The evening’s program will be followed by a solo exhibition of", "The next Biennial should have a theme that recalls the deep human joys and sorrows. I hope that this year will be about remembering, in a way that reflects our shared world. ”\n\nThe Metropolitan Museum of Art in New York has announced that it will not renew the contract of the long-standing artist-in-residence, Susanne Vielmetter, the founder of the experimental experimental RCA studio space Peace/Happiness, whose work explores the boundaries of memory and memory-making.A painter and sculptor, Vielmetter shows her own work across the decades in several formats. The artist-in-residence, whose studio space sits in the same building as the Museum of Modern Art and the Metropolitan Museum of Art, has been a part of the revitalization and expansion of the museum since it opened in 1991. The museum has been committed to creating a new chapter in its collection of work by Vielmetter since 1997. In 2005, the institution opened the Vielmetter Research Laboratory (VRL), a research center dedicated to her work. It also established the Susan Vielmetter Research Fellowship, which supports the commissioning of work by the artist. In 2016, the museum decided", "The next Biennial should commence in the fall of 2020 and will be hosted at the newly renovated Museum of Modern Art (MoMA), in New York. The museum, which was completed in 1977 and completed in 2000, will be completed shortly thereafter. Inaugurating the museum are three new works by artists in its collection, and the museum will boast of a new film program. Curated by Henry Hebert, the first Biennial to be held in the United States will be the 2019 edition, which was curated by Daniel H. Pink. Following a survey of contemporary art through the lens of the Black Lives Matter movement, the exhibition will mark the first time the museum will honor a Black artist.The exhibition will also draw on the collections of the two major Albright-Knox Art Gallerys, and will feature works by Pete Rockburne, Arthur Ingrassia, Nina James-Allen, Janice F. Adams, Elyn Fox, Wangechi Mutu, Adrienne Edwards, John Giorno, and Cara Wilcox. As part of the initiative, the museum will also inaugurate the Black Museum of Art (BMAM), a new space for", "The next Biennial should take place in 2021. Expectations for the 2018 event were high. Noli Dura’s curator, Fabiana Prăs, said: “This year was a challenge for me, but I am proud of the work that was created throughout the process, as well as the exhibition’s reception at the Museum of Contemporary Art Amsterdam and the shows that we have yet to organize.”\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has announced that it plans to spend $1.8 million to revitalize its midtown location. The institute is working with architect and urban designer Toby Keith to redesign the museum’s ground floor, which is currently home to a Philip Johnson–designed artwork by artist Arakawa Mariko, the museum’s first exhibition devoted to the late Japanese architect Tadao Ando, and creates a series of galleries and suites that will be joined by a grand staircase that will bring visitors to the museum.The new space will include a bookstore, a café, a performance venue, and a rooftop terrace that will provide 360-degree views of Manhattan. The restoration project, which will be funded in part through a $1.2", "The next Biennial should be held in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has removed a controversial work by Greek artist Ioan Iannone from its permanent collection, effective immediately. The work, Sylvia Alighier’s The Possession of the Body (1926), was one of twenty pieces that were removed from the museum last month after an investigation into allegations that they were “abused by collectors and turned into pawns” and “put to shame by an unscrupulous museum management.”The Museum of Modern Art director Michael Bowman had publicly defended the institution’s policy of not selling works by artists that had exhibited at the museum in the previous twelve months. But in a statement to the New York Times last week, Bowman acknowledged that the museum’s holdings of works that had not been exhibited for twelve months were “abused by collectors and turned into pawns” and “put to shame by an unscrupulous museum management.” He also acknowledged that his decision to terminate the contracts of those twenty-three artists was not a partisan act, but one made in the interest of the institution.Bowman also acknowledged that MoMA had not done enough", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid in 2022 and will be led by the Argentine curator Xandra Ibarra.\n\n\nThe National Gallery in London announced today that it is expanding its general circulation exhibition, Art of the Party, by the artist Harry A. Salter. The new exhibition, which will run from February 10 to March 7, 2020, will feature twenty-four works by Salter\u0097including pieces by artists such as Mies van der Rohe, Frank Gehry, Filippa Keller, and Jasper Johns\u0097and will be shown at the National Gallery in partnership with the Institute of Contemporary Art (ICA) in London.The exhibition, which traces the artist’s career from his early work in the early 1960s to his last show in the United States in 2017, will feature works by artists such as Dale Davis, Jeanne-Claude, and Thomas Mies van der Rohe\u0097which will be joined by a new exhibition of work by Francis Pendergast, a collaboration with the National Galleries of Scotland, and a retrospective of work by American artist Neil Peart\u0097the project is part of a project to explore the dynamics", "The next Biennial should focus on how to create new social media platforms that foster ethical and political action. “The fashion industry has built the power and opportunity for the marginalized and exploited,” Simone Preston, the executive director of the Fashion Institute for Design, told the Art Newspaper. “We must take advantage of this power to create new spaces for artistic expression and radical self-expression.”In the April/May issue of The Fashion Journal, Mackenzie Davis, who was nominated for the award, wrote: “The fashion industry, like any industry, has its fairs, its trade shows, its awards shows, its awards ceremonies, its trade shows, its awards shows, its awards shows, its trade shows, its trade shows, its awards shows, its trade shows, its trade shows, its trade shows, its trade shows, its awards shows, its awards shows, its trade shows, its trade shows, its awards shows, their trade shows, their trade shows, their trade shows, their awards shows, their trade shows, their awards shows, their trade shows, their awards shows, their trade shows, their trade shows, their awards shows, their trade shows, their trade shows, their award shows, their trade shows", "The next Biennial should be the last, since it will be canceled before it can begin.   The full list of exhibitors is as follows:          *Alberto Giusto Workshop and Museum (Algarve, Portugal)    *Art of Painting: The Global Centered, 1960–1968 (New York: American Art Museum, New York)    *Art of the Accidental, 1940–1950 (New York: Columbia University, New York)    *Art of the Accident, 1947–1952 (New York: American Museum of Natural History, New York)    *Art of the Act of Creation, 1939–1945 (New York: Joslyn Art Museum, New York)    “The Contemporary: A Conversation Between Robert Irwin and Eve Ensler” Full list of artists who were invited to participate in the exhibition: *Alberto Giusto Workshop and Museum (Algarve, Portugal)Juan Carlos Pérez-Perez (Mexico City: Joslyn Art Museum, New York)Alma Mathes (New York: Artists Project, New York)", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MCA) in New York has appointed Cara Nicholson as its new curator of African American art. Nicholson will be responsible for overseeing the museum’s collection of nearly two thousand works by forty-one artists and designers.  “The MCA has had a strong and enduring relationship with the African American community for more than forty years, and it’s the only institution in America dedicated to the study, exhibition, and exhibition of African American art,” said Steve Raica, chair of the board of trustees. “Cara ‘s unparalleled breadth, depth, and expertise make her uniquely qualified to lead the MCA to new heights in accessibility and scholarship.” Prior to joining the institution in 2008, Nicholson served as an assistant curator in the department of American popular art at the Museum of Modern Art in New York, where she worked alongside David H. Koch and other key figures of the New York art world, including Ted Turner, Alan Lightfoot, and Edward Hopper. She has also held curatorial roles at the Museum of Contemporary Art Indianapolis, the Museum of Contemporary Art Chicago, and the Museum of Modern Art in New York", "The next Biennial should take place in 2021. \n\n\nThe Smithsonian National Museum of African Art in Washington, DC, has received a gift of more than four hundred paintings from the estate of John Philip Sousa. The works were donated by his son, John Sousa Jr., who was born in Harlem in 1931 and grew up in the West Bronx.John Sousa was a key figure in the rise of African art in the United States. The New York–born, Harlem–raised Sousa began collecting in the 1960s, and in 1997, the museum acquired his father’s work, which features a single, unbroken panel of colored glass, all of which were created in the 1950s. Based on an exhibition of his father’s work that ran at the Brooklyn Museum in the 1960s, the museum has unveiled the works in a new period piece, “Pulp Fiction: John Sousa and the Art of Painting,” which will open in the fall of 2019.Pulp Fiction is a new project funded by the Smithsonian’s African American Museum and the Trauma Center in partnership with the David and Lucille LaChapelle, Sr., who are also giving $20 million to the", "The next Biennial should take place in 2020 and will feature the work of seventy-six artists, including Matisse and Picasso, from the exhibition “The Future is Present: Biennial Essays” (2019) and “Dinu'l-Ain: The Great Art” (2015). “The Future Is Present: Biennial Essays” is a collection of essays that examine the work of the artists whose works are featured in the exhibition; the impact of the exhibition on the field of painting; and the artists who created works for the exhibition. “Dinu'l-Ain: The Great Art” is a retrospective of the twentieth-century masters whom the exhibition is based on. The seventy-six works in the show are works by forty-three artists, including Albert Camus, César Cipolletta, Édouard Vuillard, Théodore Léger, and Pierre-Auguste Renoir. The show will continue through June 21, 2020.\n\n\nThe Norwegian Royal Academy of Arts (NRA) has received a major blow to its funding after it slashed funding to the arts following a wave of criticism following the event “Last Call", "The next Biennial should be presented by the National Gallery of Art in Washington, DC. The biennial will also host its first exhibition of work by indigenous artists in the United States. The full list of participating artists is as follows:ArtsFacultyArticlesArticlesArticlesArticlesAlt.ArticlesArticlesArticlesArticlesArticlesArticlesBibliographyBibliographyEndnotesBibliographyFictionBooksDetailersArticlesCollectionArticlesArticlesCollectionArticlesCollectionProgrammingArticlesCollectionArticlesCollectionArticlesCollectionArticlesCollectionArticlesCollectionArticlesCollectionArticlesArticlesCollectionArticlesCollectionArticlesCollectionArticlesCollectionArticlesCollectionArticlesCollectionArticlesCollectionArticlesCollectionArticlesCollectionArticlesCollectionArticlesCollectionArticlesCollectionArticlesCollectionArticles CollectionArticlesCollectionArticlesCollectionArticlesCollectionArticlesCollectionArticlesBibliographicArticlesArticlesBibliographiesArticlesBibliographiesArticlesCollectionArticlesCollectionArticlesCollectionArticlesCollectionArticlesCollectionArticlesCollectionArticlesBibliographiesLibraryArticlesArticlesArticlesLibraryArchitectureArticlesArchitectureBooksArchitectureBooksArchitectureBooksArchitectureBooksArchitectureBooksArchitectureBooksArchitect", "The next Biennial should be held in 2022. For the next edition, the theme will be Life of the Self. \n\n\nThe London-based nonprofit the Institute of Contemporary Art (ICA) has launched an initiative to train young curators in how to produce shows for the forthcoming series of the London Film Festival (LFF). The program, which will be based in the United Kingdom and will be lead by Curator and director Adam Radcliffe, will train hundreds of young curators in how to work in collaboration with artists and their institutions to present cutting edge work. The academy will employ a combination of free and paid internships to develop themes for the first edition of the ICA London Film Festival, which will take place in October.“We are thrilled that Adam Radcliffe will be joining us in the ICA for the first iteration of ICA London and to continue developing the series as a platform for youth and young artists in the UK,” said Amelia Symons, director of the ICA. “The ICA is one of the few contemporary art institutions that actually runs a full-time residency program for young curators. The series is a chance for them to develop and to experiment with a wide range of mediums and processes—", "The next Biennial should take place in 2020. \n\n\nThe National Museum of Art in Washington, DC, is planning to move its collection of over one hundred thousand works by American artist Charles Bukowski to a new home in the capital. It is also preparing to open an eight-thousand-work museum on the grounds of the Smithsonian’s National Museum of American Art, which will create a permanent home for the collection.The move will allow the National Museum of Art to become part of a larger multi-billion-dollar overhaul of the Smithsonian, and will also involve the division of the museum between the two institutions. The estimated cost of the project is $3.5 billion. “This is a historic moment for the National Museum of Art and the next four years will be a defining year for the institution,” said Joshua Helmer, the deputy director and chief curator of the National Museum of Art. “Charles Bukowski’s work has endured in the collections of many institutions and is treasured by many collectors. We are honored to have the opportunity to share his legacy with our children and grandkids.”The full list of the museum’s donors is as follows:American Jewish Mutual Foundation (A.J", "The next Biennial should take place in the autumn of 2020.  The tour will be supported by the Alfred Wegener Institute (ADA), the Alfred Proust Foundation (APG), and the Alfred Stieglitz Foundation (ASF). Houston’s Museum of Contemporary Art (HMLA), the Southern Methodist University Art Museum (SUMM), the Art Institute of Chicago (AIC), and the Metropolitan Museum of Art (Museum of Modern Art) will also present the exhibition’s inaugural edition in 2020.The inaugural exhibition, “Sensory Overload: The Art of Noise” will be presented in the new “Alberto Breuer Space” at the Museum of Modern Art. The exhibition will focus on the “philosophies of noise and its connection with the human body” and will also include a new survey of the history of noise art. Visitors to the exhibition will be able to listen to interviews with artists such as Michael Angelakos and Paul Gauguin, a selection of works by late Sixties and seventies artists such as Raye Sims, Rachel Whiteread, and Jerome Robbins, and will also be able to experience live music, dance, and", "The next Biennial should be held in 2021.  **\n\n\nAfter Israeli troops lightly occupied the West Bank city of Nablus on Tuesday, killing a dozen Palestinians, Israeli Prime Minister Benjamin Netanyahu issued an edict declaring that the new restrictions would not only apply to Palestinians, but to those who live within one kilometer of the Green Line. While the army said it only entered Nablus to enforce a temporary closure on the area, the Israeli human rights group B'Tselem, which has been monitoring the events in the West Bank since 2015, reported that the soldiersÂ�squeezed through the blockade on Nablus’s Beit El district on Monday, launching a military operation that saw soldiers fire tear gas and live ammunition into crowds.“The military is not authorized to enter a Palestinian city in order to create the conditions for fighting a violent resistance movement,” Netanyahu said, referring to the 1967 Mideast War. “Our military doesn’t need to enter Palestinian neighborhoods to achieve the military objectives of displacing the resistance movement. Our military doesn’t need to enter Palestinian neighborhoods to avoid clashes with Palestinian civilians. Our military doesn’t need to enter Palestinian neighborhoods to impose military", "The next Biennial should be held in 2020. The next exhibition should be held in 2021. The next exhibition should be held in 2022. The next book should be held in 2024. The next film should be released in 2020. The next theater production should be staged in 2021. The next play should be staged in 2021. The next album should be released in 2022. The next conference should be held in 2022. The next exhibition should be staged in 2021. The next museum exhibition should be staged in 2021. The next WW2 exhibition should be staged in 2022. The next Art Basel show should be staged in 2022. The next Macy’s fashion show should be staged in 2021. The next Art Taekwondo event should be staged as a mini-tournament in 2022. The next Sundance Film Festival should be staged as a tsumako, a traditional South Korean festival of 270 arts professionals. The next Markham Art Gallery exhibition should run from March 10–March 13 and March 14–March 20. The next Korean pavilion exhibition should be staged in 2022.Seoul Art Week will be held from March 14–March 17. The inaugural Seoul Asian art conference will", "The next Biennial should be held in 2022, but for now, will focus on integrating the works of the artist-run nonprofit group, the Biennial Foundation, with exhibition programming at the Museum of Modern Art in New York.“We are delighted to collaborate with the Museum of Modern Art to engage with the culture of the artist and the museum, but we are also mindful of the museum’s historical and current role as the custodian of the biennial collection,” said Simon West, director of the Biennial Foundation. “As we embark on a new chapter of the biennial, the Museum of Modern Art is honored to present an exhibition of work by Richard Avedon, and thrilled to present the work of the artist-run organization, the Biennial Foundation. The new Museum of Modern Art is dedicated to celebrating the work of art that is currently stored in the Art Institute of Chicago. We look forward to furthering our collaboration with the museum and to celebrating the legacy of the biennial collection in 2020.”The museum also announced that it will begin welcoming visitors to the museum through its new online display, which is currently online through March 19. Visitors will be able to browse through the collection online in person, via a biennial", "The next Biennial should be held in the spring of 2020. It will open in January 2021.\n\n\nThe Museum of the African Diaspora (MoAD) in Atlanta has appointed Katie Po, the former director and CEO of the Rhode Island School of Design, as its next executive director. Po has served as the executive director of MoAD since March 2019. She succeeds Sue Boland, who departed the institution in March 2020 to head the Brooklyn-based nonprofit Forward.“Katie brings a wealth of experience in museum and academic leadership and has an exceptional ability to leverage the talents of talented, committed staff to advance our mission,” said Peter W. Peart, chair of MoAD’s board of trustees. “We are excited to welcome her to the organization and to work with her to advance MoAD’s mission and vision.”In her new role, Po will lead the organization through a period of transition as it reorganizes to reduce costs and expand its collection. The institution has also announced that it is increasing the pay of its top executives to $1,200 from $500 and has reduced the pay of its existing employees. In a letter sent to staff, the board of trustees wrote: “We are", "The next Biennial should come in 2020, according to ARTnews, and will begin with an exhibition of work by the Los Angeles–based artist Maya Lin and will feature works by the likes of Jack Posen, Eric Fischl, Robert Irwin, Peter Sellars, and more.\n\n\nArt Basel is planning to pull the plug on its upcoming edition, “Art World Shanghai,” which was set to take place in Shanghai from May 18 to May 21. The event has been pushed back a month and a half due to the coronavirus, which is currently affecting at least 130 countries.“We cannot imagine that the 2020 edition will be as successful as the previous one,” said Marco della Cava, the head of the company’s Asia-Pacific group, which includes exhibitions of work by artists such as Tomasz Klimczyk, Anya Neswanger, and Peter Zumthor. “We are actively evaluating all options, including by following the advice of external experts, in order to try to reduce our risk. We will present our position in the future through a series of exhibitions and other events.”The 2020 edition will be the last for the British American Art (", "The next Biennial should be held in twenty years. The event’s production team is hoping to push the limits of the museum’s collection and will try to incorporate as many new and experimental works as possible. The biennial will also honor the contribution of women to the history of art, with an exhibition devoted to the French sculptor Edouard Vuillard, a statue of Joan Miró that is part of a project to display the work of feminist artists Cécile Bourgeault and Jeanne-Claude, and a performance biennial that will feature works by artists such as Marcela Aparicio, Susana Pilar, and Vivian Hill.Although the museum is currently closed due to the Covid-19 outbreak, the opening of the exhibition “Mirrors in Time: Biennials,” which was organized as part of the museum’s centennial, is expected to be on October 26.\n\n\nThe MCH Group and the Shanghai-born, Pasadena, California-based artist Nick Cave will collaborate for the first time in Shanghai this fall. The collaboration—which will take place in the city’s Tsinghua University, which is located in a former coal mine—will also", "The next Biennial should take place in 2020.\n\n\nThe Walter de Maria Art Foundation (WMAF) in New York City is launching two new initiatives in support of the Sundance Film Festival. Beginning in the fall, the foundation will host more screenings of acclaimed documentaries, ranging from best documentaries to most recent titles in search of the highest-quality films. The initiative, dubbed the “Sundance Scorecard,” will attempt to quantify the impact of Sundance films within the film festival ecosystem. One hundred Sundance film scores will then be published annually.The announcement was made during a presentation of the foundation’s new initiative at the Marfa Academy of Art in Texas, Texas, on Tuesday, September 3. The presentation featured the work of the WMAF’s own Scott Mitchell, whose work, which explores the history of American art and the trajectory of contemporary American art, was selected for inclusion in this year’s Biennial of American Cinema.“A decade ago, Scott Mitchell presented the Sundance Scorecard,” said foundation president and CEO Tim Burak. “We are thrilled to be able to present the work of the WMAF’s own Scott Mitchell, whose work is an essential evidence", "The next Biennial should be titled “Culture and Politics in the Age of Trump” according to Artforum editor-in-chief Antonia Catellani, who also suggested the title of the event be “From the European Union to the Future Years.” The 2017 edition, titled “The Future of Art,” addressed European artistic institutions, the political climate, and the role of art institutions in facilitating political action.\n\n\nFilmmaker Tom Ford, whose  and their respective companies have been accused of pushing out racist and sexist material in the movies, has been named the recipient of a $300,000 MacArthur Fellowship. The $600,000 award is one of the largest grants in the biennial’s history and comes with the potential to revolutionize how artists are rewarded.“Tom Ford is a pioneer and a pioneer is a pioneer,” said Alfred A. Knopf, chair of the biennial’s board of trustees and an African American filmmaker. “The MacArthur Fellowship is a clear recognition of his and the biennial’s achievements and the progress he has made in demonstrating the possibilities of collaboration between artists and the humanities.” Ford", "The next Biennial should be held in 2021, with the exhibition scheduled to open in 2020.\n\n\nThe Newcastle Museum of Art (NMMA) in England has announced that it will soon host a retrospective of the late artist Maurice Feldman’s artworks, titled Maurice Feldman: Hauser & Wirth, at the museum. In the exhibition, which will be held at the institution from March 27–March 29, 2021, Feldman’s work will be presented in an intimate setting and will be accompanied by an original score composed by the late composer T. Rex Ryan.“The retrospective represents a significant milestone in the history of NMMA, which has aspired for forty years to present an exhibition of Feldman’s work,” said Mark Dugdale, director of NMMA. “Through a series of conversations with a number of his contemporaries, he provided a creative and instrumental framework for the conceptual development of work in the twentieth century.”In addition to the exhibition, which will include an artist overview, a retrospective of work by Feldman’s contemporary, James Cuno, and an exhibition of the artist’s other works, which will be on view in the show the following month", "The next Biennial should include an exhibition of national artistic traditions, an international theatrical program, a juried exhibition, and a selection of short films by artists from Africa, Asia, and the Americas. The 2019 edition of the Biennial will run from September 27 to September 29. \n\n\nThe Miami-based nonprofit the Miami Art Museum (MAMI) is revamping its 150-year-old campus, which it began constructing in 2007, in the hopes of alleviating the harsh climate impacts of fossil fuels. The redesign, which involves the demolition of the existing campus, and the construction of a new 125,000-square-foot museum and event space, is part of a twenty-year vision to reshape the city’s cultural landscape in conjunction with the museum’s long-discussed expansion.“MAMI’s actions to reduce its carbon footprint and open up more of the environment for artists and visitors are a critical step in meeting our climate emergency,” Michael Aliotti, chair of MAMI’s board of trustees, said in a statement. “This means reducing waste, creating new revenue streams, and reopening the museum in partnership with the local community.” “This may", "The next Biennial should aim to introduce the audience to the work of the late British painter Keith Haring, whose paintings focus on surreal and non-recognition within a post-cultural neo-Renaissance-inspired landscape of American and European art, in order to reflect the creative ferment of the United States. \n\n\nThe Chicago Department of Arts and Culture (CADA), which operates out of the city’s Grant Park neighborhood, has appointed Maggie Winograd as its next executive director. She will be responsible for overseeing the artistic and cultural life of the city’s Grant Park and Central Artery neighborhoods, which are home to Chicago’s Museum of Contemporary Art (MoCA), the Art Institute of Chicago, and the Arthur Rossetti, Jr., SculptureCenter, and will take up her new post on September 2.“Maggie is a seasoned leader who has built a distinguished record of fostering a strong and diversified collection of works of contemporary art,” said CADA director Carolyn Lee. “Over the past decade, she has led CADA through a period of transformation, navigating the transition from a city-owned art museum to an independent organization that operates independently but collaborates with the city. Throughout,", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is rethinking its future. Its board of trustees is expecting the institution to announce that it will suspend its inaugural edition, “Into the Future,” this fall, and instead focus on remaking its campus into a “museum of art” in the city. The new exhibition, titled “The Museum as Landscape,” will explore the concept of ‘landscapes’ as a medium for the production and circulation of cultural and historical objects.” The exhibition will also introduce a new digital platform that will allow visitors to tour the museum.“Two years ago, we made a conscious decision to reinvest in the museum to make it more attractive to visitors and to make it more of a destination in our city,” board chair Mark DeMartino told Artnet. “We needed to do that in order to sustain our mission during this challenging economic climate. We were also able to make a conscious decision not to move forward with the first exhibition, ‘Into the Future,” in order to continue to develop the new exhibition program.”The move isn't surprising,", "The next Biennial should be held in 2021. The Husk Gallery and Museum, the Museum of Contemporary Art, Los Angeles, and the Metropolitan Museum of Art are among the other Los Angeles museums that have expressed interest in the exhibition. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it is planning to increase the number of exhibitions it produces by fivefold in the next few years. The initiative, dubbed the Next Five Years, was developed with the help of an internal consultation group that included David Kordansky, director of the Museum of Contemporary Art, Los Angeles; Jane Panetta, director of Art at Large at the San Francisco Museum of Modern Art; and Joseph and Maryna Zug, whose extensive curatorial knowledge spans art history, design, and design and design and design and design’s history; and was launched with an $18 million donation from billionaire collector Richard Diebreich.“The Next Five Years will be an extension of MoCA’s commitment to delivering thoughtful, relevant, and inspiring exhibitions that take our community’s imagination to new heights,” said Christopher Gavin, MoCA’s executive director. “A five-fold increase in our output will be a", "The next Biennial should be held in 2021\n\nConducted by the Kunsthalle Basel in collaboration with a select group of artists and curators, “Art in Life and Death” is a collection of twenty-eight works by the composer Beethoven, including “Prospects of Spring” (2017), “The Rite of Spring” (2018), and “Symphony No. 28: Cello and Piano” (2019).\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Anna Halper, who previously served as an assistant curator at the Hammer Museum in New York, as its next director. Halper will be responsible for overseeing the museum’s current exhibition-centric programming and for building on the institution’s existing curatorial expertise.“We are thrilled to welcome her to LACMA as our next director,” said James Cuno, LACMA’s board president. “A master of her craft, her passion for art, and her ability to motivate, Anna possesses an enviable and urgent track record of success as an art educator and curator.”Prior to joining the Hammer, Halper served as a cur", "The next Biennial should begin in the spring of 2021.\n\n\nThe National Geographic Society in Washington, DC, has filed a federal lawsuit against the federal government over its decision to end the national museum’s contract with the private oil and gas company, Devon Energy. The lawsuit claims the Smithsonian Institution has violated the National Environmental Policy Act (NEPA), which was passed in 1972 to address environmental concerns at federally funded institutions, and claims that the move violates NEPA’s 30-day notice requirement.“We are aware of the pending lawsuit and are reviewing it carefully,” said Gardner Stapley, the Smithsonian’s deputy director of conservation and conservation affairs, to the Art Newspaper. “We believe our position is sound, and we’ve shown that in advocating for and fighting for preservation of monuments.” The lawsuit comes after the president Donald Trump’s 2018 campaign promise to tear down monuments. The president signed an executive order in January 2020 that directed the Smithsonian to begin the process of removing historical monuments, but the move has been stalled by a legal challenge from Native American tribes and activists. The suit is the latest development in a string of legal challenges to the Trump administration’s controversial monument-", "The next Biennial should take place in 2021 and will be staged at the Museo de Artes Plásticas (MAS) in Madrid.​\n\n\nThe National Endowment for the Arts (NEA) has received a gift of more than 175,000 photographs by Annie Dyson\u0097one of the pioneers of the photographic medium\u0097from the author of the seminal book The Picture Gallery: The Modern Art of Annie Dyson (MCA), which was published in 1978. Nude as a Girl in a Bar: The Making of a Photographic Number by Nelly Asher (2013) and Free at Last: The Making of a Photograph by Robert Irwin (2015) are among the works that were donated by the author to the museum.The museum will now display them in its exhibition “Photography at its Highest.” The work, which was acquired by the NEA from the Alexander C. Farquharson Foundation, was presented at the institution for a two-day retrospective of the work in March 2019.The Photography at its Highest exhibition will also include photographs by artists including Robert Irwin, David Adjay, John Akomfrah, and Alex Katz, as well as an extensive bibliography", "The next Biennial should be hosted by the Museu de Arte de São Paulo (MASP), where the show will begin on September 14. “For years, we have been able to present works and initiatives that are free and are developed in cooperation with the artists and their communities,” said Juan De Jesus, director of MASP and the Museum of Modern Art, and the artist’s husband. “This year we are able to present at the same time works that are completed, represented, and in process. It is a new kind of exhibition that forms a new space for creating new works, for the audience, for the creators.”On the museum’s decision to hold the show at the venue that hosted the exhibition and the exhibition’s opening: Lima’s state museum of the same name. \n\n\nAmerican artist Peter Saul has been named the winner of this year’s Turner Prize, which is presented by the Turner Prize Foundation and the Turner Prize. Established by the Turner Prize Foundation in 2015 to recognize artists who have made significant contributions to visual arts and cultural life. The exhibition will feature works by twenty-five nominees, including Oddity, G", "The next Biennial should be held in May 2019. The event will be led by Michelangelo Antonioni and will take place in the basement of the Museo de Arte Contemporáneo in Florence. The first edition of the biennial will be held in July 2021.\n\n\nThe National Gallery of Canada announced today that it will suspend its exhibition “National Treasure: The Art of the Land” for a month, from March 14 to March 16, in an attempt to ease the health of the National Gallery’s circulation system, which is currently suffering a severe power outage due to the coronavirus. The exhibition, which was scheduled to run from March 20 to March 22, will be reopening in May. The exhibition, which included work by artists such as Pierre-Auguste Renoir and Claude Monet, was supposed to highlight the work of Canadian and international artists who have had significant roles in Canadian culture over the course of its history. The exhibition, titled “Canadian Artists in the Twentieth Century: A Retrospective,” was meant to commemorate the centenary of the country’s founding, but was never completed.The exhibition is one of the major legacies of the tumultuous", "The next Biennial should begin in January 2021. It is currently slated to run from January 15 to January 17, 2021.\n\n\nThe Whitney Museum of American Art (MCA), New York, has appointed Emily Rojas as its next director. Rojas will be responsible for organizing the exhibition and public programming at the museum, which has two locations in New York City: the museum and the Metropolitan Museum of Art. She succeeds Franck Ribery, who departed the institution in February after eighteen months to become director of the Palazzo Reina Sofia.“We are delighted to welcome Emily to the MCA,” said MCA director Adam D. Weinberg. “She is a remarkable curator who has been instrumental in transforming the MCA into an important cultural institution for the Americas. She is passionate about art, and about how it can shape and expand communities, especially in underserved communities. She is experienced and smart, and we believe she will continue to find ways to advance our mission and to expand the museum’s impact in the Americas.”Prior to joining the MCA, Rojas served as the artistic director and curator of the west coast’s first solo exhibition of works by New York artists in 1995.", "The next Biennial should be held in 2020, the Swiss institution said. \"\"In addition to the great exhibition atmosphere and the positive feedbacks on our first exhibition, we are pleased to see that the biennial will be a success. In the coming years, we intend to keep exploring and to keep making the exhibition experience as unforgettable as possible. We are currently in the process of preparing the next exhibition, which will be organized in the spring of 2021. We are looking forward to future collaboration with our visitors.”\n\n\nThe Los Angeles County Museum of Art (LACMA) announced today that it will award $2.75 million to fifty arts organizations in the city for “inclusion and excellence.”The funds will go toward “a local, local, and regional focus,” of sorts, the institution said. The nonprofit organization will determine which organizations will receive the funds by proposing projects that address issues that are currently unaddressed, such as homelessness and revitalization.The fifty awardees are as follows: 1. The Rambling Arts, an artist-led group that drew canvases, photographs, and prints from the Los Angeles landscape to create “Temple City” in downtown", "The next Biennial should aim to address the concerns of the city and the biennial’s partners, namely the community and the museum and should take place in early 2021. The full list of participating artists is as follows: http://www.hongkongartpop.com/2018/09/artists-for-the-next-series-cubo-moto-nara.html\n\n\nThe Museum of Contemporary Art, Los Angeles (LA MoCA) announced today that it will hold the second edition of the Art of the Party, which will be held at the historic Laguna Seca neighborhood of Los Angeles from March 16 to March 19, 2020. The event will be curated by John Lassiter, who currently serves as the executive director of the nonprofit organization Art in America, and will be hosted by LA MoCA.“It’s been an incredible ten years since we began the Art of the Party event,” said Tim Minchin, director and CEO of the Museum of Contemporary Art. “The transformation of Laguna Seca into an Art Museum has been the largest project in the Museum’s history, and we are thrilled to announce that it will complete in 2020", "The next Biennial should focus on the contemporary possibilities of the museum’s collection. “One of the biggest challenges for the museum in recent times has been the transition to a new five-year cycle,” said Artistic Director João Ribas. “We are still far off from a solution that will enable us to maintain an open and creative agenda throughout the festival. But it is possible that in future years we will be able to create a new exhibition based on the existing collection, including a collection of contemporary art from the new, or the last, exhibition.”Biennials will not be revitalized, but they should be taken to task for their proliferation.  With a budget of $18.7 million, the Biennials are, according to the biennial’s organizers, “concerned with the development of the French national art and culture. Together they have sufficient funds to create a new exhibition and museum, a new collection, and a new project for the future of French art.”The new museum will be a joint venture between the government and the Biennials, which will create the new institution in partnership with the local town of Biennials, the village of Cheviot,", "The next Biennial should be held in November 2020.  Vincent van Done and His Orchestra, which premiered at the Venice Biennale in May, will stage a biennial in Long Beach, California, in June 2021. The artists behind the 2017 exhibition “Valium: Our Place in the Cosmos” at the Museum of Contemporary Art, Los Angeles, will also be represented by the museum, which previously staged an exhibition of van Gogh’s work in 2017. The institution was granted a temporary exhibition block by the California Institute of Technology in 2018 as part of a research partnership between the two institutions. \n\n\nThe Art Institute of Chicago (AIC) announced that it is instituting new safety measures to protect the health and safety of visitors to its new, expanded, and expanded-out “Art Institute of Medicine” (AIM) in the City of Chicago and members of the public. The institute’s new safety guidelines, which were issued on September 12, outline the steps that visitors must take if they are unsure whether they are in a museum or not, including making an appointment with a member of staff; following museum programming; and communicating with other visitors or staff.The guidelines also", "The next Biennial should be held in June 2019, and the exhibition should coincide with the 100th anniversary of the birth of Comte de Montmelo, the German artist who pioneered the institution.The Biennial will also receive funds from the German state, the German city of Berlin, and the German state of North Rhine-Westphalia, as well as from the Italian government.  The event is expected to cost a total of $7 million.\n\n\nThe Walker Art Center in Minneapolis announced today that it plans to become the Minneapolis Museum of Art (Museum) in the Arts (MCA). The move follows a wave of consolidation and reorganization in the museum industry caused by the coronavirus. The institution, which has more than 3,500 works on display within its four buildings, will also boost the curriculum, add new programming, and reorganize its collection.“We are transforming the Walker into the Museum of Contemporary Art,” said Sarah Sze. “Its collection now includes more works by recent and established artists than any of its previous incarnations. We will continue to display their work in our current space, as well as in the museum’s newly renovated and expanded spaces, even as we work to develop", "The next Biennial should take place in the Fall of 2021. Artforum has reached out to the Franciscan Institute for the History of Art for comment.\n\n\nThe auction house Christie’s announced today that it has named Stéphane Berger the new head of its prestigious Contemporary Art Awards. Berger will be responsible for overseeing the awards, which honor contemporary art that depicts the work of forty-five artists, and will assume his position in July. Berger will be awarded an additional ten awards that commemorate exceptional achievement. The list of winners is as follows:Rendering of Cannupa + Armani’s “Tit, Tramp & Tampon” (Tit, Tramp & Tampon, 2015)Anton Kern’s “The Tree of Life” (Rendering Museum, London)Miles Gerber’s “The Gallows,” 2019Thierry Koschinsky’s “L'Ancienne Seigneurie” (Le Corbusier, Paris)Léa Meraime’s “Tit, Tramp & Tampon as a Symbol of Time” (R", "The next Biennial should take place at the City Museum in New York in 2020. The site of the Sistine Chapel in the Vatican City is currently being redeveloped by the city. The pavilion will also host a One Stop Tour, a series of lectures, and other events. The first event of its kind, the Biennial will consist of thirteen exhibitions of contemporary art, each themed around a different theme. The theme of the twentieth exhibition will be the theme of the twenty-fifth one hundred years hence.  “After a year devoted to the idea, we are ready to launch this year’s event,” said Paul Mpagi Sepuya, the director of the Biennale of Sydney. The ten-hour event will feature thirteen exhibitions of contemporary art, each with a unique narrative that will unfold over two days. The first exhibition, “Ten Years of Painting,” will open on January 7, 2020 and run until January 23, 2020. The second exhibition, “Ten Years of Drawing,” will open on January 13, 2020 and run from January 22 to January 26, 2020. The third exhibition, “Ten Years of Photography,” will open on January 7, 2021 and", "The next Biennial should be held in 2019.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is working with the Skowhegan Museum of Art in Connecticut to mark the centenary of the Skowhegan Massacre, a gunfight that took place on February 13, 1801. The event will mark the seventeenth anniversary of the incident and the first time that the two museums have collaborated.“With the Skowhegan Museum, we are re-creating a meaningful moment in the history of our city,” said Mary Anne Carter, the director of MoMA. “The Skowhegan Museum also has a significant collection that has never been seen by the public, and we are making a significant contribution to that collection through special exhibitions, educational programming, and research. Our second collaboration, a major exhibition on the Skowhegan Massacre in 2020, will close the Skowhegan Museum’s doors forever. And now, for the first time in its history, MoMA and the Skowhegan Museum will present a joint exhibition.”Meanwhile, the Skowhegan Museum has been working to raise funds for its acquisition of the seventy-six remaining Rembrandt", "The next Biennial should take place in the spring of 2021 and will focus on the evolution of art history through the study of its relation with contemporary life (2018) and the legacy of artist-activist Gwangju Vol.\n\nThe newly founded Nanyang Technological University (NTU), Singapore, plans to build a new 21,000-square-meter, seven-story exhibition hall for its inaugural exhibition, “The Future Is Here.” The space will be inaugurated by “Tania Bruguera: The Future Is Here”, which will show work by seventy artists. The biennial will follow “Animus: Avant Garde” (2019), “Nicole Porter: Avant Garde” (2019), “Isamu Noguchi: Avant Garde” (2019), “Lee Friedlander: Avant Garde” (2019), “Kyle Moulie: Avant Garde” (2019), and “Drew Karp: Avant Garde” (2019).The institution has also announced that it is studying the feasibility of launching a “traveling exhibition center” in the city. The idea was", "The next Biennial should be the twenty-fifth, and perhaps the twenty-seventh, with the selection of the works of Rachel Blum, Kivy Livy, and others whose works have yet to be exhibited. The exhibition will run from May 22 to May 29 and will feature work by both solo artists and groups. Inaugurating the exhibition will be the first Biennial exhibition on the city of Helsinki, which will take up the theme “Helsinki in Motion” and the artwork “Clouds and Clouds of Painting.” The exhibition will also include new works by the artist “Yoshitomo Morishima,” and the Tokyo Museum of Art’s exhibition “Yoshitomo Morishima: A Centenary Celebration.”\n\n\nThe Metropolitan Museum of Art (MoMA) in New York is planning to phase out a controversial $1 billion dollar contract with a company that manufactures and assembles artworks, after the institution received a $1.3 million donation from the family of Norman Foster, the American financier who was one of the main supporters of the Met. The gift also included five hundred paintings by Foster as well as a selection of Foster’s art"]