["The next Biennial should focus on constructivism and its relationship to art, “in a way that touches on the concept of a biennial as a universal kind of assemblage,” said curator Camille Chateaubriand. The committee comprised Monsignor Michelangelo Antonia Di Biennale; Guoso Gomes, president of the Republica of Piedmont; Christina Roesler, arts editor of the Art Newspaper; Andrea Bruguera, director of the Art Institute of Chicago; and Jean-Luc Moulène, a curator from the Biennale de Lyon.The full list of participating artists is as follows:François BergéHermann BoehmHermann CammockHermann CammockHermann CammockHermann CammockHermann CammockHermann CammockHermann CammockHermann CammockHermann CammockHermann CammockHermann CammockDasoFernando BonifacioFernando BonifacioHermann CammockHermann CammockHermann CammockHermann CammockHermann", "The next Biennial should be held in the Spring of 2021. The 2019 exhibition featured the work of twenty-two contemporary artists, including Francesca Brugotti, Alighiero Carlucci, and Igor Gabukhov, and was curated by Alfredo Colson, Leonor A. Vasquez, and Beppe Cipolletta.\n\n\nArtist and collector David Kline has announced that he plans to donate twenty-five artworks by twenty-two artists to the creation and protection of a Blue Ribbon Fund. The twenty-five pieces will be given the name David Kline Blue Ribbon, after the donor’s husband, David Kline. The works will be distributed over ten years and will be organized into four categories: a) single exhibitions, b) group shows, c) curated tours. Each year, the collection will be given a new name.“The show of David Kline’s artworks will be an important moment in our history, a moment that will signal that a new life, a new purpose can be found in the artist’s legacy,” said Andrew Kreps, director and chief curator of the Whitney Museum of American Art. David Kline has donated ten works since", "The next Biennial should take place in 2020.\n\n\nThe New York–based nonprofit the National Endowment for the Arts (NEA) has awarded these six artists a total of $75,000, with an additional $50,000 for outstanding partnerships. The grantees are John Armstrong (New York City), Peter Bohlen (New York City), James Couturier (New York City), Tadao Ando (New York City), Thomas Duane (New York City), Terese Emmerich (New York City), Janice Eyles (New York City), Paul Giamatti (New York City), Paul Mpagi Sepuya (New York City), and Sara John Davidson (New York City).The grantees are chosen from a pool of applicants who are members of the NEA’s board of trustees. The other finalists were Pari Dukovic (New York City), Derek Eller (New York City), Derek Landreth (New York City), Timeless Cofounder (New York City), A.J. Frank (New York City), and Jason Isenberg (New York City).“We", "The next Biennial should be held in the spring of 2021, and the first exhibition should open in the fall of 2022.\n\n\nThe Italian architecture and design historian Dario Catellani, a founder of the Italian studio Finca and a recipient of a half-million prizes over the years, has died at the age of seventy-eight. Catellani was born in the city of Reggio Emilia in Sicily in 1922, the son of an industrialist and a wealthy collector. Upon his father's death, the family moved to Turin, where Catellani attended school and grew interested in the art world.“Battista Fontana and Alfredo Catellani were two of the most important figures in Italian architecture,” said Timur Kohn, a professor of modern Italian architecture at the University of California, Los Angeles. “Fontana was the most influential of the generation of Italian architects who began in the late 1940s and ’50s and developed into the generation that began in the late ’60s, leaving behind the ’40s and ’50s to create a unified group of contemporary architects. He was maybe the most important of the four founders of the modern", "The next Biennial should take place in the spring of 2021, and the 2020 edition will be the last.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is preparing to welcome visitors back to the institution in 2021. The announcement coincides with the Fifty-Ninth Venice Architecture Biennale, which will take place in May. The premiere of the exhibition “Theater of Operations: The Gulf Wars 1991–2011”—which examines the consequences of US air attacks on civilians in Iraq and Afghanistan—and “Theater of Things”—a presentation of twentieth-century art that is based on a state-sponsored, rogue AI program—is also scheduled for May.According to Artnet, the announcement marks the first time MoCA has announced a date for a twenty-first-century exhibition in its seventy-five-year history. “After fifty years of exhibiting work by major international artists and designers, we knew that a twenty-first-century architecture biennial was the best way forward for the institution,” said director Joe Lubin. “The exhibition will include the next building block of our architecture program: a world-class exhibition of work by established and emerging American artists. Two of", "The next Biennial should be on the theme of the Arts and Science, which was chosen from the competition we nominated last year. The biennial will be organized on a large scale, with participants working together in groups of three to five. The next iteration of the biennial will be staged in 2021.The theme of the next installment is the Arts and Science and the Arts as an Interwebs Platform. The exhibition will present the works of fourteen new artists: Rosalind Davis, Matthew Hoffmann, Eileen Ilesen, and Jody Rogac. The exhibition is curated by Matthew Hoffmann and Rosalind Davis, who will curate the next installment in the series of exhibitions. The next exhibition will feature  Eric Fischl and Martin Asbæk’s Million Dollar Man, a comprehensive public performance. The museum will also exhibit the works of Eric Fischl and Martin Asbæk, whose work will be exhibited in the second exhibition of the series, “Mouth of the Wilder,” at the Museum of Modern Art in New York in 2021. The next exhibition will be curated by ", "The next Biennial should include a Who’s Who of the major twentieth-century artists of the Philippines with the intent to generate dialogue, reflection, and understanding among the twenty-first century.\n\n\nAfter years of paperless exhibitions, online programming, and exhibitions that were canceled because of lack of funds, the Museum of Fine Arts (MFA) in Los Angeles has announced it will reopen with $4 million from the $12 million raised by the 1,500 donors who gave $100,000 or more. The institution will host its first exhibition since the pandemic in September and its last show, “Before the Storm,” in October.The historic institution, which recently completed its $1.1 million expansion, will host five shows this fall: “Eddie Marshall: The Artist in Exile” (September 12–September 19), “Christopher Wool: The Artist in Residence” (September 20–September 26), “John DeAndrea: The Artist in the Living Room” (September 29–October 2), and “John DeAndrea: The Artist in the Kitchen” (October 3–October 9). The museum will also offer free admission for families with children.“In the", "The next Biennial should be held in the spring of 2021.\n\n\nThe National Geographic Society’s Board of Directors has voted to dismiss its longtime board chair, Neil Boss, after the institution’s annual meeting in Washington, DC, pulled its 2021 edition from the calendar. The cancelation of the annual exhibition, “Challenges of the Century”—which explores the themes of climate change and the human experience, and which was set to run from March 14 to March 16—has led many to question the future of the venerable exhibition. “I think that the board made the right decision,” said John Muir, the board chair. “I think the board has a responsibility to look past any past,” he added, “and to determine the future—and that’s what we’re doing.”In a statement, the National Geographic Society said: “This was a rare event; it was a minority of directors who spoke out against Neil Boss—it was the minority who did not support him. We are deeply disappointed that this was the result. Neil is a trusted and immensely respected member of the board of directors who has been a supporter of the National Geographic Society since his appointment", "The next Biennial should take place at the Museo de Cultura de Buenos Aires (MCA), in 2021. Exhibitions at the Museum of Contemporary Art1, the Musée d’Art Contemporain de Milan, and the Museum of Contemporary Art2 are currently on hold, and the first exhibition of the new century’s inaugural season, “Art as Reality,” will open in December. The Los Angeles County Museum of Art recently announced that it will delay the opening of its inaugural exhibition, “The Way It Is,” by the same team behind the recently redesigned Museum of Contemporary Art, LA. The move follows a year-long project on the exhibition, which will be organized in tandem with the forthcoming Art of the Absurd: A Retrospective of Assignments, by Leonid Resnik. The announcement of the new work comes amid a global resurgence in artistic production and an increasingly divided world, which has seen many artworks and new exhibitions cancelled or postponed. In a rare move, the Artforum.com awards were awarded to artworld insiders Jen Corbett and David Kordansky for their predictions that “The Fellowship’s premiere will not be in December or January", "The next Biennial should devote much of its attention to the politics of nostalgia, the economy, and the memory of those who have died. “We must remember that our greatest achievements are the legacy projects of others,” said festival director H.J. Aikins. “We cannot, without shame, fail to reflect on our pasts.”\n\n\nThe National Endowment for the Arts (NEA) in the United States has awarded $5.5 million to twenty-nine arts organizations in the United States, Britain, and the United Arab Emirates, in recognition of their “significant achievements in contributing to the restoration of cultural heritage throughout their countries.” This year’s grant cycle, for which the NEA selected seventy winners and awarded them awards of up to $5,000, ran from June 28 to July 3.The artists included in the grants were Artsakh, Cyril Atkins, Basil Fawcett, Connie Black, Zoumane Boghossian, Andrea Carthy, Ladie Cohen, Samantha Cooper, Tawikia Gharib, Ricardo Gomes, and Sara Jackson,", "The next Biennial should commence as soon as possible in order to allow for the transfer of the collection and for the establishment of a programme of exhibitions, residencies, lectures, and other programming.” \n\n\nThe National Gallery of Art in Washington, DC, announced today that Pamela Binder has been hired as its next director. Binder comes to the institution from the Metropolitan Museum of Art, where she previously served as assistant curator of modern and contemporary art and curator of photography. She will assume her new responsibilities on January 21, 2021.“Pam has been instrumental in shaping the museum’s curatorial and visual arts programs for more than twenty years, and she has demonstrated a strong commitment to and ability for innovation,” said museum director Christopher Woolf. “Her work has been used by the museum to create new collections and explore the role of photography in current affairs. It is especially meaningful to me that her first solo exhibition was in ‘31’s ‘Photography’s Place: Photography in the 1970s” as part of the inaugural exhibition “Photography’s Place: Modernism” in 2000. Binder has also served as an adjunct scholar at the New Museum in London", "The next Biennial should take place in 2021, when the exhibition will be marked as the 50th anniversary of the institution.\n\n\nThe Museums Association (MA), a United Kingdom–based advocacy organization that represents more than 2,300 museums, has released guidelines for museums in the UK that are facing a looming shutdown due to the coronavirus pandemic.According to the organization, which was founded in 1984 by British arts professionals Christopher Wool and Allen Sim and British designer Alexander McQueen, a museum must be able to show some sort of direct and immediate financial impact from a shutdown. “Museums are facing an unprecedented situation,” John Pritchard, president of the association, told the Art Newspaper. “They are relying on each other and the government for support. The government is saying it cannot guarantee the future of the British economy and needs to do more to protect jobs and the economy.” He added that the UK’s cultural sector is already facing a downturn caused by the coronavirus.According to the Oxford University Centre for Arts, the UK’s annual losses from the coronavirus are expected to be around £2.5 billion, and the National Museums Scotland (N", "The next Biennial should not only be an exploration of the 'biennialism' of our time, but also a reflection on the contemporary and the past, on the history of art, and on the future of art.” The upcoming edition of the biennial will take place at the Museum of Modern Art, New York, from February 16 to February 21, 2020. Its host is a panel of artists, filmmakers, writers, and other cultural professionals from the United States, Europe, and Japan.The 2018 edition of the biennial, “Art for Change,” took place at the Brooklyn Museum in New York from April 3 to April 5, 2020. It hosted sixteen artists and produced over one-hundred works that addressed issues of social justice and environmental sustainability. The exhibition was organized by Brooklyn Museum curators and curator Adam Gopnik, who is cofounder of the Urban Institute and K1-LA, and Wetumpka artist and educator Natalia Laudel.\n\n\nAfter the Milwaukee Art Museum (MAM) announced that it is reopening to the public on June 14, the institution’s board chairman, Tom Gurel, issued a statement saying that the museum is “working hard to get back to you", "The next Biennial should be held in 2021. This time around, the theme will be “life and death,” a title that will promise a​​​simplicity and immediacy that will invite the viewer to “think within the life and death of the situation.” The 2019 exhibition, “Life and Death” (2019), marked the opening of the new exhibition space “Biodiversity” in Santo Domingo.\n\n\nMisterWerner Herzog & de Meuron have announced that they will voluntarily buy out the Estate of Pablo Picasso, the Swiss and Italian Jewish photographer whose work has been lost to the Holocaust. The family purchased the works from a charity organization in 1995, which then sold them to the Museum of the History of Modern Art (MoMA) in New York. In a statement, the family said: “We are greatly relieved that this unfortunate chapter of our lives is over. The Estate has made a long and difficult decision to sell the art, and we are glad to have made it possible by selling the works to MoMA. We are grateful for the work of MoMA and the Italian Museum of Modern Art in Rome for their vision of opening a collection of Pic", "The next Biennial should take place in London in the spring of 2021 and take place in the autumn of 2022. The biennial will include a retrospective of the work of each artist and will follow a program of performances, residencies, lectures, and performances, and will present a selection of works that were previously unavailable. The next iteration of the pavilion is scheduled to run from March through September 2021.\n\n\nThe National Association of Broadcaster Arts (N.A.B.A.), which has been encircling a stalemate with the US Department of Justice over its licensing of broadcast licenses since the 2016 Presidential election, is now asking the government for $8 billion in aid to encourage the creation of thousands of new jobs in the broadcasting industry. The $8 billion figure is a drastic increase from the $4 billion that the N.A.B.A. was requesting in ‎March and $2 billion that it gave the Department of Commerce in March 2019. The advocacy group is demanding that the government give broadcasters $4 billion to $6 billion to boost job openings and create more than 300,000 new broadcast and film editing and design jobs. The group is also demanding that Congress allocate $2 billion for grants and that the", "The next Biennial should be held in 2021 and will mark the twelfth edition of the event. Its opening will be on May 14 and will feature the first ever exhibitions of work by artists from the Sixteen-Century B.C.’s Indigenous perspective.The first exhibition, “Homage to the B.C.M.T. Movement,” curated by Richard Starke, will showcase the work of twenty-nine Indigenous artists, including Marcela Pindell, Nellie May, and Esmond J. Mabar. The museum will also feature a new book by the artist and educator S. M. Jones, “The Ceremony of Creation,” which will mark the twentieth anniversary of the International B.C.M.T. Day celebration.The event will also feature a new exhibition, “B.C.M.T.” at the Biennial, a biennial review of the biennial, and an opening reception for the biennial at 7 PM on November 15.The biennial will also introduce a new program of performances, residencies, lectures, and other programming that will be organized as part of a shared mission. The program will be curated by the artist", "The next Biennial should be held in 2020. The project, which was established in 2002 to commemorate the centenary of the outbreak of the First World War and to address the legacy of the anthrax-borne disease, is still ongoing.Its next iteration is expected to also include a number of exhibitions that commemorate the history of the outbreak as well as a new archive.\n\n\nAfter the Dutch Museum of Fine Arts (VVD Amsterdam) handed the keys to the Dutch government to Pritzker Prize–winning artist Annie Pfeifer in 2017, the institution announced that it plans to move forward with the sale of the collection and is preparing to open a new exhibition space in the museum. The new exhibition, titled Annie Pfeifer: The Complete Works, will be held at the museum in 2022.“The VVD Amsterdam will always be an important cultural partner for the Netherlands in the generation of new ideas and for the expression of those ideas through its exhibitions, books, and other collections,” Peter Flannigan, the director of the VVD, said. Following the museum’s acquisition of the Pfeifer collection in 2006, it opened the Pfeifer Gallery, which has represented the artist since 1989, in the Netherlands", "The next Biennial should be held in the city in July 2021.\n\n\nArt dealer Nandita Das has been appointed the new vice president of the Tata Group. Das takes the helm of the conglomerate from Namita Gandhi, who retired following a decade as president. She succeeds Arunanondchai, who has been leading the conglomerate for more than twenty years.“I’ve been involved in art for nearly forty years, and I’m pleased to have settled into the Tata Group,” Das told the Art Newspaper. “The Tata Group’s commitment to art has been for the long term, and I’m looking forward to working with the Tata team to bring Tata Art to life and to help them shape the future direction of their business.”During her tenure, Das worked to introduce new initiatives to support the global art trade and grow the business of art dealers. In 2011, Tata Art Foundation was formed, and in 2017, Tata Art Partners was born. Tata Art Partners is a not-for-profit, nonprofit organization that supports art-and-design institutions in India through investments in work and art.The organization works with art-and-design institutions to exchange art and design and is a member", "The next Biennial should focus on the lives and work of Helen Frank, whose work explores the duality of art and the body. “Helen Frank’s work is a meditation on the physical and a reflection of the relationship between nature and art,” said Bech. “Astro is also developing new capabilities to better recognize and engage with the biennial’s biennial subjects, which will include a new program of exhibitions and residencies called ‘Ecolectivism” that will take place in the New Mexico desert in 2021. \n\n\nThe National Gallery in London will unveil a new $1 billion plan for its future in a review published today, and it says it will prioritize the future of its Tate Modern in two years and its National Portrait Gallery, in London, in the next four years.The review, titled “What Matters?,” finds that the future of the National Gallery is at risk as it looks to its future with new managing director, Huw Edwards, who is on a three-year term and will assume his responsibilities in June. The review also notes that the institution is spending a large sum to prepare for the possibility of a possible staff reduction, and says that the institution has", "The next Biennial should be held at the National Museum of Modern Art in Beijing, to be inaugurated by Queen Elizabeth II, in 2022.\n\nAdvertisement\n\nIn this article, we will index, compare, and summarize the latest research into the avant-garde, with a particular focus on work by artists such as Sèver Alth, Jacques-Auguste Renoir, and Michel-François Pinault.Lately, scholars and curators from a variety of disciplines and countries have been pushing back against the narrow confines of museum exhibitions, exploring the role of art in the public sphere through projects such as the exhibition “Odd-Norland” (2019) at the CNE Biennial in Paris. What made the project so compelling was the opportunity to place artworks in a location that had never been visited by an outsider before, and to present them through an experimental platform that was not tied to a traditional institution. \n\nThe Museum of Contemporary Art (MoCA) in NYC has announced that it is preparing to welcome visitors back to the institution in twenty-four months. The announcement follows a study\u0097the institution is currently in the midst of a $160 million renovation and expansion that will involve the", "The next Biennial should be held in 2024, with the aim of creating a more egalitarian and inclusive vision of art, and a new exhibition program, \"Apostasy: Painting and Art from the Twentieth Century.\" \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed David Zuckerman as its next executive director. He succeeds Ann-Marie Oldenburg, who was promoted to deputy director this past March, and will begin his tenure in January 2021.“As the founder and director of the nonprofit, nonprofit arts organization David Zuckerman’s long-term vision for MoCA is to continue to support and strengthen the work of artists and not to take on new projects,” said museum director Elliot Mullick. “Having worked with David for many years, I know he is dedicated to transforming MoCA into a dynamic, inspiring presence for the arts at large. The next ten years are pivotal for MoCA, with its mission to be a destination for every person to enjoy the cultural experiences of the Pacific Northwest and beyond. I’m confident that he will continue to shape MoCA’s trajectory as a global leader in the arts and culture by leveraging the museum’s unique leadership position.", "The next Biennial should take place in 2021, with a launch date of 2024. The exhibition will be hosted in the same building as the museum’s current exhibition, “Design: From the Museum of Modern Art,” which will continue as planned. The new exhibition will be inaugurated by an exhibition of new works by the New York–based designer Tanya Bonakdar, which will be followed by an exhibition of work by the Palestinian artist Nusratollah Sadr.\n\n\nThe Japanese architectural company Guggenheim, which has been working with the Massachusetts-based firm Steidl to bring the Stanley Cup to New England for twenty years, announced today that it has awarded the firm $2.4 million in a contract award for the redesign of the Stanley Cup. The Stanley Cup’s redesign will be premiered at the 2017 Skowhegan Film Festival and will be on display in the Skowhegan Museum of Art in Cambridge, Massachusetts, for ten years.Guggenheim was awarded the design contract through a $1.3 billion capital campaign, called Stimson, following the completion of a $1 billion renovation of the museum in 1997. The renovation included the installation of new works by the Skowhegan", "The next Biennial should take place in 2020, with a design by designer Mark Bagwell.\n\n\nThe Princeton University Art Museum (PUMA) in New Jersey has received a $30 million donation from the Pritzker Foundation. The gift is part of the organization’s “Generations of Art” initiative, which aims to inspire critical reflection on the art of the twenty-first century through historic works by artists such as Eric Fischl and Frank Gehry. The gift is also a major milestone for Posen Gallery, which has been working to reach a new milestone in its history: the museum’s acquisition of a work by a woman, the first work to be acquired by a female artist in the United States. The institution previously had the distinction of having the first work by a female artist in the United States on display in the institution’s collection.“This work is a wonderful example of a beautiful artist’s ability to integrate art and life in a way that is both graceful and powerful,” said Posen director Rachel Haiduk. “It is a testament to the power of artist’s work, and a tremendous honor to have the work on display. Posen Gallery is thrilled to", "The next Biennial should be held in October 2021. The first exhibition, Surrounds, was held in September.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is restoring the Holly and George Paine Pavilion, which was built in 1983 and completed in 1993, in time for the centenary of American cinema. The Pavilion will reenter the historic building in early 2021 and will be joined by the original film set as well as two restored theaters, the original lobby, and the original theater stage.“MoCA’s commitment to supporting the Long Beach Museum of Art’s ambitious addition of new, state-of-the-art and architecturally stunning works has been exemplary,” said Ellen Hofman, director of the Paine Pavilion. “Thanks to the tireless work of our talented and dedicated staff and board, we were able to secure the funds to complete this exciting project, and we are thrilled that the Pavilion will be a museum that is a tribute to the Paine/Holly partnership for generations to come.”The Pavilion will rejoin the Paine-Holly Collection, which includes works by more than ninety artists and collectives and is located in the former Paine", "The next Biennial should take place in 2020. \n\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $3 million donation from a Japanese shipping magnate in an historic $622 million gift. The transaction, which was made through his company, the Bic Camera Corporation, and was made in the form of a bronze statue, titled The Three Sages, which was commissioned by architect Katsu Uchida and sculptor Mitsudaki Yoshida, was made in 1931 and is currently housed in the museum. The donation was made in honor of the LA County Museum of Art’s fallen city, the city of Los Angeles, which was founded in 1932 by a group of Japanese immigrants, the Kakusuji, who came to California as refugees from Japan. The Kusuji set the city’s architectural and architectural style in motion. The new benefactor is Yoshitomo Tsuda, a longtime supporter of the museum. The donor also pledged to begin the work of restoring the space in 2020 and to begin the construction of a new landmark, the Museum of Tribute to the Arts, in 2020. According to the Los Angeles Times,", "The next Biennial should be held in 2022, to be announced by the 2020 winners. The conference will also introduce a new Living Room Gallery (LHC), which will present a retrospective of the artist’s work, and the For Audrey Nasser Museum in Paris. The museum will stage an exhibition of work by the artist in 2020.\n\n\nThe Centre Pompidou in Paris, which has been the largest tenant of Louis Vuitton since the luxury goods company entered the museum business in the 1960s, will no longer be a tenant at the institution, the Art Newspaper reports. The Pritzker Prize–winning institution, which has been the site of several international exhibitions since it opened in 2001, had been a PAMM tenant since 2013. Louise Vuillard, the PAMM director, told French daily Le Monde that the company offered to continue paying the tenant through 2022 and pledged to continue providing the museum with funding for the duration of the contract. However, the institution chose not to renew the contract, opting instead to move forward with plans to open its new Pompidou—which will be built on the site of the former warehouse—in 2022.“In this case, the PAMM has a special role", "The next Biennial should be held in the fall of 2020. The new exhibition will aim to examine the relationship between art and culture in the twenty-first century. The 2019 event, entitled “Art in America,” consisted of 585 works, including works on paper, photography, and video, and featured new acquisitions from the artists whose works were on display. The 2020 event will feature 5,000 works, including works on paper, photography, and video and will take place in the magic city of Nuremberg. Location: “Art in America” will be held at the Museums für Kunst und Kunst GmbH in Frankfurt, Germany, as part of the biennial’s twentieth edition, “In Praise of Art.” The exhibition will open on September 19 at the Nuremberg International: “In Praise of Art.” The biennial will return to Frankfurt in December.Before the biennial, the exhibition held at the Nuremberg International, “Art in Germany,” featured works by the artists Wangechi Mutu, Seth Manet, Arsht Hochlitz, Antony Gormley, and Salvador Dali", "The next Biennial should be held in 2021. (The exhibition opened on December 29, 2021.)The ten artists selected for the exhibition are: Gertrude Stein, Elizabeth Cady Stanton, Joseph Bonnet, Walter de Maria, Paul Gauguin, Robert Mapplethorpe, Elisée Cerny, Jean-Luc Gosselin, Douglas Gordon, and Gertrude Stein’s husband, H.G. Stein. The exhibition’s inaugural theme is “The Life and Death of a Family.” Other themes for the biennial include “Bertrand Duane” (1799), “An Acme of Air” (1872), “Avant-Garde in the City of New York” (1944), and “Avant-Garde in New York” (1948).\n\n\nThe Institute for Contemporary Arts (ICA) in London announced today that it has appointed Deborah Avakian as its new head of curatorial affairs. Avakian is the fourth person to lead the ICA, which comprises four urban centers: Blackchalk, Blackchalk in South London, Blackchalk in North London, and Blackch", "The next Biennial should be held between June 7 and June 14. It will be the first in the country since 1964 and will be a compilation of works dating from the 1960s to the 1990s. The first exhibition to be organized by the contemporary art center was the biennial “Stanley Donwood-type show.”“We are thrilled by the opening of the Stanley Donwood-type show,” said Aline Sorensen, director of the showcase. “The exhibition will draw from all of the themes and the artists represented in the work to express the theme of the exhibition, which is the possibility of art as a form of social and political life. It will also present the artist’s way of being and the way of thinking about art. The exhibition will be conceived as a collaboration between the artist and the gallery.”Since the construction of the museum in 1964, it has hosted more than 1,000 exhibitions, including the retrospective of Alejandro Campanelli’s work from the 1962 Venice Biennale. In 2012, the exhibition “Herr Jürgen Lubitsch,” which was organized by the German government, opened in the museum.\n\n\nThe Los Angeles County", "The next Biennial should take place at the Museum of Contemporary Art, Houston in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released the list of seventy-six artists who will participate in the museum’s Fourth Biennial, “Between the Sun and the Moon,” which will be held in 2020. Titled “Composition in Motion,” the exhibition will explore the interconnections and heterogeneity of modern painting and sculpture, as well as the possibilities and limitations of the contemporary media.The biennial’s curators include Jennifer Jacobs, Mia Kalif, and Adrienne Edwards. The exhibition is curated by Patricia CuéSN, the president and CEO of the Arizona-based nonprofit Arts in America.The biennial will draw from forty-six of the fifty-eight artists who have appeared in the exhibition “Composition in Motion” and will focus on the “greater gravity” of the medium. The artist-in-residence, Ali Eisa, will serve as a coeditor in chief and will perform an original work for the exhibition. The biennial’s other curators are Kameel Saeed, ", "The next Biennial should aim to be a 'we-are-all-together' experience, said João Teixeira, its artistic director and a biennial-expert. The exhibition will include artwork by thirty-three artists, including Julie Ault, Maria Elena Cossiga, Joan Miró, and Robina Roesler; as well as a selection of historical works by artists such as El Sevillán, Pilar Corrias, and Rita Carbonell, as well as a selection of contemporary artworks by artists such as Barbara Kruger, Elsie Gallacher, and Alessio Nara.The new platform will launch with a retrospective of the work of thirty-three artists, curated by São Paulo de Castro, and will present a new collection of the work of fifty-two artists in October 2020. The exhibition will then return to the Museo do Biennales, where it will be presented by José Anna Báez, José Amedu, and Jacinto, and will conclude with a review of the latest art from the museum in March 2021.The public will be able to submit their own submissions to the biennial, which will be curated by a panel of artists, and will vote on which", "The next Biennial should coincide with the start of the Cultural and Creative Biennials, a $1.2 billion initiative. The program aims to provide more than twenty-four months of programming for arts and cultural organizations to help them move forward. “This will allow us to achieve our ambitious objectives of building on the legacy of the Biennials and of working collaboratively with other disciplines,” said biennial director Simone de Beauvoir. The theme of the 2020 edition of the Arts Biennials will be “The MacGill,” an homage to MacGill’s former headquarters in the gargantuan building located at 701 East Twenty-Fifth Street in Manhattan. The museum will also honor the artists whose works are currently on display in the exhibition, which will draw from a collection of more than 350 artists’ works that were on loan to the museum from the Finger Museum of Art in Boston.\n\n\nThe New York State Department of Cultural Affairs (DCLA) has awarded the Philadelphia Museum of Art (PMA) $140,000 in support of its plan to open a new exhibition space in its former space in the historic Lehigh Bank Arts Center. The grant comes amid a major cultural revitalization campaign", "The next Biennial should begin in the spring of 2020. The exhibition will consist of twenty-two works and will be housed within the museum’s Annex. The exhibition will be organized as a cross-section of contemporary art from North Asia, the Middle East, and South Asia and will focus on issues such as migration, climate change, and art and culture. “The future of the exhibition and of the museum is in great jeopardy,” said Oleksandr Kwasniewski, the director of the Central Library of Art in the Ukrainian city of Lviv and the museum. “We are hopeful that by sharing our purpose and our history, and in collaboration with artists from the region, this exhibition will be a signal of the vitality and spirit of the region.”\n\n\nValeria Cattaneo, the Italian curator who famously refused to leave Venice after she was forced to leave the building to make way for a new cultural center, is returning to the city to continue her work. Known for her fierce advocacy of artists and their work, Cattaneo built a successful career as an advocate for photography\u0097she first joined the institution in 1987 as its artistic director, and served as its first curator", "The next Biennial should be held at the Four Seasons Hotel in New York. The 2019 edition will be staged at the National Museum of Fine Arts in Washington, DC.\n\n\nThe Arts and Sciences Authority (Asc) in London and the National Loteries Museum in Nottingham announced today that they have collaborated on a new joint initiative. Called the Cross-Nation Fellowship, the initiative will support free and reduced-price arts and cultural activities and will provide funding for travel and accommodation. The project, which will last one year and will involve 230,000 people, was inspired by the work of artist William Kentridge, who had the idea to build a bridge between Nigeria and the United States. Kentridge, who lived in the United States for twenty years, began his project in 2003 and completed it in 2008. Kentridge’s living room provides a view of the Hudson Valley and is a major attraction in the town of Richmond. He has since installed a statue of the artist in the center of the town.“We have been collaborating with the National Loteries Museum and the Arts and Science Authority to create a platform that will enable artists to connect to potentially inspiring locations around the country,” said Matthew Price, the director of the Arts and", "The next Biennial should take place in the autumn of 2021. If the project is successful, a new collection of works by Eileen Ferry and William Kentridge will follow, and a collection of work by the French artist Marcel Prouvé will be opened in the Nineties. The exhibition will also include a series of films, a live performance, and a book. The exhibition, titled “Millennium: Art and the Present,” will run from November 25 to January 31. The work of twenty-six French contemporary artists will be presented by the National Gallery in Paris, the Musée d’Art Moderne in Paris, the Musée d’Art Modern in Paris, the Musée d’Art Spécial in Paris, and the Musée d’Art de l'Orléans. \n\nThe Pushkin State Museum in Moscow, which has been closed since February for renovation, has been awarded a $25,000 grant from the European Regional Fund for the Arts (ERBA) for the development of a new contemporary art project in the city. The grant was made in support of the institution’s renovation project, the former Soviet State Museum of Fine Arts (", "The next Biennial should be targeted towards the Contemporary Art and Design. The next will be focused on the Contemporary and Art during Transition: A Symposium. The last will be On Art and the Environment. [Source]\n\n\nThe Metropolitan Museum of Art, the Brooklyn Museum, and the Whitney Museum of American Art in New York have agreed to pay $2.8 million to settle a lawsuit brought by workers at the institution who were fired after they voted to organize in protest of management decisions, New York Times reports. The workers were among the first to go on strike in May 2019, when the museum suspended all programming and fired all of its employees.The workers have since been awarded more than $2.8 million, and civil rights lawyers are now asking for an additional $2.5 million. The legal battle began in February 2019, when workers at the institution were preparing to stage a walkout, and its impact was felt for the next four months.The plaintiffs were awarded $1.8 million in damages, and the court has since awarded another $1.4 million to the workers. On Tuesday, the workers were awarded another $1.5 million, and a judge also ordered that the remaining $1.7 million be paid to the workers", "The next Biennial should inaugurate the new museum at the Ritzy and will build a new structure based on the theme “Resonance and the Unseen.” The exhibition will also include an exhibition of works by Jean-Michel Basquiat, an exhibition of images by Mary Ellen Mark, an exhibition of works by Joan Miró, a presentation of works by Michelangelo Antonioni, and a retrospective of the work of Paul Gauguin.The biennial will draw from the works of nearly fifty artists and will begin with a series of lectures on the subject by Antonioni about his experiences in the war years. The programme will be followed by a triennial of the work of the same artists in the spring of 2020. The new venue will be inaugurated by an exhibition of the same artists in the autumn of 2020, followed by consecutive biennials in September and October 2020, and finally a biennial of the same artists in December. The inaugural exhibition will feature work by Theodoros Loras, Penelope Tracey, John William Seabrook, Rossini, and others.\n\n\nThe California Academy of Sciences (CalArts) in Pasadena announced today the formation of the Pablo Picasso Foundation for the Arts", "The next Biennial should take place at the São Paulo de Janeiro State University (São Paulo State University) in 2015, and then at the University of the Arts of the Sciences of the Sao Paulo. The prize was created in 1921 by an agreement between the two universities, which together serve as the headquarters of the University of São Paulo. The seventy-three-year-old architect has also recently announced his departure from the institution, which had been preparing to reopen in March, citing the financial difficulties caused by the coronavirus. The first exhibition of his new work, “Plásticas: Autobiologies,” was organized at the museum in September. The exhibition was followed by “Signs: Autobiologies,” in February. He will be succeeded by Simone de Ciani at the museum.The award ceremony will be held at the São Paulo de Janeiro State University on February 3. The prize ceremony will be held at the Teaching Museum of the History of Art, the Institut für Kunst und Moderne, in the city of Minot, on February 6. The exhibition of the work of the artist will be curated by Harald Szeemann; the selection of his", "The next Biennial should take place in the Spring of 2020.”\n\nThe private event, which is free to the public and organized by festival organizers, will continue to take place despite the coronavirus crisis. The 2020 edition will feature work by fifty artists and exhibitions that have been selected by a panel of judges who include Lars von Trier, João Caio, Yinka Shonibare, and Fanny Pascual. The event will run from March 19 to March 21, 2020.\n\n\nAs the coronavirus epidemic spreads across the globe, the Fódstrell Art Museum in Glasgow has been forced to cancel a number of exhibitions as a precaution. The institution announced on March 6 that it would not be able to present its “Nuclear Seasons,” a presentation of work by the British artist John Barlow, at the end of the first half of the month, and it has since been forced to move several exhibitions, including “The Painted World” (March 7–March 8), “The Painted World, ‘The Painted Walls,’ ‘The Painted Houses,’ and “Painted Rooms” (March 11–March 14), and", "The next Biennial should take place in 2020, and the third in 2021.\n\n\nThe Carlos Monroevski foundation in Milan has won the Italian pavilion at the Fifty-Ninth Venice Architecture Biennale, marking the first time that the show has featured two Italian artists in its forty-year history. The foundation was nominated for the award in 2017. Its work will be presented at the inaugural event in May.In a statement, the foundation said: “Carlos Maria Monroevski has been a central figure of the Italian pavilion, both as an architect and as a strategist. He has changed the face of architecture in many ways. In the seventeenth century he became the mentor of Piet Mondrian and of Mies van der Rohe; in the twentieth century as the leader of the Foscari-Milano architecture project; and in the twenty-first century as a leading partner of the Italian pavilion. I’m proud to be able to participate in such a remarkable history.”In a letter sent to the jury, Monroevski described the award as “a very special achievement for architecture. It is an inspiration for me and for architecture in general, and gives a new dimension to architectures that,", "The next Biennial should be in the spring of 2020. The museum is currently closed until March 11 due to the Covid-19 pandemic.  Diploma of Fine Arts: The exhibition will not be held in the institution’s home ground and will be presented in several other cities around the city. The next exhibition will be a presentation of works by artists who have worked in the region for at least fifteen years.\n\n\nThree years after the first edition of the Art Paris was canceled due to concerns around the pandemic, the venue is now back on. According to Le Monde, the event—comprising Carla Capozzi, Marco Mallori, and Agnes Martin—was supposed to take place in late May and runs through May 31. While the three artists were invited back, organizers decided to reschedule the event in order to “avoid contraindicating the health of visitors, businesses, and exhibitors.”A statement released by the arts space reads: “We recall that it is a difficult situation for an institution dedicated to art, artmaking, art exhibitions, and art projects, with an annual budget of more than $100 million. However, we have chosen to", "The next Biennial should be held in 2020. The first will be held in the United Kingdom in 2022.\n\n\nThe Metropolitan Museum of Art in New York has appointed Roberta Rampton as its next director. She succeeds Richard Armstrong, who retired in March 2019 following a five-year term that was interrupted by a devastating illness.“Ratliff is a critical curator who has shaped the Met’s collection and programming over the years, and has been instrumental in bringing the Museum of Modern Art and the Whitney Museum of American Art to life, both as art institutions and as educational institutions,” said Joachim Szeemann, head of the Met’s board of trustees. “Her work will serve as the nucleus for an ambitious new museum strategy and long-term plan that will address the challenges of the future.”Ratliff, who began her professional practice as an independent curator in Los Angeles in 1976, has been commissioned for a number of projects, including a commissioned exhibition about the work of Robert Irwin that will open at the Kunsthalle Basel in October 2019, and a four-year retrospective of the artist Alex Katz. She also has a book development and publication program that has been featured in the New York", "The next Biennial should be held at the San Diego Museum of Art, in 2020; the Museum of Contemporary Art (MoCA), in 2021; and the Metropolitan Museum of Art, in 2021.The 2019 and 2018 editions of the festival drew around ten thousand visitors and featured work by a variety of artists from thirty-seven countries and territories, including the US, UK, Germany, Italy, France, Spain, and Japan. It also welcomed the first-ever audience for the festival, which is organized in partnership with the Los Angeles County Museum of Art, and grew its audience through the sale of limited-edition works by artists such as Claude Monet, Laure Prince, Marc-Andre Corot, and Peter Hujar, among others.The festival will be hosted by the San Diego Museum of Art (SDMo), which is consolidating its holdings of Peter Hujar and Javier Téllez\u0097the cofounder of Masterpiece, the international contemporary art fair that was a part of the festival\u0097and is planning to open a new venue in 2020. For the next edition of the festival, the organizers are pushing the show back by three years to February 20, 2021.\n\n\n\n\n\n\nPeter Hujar, Laure Prince, and Marc-Andre", "The next Biennial should begin in the fall of 2020 and will focus on a new group of works by Italian artists in the city of Milan, one of the cities where, between the ages of twenty and fifty, the artist Ettore Cipolletta works most famously.The next exhibition will focus on the artistic practice of a group of artists who made the group exhibition in Rumaregretto, a small town on the Adriatic coast in the province of Piedmont, Italy. The exhibition will be curated by Gerhard Richter and will aim to present a selection of works in the city. The first show is currently on view in Milan.\n\n\nThe Art Newspaper has revealed that the tenth edition of the Art Basel Hong Kong will run from March 28 to March 31 in 2021. While the gathering was originally scheduled to take place in August, the venue was forced to cancel the event due to the Covid-19 pandemic. “We are extremely grateful to the city of Hong Kong, the Hong Kong government, the Hong Kong museum team, and the organizers of this year’s Art Basel Hong Kong, who gave us the opportunity to present our first show there since 2010,” ", "The next Biennial should be held in 2020. \n\n\nThe National Gallery in London is planning to move all of its exhibition space, including its main exhibition space, the Tate Britain, from its premises into a new public museum dedicated to the arts. As part of a £4.7 million ($5.1 million) award from the Turner Prize, the Tate will move the entire museum from its current location in Whitechapel, where it has been since 1970, to the new organization.According to the New York Times, the Tate’s former director, Joana Mpagi Sepuya, announced the move on Instagram, where she wrote: “I am so excited to open an entirely new museum dedicated to the arts in London with a new contemporary art exhibition every week, giving you a chance to see the works of our artists in person, and exploring the ideas behind their work.”While the museum will be housed in a converted warehouse, the Tate’s collection will be moved to the Tate Modern, a large refurbished building in west London, which opened on September 8, 2020. The museum will also have a new public park, the Tate Modern Gardens, which will be open from September 18 to September 20, 2020", "The next Biennial should be a major milestone for the city as it becomes the first South Korean city to host a major cultural event. It will also mark the centenary of the end of World War II and the 150th anniversary of the Diaspora.\n\n\n\n\n\n\nKara Swisher, the owner of the New York City–based photography and art gallery Redfern Gallery, was indicted on Monday by a federal grand jury on charges of fraud and conspiracy.According to the New York Times, Swisher, who runs a nonprofit arts space in New Orleans called the Art Lab, was under investigation for allegedly inflating the number of donations her business received from military contractors, inflating the number of works she sold, and forgeryuling invoices.Swisher allegedly gave the military-linked organizations the impression that she had direct relationships with the companies—that is, she was the only one who knew and trusted the details of their business dealings.According to prosecutors, Swisher used her influence with the companies to win contracts worth hundreds of millions of dollars. One of the companies, Raytheon, which also manufactures Raytheon TOW anti-tank missiles, gave the New York artist $50 million in 2006. That same year, Sw", "The next Biennial should take place in the spring of 2022. “Our goal is to create a platform that will encourage and highlight the creative and artistic potential of the local community,” said Architecture and Design Director Reinhold Bürgi. “We are also planning to create a new exhibition that will bring together innovative work by artists from the Biennale. The show will be in cooperation with the Nationalgalerie Bremen, which is currently preparing the exhibition ‘Beyond Design.’”Bürgi added that the exhibition will “establish a new level of discourse and focus for the exhibition, not only in the current exhibition, but in the exhibition in general.” The theme of the exhibition will be “Creativity, the Art of, and the Making of Modern Life” and will feature works by twenty-five artists, including Günther F. Stegl, Ilana Schor and Wolfgang Staudt, as well as a selection of early works by artists such as William Gass, Alex Kapur, and Ronald W. Cox.Sara Mayer, director of the Nationalgalerie Bremen, praised the work of the gallery and", "The next Biennial should take place in 2021 and its theme should be “Places and Objects.” The 2020 edition was organized by the Museum of Contemporary Art (MoCA), Los Angeles, and comprises 137 works by twenty-nine artists, including Gabriel García Bernal, Eva Hesse, Willem de Kooning, Agnes Martin, Jnana Pinchuk, and Shih-Chien Huang. The theme was chosen by a jury comprising David C. Drèze, chair of the museum’s Contemporary Art Department; Ed Moses, former chief curator of the Arts and Design Institute; and Pamela Sidah, curator of Modern Art and Design. The 2019 show, “Places,” was at the San Francisco Museum of Modern Art. The sixteenth edition, “The Unseen,” was at the Museum of Contemporary Art, Los Angeles, and the fifteenteenth edition, “The Body,” was at the Los Angeles County Museum of Art and the twenty-fifth edition, “Introduction,” was at the San Francisco Museum of Art. Artforum will have more on the 2019 event, which will kick off at 9 AM on Wednesday, September 3,", "The next Biennial should be held in 2021.\n\n\nThe Museums Association (MA), an international network of more than 430 international arts organizations, has announced that it is working with Warner Brothers on a new joint venture that will allow museums to bring their exhibitions and performances online in a manner similar to how HBO will make its programming available to the public in the form of a digital platform. The partnership will consist of the Warner Brothers Biennial 2014, the Warner Brothers/Maersk Container, and several other online initiatives and will be developed in partnership with Warner Brothers Mumbai, Warner Brothers New Delhi, and Warner Brothers New York.“We are thrilled to be working with Warner Brothers and MA in New Delhi, where we will present the Warner Brothers Biennial 2019,” said Sumantha Shah, executive director of the association. The exhibition will be presented as a digital platform for fans to enjoy the works under the Warner Brothers banner. The show will also feature digital versions of works by artists such as Richard Serra, Gault, and Rayyane Hossain. The show will be streamed live on Warner Brothers’s website—the same site that the Warner Brothers box office will host the biennial—and will be available for purchase from Warner Brothers", "The next Biennial should be held at the Stedelijk Museum in London; the Tate in London, the British Museum in Cairo, the Jerusalem Art Museum, and the Jewish Museum in Jerusalem; the Al-Azhar Mosque in Cairo; the Al-Hijra Museum in Beirut; and the Palais de Tokyo in Paris. The third Biennial will be held at the Al-Aqsa Mosque in Jerusalem from March 20 to March 23. The fourth will be staged at the Kunsthal Charlottenborg in Stockholm from March 23 to March 25. The fifth will be at the Museum of Modern Art in New York from March 26 to March 29. The seventh will be at the Museum of Modern Art in New York from March 27 to March 31. The eighth will be at the Museum of Modern Art in New York from March 28 to March 31. The ninth will be at the Museum of Modern Art in New York from March 29 to March 31. The tenth will be at the National Museum of Fine Arts in London from March 31 to March 31. The eleventh will be at the Museum of Modern Art, New York from March 31 to March 31. The thirteenth will be at the National Museum of", "The next Biennial should be held in 2020. The announcement comes amid a global health crisis caused by COVID-19, the virus that infected more than 1,500 people in the US and has since killed more than 6,000. According to the New York Times, the number of infections in China has increased by more than tenfold since it started phasing out outdoor activities in March. While the coronavirus has been blamed for exacerbating the outbreak, Dr. Richard Boss, a professor of medicine and health at the University of California, San Francisco, told the Los Angeles Times that the outbreak is probably the worst outbreak the US has experienced for decades.The coronavirus is spread mainly from person to person, but it can also be spread from animal to animal and from one human to another. The virus can also be spread by direct contact with an infected person's blood, from a sore throat, or from an infected object such as a utensil or a spoon. There is no vaccine or treatment for the virus. On Monday, the British Medical Association (BMA) declared the coronavirus a public health emergency and urged the British government to build emergency support for those affected by the outbreak. The BMA said that 400", "The next Biennial should take place in 2019 and will comprise two fully immersive works, constructed from both contemporary and historic materials, by two artists from the same family: the designer, Juliette de Serre, and her husband, Nicolas Julien de Serre. The first, Louis Vuitton Triton, will be realized within a vast, open-concept museum, whilst the second, LaToya Curran, will be visited by a group of friends in the small town of Saint Helena, near the city of Saint-Petersburg. “One works through a family’s stories, and the other through the stories of others,” said Michel de Serre in a statement. “Together, they create a new kind of story, one that is able to address thornier questions about history, about our place in the world, about our place in the universe.”\n\n\nThe Museum of Modern Art (MoMA) in New York has removed a controversial performance piece by the American artist and activist Maya Lin that was part of a larger exhibition of works by African American artists that was being organized as part of the “Outsider” initiative. The work, which was titled Black", "The next Biennial should focus on the theoretical and practical aspects of the Scandinavian work and art of the nineteenth century, as well as the reception of the twentieth century. . . . The theme of the year 2020 should be digital art, and the exhibition should be organized as a channel for the development of new ideas.”After the opening of a new exhibition at the Museum of Modern Art in London in August, the pavilion was moved to the National Gallery in the United Kingdom, which is part of the UK’s Department of Culture. The new exhibition will debut in January 2021 and will be inaugurated by the Norwegian artist Arne Glimcher.\n\n\nThe six-hundred-year-old SculptureCenter in Manhattan has announced that it will close its doors to the public in April 2020, following the completion of a major renovation project, the centerpiece of which is the installation of the 1000-year-old work Concrete And Steel: The Mother Of All Spires, at the center. The show will be moved to a new space in Manhattan’s Lower East Side.“The SculptureCenter has been an essential and beloved resource for generations of New Yorkers—and has grown and changed with the city, helping", "The next Biennial should take place in 2020.\n\n\nParis’s Centrale des Beaux-Arts, the prestigious, short-lived, and now-defunct arts center located in the city’s rue Lafayette, is suing the city of Paris to regain the $18 million it invested in the space in 2017. According to Le Monde, the lawsuit is the latest attempt by the city to reclaim some of the $20 million invested by the Parisian region in 2006.In a statement on Friday, the city claimed that it is “committed to fulfilling our obligations under the contract, regardless of the outcome of this lawsuit.” The courthouse, which is currently closed until April 22, is currently used as a venue for legal proceedings.In a statement, the city said: “We’re going to defend ourselves with the legal means necessary. We’re going to continue to grow the platform for creativity and art in the heart of Paris, while continuing to try to address the gaps in the arts center.”\n\n\nJulie Andrews, the British artist best known for her surrealist paintings, sculptures, prints, and sculptures that explore the relationships between the body and the universe, has died at", "The next Biennial should take place at least ten years from now. \n Artforum reports that the museum is currently preparing for a possible shutdown over the exhibition “Theater of Operations: The Gulf Wars 1991–2012”; a retrospective of artworks by artists such as Michael Kistler, Kiki Smith, Paul Gauguin, and Joan Mitchell; a follow-up exhibition focused on the work of Carol Donoghue, Diana Freda, and Mary Cassatt; and an adaptation of the book by Sir Richard Avedon.The “eventual shutdown of the museum, as we know it now, is simply the culmination of three years of research and reflection on where we are in the twenty-first century.” Prior to its shutdown, the museum has been working to develop a new biennial that would take place every eight years. The first phase of the project, titled Art of the Future, was launched in 2017 and was given the greenlight by the museum in 2018. The exhibition was initially scheduled to run from March to September 2020, but was pushed back to October 2020 to reduce disruption to visitors. The sixth and final phase, titled Days of Destruction, was originally scheduled to run from October 20 to", "The next Biennial should be held in the spring of 2021.‒\n\n\nThe History Museum in London announced today that Victoria Miro, the current director of the Museum of Modern Art in New York, will be promoted to the role of director of the Prince Albert Museum in Germany, the Kunsthalle Basel in Switzerland, and the Dresden Art Museum in Germany. Miro—who has been the director of the Italian Renaissance museum in Rome since 2016—was also appointed principal curator of “Zurich,” a new exhibition planned for 2019. “The appointment is a significant step for Miro, who has been nominated for the Nobel Prize in Art in 2018, and a significant step toward realizing the ambitious projects we have been working on,” said the museum’s director, Elizabeth Anagnos. “Miro’s appointment demonstrates the breadth and depth of her experience in presenting contemporary art and architecture in Germany. Her appointment marks a new chapter in the life and work of the museum and the development of its collections.”Miro succeeds John McClean, who retired after ten years at the helm of the museum in March 2019. McClean, who was hired to lead the museum after he departed the", "The next Biennial should be held at an unclassified museum—such as the Smithsonian Institution in Washington, DC—as soon as possible. The institution could also move the exhibition from its current location at the Brooklyn Museum and move it into a new building that would house the exhibition until the 2020 event. The deadline for the event is March 16. In an attempt to encourage more diversity in the field, Arts and Arts Week is giving $1 million to twenty-three artists who represent African and Afro-Caribbean traditions in the United States.The twenty-three artists are: Adriana Berrada, Nelson Báez, Susana Díaz, Sara Ging, Hannah Kremer, JASMUSZO J. B., Leandro Larraín, Ebony Linn, Gianluca Lippi, Cynthia Mallyen, and Lucia Moser. “We are enormously grateful to the staff and supporters of the Biennial for their dedication and perseverance in bringing this exhibition to fruition,” said Paul Ma, director of the Biennial and the Art Institute of Chicago. “We are currently working collaboratively with our", "The next Biennial should be held at the Museum of Fine Arts, Boston, in 2021. \n\n\nThe Museum of Fine Arts (MMA) in Boston has added four new artists to its curatorial staff: Alex Birnbaum, Sebastian Lewis, and Josephine Piazza. Birnbaum, a Pennsylvania native and British-born New York–based artist, is the first to join the staff in its nearly seventy-year history. He was selected to curate the first Biennial in the United States by director Robin Engstrom in 2006 and has been given a collaborative role with the museum.“We are honored to be able to welcome these four exceptional artists to our team and to develop new and exciting ways to support their work,” said director Matthew Lubin. “Their collaborative approach will be crucial as they collaborate on future projects and will shape the exhibition program with whom we will collaborate in the coming years.”\n\n\nAs Hurricane Irma continues to push the United States toward a potentially catastrophic tally of more than 130 deaths in the coming days, the museum of the arts in the capital city of Dublin, which was forced to temporarily close its doors after the Category 4 storm made landfall on September 5,", "The next Biennial should take place in 2022. The first Biennial was held in 1964. In 1998, a new fifth Biennial of the Arts was organized in Oslo. The first event was a triennial, held in 2005. The inaugural Biennial of the Arts was held in New York in 2009, and the eighth was held in Los Angeles in 2011. The biennial of the arts was chosen by a jury comprising Nick Hornby of the Arts Council, Kate Fowle of the Los Angeles County Museum of Art, and Orli Sloth. The artists selected for the next edition were Corinne Bocher, Tanya Gamboa, Pia Camil, Petra Højström, and Jim Freeman. The event will be hosted at the San Diego Museum of Art. The first edition, held in the area between Venice and Sant'Arte della Dogana in Italy, was awarded the Golden Lion at the Venice Architecture Biennale in 2017. The 2021 edition, which was staged in Paris, was awarded the Pulitzer Prize at the Art Biennale in 2006.\n\n\nThe exhibition “All That Remains” will return to the Palais de Tokyo in Paris", "The next Biennial should be held in 2020.<|endoftext|>Here we are again. Two years later, and still no resolution. We return to the vortex of despair, withdrawal, and frustration that characterized our first year as a nonprofit organization. This year is no different. Despite the best efforts of our staff, fundraising efforts, and board to keep our doors open, our building, by design, closed for a month. Our team worked tirelessly to create a brand new program this past January to support the immediate needs of our artists—and the board agreed that it was the most important gesture we could have done to help them. The first program we set up was a monthlong residency program that launched with the launch of the new arts and cultural hub at Jadie’s Place in August. The artists developed a new exhibition, “Beyond the Walls,” to accompany their first exhibition, “Thinking About Display,” which was held in collaboration with the central gallery in January. The show, which was organized as a massive public art project, brought twenty-six artists to the boroughs in early March. While the biennial was a success, it was short-lived: by March, the number of entries had dwindled to eighteen.", "The next Biennial should be held in 2020. \n\n\nThe French Ministry of Culture has issued a ban on the exhibition “Les Demoiselles”—a title that translates roughly as “the beautiful and the strange” in French—at the Musée d’Art Contemporain (MAK), in Paris, France, on September 2. It also ordered the closing of the museum’s auditorium in the event that the exhibition is not canceled.The institution has since been forced to temporarily shutter the entire exhibition. The Ministry of Culture says that the decision was reached when the institution decided not to cancel the exhibition under the conditions set by the museum. “A number of cultural institutions are having difficulties because of the recent political upheaval and political instability in France,” the ministry said in a statement. “The ministry of culture has therefore taken the decision to restrict the exhibition ‘Les Demoiselles’ in its entirety, and to proceed with all remaining activities,” the statement read. The decision was made on August 28, three days after the thirty-three-year-old artist, who went missing on January 28, was found dead in his apartment near the French", "The next Biennial should be held at the Isle of Wight in the UK.  The theme of 2018 was: “Life Beyond Death.” The 2019 version will be: “An Exploration of Life Beyond Death,” an exploration of the possibility of life beyond death through the lens of transhumanism. The organizers are also planning to hold a joint exhibition at the Palais de Tokyo in Paris in 2020. However, the festival’s executive director, Christophe Morin, said that the exhibition would not take place until 2024.“The time for the exhibition is now,” Morin said. “We have been working to create a platform for the discussion of the future in a way that would not come across as a religious event, but one that would be about the life and activities of each day.”\n\n\nThe Pérez Art Museum Miami (PAMM) has received a $5 million donation from the Miami-based arts organization Miami Canvas, which was founded by the Pérez family in 2014 to expand the collection of contemporary art. The gift includes $2 million for the construction of the Pérez Art Museum Miami’s first permanent house of art, the", "The next Biennial should take place in the summer of 2022. The next exhibition should be scheduled for the fall of 2022.”The museum has been working on revising its programming for several years, and last year, it reworked its show “Into the Abyss”\u0097a biennial exploring black art\u0097in order to include more historical black artists. The exhibition was slated to open in London the week of March 14.A statement from the museum said that the change “expands our understanding of and appreciation of the history of art, drawing from the Black African experience and reflecting the urgent need to address systemic racism and the effects of colonialism,” and that the new “Into the Abyss” will “add a new dimension of art for our understanding of the African diaspora,” with “a global perspective,” which will “provide an opportunity for us to continue to integrate and reinterprete art from Africa,” as well as “a new way of looking at art,” the statement reads.In an interview with Artforum last year, Stanley Blackwood, a senior curator at the African American Museum in Atlanta, said that “there", "The next Biennial should be held in 2021, and the 2020 event will be held in 2022. The 2019 event, which was organized by the same artist-run organization that organized the biennial (“Hello!”) was marked by a number of collaborations between the artist-run agency and various galleries, including Larry Fadojuki, Jonathan Sosko, Jean-Michel Basquiat, and Pilar de Biem (two o’clock), as well as by a number of digital platforms, including Creative Commons, Google SketchUp, and Themes.Devoting an entire exhibition to popular culture, she created a transmedia installation for the biennial entitled “Spiral Paths: Stories of Art and Technology,” which will open at the Museum of the Moving Image in New York next month, and a presentation of works by artists such as Anatole Shagal, Raed Jumila, and Wangechi Mutu.The biennial is an extension of the work of the same artist-run organization that was created to promote the work of contemporary African artists. She was invited to create a show about contemporary art in the United States, and in April 2019, she accepted the invitation to", "The next Biennial should take place in the United Arab Emirates in 2022, and will organize its first exhibition in the country in 2021. The exhibition, titled “Luna,” will commemorate the artist’s twenty-second birthday and will be based at the Dubai Art Museum.\n\n\nDutch firm Exotek has received a major $100 million donation from the König-Richelson Foundation for Contemporary Art, the Berlin-based philanthropic organization which supports the development of contemporary art in the Netherlands and is currently the largest funder of contemporary art in the world. The gift will enable the firm to develop new projects with the König-Richelson Foundation in collaboration with the König-Richelson Kunsthalle, which has historically hosted the artist’s biennial, from 2020 to 2021.“The König-Richelson Foundation is a very important donor to the Dutch culture,” said Richard König, the founder of the firm and an art historian. “This donation truly completes our collaboration around the König-Richelson Kunsthalle in collaboration with the König-Richelson Foundation. It is thrilling that we are", "The next Biennial should be announced within the next three weeks.\n\n\nThe Paley Center for Media in New York has released the list of ninety-eight artists who will participate in the second edition of the Paley Center for Media, which will take place at Rockefeller Center from May 10 to May 12. The seventy-six artists selected for the exhibition, titled “Magic for Me,” will open at Rockefeller Center on May 8 and will run until May 10 at full price.With the first installment of the center’s “Television: Inside the Studio,” curated by Daniel H. Pink and Peter Gregor in 2006, art historian and critic John Akomfrah wrote: “The Paley Center for Media’s Paley Center for Media 2: The Untold Story, 1999–2008, is a breath of fresh air. It’s a powerful reminder that the medium itself—and the mediums creators—are as much a part of the human experience as we are.”The twenty-three-person jury that selected the sixty-seven-piece jury\u0097which included artist Berenice Abbott, art historian and curator Matthew Levine, and art historian and critic Christopher Knight\u0097accord", "The next Biennial should draw from a range of fields in order to highlight and celebrate the spirit of Italy and its people. The themes of the exhibition should be the continuation of the themes of the previous two Biennials, the first being the theme of the pavilion, the second being the theme of the exhibition itself.\n\n\nTwo years after an independent curator, Guadalale del Mar, “disproportionately accused Frieda Kandis and Alejandra Ibarra, among others, of neglecting to include women in their exhibitions,” a congressional investigation has concluded. The congressional inquiry published its findings on March 20, 2017, in the Federal Register, and found that the Kandis–Ibarra case was “complex and difficult,” and that the exhibition at issue “wasn’t a show about the work of women, but a personal statement about the artist’s identity.”The exhibition was a performance of a piece entitled “Sun, Wind, and Rain,” which was presented by artist Maria Amedeo in honor of International Women’s Day, and it was held on November 6, 2011, in the city of Guadalajara", "The next Biennial should take place in the spring of 2021. The exhibition will mark the twenty-fifth anniversary of the foundation and will introduce new works by some of the artists represented in the collection.\n\n\nThe Museum of Contemporary Art (MoCA), London, has listed ten new works by artists whose projects are currently being staged across the United Kingdom. Among the works that will receive a retrospective at the institution are Ali H. Ali for Wilde, The Art of Touching, 2018; Carolee Schneemann for Art of the Garden, 2017; Anna Atkins for the Art of the House, 2017; and Alia Alsop for Art of the House, 2017. The ten winners of the 2020 biennial prize are: Arika Baranek, 2017; Matthew Barrow, 2018; Ashley McKay, 2018; Gavin McClelland, 2018; Kathrin Nicolai, 2019; Larissa Rosenfeld, 2019; Vincent van Gogh, 2019; Anna Atkins, 2019; Teresa A. Graziani, 2019; Eleanor Clifford, 2019; Nina Oxtoby, 2019; ", "The next Biennial should be held in the autumn of 2020. In a review of the work in this week's issue of the Paris Review, Christopher Booker writes: Art historian Rosalind D. Steyn, in an essay on Thomas Meeuwen’s Art and Theory , argues that the history of art is history of art, even if only as a history of the human body. ‎\n\nLes Architects Et Les Lettres (LETS) has announced that the second edition of the annual Gropius Prize will return to the German city of Cologne, where it was first held in 2007. The event, which celebrates creativity and sustainability, will begin on March 18 and run until March 20.In the lead-up to the work’s first edition, in 2007, LETS was one of the first artists to stage a massive collaborative project, called “Kunsthalträge,” in the shadow of the Brandenburg Gate, to coincide with the September 12/13 edition of the annual exhibition in Cologne. The show—which featured 280 works by sixty-six artists from twenty-nine countries—wasn’t a success, but it marked a turning point in the artist’s", "The next Biennial should focus on the history of the exhibition and showcase the work of those who have devoted their lives to the study of the exhibition. The first exhibition is Coming Soon. I want to see the exhibition in its entirety. I want to see the exhibition in its entirety. With the help of a small staff, I want to create a new story that will draw the imagination of the public and symbolize the extraordinary possibilities of art.”On the commissioning of a work by the Cuban artist Héctor Vazquez: “I approached him about the proposed exhibition in his studio, and   he accepted me with great enthusiasm. For ten years we have collaborated and collaborated together. The exhibition will continue to be a reflection of our shared experience and of our mutual admiration.”\n\n\nThe European Art Museum (EIM) in Paris has appointed Sarah Loter, an American scholar who specializes in modernism, as its next director. She succeeds Mary Creagh, who retired in March after eighteen years at the helm of the institution, and will assume her responsibilities on December 20.“We are extremely pleased that Sarah will be our next director,” said EIM director Nathalie Haag. “Sarah is a brilliant", "The next Biennial should be canceled and the board of trustees should meet as soon as possible to discuss the best way forward, including the possibility of rescheduling the exhibition. The museum’s collection, which consists primarily of artworks dating from the 1930s to 1960s, has been on indefinite hiatus since February 2018.Amid the uncertainty, the exhibition will be closed until March 27, with the opening of a new exhibition taking place in the spring of 2020. “The exhibition was never meant to be a permanent solution to the institutional and structural conflicts in museums,” said architect and curator Victoria Siddall. “The exhibition is a prelude to a much bigger project, which will resolve the conflicts associated with the exhibition.”\n\n\nThe British sculptor Pilar Corrias has been named the winner of the £50,000 Corrias Award, which was established by the Corrias Foundation as a way to encourage British artists to reflect on their own legacy through their practice. Corrias, a long-standing supporter of British artists, notably Frank Gehry and Tadao Ando, who are best known in the United States for their work in the construction and installation arts, was selected for his work on the", "The next Biennial should be held in 2020. The event will present six of the work’s artists, including Alice A. Johnson, William Eggleston, and Arthur J. Isoh. The same year, the Museum of Contemporary Art (MoCA), San Francisco, will hold an exhibition of the work, titled “The Future Is Only a Dream,” and will celebrate the centenary of the event. \n\n\nThe Trojan Horse Project, the nonprofit dedicated to preserving and promoting the work of the Los Angeles–born artist Alice Aycock, has received a gift of $145,000 from the Kiyohiro Nakayoshi Foundation. The foundation is also giving $150,000 to the artist’s heirs. The gift is part of a larger initiative to support artists and their families in the United States who are buried in a Los Angeles cemetery.The foundation is also creating new scholarships for artists who are buried in Los Angeles’s San Fernando Valley. The scholarships will offer up to $100,000 to local students. The mass grave of Arturo Toscanini is currently managed by the Los Angeles County Museum of Art.The foundation raised the funds in partnership with the Los Angeles City Council", "The next Biennial should take place in 2021, with the first exhibition, “The Shape of Water,”—an early concept work that reappears in both a glass vessel and a painting that is inspired by the ceramic in the glass. A second exhibition, “live from the laboratory,” will open in 2022. The 2020 editions featured works by forty artists, including Glenn Ligon, Johannes Gimpels, and J. M. W. Teicher, and were held at the Guggenheim Museum in New York.\n\n\nThe Tate’s board of directors has approved the transfer of two-thirds of the remaining shares of the company, British Petroleum, for $7.5 billion. The Tate’s shareholders voted in favor of the restructuring plan, which involves the sale of more than 100,000 shares of the company at a price of $10. The sale took place on Friday and will see the rest of the shares transferred to the National Poetry Library (NPALS), a nonprofit organization that helps writers and poets in Britain.“The board has voted to sell off around 6,500 shares, or about 60 percent of the outstanding shares, which will now go to the library, which will then lend", "The next Biennial should take place in 2022 and the first in 2020. The 2019, which opened in October, featured work by thirty-four artists. The exhibition is organized as follows: Food and Cooking: Garden of the Mind We are currently working to prepare two additional pavilions, which will open in 2020 and 2021 respectively. The first will have the works exhibited in their original context; the second will be a new work in the theme “The Situation in Art”Agency and Agency: From the Documentary to the PresentDay The exhibition will focus on the twentieth-century relationship between art and photography and will present a selection of photographs by the artist Klaus-Ulrich Mozes. In the process, the exhibition will introduce an innovative concept of continuity. Art Museum and Library, New York: The museum is planning to open in 2021 and the library in 2021.  The museum is also working on a new series of exhibitions.  Bergen, Larsen, and Frank, New York: The three-hundred-th anniversary of the artist’s birth is now upon us. A new exhibition of work by the artist is currently on view in the museum.The artist will", "The next Biennial should be in 2021. “I am very excited about the program, the upcoming exhibition, and the site,” said architect Niccolo Bonisoli, the president of the Italian Association of Architects. “The new exhibition will be a collaboration between the artist and the museum, matching the authenticity of the museum.” \n\n\nFrench president Emmanuel Macron has announced that the country will move to cancel the 2022 edition of the Art Basel (AB) World Fair Paris, which was set to kick off on June 9 and run from March 23 to March 27. The move is part of a wider strategy to reshape French politics and culture in a more centrist, pro-business light. According to the New York Times, the move will also cut the length of the fair by roughly three weeks, and will eliminate the costs of shipping works across the Atlantic to the United States, a move that will likely save the exhibitors $20,000 on labor costs.The announcement follows months of political brinkmanship between the newly elected president, Emmanuel Macron, and the country’s major art dealers, the Corbis Group and Christie’s, over the fate of the fair, which is supported by the", "The next Biennial should be a celebration of the year 1963. The theme of the year is “The Present.” The 2020 event will showcase the work of thirty-seven female artists, including MOS and Jodi Throckmorton, an African American artist whose studies focused on the effects of race on black bodies.Throckmorton said: “I was just watching a documentary about an African American artist who was about to start a solo exhibition at the Museum of Modern Art in New York. It was about the artist who was about to start in the South Bronx and be the first African American artist to open an institution in the United States. I had the opportunity to meet him and the work in the exhibit. It was a joy to discover his work and to work with him.”Franz Schubert was nominated for a Pulitzer for his photograph series “The Seven Sisters,” 1963–1963, which was featured in a retrospective at the Museum of Modern Art in New York in 2011. The 2013 exhibition “Exhibition: Representations” was at the National Gallery of Art in Washington, DC. That same year, the National Endowment for the Arts awarded the Turner Prize to eight artists, including Jamie Hew", "The next Biennial should be held in 2020, in the future. “The Art of Life: Climate Change and the Art of the Body in Art of the Plains,” which will take place in the city of Haus de nata in central India, is one of the themes of the forthcoming exhibition.\n\n\nThe Academy of Fine Arts (AF) in Vienna and the Austrian State Art Archive (SAA) have partnered to create the largest collection of artworks ever assembled. Presented by the Austrian State Art Archive, the exhibition, which will also include works on paper, will be inaugurated with a special reception at the Academy of Fine Arts on May 29. The show will also include a reconstruction of the Art of Life, a major work from the late twentieth century, and an exhibition of the works of unknown artists.The partnership, which was conceived by the respective leaders of the Austrian State Art Archive and the Academy of Fine Arts, Reinhold Kremer and Wolfgang Popper, was announced after they celebrated the acquisition of one of the most celebrated works of the Art of Life, a monumental Victorian painting by Robert Mapplethorpe, which has been held in the collection of the Austrian State Art Archive for more than forty years.“This", "The next Biennial should open in 2020 and will consist of the first exhibition of work by thirty artists, including Alexander Calder, Alighiero Cattelan, and Eulogio Castelli.\n\n\nItalian curator Stefano Cervetto has announced that the forthcoming fifty-ninth edition of the São Paulo Triennale will be held in Milan between March 15 and March 18. Curated by Gio Ponti, the Italian director of the Museo d’Alto Medio Emporano, in collaboration with a group of curators led by Adrian Brodsky, the exhibition will feature forty-eight works curated by the fifteen core artists - Enrico Cipolletta (Algeria), Riccardo Cipolletta (Italy), Paolo Cipolletta (Italy), Stefano Cervetto (Italy) and Marta Cipolletta (Italy)\u0097the latter two have previously staged the festival in Lucerne, Switzerland, and Venice, Italy.The triennial’s inaugural edition, “The Prada Years: Art in the Age of Prada” (2019), featured works by forty-three artists, including Arsenale Zingare", "The next Biennial should be held in 2021. The 2020 edition was held in June. For the next two years, the museum will host a series of exhibitions devoted to the art of the time, including “Saul Levey: From European Tear to American Tear” (2019); “Frank Luigi: The New American Art” (2019); and “The Philippines: A Modern History or a History of a Nation?” (2018). The museum will also present a retrospective of the work of former director Edgar Casto in October 2020.\n\n\nThe Galerie Lelong-Boucher in Paris, which has hosted several acclaimed French and international artists over the years, is planning to close its doors permanently in May 2020. The move will affect more than 1,800 artists who are represented by the gallery\u0097the space currently hosts around eighty engagements annually\u0097as well as the roughly 500 employees of the Galleria Lelong-Boucher.According to the New York Times, the closure of the gallery follows the announcement last October that it would cease operations. The news marked the end of an era for the gallery, which is best known for its exhibitions of work by Pierre and Georges Boucher, Jean-", "The next Biennial should be held at the location of the former Auschwitz concentration camp in the city of Oswiecim, in the province of Lublin, Poland. In January 2019, the museum held its first exhibition dedicated to the life and work of the late Polish artist Biłońsław Miściński. In May 2019, the museum also revealed the exhibition “Biennies II–2017”, a new series of projects inspired by the artist’s work, and the exhibition “Yevgeny Zemljajewski: A Biennial History” (2019) at the museum.In January 2020, the museum received a gift of more than fifteen thousand photographs taken by the late Polish photographer Wojcie Powełński. Since the museum has previously displayed the works of the late Polish architect Ado Blagow in the past, the museum decided to give the photographer a retrospective in 2020, with the support of Filipina designer Rosalind Kraus, who designed the event. \n\n\nThe Museum of Modern Art (MoMA), in New York, has announced that it is reopening to the public on November 25. The reopening coincides", "The next Biennial should take place in Beijing in 2020. \n\n\nThe Zeneca Foundation, a New York–based nonprofit, has received a donation of nearly $1 million in support of its acquisition of fifty artworks by the artist Susanne Voss and the Berlin-based artist Leonor Antunes. The donation, which was made in partnership with the Glenn Foundation, was made in recognition of the work’s exhibition at the Glenn Museum of Art in 2014, and the biennial’s opening in 2019. Both women are known in the art world for their monumental, multi-million-dollar works, which are often on view in their respective exhibitions, “Theater of Operations: Art of War in Vietnam 1941–1945” (2019) and “Theater of Operations” (2019), and are also known for their work in two other venues: the Getty Center in Los Angeles and the Metropolitan Museum of Art in New York.The gift includes works by Voss, Antunes, and Kílmán Polsár, each of whom will receive $350,000. In addition, the Foundation will establish the Ilštún Museum of Contemporary Art in Ilštún, a museum", "The next Biennial should focus on the structural and biological changes that have taken place since the end of World War II, and on the implications of that for future trajectories. It should also include a survey of current scholarship and practices, including a review of the current exhibition “Wangechi Mutu: The Next Man” at the National Gallery of Art in Seoul.The event is currently on view in the National Museum of the African Diaspora (MMAD) in Athens.\n\n\nThe Jean-Luc Berlioz Foundation (JLBF) and the Joint Centre for Scientific Research (JCSR) in New York have announced that the fifty-third edition of the Biennale de Lyon will mark the centenary of the Italian Jewish museum, founded in the former Prada factory and opened by the Giuoco brothers in 1989. The exhibition will highlight the work of the four artists who have transformed the space into an art museum: Maurizio Cattelan, Piet Mondrian, Simone Leigh, and Robert Mapplethorpe.The theme of the event will be “Art and the Body: From the Centenary to the Present” and the five artists nominated for the award will be announced on November 27. The", "The next Biennial should be held in January 2021. The Palais de Tokyo in Paris will host the event, which will be hosted by the Institute of Architecture in Paris, on February 28–March 6.\n\n\nNew York City’s Metropolitan Museum of Art (Met) has appointed Lauren O’Leary its new deputy director of exhibitions and exhibitions design. O’Leary will be responsible for the development of exhibition and exhibition design across the museum, including the redesign of the Andy Warhol–designed Warhol and Frieze pavilions, the overhaul of the Met’s National Gallery, and the development of new programming.“With a deep and specific history serving both artists and communities, Lauren brings an extraordinary breadth of experience in art and design,” said Met director Neal Benezra. “We are thrilled to add her to our team, and look forward to working with her. Lauren’s built a strong professional network around high-quality contemporary art design through her internationally acclaimed exhibitions, and we are confident she will continue to advance the museum’s vision.”O’Leary comes to the Met from the Museum of Modern Art (MoMA), where she has served as associate curator of modern and", "The next Biennial should be held at the Museum of Modern Art in New York in December 2020.\n\n\nTatjana BONAS, a Brazilian artist and educator, has been selected to represent Brazil at the Fifty-Ninth Venice Biennale in May 2021. The artist, whose practice ranges from painting, sculpture, performance, and photography, will portray Brazil in her work.BONAS, who lives and works in Rio de Janeiro, will portray Brazil in “White Cube” (2018), an abstract work on paper, which is based on the Brazilian folk tale of the White Cat (Báia da Catarina) and the Black Cat (Zinedine Zidane), which is a reference to the Spanish novelist and poet José Maria Marin. In the same year, BONAS will publish her first book, “The Life and Death of Black Cat,” about the Brazilian artist and poet, and a “portrait of the artist” (2018) will open the Museum of Contemporary Art in Ciudad Real, the state of Rio Grande do Sul. The work will also be included in the upcoming edition of the Fifty-Ninth Venice Biennale, which will take place at the Venice Bi", "The next Biennial should take place in the spring of 2021. The official announcement is expected by the end of the year.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced that it is planning to move the Greater African Museum of Art (GAWM) from its current location on East Twenty-Third Street to a new facility located in the East Village. The institution has been in a long-overdue expansion in recent years, but the $900 million overhaul, which is slated to be completed in 2021, is expected to result in significant delays, including the 2019–20 season, which is slated to end in March.The civic-minded move comes amidst a cultural revival in New York City, which has seen a precipitous jump in arts and cultural activity in the past twelve months. According to the Art Newspaper, the city also reported a 23 percent increase in the number of visitors to the museum, which is presently closed due to the Covid-19 pandemic. The move to a new home is being made in recognition of the museum’s role as an important cultural draw for the Greater East Side, the Bronx, and the South Bronx, as well as its significant collection and holdings of African art.“GAWM plays a", "The next Biennial should be held in April 2021. The seventy-fourth is expected to take place in March 2022.\n\n\nThe Smithsonian’s National Museum of African Art in Washington, DC, has announced that it will reconfigure its existing outdoor space in honor of the institution’s centennial in 2022. In a statement, the museum said: “The change will involve a number of changes but the most important is a redesign that reflects the core mission and vision of the Smithsonian. We will launch with a new and refreshed collection and a new generation of leadership, including the first African-American head of the institution, a woman appointed to the board of trustees, and an African-American curator selected to lead the institution for a fourth time.”The redesign, which is part of a larger $3.8 billion overhaul of the museum, will include the installation of two new works, “Uncanny: ‘Ascension,” an experiment in black and African art, and “How African Artists Reconstructed Western Art,” a collaborative project between the curators of the first two biennials, Joseph and Lissa Greaves, as well as the curators of the third.“Contemporary", "The next Biennial should take place at the National Gallery of Canada in Ottawa in 2021. \n“We know that the museum is a diverse and challenging environment. We know that we need more collaboration, more creative engagement. We know that we need to have more financial accountability. We know that we need to invest more in our staff and our programs,” Museum Director Deborah Rich said in a statement. “We’re also determined to take bold and innovative new approaches to our exhibitions, our exhibition-going experience, and our collections, and to redesign our buildings in ways that support our mission.”The Biennial will feature works by fifty-eight artists who have been selected for the inaugural iteration of the Virtual Museum. The selected artists are: Agnes Martin, Joan Miró, and Maria Lināny, and the twenty-eighth panelist is Julia Serpell, who will be given a solo exhibition at the Noguchi-Skirball Gallery in New York City in November 2019.\n\n\nThe Göttingen Biennial for Architecture and Design (BFAD) in Germany has awarded $29,000 to Eighteen-year-old Georges Antoniades, who val", "The next Biennial should take place in 2022 and will be hosted at the Paris Museum of Modern Art (VM), the Parisian O2 Arena, and the Centre Pompidou. An open-concept design by the architect Zaha Hadid will also be featured in the exhibition. The theme of the next edition will be “Agriculture and Design in the Age of Mechanical Reproduction” and will be unveiled in January. “We are thrilled that the twenty-third edition of the Biennial will be hosted, curated, and organized at VM, the Centre Pompidou, and the Museum of Modern Art in New York, and are honored to enhance its international reputation and reflect the rich and vibrant international spirit of Paris,” said VM director Marie Billeaud. \n\n\nThe Burundian artist Dabo Tsereteli, whose self-taught, three-dimensional works are filled with references to African art and his native Kinshasa, has won the Prix d’Art Contemporain in Paris. The $150,000 prize was awarded to Tsereteli, who will represent Burundi in the exhibition, “In Search of a Nation,�", "The next Biennial should be held at the LA County Museum of Art, which recently announced that it is now accepting solo presentations of works by Iván García’s La Tercera and Guadalupe García’s Huelva; Julia Baird’s The Aparosa Project, which eschewed the central figure in its studio in Albuquerque, New Mexico, and instead focused on a group of women whose bodies were reimagined by the artist into the forms of butterflies, flowers, and fruit; and the upcoming exhibition “The Earth Found Art,” featuring work by fewer than 150 artists from the global civilizational tradition, is currently on view in Santiago, Chile. “The planet is ready to be shared,” said Kit Harrington, the chair of the 2018 exhibition. “The arts environment will thrive and thrive with the release of the next biennial. I look forward to a new and dynamic year with the biennial at its center and to seeing it through to completion.”\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles (LACMA) has become the latest institution to temporarily shutter over the last few months as the coronavirus epidemic reached other parts of", "The next Biennial should take place in the fall of 2020. In the meantime, the Museum of Contemporary Art (MoCA) in Los Angeles is preparing to reopen in the spring of 2021. “We are committed to making this event as accessible as possible,” said Jean-Baptiste Blouin, the director of the Museum of Contemporary Art. “It is our hope to be able to present the next edition of the Biennial in April, 2021. Our current exhibition schedule reflects this. The exhibition of the Biennial at the Museum of Contemporary Art will launch in January 2021 and will continue on until September 2021.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is preparing to reopen in May 2021 following a $500 million expansion, described by architect Daniel Libeskind at the time as “a new kind of museum,” the Los Angeles Times reports. The overhaul of the institution, which was initially scheduled to kick off in June, has pushed the opening date back to March 2022.According to the Los Angeles Times, the full extent of the renovation, which involved the removal of several thousand pieces of art from its collection and rearranging of its exhibition floor, signage, and program, will be", "The next Biennial should take place in early 2020. \n\n\nGallery Tourists are being urged to stay away from the Auckland Art Gallery (AAPG) this weekend as it reopens following a $100 million expansion. The redevelopment, which added an additional gallery space and added an additional exhibition space, will increase the gallery’s exhibition space by 15,000 square feet. The expansion is believed to have boosted the capacity of the building by 10,000 square feet, raising hopes of more shows depicting contemporary art.The exhibition space is being described as an extension of the gallery’s existing standing in the city, which has a population of around 2.2 million people. This will mark the second time the gallery has been re-opened since the construction of its New World, a new exhibition space located in the former Ohau Power Station, began in 2001. The first re-opened in 2007.The first exhibition, “Seconds,” was created by contemporary art artists Ali Jumabong and Jennifer Hunt and was on view until March 13. The program will remain on view through April 23. The exhibition will also be featured in the 2019 Auckland Biennial, “Echoes from the Earth,” which will run", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Sandra Shoup, who has served as the curator of American art in the United States and Europe since 1987, has been promoted to curator of modern and contemporary art in the United Kingdom.Shoup will assume the curatorial role of the institution’s director after the end of the institution’s forty-year tenure, which is slated to run from March 20 to March 22, 2021. She succeeds Simon Laski, who left the institution in March 2019 to head the Metropolitan Museum of Art, and will begin her tenure in the summer of 2021.“In his introductory remarks, Dr. Shoup said: “One of the highlights of my new role is working with so many talented and talented artists. The museum is fortunate to have a deep, distinguished roster of contemporary art and design artists who have inspired and defined our museum’s role and mission. I’m honored to lead their international journeys as they work to redefine the future of art and design in the UK.”“In the coming years, we will have a new director at MoCA who will take the MoCA brand", "The next Biennial should focus on the importance of exhibitions and meetings in revitalizing the city’s art galleries. The 2018 edition, which opened on December 14, was mixed and featured only a handful of exhibitions. “We cannot and will not accept that many galleries are not contributing to the City’s vibrant cultural scene,” said Mayor Randall Woodfin, who served as chair of the biennial’s creative and cultural committee. “We have to be creative and we have to be innovative about how we create new opportunities for galleries to contribute to our community.”\n\n\nThe American Alliance of Museums (AAM) has released the list of the seventy-ninth members of the International Council on the Visual Arts (ICVA), which comprises seventy-seven American arts and cultural organizations. “ICVA provides a unique opportunity for our member organizations to collaborate and share ideas and experiences as we engage with the latest exhibitions, programs, and initiatives from museums around the world,” said Todd Bronk, director of the AAM. “We are grateful to the Council on Contemporary Art, the Board of Trustees, and all of our members for their constructive feedback and encouraging the exhibition and program", "The next Biennial should present a proposed concept which is based on a combination of idealistic ideals and practical realities. Such a project should be based on an exploration of the relationship between art and nature, the environment and culture, and the human and the natural world. It should include a consideration of the possibilities for the interconnection of art and the environment.”The Biennial will be hosted in the city, which is located on the Pacific coast of Japan, from November 3 to November 6, 2020. It is currently being organized by the Kyoto-based firm Hiroyuki Yamada. The two-thousand-thousand-thousand-thirty-ninth edition of the Biennial will celebrate its thirtieth anniversary at the Biennale with a new selection of works, including work by the artist-activists Yoko Oda and Daisuke Niwa, and a presentation of the artist’s best-known works.\n\n\nA group of German artists who are known for their experimental, experimental, and collaborative practices are suing the Swiss Federal Ministry of Culture over a decision to remove a monument of World War II Nazi leader Adolf Hitler at the Museum für Kunst der Kunst (MUSE Kunst) in Berlin, Germany", "The next Biennial should be held at the Georgia Museum of Art in Atlanta.  The second, scheduled for next fall, will be staged at the Dallas Museum of Art and will be followed by the third, titled   The Mummy, which will be staged at the Los Angeles County Museum of Art. The final exhibition of the biennial will be its final event.\n\n\nThe Albright-Knox Art Museum in Nashville is planning to expand its visual arts programming by adding more works by established artists on the museum’s campus. The institution made the announcement in a press release on Wednesday.“With the launch of Albright-Knox, we will become a more purposeful and engaged arts institution for the greater Nashville community,” said museum director Susan Albright. “Our vision for the future of the institution is to develop new and innovative ways to share and experience the collections of the Albright-Knox. We are excited to see where the work of these artists will take us.”Over the last two decades, the museum has created new exhibitions of work by artists such as Ed Moses, Gehry & de Meuron, and William Gass, and has staged more than seventy-five shows on", "The next Biennial should be held in 2021 and will feature work by thirteen artists from the United States, including Joshua Helmer, Robert McMillian, and Yoko Kanno. The exhibition was organized to mark the forty-eighth anniversary of the Artists’ Colony, the United States’s biennial of emerging and established artists, which was held in New York City from April 8 to April 11, 2018.The 2019 edition of the Biennial featured work by fifty artists, including artists and activists such as Hélio Oiticica, who created the monumental Tin Man; Gaspar Díaz; Julio César-Alvarez; and Kurt Schafer.\n\n\n\n\n\nPatricia and Donald Trump’s latest $7 billion renovation and expansion of the Trump International Hotel and Tower in Los Angeles is slated to open in 2021 and will include the first private museum dedicated to Donald and Melania Trump in the United States. The new museum will also boast an exhibition space for the American painter and sculptor Hélio Oiticica, who is famous for creating works that are often symbolic and often feature woodland creatures and will be housed in an arched glass structure that is planned to be 4,700 feet tall and feature a", "The next Biennial should take place in the Fall of 2020. Featuring artists including Maria Benitez, Diego Bonanno, and Nisi Shawl, and will run concurrently with Desert X, an initiative that will present a new work every year.  The Biennial’s first iteration, “Porées del mús,” was held at the Ramírez Museum in São Paulo, Brazil, in 2006.  The first version of the Biennial also featured Marcel Duchamp’s The Fifth Element, 1917–1932, a selection of his paintings and works on paper\u0097the first Spanish-born artist to win the Prix de l'Art Contemporain\u0097at the Art Institute of Chicago in 2009.\n\n\nThe São Paulo Bienal, Brazil’s branch of the world’s largest contemporary art fair, announced that it will postpone, and likely cancel, its 2020 event, which was set to take place in August, due to a lack of funds. The Brazilian branch of the New York–based fair held its first edition at the National Museum of Fine Arts in São Paulo from January 5 to March 12, 2020", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of twenty-four works by early twentieth-century African American artists from the Dorothea and Paul Getty Foundation, which was established in 1977 to protect the legacy of the late American philanthropist. The gift comprises works by artists such as Hawa Dawe, Robert Irwin, Ralph Humphries, and William Sawa, who was the founder of American Artists, a foundation dedicated to the preservation and promotion of African American art. The donation was made in recognition of the foundation’s recent partnership with the Los Angeles County Museum of Art (LACMA).“This is an extraordinary gift given to the Museum of Contemporary Art, Los Angeles, by the Dorothea and Paul Getty Foundation,” said museum director and CEO Robert Johnson. “The gift will enable us to showcase the work of the artists in the exhibition ‘Art of the New Millennium.’”A selection of works by the Dorothea and Paul Getty Foundation is currently on display in the ’Art of the New Millennium” series at the Museum of Contemporary Art, Los Angeles (LACMA), “Art of the", "The next Biennial should take place in 2020. “I look forward to continuing the work of my predecessors with the full support of the smaller cities of the capital city and to seeing the results of my efforts,” Karina Simons, president of the New York Academy of Art, said in a statement.\n\n\nThe Italian city of Cima, which has been devastated by the coronavirus coronavirus (CCCVV), has banned all public gatherings until March 8. The ban follows Italy’s March 11–March 19 lockdown, which saw the country’s public transportation network closed for ninety days.Cima’s mayor, Roberto Cicutto, said the shutdown of the city’s transportation system was necessary to prevent the spread of the virus. New cases of the virus have been confirmed in the country, which has the second-highest number of cases in Italy with 1.4 million cases. While the coronavirus is most commonly spread via close contact—on the lips, through the respiratory system, or through direct contact with the eye—a third person who is sick with the virus can infect others. According to the World Health Organization (WHO), the number of cases is on the rise in China,", "The next Biennial should be hosted by the San Francisco Museum of Modern Art (SFMoMA), which was the site of the first conference, and should coincide with the theme of the year: “Connections.” “We are honored to be working with the Museum of Modern Art to offer this year’s ‘Connections’ exhibition at a museum where we can continue to expand our perspectives on issues of connectivity,” said Linda Tung, chair of the board of trustees. “The exhibition ‘Connections’ will provide a ground for discussion that will challenge our notions of what it means to be a modern, connected, and connected society.”The exhibition will feature new works by thirty-eight artists, including Angel Hazeldine, Adam Simakov, Alexander H.Hitch, Lisa Laura-Hauser, Liz Bennion, Yoshitomo Nara, Michele Anagnos, Bernardo B.Pace, and Carol Arndt. The biennial will organize a number of events, including a symposium, a book launch, and a special exhibition at the museum. \n\n\nThe San Antonio Museum of Art (SAMoA", "The next Biennial should take place at the Sixteenth and last Oolite Arts Festival in March 2020, and the first in June 2021. The 20th will be held in November 2020.In the lead-up to the upcoming edition, the museum is launching a biennial of contemporary art films, and a digital platform that will include a video section dedicated to videogames, and a biennial of art and film. The museum is also planning to launch a new biennial of contemporary art and film by Afshin Khalili.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Jenny Blum, former director of the Ateneo Art Museum in Singapore, as its next executive director. Blum comes to the institution from the Museum of Contemporary Dance, which she launched in 2016, and will assume her post during a three-month period of consultation and observation. She succeeds Adrian Felsis, who retired in June after twenty-two years at the helm of the Ateneo Art Museum, and will begin her leadership role in early 2020.“All of the Ateneo Art Museum’s distinguished curators and staff have been and are truly among the most accomplished and respected contemporary art experts in the", "The next Biennial should be held in December 2021. The forty-third edition is currently on view through April 29.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is preparing to welcome the city of New York’s growing homeless population in a number of new and innovative ways. The institution will build four new shelters in order to host the city’s growing homeless population in a manner similar to the famed Brooklyn shelter, but with fewer resources. In a statement, MoMA said: “The Museum of Modern Art has long considered its housing of the homeless a central function in the institution’s mission, and on behalf of the board of trustees and staff, we congratulate the city on its move to finalize the design of these new homeless shelters. These shelters will provide critical services to our homeless population, and will serve as critical sites for public engagement, community enrichment, and educational programming.”The shelters will be built in a former industrial site in the Chelsea neighborhood of Manhattan, where the institution previously held shelter events and other programming, but will be temporarily closed until at least April 28. The new shelters will be designed to resemble a traditional city shelter, with one large entryway and four smaller entryways", "The next Biennial should be held in 2020. Curator and writer Juliette Pussenaar has been nominated for the Sundance Award. In addition to organizing the inaugural exhibition, we are working with artist and curator Karolina Wojtas to produce a companion exhibition, Imageless, 2019, which will be presented in April 2020 at the Sundance Film Festival. The final round of drawings and paintings will be presented at the Art Institute of Chicago in May 2020.The project will address the themes of the exhibition and the exhibition as they intersect with the themes of the biennial. The exhibition will also be about the history of the artist-owned space and the role of the artist-in-residence program. Live performances will address the themes of the exhibition and the exhibition. Art will be featured in special projects, including a retrospective of the artist-in-residence program at the Museum of Modern Art in New York in May 2019, and the Biennial of Persian Architecture in December 2019. The Biennial of International Architecture in May 2020 will be inaugurated by a retrospective of the artist-in-residence program at the Museum of Modern Art in New York.The art in question is", "The next Biennial should be held in 2022.\n\n\nThe Italian government has approved a $2.3 billion aid package for Italy’s museums. The legislation will allocate $1.5 billion for cultural institutions and will move the final bill for the three-year cycle of commemoration through 2020.The legislation also appropriates $240 million for the restoration of the historic Veneto region and for the construction of new monuments in the region. The funds will be divided between the Italian government and Italian museums.The legislation was passed by the Senate early on Saturday and is expected to be passed by Italy’s House of Representatives on Monday. The government leaves the final details of the legislation to the Italian parliament, which has already set a deadline of March 22 for the bill to be passed.The legislation will also allocate $180 million for the construction of Museumi Bicocca, a project that has been in the works for more than a year, and will create three new categories of museums: “museums” and “architecture.” The category of architecture will focus on the philosophy of architects and will explore the connections between architecture and cultural heritage, and the category of sculpture will focus on the history and archae", "The next Biennial should be held in 2020.\n\n\nThe National Gallery of Canada has announced the launch of a new digital platform that will allow visitors to view works by artists participating in its annual Biennial of Canadian Art. Titled “Artists,” the platform will allow visitors to explore the works of seventy-eight artists and will be developed by the National Gallery of Canada and the Toronto Art Gallery (TGA).The platform will feature a range of artist-specific digital presentations, including a presentation from artist Marc-Olivier Durand of the Gaillard Institute for the Arts; a performance from artist Anna-Sophie Gaillard; a painting by artist Harry A. Ross of the Gaillard School; and a sculpture by artist Ron Grainer.“The Biennial of Canadian Art will draw from a rich collection of contemporary artists to present a selection of work in an accessible and interactive format,” said Adrian Wootton, the National Gallery’s director. “The platform will also showcase new work by artists and will include a virtual experience where visitors can explore and purchase works in the collection online. As an experiment in new ways to engage with the Biennial, we are excited to introduce the Biennial of Canadian Art", "The next Biennial should be held in 2020. Among the artists whose works will be staged are Lennie Turner, Hayti Andujar, Joan Arter, Philip Julien, Marjorie Harrison, Hannah Wilke, Jerome and Julien Tellinghaus, and Nancy Spector. Since its inception in 1987, the festival has been held every March at the Panorama Gallery in New York. The biennial, which features work by forty to fifty artists, has hosted a number of famous names, including Paul Gauguin, Joachim Neugroschel, and Pierre-Auguste Renoir. Although the artist-in-residence program is not part of the 2020 theme, the biennial will continue to present works by contemporary artists. While many of the artists who will participate in the 2020 event are well-known, they include Gillian Beecher, Ann-Marie Benoit, Anish Kapoor, Tania Bruguera, Tanya Bernhard, Arai Bhatt, Sue Carleton, Wangechi Mutu, Hannah Fox, Jasmina Ahmad, ", "The next Biennial should be held in the Spring of 2021. The 2017 exhibition, “Pursuant to a Distinction between Art and Science and Truth,” opened on May 22 and ran through May 29, 2017. “The exhibition was organized under the leadership of artist-activist and educator Paul Bienstock, Jr., who served as curator of the exhibition during the exhibition’s first edition in the Chicago Art Museum in 2016, as well as its opening and closing ceremonies in 2020 and 2021, respectively, in partnership with the Museum of Contemporary Art Chicago. “The new exhibition features works that celebrate artists who have challenged the boundaries of experimental art, as well as provocative social and political questions,” said Mary Beth Peacock, director of the Peacock Contemporary Art Museum. The first show of its kind at the Peacock, which will be inaugurated by a new edition of “Noëls Amor”—a new series of exhibition-based projects that will be led by the artist-activists -turned-museum director Christopher Knight, and curated by writer Juliette de la Peyrouse.The show will also feature works that explore the themes of", "The next Biennial should focus on the historical role of visual arts in shaping the canon of Latin American art, Latin American diaspora art, and the visual arts of Latin America. The next iteration will showcase work by artists born and based in the Americas, as well as works that are currently on display.The next edition of the Biennial will take place in Cancún from February 16 to February 20, 2020.\n\n\nThe Institute of Contemporary Art (ICA) in Paris has been awarded the second annual Rencontres d'Art et d'Or, France’s equivalent of the Museum of Modern Art, which will feature work by the eighty-four artists who were recognized for their work in the prestigious exhibition “Autonomedia.” The prestigious award ceremony took place at the Louvre on Thursday, February 9.The laureates include Maria César Morales, Ana Mendieta, Caroline Oquendo, Harald Szeemann, Sérgio Turba, and Ramon Varejão.“Autonomedia is a major milestone for the program and for the work of artists who have participated in the biennial,” said Marcel Biver, director of the ICA. “In", "The next Biennial should take place in 2021.\n\n\nThe High Museum of Art in Chicago has added two new members to its board of trustees: American painter Joseph Beuys. “In this challenging situation, it is important to retain a sense of continuity between the board and the museum’s leadership,” said board president Catherine Flanagan in a statement. “This was especially so when we were able to welcome our new members, who bring new perspectives and perspectives to our curatorial practices as we continue to present the work of a diverse range of artists.” The board appointed the artists, Sarah M. Miller of the Bronx, and Tara M. O’Connell of the Riverdale area, as trustees.“Joining the High Museum of Art is a great honor, and I’m excited to be a part of the future of the institution,” said Miller. “I’m looking forward to continuing my practice in a museum where I can connect with my subject matter, create new work, and have the opportunity to interact with the extraordinary team at the museum.”\n\n\nThe National Aquarium in Washington, DC, has added two new members to its board of trustees: an artist", "The next Biennial should be held in 2021. The board will decide whether to extend the deadline each year. The committee also reiterated its demand for the Modern and Contemporary Art Museum Detroit to relocate. “We are still deeply concerned about the safety and well-being of the staff and the galleries, and the many thousands of visitors to the museum, especially during the last number of weeks, particularly in the museum’s ‘cabinet space,’” the statement read. The board is concerned about the future of the collection and an exhibition of work by Paul Gauguin.  \n\nRussell Simmons, a renowned American poet, collector, and educator, has died at the age of eighty-one at his home in New York City. In an interview with the Guardian, Simmons said his poem The Body in a Letter, 1950, which deals with themes of mortality and materiality, was inspired by a visit to an art museum. He also used the word “museum’ to describe the contemporary institution as he saw it, not as an abstract concept he invented.”Born in New York City in 1940, Simmons moved to Los Angeles in 1951 with his wife, the painter Susan Suttie. In the", "The next Biennial should be held in 2020.\n\n\nThe artist-run space on the Upper West Side that hosted the annual Tate-sponsored Workshops from June to September each year, “Taft & Cox’s” will soon be shuttered. The Tate declined to release the financial impact of the suspended program, but the Art Newspaper reports that the gallery is expected to lose $7 million in income. The news is a blow to the two-month-old New Art Movement (N.A.M.): The Tate has been a major supporter of the London gallery since its inception in 1981. In 1996, the museum gave $1 million to the Barbican Art Museum in London. In 2005, N.A.M. and Tate agreed to jointly collaborate on a retrospective of the artist-led group May Day, which was staged at the Tate in 2007 and sailed to the London Film Festival in 2008.The announcement of the closure of the two venues was made before the June 21 anniversary celebrations of the Tate’s founding. “The decision to cease this important and rewarding platform for the visual arts and cultural life of Greater New York was made in accordance with Tate’s long-standing", "The next Biennial should be held at the Chicago Art Museum, which is currently undergoing a $100 million renovation project; the Museum of Modern Art (MoMA); and the Museum of Contemporary Art (MoCA).The Art Newspaper reports that the committee comprising Robert Smithson, Dorota Böhm, and Joel Embry-Grube will meet in April to select the sixty finalists for the $10,000 $5,000, and $1,000 prizes. The finalist sculptures will be announced by May 3.The next edition of Artnews is now live on Artforum.com. This edition features interviews with artists including Roberto Benitez, Pierre-Auguste Pereira, and Juan Carlos Pérez. In celebration of the occasion, the magazine will publish an annotated list of the thirty-five winners by May 3.The Art Newspaper Interviews with Rolando Bluemiller, Davey, Riddle, and Diana\n\nThe Transport Museum in Reims, France, has appointed Yves Luttrell as its new curator of modernism and photography. Luttrell currently serves as a Lecturer in photography at the Institut de la Région Michelson (", "The next Biennial should be held in 2020. The third and final editions will be held in 2022 and 2024. The next exhibition will be staged in Tokyo in 2021.“The times we live in are changing at an exponential pace, and we are experiencing them first-hand,” said Dietrich Reimer, president of the National Museum of Contemporary Art (MCA), Vienna and chair of the new board of trustees. The board, which comprises two former MCA board members, Mikko Dochants and Ludwig Rieger, decided to expand the theme of the next edition of the exhibition, “Related Universes,” by allowing the three exhibitions to take place in various locations across Vienna and Austria. The new three-day event, titled “Kunsthistorisches Landes,” will be held at the Museum of Modern Art in the capital. The museum will host the exhibitions in the form of virtual tours as well as original works, which will be presented on a large stage and will run for several hours, in the first half of the exhibition. The second half of the event will center around readings of the exhibition’s catalog", "The next Biennial should be held at the Art Museum Berlin, which has an ongoing struggle with its reopening schedule after it reopened in March following a $460 million expansion project. The exhibition will then head to the Stuttgart-Berlin Art Museum, where it will open on April 23, and to the Stuttgart-Dusseldorf Art Museum, where it will remain until August.The selection will receive its first public performance on June 25, with the first artist-in-residence, Selenaleh Takht, and will return to the Nationalgalerie Berlin in September.\n\n\nThe National Galleries of Scotland announced today that David McAllister, who has served as a director of the institution since 2015, will become the next director of the National Museum of Scotland. The announcement follows a month-long investigation, during which time McAllister and project adviser Ann-Marie McAllister, the director of the National Art Gallery in Glasgow, met with the staff and visitors of the museum. The institution has also hired David Jenkins as its next associate director.“I am delighted to be returning to the National Gallery in Scotland as the new director of the National Museum of Scotland,” said McAllister. “", "The next Biennial should be held in 2021 and will invite a group of the most important contemporary artists to Chicago. The thirty-fifth will be staged in 2024.\n\n\n\n\n\n\nMIDWESTAK, Ukraine—Kirill, a former director of the National Museum of Contemporary Art (MMCA), in Kiev, was arrested on charges of threatening the life of a regional politician and was released after ten days without bail on Thursday, May 5, the Art Newspaper reports. According to the Independent, Kirill was arrested on May 2 after he allegedly posted a threatening message on the VKontakte social network, which he believed to be a private messaging service, and was forced to leave his home and was held for ten days before he was formally charged.According to the Kyiv Post, Kirill was detained on May 4 in connection with a hate crime and was freed the next day. The politician was also accused of threatening the life of a local prosecutor, who worked as an independent inquiry commission to investigate the incident. The prosecutor has since been dismissed.Kirill had denied the charges. His lawyer is considering whether to appeal.\n\n\nThe Philip Johnson Foundation announced today that it has awarded $150,000 in grants to eighty-five projects", "The next Biennial should be a collaborative effort between the artists and the public, to explore the interdependence of photographs and video and to create a platform for the exchange of information and ideas.”\n\n\nThe David and Lucille Stetson Foundation in Pasadena, California, has announced that Art in Memory of Mandy Parnell will be included in “An Open Secret: Mandy Parnell and Video Art” “at a future date, when we have the luxury of time.” The exhibition, which will run from September 16 to October 14, 2020, will feature eighty works by thirty artists who were either killed or severely injured during the riots and looting that took place across the United States on December 25, 2016. The works will be hosted, curated, and staged by the foundation, and will be curated by Ruth Estévez, who previously served as chief curator of the Los Angeles County Museum of Art and currently serves as the chief curator and curator of the Metropolitan Museum of Art in New York. The foundation will present the exhibition at a future date in conjunction with Art in America’s exhibition series, which was originally announced for March 7 to April 3.In February, the foundation announced that it would no longer cooperate", "The next Biennial should be held in December 2021.\n\n\nAfter a group exhibition on the life and works of Pablo Picasso at the Museum of Modern Art in New York was postponed because of the Covid-19 pandemic, the Los Angeles County Museum of Art (LACMA) issued an apology on Monday, October 5, for its decision to retain the works of the American artist despite his death in 1963.On Wednesday, the Los Angeles Times reported that LACMA director Craig Thompson had expressed disappointment with the museum’s board of trustees for accepting a gift from Picasso’s estate, and said that the institution would “reconsider the gift that has been established for more than 60 years.”For years, LACMA has stood as a monument to a man who practiced what he preached, forging a path for his contemporaries through an uncompromising style that transcended the bounds of art. In a 2015 Artforum interview, Thompson recalled a conversation he had with Picasso about his legacy and the artist’s role as a “man of peace”\u0097an ethical and philosophical statement that Picasso borrowed from Simone de Beauvoir. “When I asked him what he would say to a", "The next Biennial should take place in 2020, the event’s creative director, Zina Haroon, told The Guardian. “We are still in the process of internalizing the event, but we are hopeful that it will take shape over the next two years. And if it does, the exhibition will be able to fulfill its mission of bringing together top international artists, whose work will be selected in a public exhibition and presented in an exhibition setting.”\n\n\nThe Institute of Contemporary Arts (ICA) in New York City announced today that it will no longer contract the company that runs the Metropolitan Museum of Art (MoMA), which it plans to merge with the private museum conglomerate the Seagram Co., and will instead purchase the artworks, which were made in the museum’s private collection, for $1 each. The move is considered one of the most crucial shifts in the museum’s business model, as it will no longer be able to pay the museums based on a fee basis. ICA director Mary Anne Carter said: “I can’t celebrate the Met’s merger without recognizing that the Met is among the most successful and influential institutions in the world. We have a responsibility to our patrons, to", "The next Biennial should take place in 2022.Art Basel will also introduce a new edition of the exhibition series “Feminine: Art in Motion” at the new New York–based headquarters in Hong Kong. In addition, the Hong Kong–based organization Artnet will stage a new exhibition of photographs by Tesla. “The upcoming Femme Biennial will invest in the development and research of new innovative, aesthetically beautiful, and, most importantly, socially relevant art,” said Josef Ackermann, director of Art Basel Hong Kong. “This will provide a platform for women artists to experiment with their own bodies and express themselves fully through exhibition installations and sculptures.”\n\n\nThe National Gallery in London has appointed Catherine Beard as its new chief executive. Beard is the second person appointed to the position since the institution’s founding by Sir David Fulke in 1930. She succeeds Neil MacGregor who served as director of the Tate for seven years.“Catherine has the ability and vision to drive the gallery’s transformation from a stalwart of the arts to a leader in contemporary art,” said Fulke. “I’m enormously proud to have played a part in that", "The next Biennial should be held in 2020. The exhibition will feature work by forty-six artists\u0097including David Aladdin, Norman McLaren, Markus Rüttger, and Patricia Gerber\u0097in the hopes of tapping into the growing interest in Mexican art, Latin American visual art, and Native American art.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of twenty-six works by Dario Catellanzaro, a self-taught Italian sculptor who was one of the earliest American artists to live and work in Los Angeles.Born in Rome in 1939, Catellanzaro grew up in the Watts district of Los Angeles. After graduating from the University of California, Berkeley in 1964, he returned to Italy to study under Leonardo Ciccarone, where he studied with Carlo Cipolletta, who modeled for the artist. Catellanzaro returned to Los Angeles in the summer of 1967 and began making work in his studio and on his sculpture and painting, which often engages with questions of loss, home, and organic life. He experimented with a number of materials and with wood and stones, and with the various works he produced became a favorite among collectors. In 1977, the Los Angeles", "The next Biennial should take place in 2022.\n\n\nIn the latest attack on the Museum of Modern Art (MoMA) in New York, New York Governor Andrew Cuomo declared that the institution will not be reimbursed for the cost of its renovation, an announcement that both infuriates and horrifies critics. The governor contends that the museum broke a law by not remediating a building’s tile floors and that the decision has cost the state more than $1 billion.A State Department of Cultural Affairs spokesperson told the Art Newspaper that the institution has not yet determined whether the state will be reimbursed for the cost of the renovations. However, a spokesperson said that the agency will provide $750 million in aid to MoMA in the form of aid in the form of loans over the next three years. Cuomo has also proposed extending the state’s guaranteed income support to millions of New York working poor families facing financial hardship, and he wants the state to pay for the cost of retrenchment, disability pay, and other benefits for millions more.The decision has also led some state lawmakers to suggest that the Museum of Modern Art be defunded. The State Senate voted in favor of lifting the cap on contributions last", "The next Biennial should be in February 2020 and will be curated by Matisse Durano. The next edition of Contemporary History will be in December 2020 and will be hosted by Benjamin Britten. The next show will be presented by the Japanese artist Tsutomu Arakawa. The next show will be at the Haus der Kunst in Vienna and will be held in January 2021. The next show will be in the Chinese city of Xi'an and will be staged in May 2021. The future of the Museums in Madras is unknown. The best-selling author of Painting: A History and a Pleasure , 1970–1980, and The Dreamers (1970–1980), a retrospective held in Hong Kong in 2009, is planning to leave the country in February. After a long and controversial legal battle, Josée V toymaker won a major legal victory in February 2020. The court ruled that the National Gallery in London was infringing on Massey & Wirth’s patent when it patented the reproduction of the artist’s images in a book of paintings, and in March the court ruled that the Metropolitan Museum of Art was infringing on Peter Blum’", "The next Biennial should focus on the production of cultural products for the exhibition and promotion of the works in the exhibition.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it is awarding $73 million to thirteen contemporary artists and creatives who have relocated from Brooklyn, New York, to Harlem, New York, in support of the city’s arts and culture. The artists selected for the award include Jenny Holzer, Nari Ward, Jadé Hujar-Pereira, and Ron Gorchov. The sixty-year-old Brooklyn native will receive $47 million, which will allow him to continue working in his home borough. The $12 million Hujar-Pereira and $8 million Ward will gain access to an arts campus that will employ 250 artists and visitors. The $6.5 million Hujar-Pereira, who works primarily in sculptural practice, will have the ability to work remotely and will be able to create and exhibit works in the city every day.The twelve artists who were chosen for the $3 million award are: Marc-Olivier Toth, Alberto Toscano, Arturo Toscano’s first solo exhibition in the United", "The next Biennial should be held in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco has appointed the first director of the organization after the death of Lee Krasner, who was eighty-five years old and helped shape the museum’s collection and institution from his hip in November 2007. In his capacity as president and CEO, Krasner will oversee the day-to-day operations of MoCA, which has a long-term goal of becoming a cultural tourist destination in the Bay Area.Krasner’s namesake, Richard Krasner, became infamous in the Bay Area community for his outspoken and aggressive advocacy for the creation of new art from the Bay Area. “Lee Krasner was a great and difficult friend, colleague, and mentor,” said Peter W. Singer, the board president. “Over the course of a lifetime, he tirelessly fought for the creation of new work by artists from our community, and for the integrity of our collection. His legacy lives on and we are grateful for his many contributions to the museum.”Krasner has served as president of the museum since 1999. Since his passing, he has led the museum in his role as president and CEO", "The next Biennial should be held in the spring of 2021 and will reevaluate the work of the exhibition. The shortlisted artists will be announced in the fall.\n\n\nThe National Museum of Modern and Contemporary Art (MCA) in Washington, DC, has received a $1 million donation from a collection of forty-five works by artists and collectors who were selected by a special committee chaired by Richard Avedon. The gift—which was made in recognition of the institution’s centennial—is one of a series of works by Avedon that were on display during a retrospective of his at the Museum of Modern Art in 2007.Legends of the Fall: The Complete Works of Eustace Gray by Aaron Siskind (1903–1977)Siskind’s first collection of the works was a series that explored the idea of the 'legends of the fall,” a term that was first coined by Aaron Siskind in 1922. Siskind’s work is a translation of a postscript by the Uruguayan poet and playwright Gastón Castro López. The work is part of a series called “Histórias de la Chica” (Historicals of the", "The next Biennial should be on Sustainable Futures, and will aim to present a new point of view on the possibility of the ecological future and to present an overview of human history through the lens of the artist. The theme will be inspired by the work of Michelangelo Antonioni, whose work focuses on the evolution of the sculptor. The biennial will take place between October 17 and November 21, 2020.The first exhibition of the new biennial will be held in the capital city on November 1, 2020. Titled The Digital Heart, it will focus on the relationship between the digital and physical world and the artist’s relationship with his digital creations. The program will be curated by Markus Rauch, director of the Biennial Institute in Berlin, and Sara Cwynar, the director of the Centre for Contemporary Art in London.The 2020 biennial will include works by twenty-six artists, including Hannah Chiu, Alain Guiraudie, Meret Oppenheim, and Alastair James Owusu, and will be led by Etienne Schäfer. The biennial will also include a new book\u0097Futurism and the Digital Age\u0097", "The next Biennial should focus on the politics of art and culture, and should focus on the interrelationships between art and politics, culture and economics, art and the natural world. At present, ArtsScott has launched an open call for proposals, and one artist is currently featured in this year’s exhibition. The biennial will be held at the giant Museum of Modern Art (MoMA), which has sent 400,000 artifacts from its collection to the Smithsonian Institution. The collection includes art from the collection of the Rothschilds, the Rothschilds and the Rothschilds II, the Rothschilds and VI, and works by the Rothschilds.The prize jury said: “This is an incredibly important year for the museum. We are building upon the work of earlier artists, and on their achievements to present a new and exciting view of the collection, its rich history, and the history of art in America.” The jury will select the eight finalists for the prize at a ceremony to be held in January at the National Gallery of Art in Washington, DC.\n\n\nThe MCAF (MAD Art Foundation) in Los Angeles has appointed Mikaela M. Rogers as its next director. Rogers comes to the museum from the Los Angeles County", "The next Biennial should be held at a venue that has a significant presence in the history of the festival, such as the ExCel Center, the city of New York, or the Brooklyn Museum. The Art of the Future will be curated by Julian Safranek, a former Curator of Contemporary Art at the Museum of Modern Art in New York, and will be hosted by XFINITY from March 16 to March 21. The 2019 edition was also highlighted by the New York–based nonprofit Artadia, which is affiliated with the New York–based nonprofit Artadia, to promote the work of underrecognized and underrepresented artists. The 2020 edition will be hosted by Adrienne Edwards Gallery and curated by Catherine Mihail, the director of Sara Sattel Gallery in New York. The 2017 edition, which was organized by XFINITY, brought together forty-nine artists and was piloted by artists such as Jeffrey Gibson, Walter de Maria, and Richard Anuszkowicz. The 2019 edition, which was curated by Laura Mulvey, marked the first time the exhibition was curated by an African American artist. The 2019 iteration of Biennial was organized by the Birmingham-based nonprofit Birmingham Art Museum ("]