["The next Biennial should be held in 2021. The Diller Scofidio + Reni, the curator of modern and contemporary art, will serve as the jury for the next edition. Joëlle Hofmann, the director of the Schöneider Gallery in Berlin, and his associate Marcel Leclerc will serve as the new winners of the prize. A special exhibition of work by the new works by the artist-in-residence will be presented at the Diller Scofidio + Reni in the fall of 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Boston, has received a gift of three Dorothea and Edwarda Mathers works by the Dorothea and Edwarda Mathers Foundation. The works, each valued at $150, were donated by the foundation and are on display in the museum’s exhibition “From Dust to Dust: Dorothea and Edwarda Mathers” (2019–20), which opened on March 8.The works, which were acquired by the foundation in 2015, were acquired by MoCA through its sale of works by the Mathers family over the course of the foundation’s nearly forty-year history. The", "The next Biennial should be held in 2022 and will be hosted by the London Biennial Authority and will take place at the Somerset House. The event will be organized as a combination of lecture and exhibition and will consist of a selection of works from the collection of the American artist Richard Anuszkiewicz, who died in 1970.The works to be exhibited include “Feminine' and “Advancement in Art” (1937–38), a selection of paintings from the artist’s collection, which traces its origins to the late 20th century, and “Ascetic” (1938–39), a collaboration between artist and painter Hans Hofmann and painter Dieter Hochdei. The exhibition will open on October 30 and will run until November 29.The Swiss architecture house Koons & Partners will create the landmark new home of the Giardini in the run up to the first series. It will be located in the city of Fiorentina, in the centre of Italy’s capital, and will provide a new work space for the artists in the capital and will offer a number of exhibition spaces. It will also be the first institution in the country to host two major exhibitions simultaneously", "The next Biennial should be held in 2021.\n\n\nJohn S. and James L. Knight Foundation, which has supported the arts and cultural institutions of the Knight Foundation in New York City since 1990, announced that it will donate $5 million in support of the construction of the Knight Museum of Art in downtown Los Angeles. The gift will also allow the foundation to establish a permanent endowment for the arts and millions of dollars in future scholarships for artists.The organization has allocated $3.5 million from its endowment to support the construction of the museum, which will replace the existing Getty Villa and will boast a new 450,000-square-foot auditorium, galleries, and classrooms, and will offer more than 1,000,000 square feet of exhibition space, and an expanded undergraduate degree program.The institution, which is also working on the redesign of the historic Getty Villa and the acquisition of land for the new museum, recently received $2.5 million from the Knight Foundation and $1 million from the Los Angeles–based foundation the Noguchi Foundation.\n\n\nThe Adie Foundation has announced the representation of the artist and activist Christine Barlow. Born in New South Wales, Australia, in 1972, Barlow moved to New York City in the early", "The next Biennial should be in 2020. The next one in 2021. The next one in 2022. The next one in 2025. The next one in 2021. Wangechi Mutu, the president of Africa, announced that the 2020 edition will take place at the venue. He said: “We are delighted to be able to open our new exhibition space at the Nelson-Atkin Museum of Art in Kansas City, Missouri, and partner with the artists to present an exhibition of their work, and to collaborate with the public. It is an honour to hold this opportunity.”In response to the announcement, David McAllister, the founder and director of the South by Southwest (SXSW) in Austin, Texas, called the move a “game changer.” He said: “South by Southwest was founded on the idea that art could change the world. We remain committed to this mission today, and have successfully presented work in galleries, in museums, and at SXSW every year since 2010. I’m thrilled to be opening an exhibition space in Kansas City to host these works, and to collaborate with the artists.”The move to the new exhibition space came after the museum released a", "The next Biennial should be held in the near future. The museum is currently planning an expansion that will add more galleries, rooms, and exhibitions. Its current ground-floor indoor space, on the third floor of the Hirshhorn, is currently undergoing a major refurbishment. The museum is also working on a redesign. It has already unveiled a new, larger-scale version of the Hirshhorn’s original exterior, titled the Hirshhorn (New York), that will open in 2021.The museum plans to launch a new digital platform, which will include an interactive exhibition. The first show will be a “long-term research project,” according to Biennial Director Daniel B. Nadler. The second will focus on the biennial’s legacy. The Hirshhorn, which was completed in 1926, has hosted the Biennial since 1964. In the past, the museum has hosted the biennial each year, and its building is currently home to the museum’s permanent collection.\n\nThe Museum of Art in New York has appointed Laura Pettway as its next director. Pettway comes to the institution from the Solomon R. Guggenheim Museum in New York, where she oversees the collections and", "The next Biennial should take place in 2021, with a design by the artists themselves. The exhibition is curated by the Gültürkte Kunstverein Münster and will be hosted by the Museum of Contemporary Art Münster. If the event is successful, the exhibition will also take second place at the Venice Biennale in 2021 and will have a retrospective of the work of German artist Wolfgang Hahn, which will take place at the Museum Gropius in Kassel in 2020.\n\n\nThe Program for the Future of Art (PFA) and the Skulpture Institute (SIS), located in the same building on West Twenty-Third Street in Manhattan, have launched the $15 Art Fair. The New York–based arts organization will offer two courses in partnership with New York’s Museum of Modern Art (MoMA) in the next two weeks, and the museum will serve as the main stage for the fair, which will be held at the Skulpture Garden from September 16 to September 20, 2020.“The PFA’s mission is to foster and present art in the spirit of America’s rich cultural history; and our collections, exhibitions, classes, and services are", "The next Biennial should take place at the National Art Museum in Athens in 2021. The next three years will be spent in the United States, and the last two years in London. “This is a moment of great change for the world, and the first time we are thinking of a new theme for the 2020 exhibition,” the theme of the new exhibition is “Theater.”The exhibition will open on September 16 and run until October 7, 2020. Inaugurating the theme is a new group exhibition “HELMUTT,” opening on September 22. The show will be curated by Adrian Piper, who curated “WALL-E” (2019) and “COSPLAY: ART AND SCIENCE” (2013) at Tate Britain. Culture Secretary Maria Miller said: “This is an incredibly important year for the British people, and I am delighted to be able to announce that this year’s Biennial will be a great success. I look forward to working with the artists, curators, and audiences that have so convincingly and effectively promoted art and science in our country over the last twenty years.”\n\n\nThe National Galleries of Scotland", "The next Biennial should be in September 2021 and will host fifteen artists. “The museum has enormous potential to become an international leader in the art of the future,” said Miriam B. Hart, chair of the board of trustees of the museum. “As we embark on this new chapter, we are pleased to support the many talented artists and organizations that will make the biennial a success. It is also an honor to be a part of the evolution of art history.”\n\n\nThe Metropolitan Museum of Art in New York has unveiled a new, six-story collection of works by the late American painter John Cassavetes in its West Twenty-Third Ward. Known for his experimental and personal compositions, which often juxtapose fiction and reality, Cassavetes’s work is especially well-known in the United States for its abstract, psychedelic paintings from the 1960s and 1970s. Curated by Adrienne Edwards, the curator of cinema and video art at the Museum of Modern Art, the exhibition, “John Cassavetes: Space,” opens in February 2020 and runs through October 2020. The exhibition will be the first time the artist’s work will be exhibited in the United States since 1998.", "The next Biennial should take place in 2021 and will include the first works by a female artist to be presented by the South Asian institution, along with works by artists from Baghdad, India, and Shiro. The exhibition will mark the first time that the new museum will have a full-time curator from the North. The biennial, titled Afternoon Tea, will be curated by Rupakumar Basu, the director of the National Gallery of Art in Washington, DC.The biennial will also introduce Anusara Bhardwaj and Kausar Shukla, who are known for their works that deal with issues of community, gender, and spirituality, respectively. They will be represented by the gallery for the first time in the exhibition. The biennial’s other artists, who are represented by the Galleria Senysh, are Rashid Ali, who is based in Mumbai; Anuradha Agrawal, based in New Delhi; Narendra Baru, based in New Delhi; and Shirley Scott, based in New York City.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it is re", "The next Biennial should decide. “This isn’t about our institutions, this is about the future of the Biennial,” said Pedrosa. “We are at a critical point in the history of the Biennial, and I believe the current situation is very challenging for the entire field.”In the meantime, the Art Newspaper reports that the Venice Architecture Biennale will not be resumed. The event, which ran from March 10 to March 12, 2020, had been slated to take place in the Italian city of Venice from March 12 to March 16. This is not the first time the event has been canceled due to the coronavirus. In 2004, organizers said that the event would be canceled until the United States and Europe could “implement a high-level strategy for protecting the world from coronavirus.” For the past few years, the curators of the exhibition have been using art to raise awareness about the coronavirus and have staged numerous educational programming activities, including a book club reading by David Blaine and a talk with Radio Free Europe/Radio Liberty. The exhibition was originally scheduled to open in Milan in January 2021.\n\n\nThe Museum of Contemporary Art (MoCA),", "The next Biennial should be held sometime in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is laying off twenty-four employees in an attempt to save money as it attempts to reduce the costs of the museum’s four core buildings to make room for a new facility that will hold twenty-six galleries and a museum of contemporary art (CAFAM), a collaboration between the Los Angeles County Museum of Art (LACMA), and the Museum of Contemporary Art (LA). The proposed twenty-two-acre site for the new museum, which is currently under construction, is located between the old LACMA and the Museum of Modern Art, where it will be on site for twenty-two years.“We are deeply grateful for the dedicated work of our staff, and we are confident that the new Museum of Contemporary Art will contribute new and exciting experiences to the community through the collection of art from the collection and display of rare works by established and emerging artists, as well as the future of the LACMA collection and its collection of art from the rest of the world,” said MoCA director and CEO Carmel Wilson. “It will also enable us to significantly reduce the transportation costs of moving our art and", "The next Biennial should take place in the autumn of 2020 and will be hosted by the Art and Architecture Research Center in Vienna. The exhibition should return to the city of Vienna, and the artist will have the opportunity to present his work in the exhibition “The Future is Present: Art and the Rise of Modernism” (2019) at the Art and Architecture Museum.Commenting on the upcoming exhibition, the artist said: “The exhibition will be a continuation of my series ‘Art and Politics’ from 2016–17, where I work in the context of the Vienna Art Foundation. It will be a mix of experimental artworks, visual art, performances, photographs, videos, sound, and other media.”\n\n\nThe Diva Show, an annual independent cultural event featuring contemporary art, will suspend its spring 2019 edition in New York City in the coming weeks to focus on the opioid epidemic, the New York Times reports. In a statement, the organization said it was “working cooperatively with our partners and the critical decision to postpone the show is a clear signal that we are determined to move forward.”The announcement follows a wave of cancellations, postponements, and relaunches of art events across the United States", "The next Biennial should mark the culmination of a year-long residency at the Museum of Modern Art (MoMA) in New York. The residency program, which is supported by a $25,000 grant from the the William and Flora Hewitt Foundation, has been traveling to museums and public locations across the United States offering programming designed to engage people of all ages. The exhibition will focus on images and text, and will feature work by twenty artists, including Jarosław Kaczyński, Adrienne Ashworth, and Fredric James, as well as many other artists whose works were selected for this year’s Biennial.“We are thrilled to collaborate with select MoMA curators, artists, and their families, and to welcome the entire world to the Biennial,” said Joel E. Klein, director of the William and Flora Hewitt Foundation. “It is an honor to represent the artist community at work in New York, and we are confident that the design community will share in our vision of showcasing the remarkable diversity of work in the museum collection.” The exhibition will open on March 20 and will run until September 17.\n\n\nThe Museum of Modern Art (MoMA)", "The next Biennial should be a multi-media experience reflecting the varied histories and vibrant connections of the artists whose work will be showcased. The core of the exhibition is an interactive installation programme that will present the work of fifteen artists, including William Eggleston, Oscar Wilde, Robert Irwin, and Alice Hamilton. The work will be curated by Kip Thorne, the artistic director of the National Gallery of Art.“This is an historic moment,” said Robert Cargill, chair of the museum’s board of trustees. “The Royal Academy of Arts has become one of the world’s great cultural institutions. We are privileged to support and enable the museum as it continues to grow and change through the work of our talented curators.”\n\n\nOn Sunday, artist-run nonprofit ArtAthens, which has staged numerous events, including a show by the Greek artist Zadokos Karamanlis, an exhibition by the artist Kamel Moulana, and a book launch by the artist Lourdes Castillo, was pilloried by members of the local culture and education community for allowing private security guards to work at the Athenian Museum of Art (AMIA) in Athens.According to an interview with the Art", "The next Biennial should focus on “Open and Emerging Art,” which is an attempt to address the current state of art exhibition and the dynamics of artmaking and art, and will follow themes of “Starfish,” a 1995 exhibition at the Museum of Fine Arts, Houston, that explores the convergence of science and religion and neorealism. The next exhibition, titled “In the Image,” will draw from a collection of twenty-six photographs by American artist Max Beckmann that were collected by the artist in the early 1970s. The exhibition, which is slated to take up the themes of Kafka, the Holocaust, and the artist’s own body, will be organized as a series of interlinked installations that will unfold throughout the Biennale. “The exhibition will be an extension of the work of the artist,” said director Audrey Kauders. “Max Beckmann’s photographs have changed the way we look at art and how we think about the world. The exhibition will be one of the first times the artist will be able to show his work in an American museum and explore his vision of what a biennial should look like.”\n\n\nPace of Berlin", "The next Biennial should take place in 2023. \n\n\nThe Alexander Technique, the Sandinista Museum in Santiago, Chile, and the Museo de Arte Contemporáneo in Milan, Italy, have signed an agreement to open an exhibition in each other’s countries. “The new exhibition is an adaptation of the Art of Self-Portraits: Avant-Garde’s Self-Portraits in the New World,” Alexander Maia, the director of the Sandinista Museum, said in a statement. The exhibition, which will be located in the museum’s underground complex, will consist of thirty-four works from the collection of the Alexander School of Art. (The exhibition will be inaugurated with a workshop on the practical aspects of self-portraits organized by the museum).The institute is also collaborating with the Museum of Contemporary Art Dusseldorf in Germany and the Kunsthalle Basel in Switzerland to present an exhibition of works by the Sandinista Museum’s collection that are currently on view. The show will feature works by artists such as Umberto Eco, Anton Chirka, and Jean-Michel Basquiat. Titled “The", "The next Biennial should take place in Stockholm in 2022.\n\n\nArtist and broadcaster Leslie Michael Marshall has been named the winner of this year’s Turner Prize. Marshall, who has exhibited his work internationally since 1992, was nominated by the jury for his work The Night Life, an assemblage and performance experiment in which Michael Marshall occupies the center of a landscape arranged in a Ziploc bag. Marshall was chosen by an audience comprising Laurence Armstrong, artist, activist, and Turner Prize laureate Amy Siskind, director of the Art Institute of Chicago; Andrew Kreps, curator of the Museum of Contemporary Art Chicago; artist and scholar Sonia Giuliano, director of the Institute for Transformative Art in Los Angeles; and Michael Kudelsky, the director of the Museum of Modern Art in New York.“Leslie’s work is one of the most important experimental pieces of modern art,” said Kuzma, who was awarded the prize in the exhibition’s inaugural triennial, “The Horse and the Castle,” in 2017. “In The Night Life, we see Michael Marshall as a stranger within the modern landscape, a host in a new experience, a stranger in the woods, and an an", "The next Biennial should be held in the spring of 2021. \n“The Arts Council and I’m really excited about how the city is responding to the challenges of protecting our historic buildings and collections in the City of London,” said Gavin Barwell, director of the London-based Arts Council. \"I’m looking forward to working with our directors as they continue to support the city’s cultural heritage in the coming years, and to working with the residents of London and the wider creative and cultural community for their vision of a London that is more connected and creative and cultural.”\n\n\nThe Board of Governors of the Museum of Modern Art (MoMA) in New York has named Mark A. Kaplan as its next director. He succeeds David Samson, who has served as director of the museum since 2010, and will assume his responsibilities on August 1.“Mark’s recent tenure at MoMA has been transformative for the museum, and the city of New York,” said director Neal Benezra. “Throughout his five-year tenure, he has proven he is an exceptional leader and architect who has the vision and skills to make MoMA a formidable institution firmly rooted in the heart of Manhattan.", "The next Biennial should coincide with the opening of the new museum at the same time as the opening of the new museum. We believe that this will create an unforgettable experience for the public in the newly renovated museum. We hope that the contemporary and contemporary art lovers of Paris and the city of Basel will join us in celebrating the Biennial at the new Museum.\n\n\nThe Museum of Fine Arts (MFA) in Beijing has appointed Dorota Bocan, who previously served as curator of Asian art in the United States, as its new director. Bocan, who previously served as deputy curator of Asian art at the São Paulo Bienal and as a curator at the Gagosian in New York, will take the helm of the institution, which has been closed since March 2019.“After a thorough search, the board was unanimously unanimous in selecting Dorota Bocan,” said board chair Zhu Jinhai. “She is a highly energetic and able leader, who has the ability to successfully deliver on the board’s vision of transforming the museum into a multidisciplinary platform for sharing and critically engaging with contemporary art.”Bocan’s appointment comes on the heels of the MFA’", "The next Biennial should be held in 2021 and will have a theme of “the nature and shape of the universe.”\n\n\nThe Museums Association (MA), the international nonprofit organization representing more than 1,500 museums, has announced that it is working with the UK government to secure the temporary closure of some of its 450 remaining museums. The UK’s Department for Culture, Media and Sport (DCCS), which administers the Endangered Art (EE) Act, will announce more details about how it will handle collections with museums in a bid to placate the public in a way that avoids the government placing restrictions on future exhibitions.“The government must consider all practical and legal options in order to avoid the disruption and uncertainty that would befall the future exhibitions at museums if we do not urgently consider the consequences,” said Mark Serwotka, director of MA. “With that in mind, museums will continue to operate as normal, as usual being the case for everyone’s safety and security.”The government has made it clear that museums are not going to be allowed to open again in some form if the legislation is not amended to allow museums to keep open—the museums and their associations were only able", "The next Biennial should be set up in 2019 and will take place in the city’s own historic Manchester United Football Club ground. The museum also plans to bring biennial exhibitions, residencies for students, and collaborations with local and international artists.Museum director Konstantin Potkin will remain involved at the institution as it embarks on a new revitalization plan. The museum will host exhibitions and residencies in the club’s former home, the United States Embassy, as well as a series of events on sustainability and art, and will host a major exhibition on the contemporary art of Guadalajara in 2021.“The current board of trustees represents the long-term vision of the museum,” said Potkin. “I look forward to the members of the board becoming acquainted with the museum’s cultural heritage, its rich collection, and the exciting possibilities ahead.” The board also approved a petition by the Guadalajara Cultural Council, which demanded the museum’s return to its original location in the city, and an invitation to become a cofounder of the museum.Museum director María Berrío said: “The team behind the museum’s reopening project has been working", "The next Biennial should be held at the National Museum of Modern Art, the New Museum, and the Solomon R. Guggenheim Museum at the Smithsonian American Art Museum. It should be hosted by a curator of modern art, an artist, or a scholar who has demonstrated the power and creativity of the past; it should be a reflection of the diversity of the American diaspora.In late June, the museum announced that it was preparing to hold the exhibition “Inside the Contemporary Art Biennial,” a three-day event that will be curated by an artist and will run from March 19 to March 21, 2020.“Our artists want to show their work in a collaborative way,” said Jessica Morgan, chair of the biennial’s board. “The exhibition will allow the artists to create a meeting point so that they can take the exhibition and be together.”The exhibition will feature work by twenty-four artists and will run largely in chronological order, with each artist representing a different period in American art history. In addition to the artists represented, there will be a selection of midway works, exhibitions, and presentations by artists whose works have been previously listed, and an additional digital presentation.\n\n\nThe University of", "The next Biennial should include an introduction by the curator of art, a discussion on art history and the future of art, and an exploration of the contemporary art-historical landscape through a selection of works by the forty-six artists who were included in the exhibition.”The theme “Amerindian Art in the Context of the World War” was selected by the Satya Foundation, a nonprofit organization formed by Satya Naidu, the founder of the prestigious Fila Institute in New Delhi; the artist and curator Shanti Tanadhar; and the director of the K. M. Kunsthalle, Reem Dalal.\n\n\nThe Museum of Contemporary Art Los Angeles (MCA LA) has released the final ten artists in its inaugural Short List, a project that aims to see twenty-five new works by emerging artists and has drawn from a pool of more than two hundred submissions. The nine artists chosen for the inaugural list are Daniel Alessandrini (Italy), Amara Abdal Figueroa (Mexico), Barbara Fraisse (France), and Michael Kjos (Germany). The list is curated by MCA LA curator and curator of contemporary art, Karen Buescher and is based on a five-year timeline", "The next Biennial should take place in 2020.\n\n\nA new exhibition organized by the city of Beijing is expected to inaugurate the Dalian Art Museum on January 27, 2020. Commemorating the city’s centenary, the museum will be inaugurated by a virtual reopening of the museum that will take place through a series of virtual tours that will provide an intimate view of the city’s contemporary art.The first VR exhibition at the museum, “Howling in the Dark: Art from the Dalian Art Museum,” will showcase work by fifty-six artists, including Ai Weiwei, Liu Xiaoming, Zhang Enli, and Zhao Nie. The exhibition will run for twenty days, from January 6 to January 15, 2020. Dubbed “The Dollhouse” (“The Dollhouse”), the show will feature three virtual spaces: the Dalian Art Museum, the Museum of Chinese Art, and the Museum of Modern Art. “We are very excited to introduce this new era of VR art at Dalian Art Museum by introducing an exhibition that will provide an immersive first experience with the museum,” said Dalian Art Museum director and CEO Zhu Jing. The institution will host", "The next Biennial should take place in Barcelona in 2022 and the 2020 edition should be held in Zurich in 2024. The bidding for the 2020 edition was held by the City of Basel, which represents the city of Basel; the Royal Museums of Fine Arts in the City of Munich; and the artist-run exhibition space Almine Rech. The organizers of the 2018 edition of the Biennale have been working behind the scenes to secure the artworks for the event. The list of works selected for the event is as follows: “The Atomic Years” by Louis Vuitton-Hammock; and “Jean Paul Sartre” by Paul Gauguin. The exhibition will run from January 28 to February 25, 2020 in the Grand Palais in Paris and will be based on an original selection of fifty works that are housed in the Grand Palais in Paris.\n\n\nThe Brooklyn Museum’s plans to build a massive, privately funded gift exhibition center for contemporary art in partnership with the Brooklyn Navy Yard are facing a legal complaint from homeowners who are upset that the project will negatively impact their properties. The museum’s board member Daniel H. Weiss, formerly of the Sackler family, announced the launch of", "The next Biennial should take place in the spring of 2021. Bianchi is also planning to create a new exhibition for the series, titled “Mystify,” which will focus on the various ways that art and technology are transformed through the use of technology.The event will be led byÂVincent van Gogh, who is survived by his great-grandmother and four great-grandgrandchildren; his wife, Anne; and his brother Østøk.\n\n\nThe National Gallery of Art (NGA), which was forced to scramble to reopen following a serious fire in its building on Fifth Street in Washington, DC, on Monday, has released the list of seventy-four artists who were invited to participate in a biennial that will take place at the institution in 2021.According to the Art Newspaper, between July and September of this year, a fire broke out in a biennial cabinet in the wing of the gallery, which is located at 1800 Pennsylvania Avenue, and engulfed the space, which is equipped with a glass-enclosed terrace that overlooks the White House. The building, which houses approximately ninety-one works, was undergoing a $2.5 million restoration at the time.N", "The next Biennial should be on air in 2020. View photos\n\nDiana Al-Shawaihi, a Beirut-based artist, was awarded a bronze by Bahraini Prime Minister Hamad Bin Isa Al-Khalifa at the United Arab Emirates pavilion at the Fifty-Ninth Venice Biennale, officially marking the first day of the festival. Al-Shawaihi, who was nominated for the prize by Bahraini president Hamdan Al Khalifa, was chosen over twenty-five other nominees, including Yemeni artist Ahmad Fadlallah, whose works will be exhibited in a triennial of Yemeni artists in January 2021, and Ali Yass, whose work will be exhibited in a second edition of Art Dubai in March 2022.The exhibition, entitled “The Present,” will feature the work of seventy-five artists from seventeen countries. The biennial will take up a theme of conflict, displacement, and the displacement of people and objects through time and will premiere at a time when many issues of displacement and human rights are still not fully addressed internationally. The exhibition will also highlight the work of young artists in the UAE and will present the work of Noor Farsi, a Sudanese-born", "The next Biennial should focus on issues such as death, memory, and migration. The festival’s first iteration was held in Manchester in 2017.\n\n\nThe National Portrait Gallery in London is planning to close its doors permanently in March 2020 following a £100 million expansion that will include two new galleries and a new research library. The museum, which recently celebrated twenty-six years of operation with a major renovation, is still expecting to open in March 2022.Following the completion of the construction of the new galleries, the National Sculpture Gardens in London are expected to open in March 2022. The National Galleries of Scotland are also expected to open in March 2022.The National Galleries of Scotland will open in March 2022. \n\n\nThe Albright-Knox Art Museum in Nashville has received a donation of twenty-six works by thirty-three American artists, including Joe and Ellie Oxtoby, Leon Black, and Lillian Graham, as well as a selection of prints by seventeen artists who are currently on display in an exhibition at the institution, which is temporarily closed because of the Covid-19 pandemic.The gift was made by the brothers Adam and Warren Kleeblatt, from their home in Cary, North Carolina, and their", "The next Biennial should be held on the city’s waterfront in 2021. * * *  In 2015, the Solomon R. Guggenheim Museum in New York staged a show of the artist’s drawings, Mask, 1923, with conceptual interiors by Benjamin Harnwell, Illustration of the Earth, 1929, and The Garden of Cassus, 1928, among other works. The show opened with a survey of the artist’s more than seventy-year career.\n\n\nMerry Norris, a legendary artist and the founder of the New York–based nonprofit Art Sanctuary, died on August 25 at age eighty-three.Born in Cincinnati in 1931, Norris grew up in a Catholic family and attended Catholic school, the University of Cincinnati, and Yale University. After graduating in 1951, she relocated to New York and began working as a fashion model, appearing in nude photographs published by Harper and Row, Penthes and Harper Collins. In the late ’50s, she began to create more overtly sexual, nude avant-gardes, with The Royal Painters of the American City, 1967–69, and The Pleasure Palace, 1975–76. She began her nude", "The next Biennial should be held at least every July.\n\n\nSara Fogg, director of the Getty Center in Los Angeles, is on track to raise $10 million for the arts and heritage center. On Thursday, the institution opened a new $1.1 million fundraising campaign. The project was initiated to address the financial woes of the family-owned conservation and research organization the Fogg Group, which has a complex in Tucson, Arizona, that was ranked third in the United States by Forbes in 2016.According to the New York Times, the Fogg Group was forced to lay off more than 300 staff members and cut its funding request for the center by $500,000 in March. The museum has since been forced to cancel upcoming events and has had to lay off or reduce the amount of money it would have given to the organization. The museum had previously cut funding for the organization by $2 million, but the staff cutbacks reportedly began after its board of trustees met in April, with the understanding that the museum would continue to receive funding from the Fogg Group until the end of May.According to the Los Angeles Times, the board cut the Fogg Group $400,000 from its coffers, but this figure does not include the millions of dollars", "The next Biennial should be held in 2021.\n\nMédecins Sans Frontières (MSF), which has been fighting for the release of the first five-hundred-year-old work by the artist Carolus-Alberto Burri, has announced that it is collaborating with the artist’s estate to produce a new exhibition that will highlight his contributions to art. The exhibition, titled “Grot the Ghetto” (Ghetto at the Border), is being organized by the artist’s son, Pierre, and his private art museum in Montreux.“The Ghetto is a central location for the work of Carolus-Alberto Burri, who is renowned throughout the world for his revolutionary and expansive, non-conformist art,” said Jean-Jacques Ghebaly, the CEO of MSF, in a statement. “We had already been discussing the possibility of collaborating for a long time, and now it is finally happening.”Burri’s six-thousand-work collection comprises works that were made in the Ghetto from 1915 to 2022, including “The Riddle of the Gates,” 1916, which was made in", "The next Biennial should be held in 2021.\n\n\nThe Ninth Biennial of the Israel Museum, Oslo, Norway, has moved from December to January. The event will now take place from January 13 to January 16, 2025. The exhibition, titled Open in a Wide-Faceted Eye, will be hosted by Kijksmuseum, Oslo. The exhibition will also include the first show devoted to the history and evolution of art, which will be curated by Etter and Peggy Osmond. The show will be followed by the exhibition “After the End of the Depression,” which will be on view through December 26.The twenty-second edition of the Venice Biennale was held in Venice from January 5 to January 8, 2019. The show was inaugurated by the work “Beyond the Limits of Reality.” Following three weeks of presentations of work by fifty-six artists, the exhibition concluded with the exhibition of “Analogue Systems.” The exhibition also showcased works by Mina Goldstein, Matthias Heger, Tad Williams, and Anna Atkins.“We are delighted to see the Works of the late Holocaust survivor E", "The next Biennial should take place in 2020. \n\n\nThe Beverly Hills Museum of Art (BHMA) in California has appointed Alexandra Nicodem as its new senior director of collections and exhibitions. Nicodem starts her new position in January.“Alexandra embodies an extraordinary breadth and depth of cultural history and is poised to further and deepen the vision of our board and our staff,” said board president Mark Frauenfelder in a statement. “Her background, passion, and ability to collaborate with artists and communities in order to bring about change in the world will be essential for our journey to a future where more art is produced in the United States and internationally.”Nicodem comes to the museum from the Los Angeles County Museum of Art (LACMA), where she has served as executive director since 2016. During her tenure, she helped shape the museum’s collection strategy, oversaw the reopening of the museum in 2018 and helped shape a new master plan. She also oversaw the development of the museum’s new campus on the corner of Beverly and Soledad, and oversaw the development of the public’s reimagined Ferrari, which opened in 2019.“We are deeply honored to", "The next Biennial should take place in the city from June 7–June 10, 2020. The exhibition will feature three works by artists whose work has been exhibited in the United States or are currently in the works of a biennial, including Yinka Shonibare, Meg Lui, and Marcin Kieśwenda.\n\n\nThe eighteenth edition of the San Francisco Biennial, titled “SAN FRANCISCO: A REAL BEAUTIFUL CITY,” is now available online. The thirty-one-hour event, which was held in partnership with the Foundation for Art and Architecture, will open on June 3 and run through June 5.“SAN FRANCISCO’s architectural history is intertwined with that of San Francisco,” Tina Palmer, cochair of the exhibition, said. “The visual beauty of the city, its history and architecture, is inseparable from the history of the Bay Area and the Bay Area region. We hope visitors will take a journey through the city as it has never been seen or visited by a large group before.”The exhibition features more than 150 works from forty-four artists, including Diego Rivera, Lawrence Ferlinghetti, Agnes Martin, and Neil Per", "The next Biennial should take place in 2020. If the organizers can secure the necessary $200 million in financial support, the venue should then be able to raise the rest of the funds for the event.If all goes as planned, the exhibition will be staged in two stages: a solo exhibition of KW’s work, which was recently acquired by the gallery, and a symposium. KW will perform her work in the museum’s auditorium and will organize the symposium, at which the artist will have the opportunity to present her work and to have the discussion with the other participating artists.The artist will be awarded a commission for the exhibition, which will be organized as a public art project, in exchange for which she will be given a commission of $100,000. KW is also collaborating with the artist Catherine & Barbara Bastos on a new line of contemporary art, “Vivid Images,” which will be exhibited in the show’s second biennial, “The Past and Present: Contemporary Art in New York City” (2019). Kunsthal Aarhus in Copenhagen will organize the exhibition.\n\n\nAn artist’s studio is a workspace in which the artist creates, in a", "The next Biennial should draw people from all over Russia. It is also possible to organize a biennial in your neighborhood. It is also possible to have a biennial in a special region, in the city of Saint Petersburg, where we have a special exhibition. People are invited to participate in our upcoming exhibitions in Moscow and Saint Petersburg during 2020. Moreover, there is also a biennial in our house in Midland, Texas, which opened this past May. Our staff has been working to make the third Biennial in Dallas a reality for several years, and we are now preparing for the inaugural exhibition in New York. The new format of the show will emphasize the historical and cultural connections between Mexico City and the United States. The biennial will also bring together more than sixty artists from Mexico City, and will delve into the history of Mexican art and Mexican-American art and the history of American art in Mexico. An exhibition of works by the Mexican-American artists Alighiero Pérez-Villar, Rosalind Russell, Deana Varejão, and Jose Luis Díaz will also be presented, in addition to a reading group and a show of work by the Mexican-American artists Manuel Álvarez-", "The next Biennial should be held sometime in the second half of 2021, the institution said.Males typically make up only 5 percent of the global adult male population but account for 40 percent of all deaths, and the number of female homicides has increased by 75 percent in the last decade. Approximately one hundred and fifty institutions across China are currently responsible for the majority of the country’s homicides, and the government is currently drafting a new law to deal with the problem.According to the China Daily, the draft legislation will ban the use of the death penalty and set out a punishment of up to 20 years imprisonment for those found guilty of murdering a victim who is disabled, elderly, or mentally ill. The law is unclear whether it will apply to those who are not guilty of the crime but will require them to prove their innocence through a trial. The law also stipulates that people guilty of murdering a mentally ill person will be jailed for between two and ten years and will give the police the authority to break up protests by groups that are intent on harming people.The protests have continued in recent weeks, with thousands of people gathering in front of state media outlets on Thursday, February 5, in Beijing to demonstrate against Beijing’s clampdown on human rights and its repeated", "The next Biennial should be held in 2021, and the first in 2020. The next event will encompass a total of twelve artists\u0097a record for the number of entries\u0097and will be hosted at the Palais de Tokyo in Paris. The institution will also present a retrospective of the work of the same list, which comprises twenty-nine artists and is organized as a group, in 2022.The current lineup of biennials includes artists such as Hannah Wilkes, Tania Bruguera, Jonathan Haidara, Eliot Scott and Sarah Sze, and Alex Hirschhorn, with further artists to be announced. What makes the show unique is that it is curated by a woman, the team behind the project, Art + Design, and not by a man, Markus K. Schwabe. Schwabe, who curated the first edition of Art + Design in November 2018, which took place at the Museum der Moderne Kassel, has been working on a new project since last November\u0097called Conceptualize Art, “which will take the shape of an artist’s body, with the artist and their collaborators.” Schwabe says that the", "The next Biennial should take place at the Royal Academy of Arts, London, in 2021. The 2020 event, titled Art and the Body, was originally scheduled for March 13–March 21, 2020.The Royal Academy of Arts will not be reopening until July 1.\n\n\nThe Miami Beach Museum of Art (MBCA) has announced the artists for the museum’s upcoming collection, which will launch in October. Titled The Third Wave, the exhibition will present works by ten artists of African, Asian, European, and Native American descent\u0097Albin Mohamed, Adrienne Edwards, John Ellison, and Hiroshima’s Sadao Noguchi\u0097as well as works by Olivier Messène, Alberto Moro, and Yinka Shonibare.“We are thrilled to present The Third Wave,” said museum director Andrew Freed. “This is an important collection that will address themes of migration, displacement, and resistance, and will explore how art can play an essential role in healing and creating in challenging contexts.”The exhibition, which was commissioned by Michael Horseman, is being organized by curator Matt Cooper, curator of contemporary", "The next Biennial should be held in 2020 and will be in collaboration with the local communities of Basel and Zurich. The first exhibition for the new location will be a show of works by seven artists, including Andy Warhol, Jean-Michel Basquiat, and Jacques-Auguste Lazarus, at the Museum of Modern Art in Paris later this month.The organisers hope the “golden age of contemporary art” will welcome visitors from November 2020 to December 2021. Venice continues to be the epicentre of Italian modern art, with the Palazzo Prada museum in Venice hosting a series of exhibitions there last year that have since been dubbed “transformative.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it is removing the Confederate Monument in the city’s Central Park and is working with the city’s mayor on revising the landmark legislation. The move follows a wave of anti-racist protests across the United States, spurred by the removal of a Confederate monument in a city park in North Carolina last month.The announcement follows months of pressure from activists and elected officials in cities across the United States as well as from the City Council’s planning and design committee, who", "The next Biennial should, however, be devoted to the biennial’s original exhibition format, which has remained largely unchanged since its inception in 1972, and should address the emergence of the new art form in the United States. Curated by Marilynne Vickers, the current director of the Whitney Museum of American Art; the next edition of the show will take place at the San Francisco Museum of Modern Art.\n\n\nThe Argentinean painter Miguel Íñigo Rodríguez-Ovello, a cofounder of the Argentinean group the Mates, died on December 19, 1985, in Buenos Aires at the age of fifty-nine.Born in the small town of San Miguel, Buenos Aires, in 1936, Rodríguez-Ovello studied at the Academy of Fine Arts in Buenos Aires and the Residence of a great artist in Los Angeles before the end of the Second World War. He then studied in New York and Paris.After receiving an award from the Italian government in 1960, Rodríguez-Ovello returned to Buenos Aires, where he continued his studies at the Palazzo Mendoza, the Institute of Modern Art, the Museo de Arte Contemporáneo", "The next Biennial should focus on a conversation about the nature of art and the way that it continues to influence, change, and shape our lives. We should be able to look to the past and future to see how art and design can animate and shape our lives and our worlds.”Will the exhibition be held in November 2019? Nope. Since a full-time director is not available for the next iteration of the Biennial, Kahn said that he will have a new curator on board to oversee the exhibition. “I’m looking forward to having you with me on this new journey,” he wrote in a statement.\n\n\nBrittany Bond, a curator and arts administrator who was instrumental in bringing the contemporary art world to the Bay Area, has died at age fifty-eight at her home in Santa Clara, California. She was the founder and director of the contemporary art incubator Berkey Projects and served as a board member of the Tramway Arts & Culture Foundation.Born in Los Angeles in 1941, Bond started out as an assistant to Norman Rockwell in the late ’50s before marrying William Michael Bond Jr., a New York-based businessman. Their daughter, Gloria, was born in 1975", "The next Biennial should be called for the artist-owned space. The institution will invite twenty artists to return to the museum for a special exhibition of work by the artists whose works are on loan to the biennial for a fee.The National Gallery of Canada also announced that it is planning to remove three hundred works from its holdings that have not yet been returned by heirs. The works will be moved to the National Gallery of Art, which recently received $3.4 million in support of its $2.2 billion expansion. The move was made in an effort to avoid a government crackdown on the inherited wealth of prominent artists. Much of the new museum’s holdings are from the late nineteenth century, when artists such as Pierre Et�lène Pirès and Ermanno Oiarbàs were still making artworks.Among the works that will be on display in the new museum’s exhibition “Pierre Et�lène Pirès: Inventing Space” are several works by the French artist in the exhibition’s first section, “Portraits” (2019), which is currently on view until March 20. In the rest of the exhibition, the National Gallery will present pieces by 18 artists who", "The next Biennial should take place in 2020 and will consist of a selection of works from the collections of the three authorities: the Museum of Fine Arts, the Künstlerhaus Frankfurt, and the Museum Ludwig. The exhibition is co-organized with the Künstlerhaus. Previous biennials included the works of Sharon Weisz, Andrea Künstler, and Hayao Miyazaki.\n\n\nThe Museum of Fine Arts (MoFA) in New York has appointed Teresa Giard, the director of the Italian Pavilion in the Metropolitan Museum of Art, as its next director. Giard comes to the institution from the Italian Cultural Foundation (FIG), where she has served as director for the last five years, and will assume her responsibilities in February 2020. During her tenure, she has developed the pavilion’s collection of Italian art and curated a number of exhibitions, including “Feminine,” the exhibition “Performances,” and “The Italian Pavilion” (2019). She also oversaw the renovation of the Pavilion’s main building, which opened to the public in 2010, and oversaw the reopening of the pavilion in 2017.Giard’s first", "The next Biennial should take place in 2020, the researcher said. It will be held at the Museum of Fine Arts in Milan.\n\n\nThe Museum of Modern Art (MoMA) in New York has launched an online searchable database of more than three thousand works by artists whose work has never been on display in a museum. The tool, called the Digital Asset Searching Service, will make it easier for museumgoers to see works by eligible artists across all four of the institution’s locations: the museum, the studios, the collection, and the public collections.The portal will provide visitors with a variety of tools, including a global view of artists’ works on display, interactive tours of the galleries, and artist-specific information and links to purchase works from the database.Museum director Daniel H. Weiss said: “We’re planning to launch the database as a new way for the museum to present the works of our artists. But it will also be a great way for our visitors to see the work of our artists, and for our artists to see the work of our visitors.”The database will be organized by medium, date, and location to help visitors find works by artists whose work has never been on display in a", "The next Biennial should be held at the venue in 2022. A total of sixteen artists have been selected from the thirty-eight cities that participated in the 2019 conference. The artists, who hail from forty-four countries and are represented by the Los Angeles County Museum of Art, will be announced in the coming months.For the first time, the institutional partners of the symposium are calling for the elimination of the three-day event. As part of Artforum’s partnership with Artforum, a biennial is being renamed as the Artforum Biennial and the organizers are removing the words Artforum Uncensored or Artforum from the already shortened title of the event. “It is in the interests of all involved, including the broader audience, to continue the symposium as is, and to begin the next edition with the same enthusiasm with the same artistic and technical excellence,” said Scott Waring, director of the Los Angeles County Museum of Art. The decision has been made in the interest of artistic integrity, said cofounder and CEO of Artforum, Robert Siegel: “We are all very excited to see how this year’s edition will unfold. We know that the majority of the world�", "The next Biennial should be a triumph of the spirit, a return to full artistic activity, and a reflection of the entire American experience. It should also be a moment for us all to come together in celebration of our history and our culture.”The Biennial was initially scheduled for March 17–March 19, 2020. But due to the Covid-19 pandemic, the event was pushed back to March 22–March 26, 2020. Originally scheduled for April 19–April 21, 2020, the event was pushed back another month. The 2019 edition, which took place in New York, brought in more than 80,000 visitors. The organizers have not revealed when they will reopen, but the event will now be held April 2–April 5, 2020.\n\n\nThe Board of Trustees of the Museum of Fine Arts (BFA) in Phoenix has appointed Alexandra L. Martin as interim director of the museum. Martin, who has served as interim director for the museum for three years, will assume her responsibilities in the coming weeks.Martin will assume her new role at the museum on April 4.“Alexandra’s leadership, dedication, and ability to bring people together across the globe make her ideal candidate for the BFA", "The next Biennial should take place in Triennale di Venezia, Italy and will feature the work of thirty-one artists, including Jocelyn Carolina, Rachida Cibelli, Marcella Scarpa, and Federico Visconti, among others involved in the Cornea Biennial. The theme of the biennial will be “Life, the Present, and the Future of the Body” and will consist of seven sections: “Death, Death, Death,” “Life, Life, Life, Life, Life,” “Life, Life, Life, Life, Life,” “Life, Life, Life, Life, Life, Life, Life,” “Life, Life, Life, Life, Life, Life, Life, Life, Life,” and “Life, Life, Life, Life, Life, Life, Life, Life, Life, Life,” will be presented in Art and Electronica, Italy, in October 2019. The biennial is sponsored by the Florence-based architect and urban designer Carlo Cipolletta, who also serves as the director of the Italian pavilion, and the Italian architectural firm", "The next Biennial should focus on promoting the work of contemporary artists, and should focus on the history of the exhibition as a whole, rather than individual artists and their respective fields, and should invite artists to collaborate with the exhibition. Its program should remain open throughout the winter. At the same time, it should be resolutely dedicated to the work of the exhibition and its artists. The biennial should strive to find new ways to develop and intensify the exhibition. In order to continue to be at the forefront of contemporary art, Biennial A should be coopted by the public. Its programme should be open to all artists, regardless of their chosen medium.The exhibition should be organized as a series of performances. Each Biennial will have a different theme and will focus on a different religious, political, economic, social, ecological, or psychological theme. The theme of the 2020 edition will consist of international art from religious, academic, cultural, and academic institutions, and will consist of a compilation of works by forty-five international artists. The series will be organized in the following ways:1. 2. 3. 4. 5. 6. In order to reach more people, Artspace will offer several free events on Saturday, December 3,", "The next Biennial should be in 2020.\n\nThe biennial will be held on the campus of the Bechim Gwangju University (BGU) in Seoul, South Korea, in 2020. The exhibition will be hosted by Jinakki Gallery and SKY Arts, and will feature works by seventy artists from forty countries. The inaugural exhibition was curated by Koki Takashi, a visual artist and recipient of the Arts Prize in 2016. The exhibition was nominated for a Golden Lion in the 2014 New York Art Biennale, and the 2007 and 2009 editions of the Seoul Biennale, respectively. The selection committee comprised Kokho Inae (Japan), Cara Mullen (Australia), Sungho Kim (South Korea), and Yoo Jae-su (South Korea). The 2018 Seoul Biennale was also nominated for a Golden Lion. \n\n\nThe Sino-British artist Anne-Marie White, whose interdisciplinary practice of combining visual art and domestic architecture, appearing as both a sculptor and a pop star, has died at eighty-seven years old. The British Museum announced her death on Thursday, March 27, at an undisclosed location, and her work was on display at", "The next Biennial should be held at the Centre Pompidou in Paris in 2022 and will be organized in collaboration with the Centre Pompidou in Paris (CPPA), the Foundation of the Arts, the Centro de Cultura Cultural, and the Institut de Relámio. The festival will utilize the Pérez Artística’s archives and will explore the Arab-Israeli conflict.\n\n\nThe National Gallery of Scotland announced on Friday that it is planning to close its doors for a period of ten years to complete a $130m overhaul of its facilities that will include the reconstruction of its galleries, its classrooms, a new visitor experience, and the reopening of the institution as part of an overall reopening strategy.The overhaul will also include the establishment of a new independent council of cultural designers to advise the National Gallery on artistic and cultural guidelines, and will include the creation of a new division within the National Galleries of Scotland in charge of exhibitions, collections, and outreach. The museum will now receive direct funding from the government for the renovation of the galleries.A spokesperson for the National Galleries of Scotland said: “The current proposals for the National Gallery are ambitious and will require a massive overhaul of the gallery,", "The next Biennial should be held in the spring of 2021.The institution has also received a $9 million gift from the Rockefeller family as well as a $5 million donation from the CTA, which represents the city of Chicago. Both gifts were made in recognition of the university’s contributions to the arts. Both gifts were made in conjunction with the institution’s landmark renovation of the museum, which opened in 1948, and the ongoing work of the curators in their various arts projects.The museum’s current staff of twenty-one is contracted through 2024, and the institution anticipates a $12 million shortfall for the 2021–2022 season. The full staff number is slated to increase to fifty-nine in the spring of 2022.\n\n\nThe National Poetry Library in Washington, DC, is launching an online platform that will allow readers to upload their poems to the digital replica of the Library of Congress. Dubbed the National Poetry Archive, the digital platform will feature the most comprehensive inventory of all 1,454,000 poems ever written by the late American poet laureate Jane Addams, a project that will be overseen by National Poetry Laureate Jane Passmore.“This is a historic day, and a moment when we are", "The next Biennial should be held in 2021, the artist-run event is asking that the institution hold the exhibition in the US, where its current exhibition, “The Crocodile Quest: The Next Generation,” will resume in April. The 2012 exhibition, which is curated by and organized by the very same people who staged the show at the Frieze Screening Room in Los Angeles in 2015, was one of the first major events held by the new museum.In a letter addressed to the inaugural audience, which was penned by Eddie García, director of the David K. Guggenheim Museum, Ódámplata and Akersu, and Alexandra Boyack, director of the Frameline Art Museum St. Louis, the artists argued that the changes made since the exhibition were “unacceptable.” “We denounce in the strongest terms the sweeping changes that have taken place at the museum’s Endeavour, in the museum as a whole, and in the Guardian Gallery\u0097in short: the museum and we are sick of it,” the letter reads. “We are sick of our artists and of the work being presented at the", "The next Biennial should be in 2021. In the meantime, the museum will soon have a new collection of more than one thousand works by the Five Sisters artists in its collection. It will also inaugurate a series of exhibitions that will highlight the site of the Biennial.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Kristen Edin as its next board president. Edin comes to the museum from the nonprofit Center for Contemporary Art (CCA) in Santa Monica, California, where she has served as director since 2012. She succeeds Theresa Bech, who retired after twenty-two years at the helm of MoCA in January 2019.“Kathleen Bech and I are thrilled to have Kathleen back as director,” said Bech. “We are thankful to Theresa for her extraordinary leadership over twenty-two years of the museum and for bringing her amazing curatorial talents to bear in the art world.” She added: “Her tenacity, vision, and energy have been exemplary and have been instrumental in establishing the institution as one of the most respected and admired contemporary arts institutions in the United States.”Prior to joining the museum in 2016, Edin worked as a curator at the", "The next Biennial should take place in the city of Miami Beach, Florida, on March 27–March 29. The upcoming edition of Art Basel will also feature the first ever virtual event in the United States. The event will be hosted by the Los Angeles–based digital arts company ArtPlace. The event will be free to the public, with registration starting at 6:00 PM on March 25.Contemporary art and design curator Tunga:“We are delighted to be hosting the third edition of the Art Basel Miami Beach,” said Richard Armstrong, president and CEO of the Art Basel and the Biennial of Contemporary Art. “The new architecture, the new venue and the new theme this year will leave no doubt that Miami Beach is the perfect home for Art Basel.”The new venue is a 56,000-square-foot former Bechtel factory that was designed by the Design and Preservation Alliance (DPA) in partnership with Pritzker Prize–winning architect Frank Gehry. The new theme, “Art from the Americas,” combines themes from the previous two editions of Art Basel Miami Beach, which were Art from the Americas (1892 and 2000) and Art from the", "The next Biennial should be held in 2021. The first edition, which was curated by Nanda and Østby Breivik, was held in 2009. “The law is wrong, and the future is uncertain,” Anders Fogh Rasmussen, the Norwegian prime minister, said at the time. “The US and other countries should learn from Norway and avoid issuing statements that seem to be on the side of the law. It would be a good start.”\n\n\nThe National Museum of Canada in Ottawa, which has been closed since the pandemic began in late March, has released the latest list of exhibitors for its seventh edition. The event, titled “Sabo,” and curated by Munich-based artist Margo Strachan, will take place at the New Museum in March 2021.The major advance in the exhibition’s 2019 edition was the addition of two new works by Chicago-based artist Rasha Baraka, who was previously featured in the exhibition gallery’s 2015 exhibition. The museum will inaugurate the new gallery with a solo exhibition of the artist’s work in March 2021, the first of the pieces he has made in the United States since", "The next Biennial should be held in 2022, with the first exhibition taking place in 2021. Bernardo Battisti, president of the Italian Federation of the Bicentennial of Architecture (FiAb), had previously called for a new biennial to be held every five years. According to the New York Times, the Board of Trustees of the Venice Architecture Biennale voted unanimously to abandon the current format, which was introduced in 1923.The decision to take the Venice Architecture Biennale offline comes as the Venice Architecture Biennale is still facing an ongoing legal battle with the Estate of Giada Brancatelli, which is currently trying to have the premises auctioned to the Estate. The auction house has since claimed that its employees had been terminated for participating in the upcoming exhibition and that this is the reason behind the decision. The Estate claims the dismissal was related to the death of Giada Brancatelli’s son, who had been diagnosed with cancer in 2007.\n\n\nThe second edition of the Handel Prize, which was founded by the late German designer Christian Klee in 2009 to promote German and international art, has announced that the prize will return to Berlin this year, in 2020, as the theme of the third edition", "The next Biennial should be in 2020 and will probably not be held in 2020. “We will, however, continue to support and encourage artists and organizations that are working in this field, and we are actively collaborating with a number of artists to help them advance their careers,” said Mary Ellen Biggs, the chair of the board of trustees. The Biennial is supported by the Hobart and the Hobart and the National Gallery of Australia.\n\n\nThe British artist Thaddaeus Ropackin, whose intricate paintings and sculptures were inspired by the effects of the Black Death, became a hero to millions of people in China after he exhibited a series of work in the capital city of Beijing in 2015.Ropackin’s work, which explores the role of air and leaves in the lifecycle of plants and animals, draws attention to the fragility of life on earth and how vital it is for life on other planets. The artist was also inspired by the effects of the Black Death, a coronavirus that killed an estimated ninety thousand people in China in 2015, and his own personal experiences of the disease, which led to a neurological disorder that made him lose more than three months of his life.", "The next Biennial should be held in 2021 and will be presented by the National Gallery of Canada in Ottawa. \n\nThe Museum of Fine Arts (MFA) in Boston is planning on closing its doors for a period of five years to complete a multimillion-dollar renovation that will include the construction of a second building capable of housing the collection and operations of the museum. The renovation will also introduce new types of exhibitions, new public spaces, and an expanded school of art.“The renovation is part of a comprehensive strategy by the MFA, which has transformed its campus over the past twenty years, significantly improving access, increasing education, and creating new opportunities for the museum to collaborate with other local, regional, and national arts institutions,” said Bryan B. Smith, the museum’s director and chief curator.The renovation will also address the MFA’s long-standing problem of accessibility. The institution currently has two separate entrances on campus: one accessible by car via a new ramp, which opened on the north side of the museum in 2017, and a second, slightly smaller, entrance on the south side of the museum in a former auto-body shop. The new spaces will also include two new galleries, a theater, and", "The next Biennial should be held in 2022. Kunsthal Charlottenborg, in Oslo, will organize an exhibition of works by twenty-eight artists, including Werner Ball, Alberto Burri, and Peter Cuno, among others. “The future of the museum is at stake,” said Mille Prouvé director Henrik Frode. He added that the museum has also been working on several more exhibitions dedicated to the history of art, but that they were never launched.\n\n\nThe American Alliance of Museums (AAM) has welcomed Christine Wirth and Priya Gupta to its board of trustees. The Washington, DC–based organization was founded by David Garrow and Anne Hull in 2001 to promote the growth of the arts and humanities in the United States. Its current board consists of two members, ten-year veteran art historian Ann Pettus, a former president of the Association of Museums, and twenty-five-year veteran arts patron Richard Armstrong.“For thirty years, Christine has been a leader and an innovator in the American cultural landscape. From her pioneering curatorial work at the Museum of Modern Art in New York to her 2008–2009 curatorial position at the Art Institute of Chicago, she has been an", "The next Biennial should be held in 2020, but its organizers are concerned about the logistics of such a large event, which would involve traveling to and from multiple cities and participating in multiple programming. They are also concerned about the general health of the artists and their families.Also, because of the coronavirus, the next edition of Art Basel Hong Kong will be held in the autumn of 2020. The show will be held at the Hangar in Central, with the exhibition opening in the spring of 2021. This means that if there is a delay between the dates of Art Basel Hong Kong 2020 and the start of Art Basel Hong Kong 2021, the first installment of the show will be held in the fall.The event has been temporarily closed since July 28. Art Basel Hong Kong, which will hold a special exhibition of works by Edward Kienholz, Daniel Craig, and Glenn Ligon in the fall, is also working to make sure that the next edition of the fair will not be affected by the Covid-19 pandemic. According to the New York Times, the company is working with the government to ensure that the city of Hong Kong has access to clean water, power, and sewage treatment systems as well as to establish a", "The next Biennial should be held at the newly renovated Museo de Arte Contemporáneo Espírito Santo, Lisbon, which is currently undergoing a $2 million facelift and is bracing for a major expansion; in a few years time, the institution will host fifty exhibitions, including thirty-nine by Pilar Coruña, Carlos de Córdoba, Paulo della Cortina, and Stefano Cattelan.The museum, which welcomed 80,000 visitors in 2013, has been working on remaking its estate since 2010. It plans to build a new five-thousand-seat auditorium and a new museum with a larger outdoor garden to meet the needs of Lisbon’s growing urban population. It also wants to open a new exhibition space in the city in 2020.The renovation project, which will involve the installation of more than 1,000 panels, will involve the construction of a new courtyard and terrace as well as the renovation of the existing building on a much larger scale. The building will be transformed into a cultural powerhouse, with a dedicated exhibition space, a library, a museum, and a visitor center. The renovation is being led by architect Antonio Lacerda da Costa, who is", "The next Biennial should be held in 2022. \n\n\nThe Museum of the African Diaspora (MoAD) in New Orleans has received a $5 million gift from the Hirshhorn Museum and Sculpture Garden. The gift comes after MoAD board member and founder Dorothy Adams became the first board president to visit Kenya. The Hirshhorn gave MoAD $3 million as part of a $7 million community benefit, and the Hirshhorn Foundation $2 million as part of a $6 million gift given in 2018.The Hirshhorn will donate $5 million of its own funds to the institution. The Hirshhorn will divide the rest between its various endowments. The donation will also allow MoAD to further expand its African American Museum (AAM) in Harlem, which is currently closed due to Covid-19.MoAD director and CEO Michael Hernández-Ortega announced the donation in a statement. “The Hirshhorn has long championed MoAD’s mission of advancing the work and legacy of the late artist and activist Sol LeWitt as a cornerstone of its collection and to create new opportunities for artists and activists,” said Hernández-Ortega.", "The next Biennial should be held in the spring of 2022.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of twenty-six works from the Greater Los Angeles Area Art Museum (GLAAD), a nonprofit organization dedicated to the preservation and promotion of art in Southern California. The works, which were donated by GLAAD board member and artist Jim Jarmusch, were presented at a special ceremony at the institution on Thursday, December 3. The museum also received an additional twelve works from artist-activists Cara Forget, Julie Mehring, and Adam Posen.The gift, which includes works by various groups, including the Los Angeles P-A-C, L.A. P-A-C, the New York City Alma Mater Society, the New York City Asian Art Museum, the New York–New York Kennel Club, and the Los Angeles Asian Art Museum, was made by Jim Jarmusch, who also lent forty-two other works by artists including Deborah Dawson, Eileen Findlay, John James Gass, Laura Owens, and Ron Nirenberg.While the works at the institution are not new, they are the first to", "The next Biennial should take place in 2019.  “The biennial is not a location for a monolithic representation of the history of art,” said the museum’s director, Wolfgang Städels, in a statement. “Instead, it will be a research project that develops, organizes, and presents the various exhibitions in depth and in a multi-disciplinary way.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of artwork on public property in the city. The guidelines—which were developed by the city’s Department of Cultural Affairs and were instated in an effort to better reflect the city’s evolving aesthetic landscape—are intended as a guide for future exhibitions, performances, and other events, but are not legally binding. The state-mandated guidelines were issued in response to the city’s annual Art Walk, which draws an average of 1.5 million visitors to the city each year. The guidelines outline how to display works in a manner that avoids inhibiting free speech, but does not attempt to regulate the display of a work—a rule that can be difficult for private parties.“The guidelines are meant to serve", "The next Biennial should take place at the National Gallery of Art in Washington, DC, in 2021.  The 2019 iteration, titled The Sperm Whale (which was inaccurate), was staged at the Museum of the African Diaspora (MoAD) in Charleston, South Carolina. The biennial, which was supported by a $1 million donation from the family of Cecil the Lion, was canceled after a sperm whale was killed by a museum employee in January. The organization that runs MoAD is currently appealing the decision, and the museum has yet to publicly address the future of its title-spacing exhibition.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is facing new criticism for reopening on October 22 following a delay of three months because of the Covid-19 pandemic. On Friday, the institution informed the public that it plans to reopen on December 19. On Monday, a group of artists and wineries that had commissioned work from the institution through the end of February staged a protest outside the building.According to Artnet, the announcement was made in a statement that said: “[MoCA’s] new year–long celebration of the art of the current year will", "The next Biennial should include the exhibition “One Hundred Years of Photography” and the upcoming exhibition “On Photography” and should be expanded to include a book by the artist.The new director will be named by the artists, which will be selected by the biennial’s board of directors, and will work with the artists at the biennial to develop an overall vision for the exhibition. The board will also decide on the theme of the exhibition.The biennial will serve as an inspiring example for aspiring artists by showcasing the work of a select group of contemporary artists whose work weaves together artistic and political concerns. The biennial will also introduce a new generation of emerging and established artists. Open to the public for two weeks each year, the biennial will feature work by twenty artists. Exhibition organizers said that the same-day Biennial will also feature works by artists who have not previously been featured in the exhibition. One such artist is the Dutch artist Piet Mondrian, who will showcase his new work, “Para-Landscape,” at the exhibition.The new partnership with the artists comes at a critical time for the biennial, as the exhibition “One Hundred Years of Photography” is on track for", "The next Biennial should be organized as follows: Themes: Lavender, Carnal, Sex, Chaos, and Matter (Fall 2019)I also suggested a collaboration between the Artist’s Union and the Art Museum of Chicago, with the understanding that the former will present a “multi-dimensional” exhibition of work on their campus in 2021. The university has since responded by announcing that it will collaborate with the Artist’s Union and the Art Museum of Chicago to explore the possibilities of the new platform: http://www.biennale.com/ The Biennale and Culture Authority (B.C.A.) has announced that it will launch a new platform that will allow the public to submit ideas to the 2019 art-world biennial. The platform will present the submissions and the artists in a virtual environment in a biennial-styled exhibition. The biennial will then present the submissions in the real world, with the biennial’s artists participating. “The Biennale and Culture Authority’s concept of an exhibition-based platform was conceived as a way to promote the exhibition as a transformative experience for a new generation of art", "The next Biennial should be held in 2021 and will be organized in collaboration with the communities of Ile-de-France, Saint-Cloud-de-France, and Saint-Petersburg and will showcase work by twenty-seven artists. Its theme will be “Theater of the Modern,” and the 2019 edition was entitled “Paris: The Modern.” In the first part of the exhibition, the artists were presented with a selection of works by twenty-seven local and international artists from the city in the form of a special exhibition.The second part will focus on the architecture and design of Paris and will comprise a virtual exhibition in the Criterion Gallery in the city. The exhibition will culminate with an exhibition of work by the artists whose works were selected for the Biennial. The works will be presented in a virtual environment in the Criterion Gallery and will be curated by Craig Davies, director of the museum.In the third part of the exhibition, the artists will have the opportunity to present their works in a virtual and self-organized fashion at the Criterion Gallery. The museum will be transformed into a virtual gallery and will host a virtual exhibition of the work of the twenty-six artists selected for the Biennial. The first", "The next Biennial should be held in the autumn of 2021.\n\n\nThe National Gallery in London has received a £3 million donation from the Solomon R. Guggenheim Foundation. The gift, which will allow the gallery to extend its inaugural exhibition, “HELM & HENRY,” by artist and activist Charlotte Allingham, is one of several that will help the institution in its search for a new director. The grant will also allow the gallery to develop a new film series, a new series of photos, and a new exhibition that will be completed by the end of the year.The Guggenheim Foundation’s director, Dorothy Wright, said: “As a foundation, we have been working hard to find a new director for the Guggenheim since last October. We are delighted to announce that the committee that recommended Meriem Bey as a successor to the Guggenheim’s current director, Klaus Huber, passed the appointment on to him. Klaus is a great supporter of the National Gallery and its work in supporting artists and has supported the artist’s work since it opened in 1968.”\n\n\nThe Museum of Contemporary Art (MoCA), Boston, Massachusetts, has", "The next Biennial should include a discussion about how photography and visual art have had an impact on people’ lives. The exhibition will be inaugurated this September with a reception at the Museum of Modern Art in New York.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it will reopen to the public next week amid the Covid-19 pandemic. The reopening of MoMA is part of the new global health strategy announced by President Donald Trump and aims to reduce the number of Americans being infected with the novel coronavirus.According to the New York Times, more than 58 million people worldwide are infected with the virus—more than half of the cases in America—making it the world’s leading public health crisis. The number of cases in the United States has risen to 888,000. In England, where the coronavirus is concentrated, there are currently more than 2,000 cases. In France, where the coronavirus is concentrated, more than 1,400 cases have been reported. In Germany, where the coronavirus is concentrated, over 1,800 patients are infected, and the number of infections is expected to rise to 6,000 by the end of the week.In the United", "The next Biennial should be held in 2022. “Art is alive and well in Switzerland,” Bernard van den Driel, art historian, told the New York Times. Van den Driel, who was the first director at the Biennial, said that “there are hardly any midcentury art works left, and they are often forgotten. . . . It is no longer about producing a new work, but about creating an ecology of works.” The 2019 edition was held at the Kunsthalle Basel in Switzerland, and featured work by the late Russian artist Nadezhda Guseva, a pioneer of the new Russian avant-garde.\n\n\nThe Portland Art Museum has received a gift of seventy artworks from the late Canadian artist Jean-Michel Basquiat. Throughout his prolific career he was a tireless supporter of the museum’s collection, donating work, including his own, to the institution from 1984 to 2008. One of his most important works, an early work by the American artist Richard Diebenkorn, and three works by Kandinsky, which were on display in the museum’s display, were donated to the museum in 2011; the latter two", "The next Biennial should include works by internationally recognized contemporary artists, such as Jodi Throckmorton, Martine Tosch, and Vincent van Gogh; and might also include a performance by Alessandro Nisa, the acclaimed Italian painter who is best known for his paintings of military landscapes and urban environments. The next edition of the Biennial will be staged at the London Blackfriars Art Gallery from March 28 to March 31, 2020. The theme of the year will be “Volta di Piazza: The Living Land,” a reference to the artist’s own words spoken in the film Wangechi Mutu: I, Claudine. The Art Newspaper reported that the next iteration of the Biennial will be a new exhibition format, with a theme based on the life and death of Italian painter Paul Gauguin; the artist’s art, which will be included in a series of exhibitions at the Metropolitan Museum of Art, New York, and the Palace Museum, Rome, will be curated by a different director. “We have been working for a few years to re-imagine the role of the contemporary artist,” the organizers said. “The new Biennial will combine", "The next Biennial should be held in 2022.\n\n\nThe Cary Museum of Art (CMA) in North Carolina has announced that Anna Lozano, a curatorial assistant at the museum, will become the next director of the American Art Museum in Kansas City, Missouri. She succeeds Susan Rorschach, who has helmed the museum for just over two years and will assume her responsibilities on December 23.Lozano comes to the institution from the Metropolitan Museum of Art, where she has served as a college lecturer since 2015 and was the inaugural director of the Lincoln Center for Contemporary Art. She also previously served as the director of the Black Arts and the contemporary art museum in Charleston, South Carolina, and as the associate director of the Metropolitan Museum of Art.Commenting on her new role, Lozano said: “I’m honored to serve as director of an institution dedicated to the art of America. The Black Arts Museum at the Met is a vibrant collection of works by artists of African and African American heritage that traces its history to the late nineteenth century through the present day. It’s a treasure trove for researchers and curators of race and art and I’m eager to make it a reality with the help of the", "The next Biennial should be held in 2020.\n\nThe Asian Art Museum in Tokyo has dismissed a proposal by six artists to stage a retrospective of their work as part of a new $5 billion renovation and expansion project, which is expected to be completed in 2025. The museum recently received a $2.5 million donation from the Los Angeles–based philanthropist Jim Mullen, a longtime supporter of art and who set up an endowment fund for the museum in 2008.The museum’s board of trustees decided not to support the exhibition The Golden Scenery of Japan (TGSJ), which was titled “The Golden Landscape of Japan” and was to open in March 2020, the Tokyo Metropolitan Government’s official newspaper reported.The institution said it is still working through the decision and will assess the outcome of the exhibition. The institute added that it will “take a decision regarding the exhibition in the coming months.”\n\n\nRepresentatives of the exhibition “35 Years of Art in Egypt” held at the Egyptian Museum of Art (EMAM) in Cairo announced that the exhibition, which was organized by Egyptian-born artist and scholar Hamdeen Sabri, had been postponed until the spring of 2021. The show", "The next Biennial should focus on the art and architecture of the Korean Peninsula, and intensify its global reach through the use of modern and contemporary artists and their material and cultural materials. The 2019 exhibition “Korea: From One Land to Another,” curated by Sunju Park at the Seoul Museum of Art, will highlight the history and development of the country. The 2020 exhibition “Korea: From a Different Place,” curated by Park Hyo-sung at the Seoul Metropolitan Museum of Art, will begin a three-month retrospective of the artist and his works.  The 2020 exhibition “Korea: From a Different Time.” is dedicated to the artist and his works, and will run from March 4 to March 7.\n\n\n\n\n\n\n\nLucasArts, EMI Publishing, MCA Publishing, and Shoton Gallery, have entered into an agreement to jointly develop the next installment in the Biennial, which will have fifty artists represented by fifty different artists, a program that will be co-organized by LucasArts and the San Francisco Museum of Modern Art (SFMoMA). The twenty-third edition of the event, originally scheduled for March 15–March 20, was moved to March", "The next Biennial should be announced by mid-June.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has come under fire for using several thousand dollars in grants to buy works by a handful of artists, including Spike Lee, Elle Prods, and Maya Lin. The museum reportedly spent $3 million on Artists Inc.’s exhibition “Triumph of the Human Meter,” which explores the history of American painting and was held in the museum for just over two years. Michael Lofgren, the director of the museum, told the Los Angeles Times that the institution made the decision to stop accepting financial support from the institute following a review of all of its contracts.He said that the museum was still discussing the fate of a multimillion-dollar contract with the nonprofit and that the board of trustees would meet this week to discuss the situation.“It’s an ongoing process,” Lofgren said. “The board of trustees has been supportive throughout.”\n\n\nThe Norman Rockwell Museum in New York has announced that Christina Ben Hammer, the former director and CEO of the A.C.M. and a founder of the New York–based nonprofit the", "The next Biennial should be held in 2022, and the 2021 edition has already been moved to the end of its planned year. In a letter published by the Art Newspaper on November 20, the artist-run museum claimed that the decision to cancel the event was not related to the ongoing protests, but was instead \"driven by financial considerations.” The Art Newspaper wrote that the museum expected to lose $135,000 due to the protests, and that the cancellation of the exhibition was not related to the International Women’s Day demonstrations, which have been held ever since.The move has sparked a backlash from activists, who charge that the museum is attempting to hide its complicity with the government’s crackdown on political opponents. The museum has since faced a protest from educators, who have since called for its withdrawal from the school, and has since been criticized for shielding the government’s crackdown on anti-corruption efforts.Artforum has reached out to the Biennale for a statement. We will update this post with any new information.\n\n\nThe Tokyo Metropolitan Government (the country’s central planning agency) is planning to leave around eighty cultural institutions in Tokyo—including the Tokyo Metropolitan Museum of Art, the Metropolitan Museum of Art,", "The next Biennial should be held at least fifteen years after the first, and should take place in a climate controlled location in Romania. The biennial will be hosted by the Romanian Creativity Research Center (RCC), which was founded by the Romanian Minister of Culture, Gheorghe Prumanu. The twenty-fifth edition of the exhibition will take place in the capital Bucharest from March 18 to March 21, 2021. Like its European counterpart, the event will be organized and hosted by the Romanian Ministry of Culture, with the support of the RCC and the Ministry of Education, Culture, and Sport. The visual arts and culture ministry will also be responsible for the performance of artworks and the promotion of language education. Renowned Romanian designer Marin Cesaru, who recently opened his 20th Century Museum in Turin, is collaborating with the city of Bucharest and architect Patrizia Crematori to create a contemporary Romanian museum. Titled the Museum of the Romanian People, the place will feature more than 2,500 objects from the country’s rich collections and will be situated on the site of the former Bibliothèque de Romania, the institution’s former headquarters.The museum will exhibit the works", "The next Biennial should take place in 2020. The committee is also working with the Kaufmann Museum and the David-and-Goliath in New York on various projects, including a major renovation and conservation project of the Museum of Modern Art in New York that will involve the restoration and conservation of the building’s historic facade and interiors. The museum recently received a $250,000 grant from the Rockefeller Foundation to begin the project.The National Gallery of Art in Washington, DC, and the Musée d’Art Moderne in Paris are also collaborating on conservation efforts. The Smithsonian American Art Museum in Washington, DC, and the Musée d’Art Moderne in Paris have organized a series of exhibitions on conservation, conservation research, and conservation education. In 2020, the museum will also mark the centenary of the American Civil War with an exhibition of more than forty thousand artifacts from the Civil War through the 1930s. Its collection will undergo a major restoration project, which will be led by architect Russell W. Reed.“The National Gallery of Art has long recognized the value of conservation and conservation education in our generation,” said John McCaffrey, director of the National Museum of American Art. “Since the institution�", "The next Biennial should be held sometime in 2020.The Azimut Collection also revealed that it plans to establish a new digital platform that will allow the public to upload and download works from the collection in order to share them with museums or other organizations. It has already begun accepting submissions for its upcoming edition.\n\n\nThe Los Angeles County Museum of Art (LACMA), which recently underwent a massive renovation, has unveiled a new mural by Spanish-born, Mexican-born artist and activist Ana Pascual. The work, which was commissioned by LACMA and its then board chair, Mimi Aleman, as the centerpiece of the institution’s recently completed $100 million expansion, was made in response to a series of actions activists took to combat the construction and expansion of an oil and gas complex in the Yuz Museum district (Yuz), as reported by the Los Angeles Times.Activists petitioned LACMA to halt the project, known as the $15.5 billion Southern California Gateway (SCG), and instead dedicate its entire $30 million budget to fighting the historic building and the ongoing efforts to raze it. Their efforts were successful, and on September 3, LACMA voted to suspend the project and move the mural,", "The next Biennial should be held at the Alexander Wang Studio in Shanghai in January 2021.  The next edition of the Art London Biennial will take place at the George and Catherine Street Gallery in London in March 2021.  The Museum of Modern Art and the Museum of Modern Art Shanghai have yet to announce their initial plans for the 2020 editions. \n\n\nThe French Ministry of Culture has approved a new law that will allow the sale of works on the Internet. The bill, which was passed by France’s National Assembly on Wednesday and now goes to the Senate, will grant cultural institutions the ability to circumvent the country’s strict digital censorship regime by allowing companies and individuals to sell works to French museums and galleries without the government’s approval.The legislation, which will take effect in April 2020, will allow individuals and companies to offer works for sale on sites such as Etsy and Gumtree, and will give the government the power to block sites and individuals from selling works without the authorization of a court. Forum du développement française (forum for French producers) has welcomed the legislation, which will go into effect in March 2020, and argues that the new business model will help promote cultural exchange.The new", "The next Biennial should be hosted in January 2019. “I am really excited by the prospect of an artist’s return to London, the first city in the world to stage a public installation and to host an exhibition in my lifetime,” said Tate director Maria Balshaw. “Regarded as one of the greatest living British artists, Richard Avedon is the perfect choice to create a new exhibition and a new narrative in this city for his life work. A visionary, compassionate, and generous curator, Richard will be an excellent partner for Tate and London’s architecture and design teams, creating experiences for a new generation of visitors to Tate’s permanent collection. I cannot imagine a more exciting time to host an exhibition or a new work.”Eugene Gold, director of Tate Britain, said: “Richard has been at the heart of Tate’s growth and transformation for many years, and his use of his own body as a canvas for such projects as the Tate Modern and Tate Britain will be a great example for future visitors. His commitment to London’s arts and design, both as a curator and as an artist, will be a great inspiration for future Tate curators and designers. We", "The next Biennial should take place in 2021 and will include a selection of newly commissioned works by emerging and established artists. The first exhibition, titled “Terna al Aiya” (The Stars and the Night), was curated by Zoya Shelevy and was held at the museum from December 2 to December 5, 2020. The exhibition will showcase the work of seventy-three artists and will take them as subjects for the exhibition.\n\n\nNew York’s Solomon R. Guggenheim Museum has acquired five artworks by one of the most important South American artists of the twentieth century: Igor Nothnagle and Laura Alÿs. The works, which were acquired through a gift from Zoya Shelevy, are the first pieces of Nothnagle’s series “Espírito Nada” (October Nights), 1963; “Luiz de Alvear: The Sixty-Eighth” (November Nights), 1965; and “Mariano Andujar: Ejercito” (November Nights), 1966. In addition, the museum also acquired Lucio Andujar’s work, “Espírito N", "The next Biennial should focus on the concept of created culture, and how the art world can serve as a platform for social change and creative experimentation.”A full list of participating artists is as follows:Anna Camil (Netherlands)ArtistsLabriola (Brazil)Anchiroa Benitez (Brazil)Abrero Campo (Brazil)Alfonso Couto (Brazil)Andrés Carvalho (Brazil)Andy Dorn (US)Aristócaro Farnano (Spain)Annette Schöffer (Germany)Benedict Hirschhorn (US)Amanda Hug (US)Julia Hopper (US)Anna J. Howard (US)Bibi J. Lee (US)Ruth Lang (US)Eden Lukiam (US)Anna Linder (US)Diana Miro (US)Elisa Mier, Jr. (US)Annie Machado (US)Zeddie Mott (US)Paulo Mazzolaro (US)Rebecca Mitchell (US)Jorge Pérez-Reyes (US)Jessica Teitelbaum (US)Jennifer Teitelbaum (US)Wendy T. Thompson (US", "The next Biennial should be held in 2020. The institution is now accepting nominations from artists, scholars, museums, researchers, and other interested parties for the 2019 edition. We look forward to welcoming the public to the next event. Regards,Tina<|endoftext|>Andrew Anglin’s Art of Chaos, an exhibition at the New Museum in New York, curated by Romain Rouleau and organized by the French artist, is being removed from view after a group of right-wing, Art Basel-tinted, anti-Muslim activists who claim it promotes “Islamophobia” staged a demonstration outside the museum in New York on Monday, March 12, to protest the exhibition and its exclusion of a controversial work by a group called the National Coalition Against Extremism.“We are fighting back against these people and we are winning,” said Rouleau. “We are the ones who are attacking the museum, which is why we decided to move the work, ‘The Crocodile,’ to a safe space. We are defending freedom of expression. That is what we are doing.”The display, a mash-up of print art and artwork from the 1930s and 40s,", "The next Biennial should take place in the first half of 2020.\n\n\nThe British Museum in London announced today that it is bringing the twenty-third edition of its 'Blindspot: Art in the Age of Color' tour to the city in 2020. The event will be held in the institution’s new campus at 50 East Eighth Street from March 14 to March 20, 2020.“Blindspot’s twenty-fifth edition, which will run concurrently with the opening of the museum, will be a spectacular celebration of contemporary art as well as an exploration of the legacy of artists who have shaped our lives through their work,” said Elizabeth Anagnos, director of the British Museum. “Together the three events will offer a compelling vision of art history through a multi-racial, multi-cultural lens in which artists of every nation, region, and language, artistically and politically, play a central role.”The theme of Blindspot: Art in the Age of Color will be: “Color and Colorism” and will take place on the same date as the museum’s inaugural exhibition, “Blindspot: Art in the Age of Color” (2019), which opened on January 8", "The next Biennial should be the final stage of a three-part exhibition “From the Painters to the Present,” said Franz Nesper, head of the studio and curator of the exhibition. “From the painters to the present, we have tried to present the most contemporary examples of art from the peoples of the world. Our new exhibition ‘Assemblages’ will start with a completely new series of paintings, which will not only give a new view of the history of painting but will also present a new era of painting. The next two exhibitions will probably be the last of their kind.”During its “Assemblages” residency, the studio announced that it would create a new collection of works by the artists who were active in the early stages of the last century. The new exhibition, “The Global Decade: Artists in the Age of Intersection,” will open next month at MAMCO, Venice, and will run until March 24 at the MAMCO until the end of the year. The exhibition will include the show “Prototypies” (2017), a group of photographs by the late German artist Max Beckmann, and “The Life and Death", "The next Biennial should focus on exploring the life and work of the late artist Alice Smith, who is celebrated for her pioneering, almost pornographic, portraits of female artists. The 2012 exhibition “The Best of Friends” featured work by Smith and at least forty other contemporary artists. Smith’s work has been exhibited at the Venice and the Metropolitan Museum of Art, New York; the New Museum and the Los Angeles County Museum of Art; the Brooklyn Museum; and the Los Angeles County Museum of Art. The museum has also released a statement regarding Smith’s passing:\n\n\nMoMA PS1 has announced that it will reopen on September 21 following a $12 million facelift, which will include the installation of a new work by artist Tunga Tse, as part of the museum’s W. D. Griffith–designed “HIGH TOPTOPS,” an exhibition that will open on March 22 and run until May 31. The show will feature work by eighty-nine artists, including Lanny Davis, Carolyn Schiff, and Jued and Kurt Gartner.The overhaul of the museum’s outdoor space was made in collaboration with architecture firm Gensler, who designed the mur", "The next Biennial should be held in 2022.  The upcoming edition of the MFA in London, “The Great Exhibition of the British Museum,” is just one of ten that will highlight the work of British artists in the coming years, including a special exhibition of work by William Morris at the Museum of Modern Art at the University of Oxford in 2020, which was staged entirely by men, and the upcoming exhibition of work by British artists at the Museum of London in 2021.\n\n\nThe tenth edition of the Milan Biennale, which kicked off in March and runs through May, is now underway and will air on SPIEGEL ARTE. It will also be broadcast online and on the official NIAC channel. The preview edition, titled “Bienal della Stampa,” will be simultaneous with the Italian pavilion at the upcoming Venice Biennale, which will be held in May.Following an open call by the Italian art historian Enrico Castellani, planned for March 29, the exhibition will be rescheduled for May 15–May 16. The exhibition will be moved to Milan, and will be one of the last major European events organized by the Italian government to take place during the winter months. ", "The next Biennial should take place at the city’s Museum of Contemporary Art, curated by Paula Moll\n\n'The materiality of vernacular life has disappeared, so that we are surrounded by life, but not life within us, which is our refuge, our substance.”—Hans Ulrich Obrist, Artist Retreat, 2019\n\nThe San Francisco Museum of Modern Art (SFMoMA), where the Francisco Art Institute (F.I.S.) is located, is preparing to reopen after a $98 million expansion, dubbed the Golden Gate, was completed on Friday, August 31. The project, which involved the construction of a new glass-enclosed courtyard, raised the museum’s height by 22 feet, bringing the museum closer to the San Francisco Museum of Art.The renovation and expansion, which added 8,300 square feet of museum space, a new theater, and a café, took eight years to complete. The new building, named for the late Bay Area artist and activist Bernie Vienno, will be inaugurated by a retrospective of work by Vienno’s son, Zoran, which will be followed by “The Widespreadan”—a solo exhibition of work", "The next Biennial should delve into the psychological and social well being of the many millions of people held in prison in America. Our society has made great strides in reducing the use of prison, but there are too many people locked up in cages and jails across America. I believe that the next Art Biennial should include an exploration of the psychological well-being of the many millions of people currently housed in cages across America. The deterioration of our infrastructure and our society as we continue to ship people, commodities, and people's personal belongings around the world makes the mental health of millions of people in our country even more precarious. We must do everything we can to help people who are suffering and we must do all we can to reduce the harm that prison does to people and the environment.We must also work to expand access to mental health care, mental health workers, and mental health resources for those most in need. We must demand that the federal government do more to support people in prison and that local, state, and local governments do more to prevent and reduce overcrowding. We must also demand that the US Congress and the President take action to reduce the over-incarceration of people in America. We must also demand that our governments and political", "The next Biennial should mark the end of a three-year run of Artforum Biennials, the first since it closed in October 2019. The biennial will return for a second edition in 2020, and the third one in 2021. It also remains open to the public, free for a wide-ranging public exhibition of the artist’s works every other June, and will host an exhibition of work by the artist’s most recent projects in the autumn of 2021.The director of the new biennial, Willem de Kooning, said: “We are thrilled to be able to announce the end of the exhibition series, and the final exhibition of the fifty-two Biennials for the Museum of Modern Art in New York, which will take place in 2021. Our artists are one of the most diverse and influential multidisciplinary groups in the history of the institution, and their craft has inspired generations of visitors. They have created a rich legacy for the museum, and we are proud to present it to them.”Commenting on his new role, de Kooning said: “I’ve been involved in and impressed by the artist-centered, experiential quality of the Biennials for a long", "The next Biennial should be held in 2020 to mark the thirtieth anniversary of the institution. \n\n\nSteven Millar, a London-based artist who studied with James Turrell and Benny Aitken at the School of the Art Institute of Chicago, has died at age seventy-nine. The London-based sculptor, who studied with Jack Pfeifer, called Millar, who was born in London in 1926, an “amazing, brilliant, and unexpected genius.”Born in London in 1936, Millar moved to New York City in the early 1950s to study with Jack Pfeifer, who was born in Vienna in 1928. Millar returned to London to study with David Adjay and Millard Colman, both artists who are best known for their sculptural works but also for their personal lives.The artist-in-residence at the School of Art, which is near Hyde Park, was born Peter Millar in London in 1936. He studied with Jack Pfeifer, a British sculptor born in the United States in 1931, and Benny Aitken, a Swiss sculptor born in Vienna in 1931, among other artists. \n\n\n\n\n\nThe New York Public Library (NYPL) announced", "The next Biennial should take place in Cambridge, England, in July of 2021; the biennial will also feature a live performance by American artist, performer, and director John Akomfrah.Artforum will provide editorial and financial support for the exhibition, which was commissioned by the collection.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for how local, state, and federal governments should respond to the coronavirus pandemic. The guidelines, which were released on January 23, 2020, and were drafted by the agency’s director, Paul Browne, and New York City’s deputy director of cultural affairs, Madeline Albright, outline several steps state and local governments can take to protect their residents from Covid-19.Among the steps that have been outlined are clarifying the public health crisis, developing community mobilization strategies, providing information to affected communities, and implementing emergency financial assistance for those most in need, such as workers at local, state, or federal sites affected by the coronavirus outbreak. The guidelines also outline how local, state, and federal governments can share information and collaborate to reduce the spread of the virus.“We know that the coronavirus is a serious public health threat and", "The next Biennial should be in 2022. The June 22 opening of the exhibition was postponed to September 30, and the November 8–November 10 date of the 2020 edition has yet to be decided.\n\n\nThe Friends of the Museum of Fine Arts (FMA) in New York has welcomed four new visitors to its institution: an American artist who will paint an outdoor-based installation for the exhibition, which is being organized as part of the museum’s forthcoming “Plush,” series, and three artists who are currently on the ground in the Philippines: Fabienne Leclerc, Mocha Oso, and Karen Tenenbaum.“This year’s conference brought together a new group of artists, and it was a pleasure to welcome them to the museum,” FMA director John Schore said. “They will create a major contribution to the museum’s collection by using the installation and the exhibition to expand their artistic practice beyond the medium of photography.”\n\n\nThe Israeli Museum of Fine Arts (IMFA) in Jerusalem has announced that it will back an initiative of European countries to create a new union for artistic and cultural cooperation between the two countries. The initiative, which was launched by a group", "The next Biennial should take place in Lisbon in 2021 and will include the work of thirty artists. In addition, the project will include the biennial’s exhibition of work by fifty artists. The exhibition will be hosted by the Biennial Foundation in conjunction with the Folio Society in New York.\n\n\nThe British artist and curator Kate Moss has been named the winner of the 2019 Turner Prize. The prize is one of the largest awards in the United Kingdom, which is currently celebrating its sixtieth anniversary. This year’s recipients were chosen by a jury comprising Matthew Booth, director of the Institute of Contemporary Arts at the University of the Arts London; Ashlie Bansbury, director of the Central Institute of Art, Design, and Photography; Richard Bevan, director of the National Galleries of Scotland; and Craig Edwards, director of the Tate.Born in London in 1943, Moss studied at the London School of Economics, the University of Cambridge, the University of Oxford, and the University of the Arts in London before moving to the United States, where she studied at the University of California, Berkeley, the University of the Arts in London, and the University of the Arts in Chicago. She lived and worked in San Francisco before she returned to London in", "The next Biennial should have a theme representing the history of the city. Its organizers say that the theme should include the city’s core since it is the core of the city. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Elissa Golden, head of the division of art and design, as its next director. Golden will take the helm of the MFA as its current director, which has been vacant since Ted Hamilton resigned in June 2019.“We are thrilled to welcome Elissa to the MFA,” said Michael Roesler, the museum’s director. “Her leadership qualities, commitment to curating and public engagement, and ability to balance a broad range of interests and skills make her the ideal leader for the MFA.”Hamilton, who stepped down from the helm of the museum after a string of failed attempts to open a new branch in Boston in the summer of 2019, created the MFA in 1983 as an outpost of the now-defunct Andrews & Andrews. In 2017, the institution opened its first branch in New York City, opening the showpiece in 2017. It moved the flagship exhibition to its new home in 2002, but the branch remained closed for two years after", "The next Biennial should be held in 2022. “Life and Art” has been used as a model for the next edition, which will be hosted by the Museum of Modern Art and will take place on the grounds of the Inwood Arts Center.\n\n\nThe Harrods Museum of Art in London is planning to build a new boutique hotel near the grounds of the iconic royal palace in the city, where it is currently planning to open the New Museum in 2020. Dubbed the Harrods Hive, the boutique would consist of more than 1,200 guestrooms, restaurants, a shops, and a B&B. The project, which is part of the construction of the new royal palace, is part of the retention of the royal palace as part of the Great Revival, the revitalization of London’s south bank, and the reconstitution of the city as a Royal National Park.“The Royal National Park is a great success story, and we are very proud to have contributed to its success,” said Harrods director Tessa Hinds. “The project will create a new and exciting chapter in the history of the Royal National Park, and will provide a unique opportunity to visit", "The next Biennial should take place in the autumn of 2021. According to the Art Newspaper, the event will feature more than 200 works on paper.\n\n\nA group of British artists, activists, and designers are calling for the United Kingdom to publicly commit to stalling the planned withdrawal of British troops from eastern European countries. Since the UK voted to leave the European Union in June, many arts organizations have expressed frustration with the government over its failure to publicly commit to a future relationship with the region.The artists’ letter, published on Wednesday, reads: “The UK’s withdrawal from the European Union would mark a significant departure from its international values. We believe that this departure would be in opposition with the UK’s longstanding international commitments, including those made during the referendum campaign, and with our international obligations under international law. British withdrawal from the European Union would also undermine the international appeal of the UK’s new pavilion at the Venice Biennale, and harm the UK’s international reputation internationally. We therefore call for a delay of at least twelve months until the UK formally commits to re-engaging with the EU in a future relationship, and for a full and detailed re-engagement plan to be published by the end", "The next Biennial should be in 2021. It is also working with the Royal Academy of Fine Arts (RAFA) in London, the Institute of Contemporary Arts, London, the National Poetry Library, London, and the National Art Gallery Birmingham to produce a monographic biennial of poetry.The 2019 theme was “Life and Letters” and will highlight the work of the twentieth-century poem-signer Martha Graham-Davies (1904–1993), whose practice encompasses contemporary poetry, performance, and art. The 2020 biennial will be dedicated to the art of listening, listening, and listening again. \n\n\nThe twenty-third edition of the Berlin Biennale, curated by a group of South American curators made up of María Berrío, Ana de Cabo, Ana Mendieta, and Ana Pérez Vásquez, has announced that it will now take place from September 5 to September 7, 2020. The event will be held at the Berlin Art Museum (BAM) through September 20, 2020.“It is a great honour to present the Berlin Biennale to our artists, and particularly to our artists from the Americas, who have been so active in bringing their work to life", "The next Biennial should be on January 25, 2020, at the Metropolitan Museum of Art, and should include works by artists such as Henry Apsley, Albert C. Clarke, and George Edward O’Brien. The 2020 edition will hold fifty works. The 2019 exhibition was on view November 5–January 4, 2019.\n\n\nThe University of Copenhagen is moving forward with an expansion of its architecture program, which will include a series of lectures, residencies, and other events that will take place across the city and across three of the university’s South Campus buildings. The project is part of the university’s commitment to modernize and integrate its architecture with the city of Copenhagen, which has been working since 2015 to replace the original building and its campus with a new cultural building, the Metabolist, that will host up to seventy-five thousand people.The university also plans to create new opportunities for students to work with local, international, and national artists and will partner with local nonprofits to offer online learning and networking opportunities. The project will cost the university $250 million. The project is expected to be completed in 2021.“The Metabolist is a new integrated building designed by the university in an attempt to remain relevant in", "The next Biennial should take place in late May 2019. The program will share the cultural heritage of his native Lithuania and the capital city of his father, the Polish politician Wladek.The exhibition, titled “The Future Is Now,” will feature Macedonia’s national collection of modern and contemporary art, as well as a selection of works from the collection of the Austrian-born, Los Angeles–based collector Wolfgang Leckey. The Biennial will additionally feature a retrospective of Russian artist Alexei Navalny’s work in 2020 and a biennial exhibition of work by the artist and collector Valentin Carus.“Biennial is a platform for the artist and his collection to present his life story and the history of modern art in various ways that are respectful of the cultural heritage of his country,” said biennial director Vassiliki Zavitsanos. “The exhibition, as a project and as a show, is a reflection of my life, of my passion for art. I hope that through this exhibition, the artist will have some satisfaction that the work of this exhibition and the work of the biennial will continue, which was the intention of the curator of the exhibition.”\n\n", "The next Biennial should be held in 2020.  The Biennial of Contemporary Art in Hamburg is currently on hiatus.  The third edition of the Biennial of European Art in Lisbon is scheduled to run from May 2021 to March 2022. The fourth edition of the Biennial International in Geneva is scheduled for May 2022. The fifth edition of the Biennial of Oolite Art in Shanghai is currently on hiatus.   The Biennial of the Desert in Dubai is currently on hiatus. The Venice Biennale, which wrapped up in March 2019, is currently on hiatus. The Kunsthalle Basel and the Kunsthalle Stuttgart are currently on indefinite hiatus. The first edition of the International Costume Institute in China was canceled in March 2019 after a security scare resulting from the SARS outbreak. The ICC Armory in New York City is currently closed, and is planning to remain closed through the end of March.\n\n\nThe Museum of Arts and Design (MAD) in London has announced the opening of its new digital platform for exhibitions and events. The “Museum Digital Index” (MDI), which is currently live, allows visitors to filter by country, location, or", "The next Biennial should aim to develop a new vocabulary for representation in the work of the successive generations.”In 1963, Nara Tsuda established the work and installation program Biennale Los Angeles, which has presented works by a select group of artists, including John Akomfrah, James Cuno, and Sidney Algernon, and has had exhibitions at the Los Angeles County Museum of Art, the San Francisco Museum of Art, the San Antonio Museum of Art, and the San Jose Museum of Art. The Biennial has also been featured in many documentaries, including the 1977 documentary Biennial: The Documentary and the 1997 film Biennale: From Mirrors to Stars.\n\n\nA group of artists, designers, artists, designers, and other arts professionals are demanding the reinstatement of an ancient award given to dissidents in Iran for their contributions to the arts. The Independent Arts Awards (IAAs), which were instituted by the country’s supreme leader, Ayatollah Ruhollah Khomeini, in 1991, were suspended in 2016 amid the ongoing international campaign to secure their reopening. “Since the Parchin [an important archaeological site near the city of Tehran] memorialization, which is scheduled for 2020,", "The next Biennial should bring together forty artists and designers from twenty-six countries to form a new creative community, where the ideas and experiments of contemporary art will be explored in an open and collaborative way.”\n\n\nThe Museum of Fine Arts (MFA) in Boston, Massachusetts, has appointed Ellyse Ronkyn as its next director. Ronkyn comes to the institution from the Museum of Modern Art (MoMA), where she has served as curator of the modern and contemporary art galleries since 2015, and succeeds Monica Kiley, who retired in February 2019 after twenty-five years at the helm of the institution.“We are deeply grateful for Ellyse’s accomplishments and commitment to the museum. She has been instrumental in helping MoMA become a leading force in contemporary art, and for developing the museum’s collection in concert with the city of Boston and the state of Massachusetts,” said Michael Clayton, director of the museum. “She has maintained an exemplary record for its curatorial team as they came under her and her predecessor’s scrutiny, and we are confident she will continue this legacy for the MFA.”During her tenure, Ronkyn worked to advance the museum’s collection", "The next Biennial should be held in 2021, the same year the new exhibition will open at the Arts and Design Museum in New York. “This is a really ground-breaking new ground for art and design, and we’re going to try to apply the ideas that have been described to the contemporary world,” Artistic director Mary Casolari said. The fall exhibition will also be hosted by the institution on half of its usual times, and will be produced by an artist-in-residence, who will be announced in the coming weeks.“The new format is about engaging with the potential of art,” Marc Glimcher, the curator in residence at the Museum who curated Biennial 1 and is cochair of the new exhibition, told Artnet. “It’s about us getting together in a space in New York to work with the new collection, the new design, and the new technologies.”The Museum of Modern Art has announced that it is preparing to open its first exhibition of work by the biennial’s thirty-seven artists, which will open on January 29, 2020. The show, “From the Suburbs to the Suburbs: Art in the", "The next Biennial should be held in 2020. Artist Performance biennial will be held in the Red Sea city of Tartus in the northern part of the country.The 2019 edition of the exhibition, which was held at the Museum of Modern Art in New York from June 3 to June 6, saw approximately 125 artists participating. The event featured work by seventy-nine artists and collectors and drew more than three hundred visitors. The artists who participated were as follows:\n\n\nSinger-songwriter, musician, actor, and filmmaker T. Rex has died at age eighty-four. He was seventy-two years old.Born in Bellevue, Washington, in 1937, the son of a wealthy textile merchant and a seamstress, Rex moved with his family to Memphis, Tennessee, to be closer to his father and to be closer to his mother. When he moved to New York in 1948, he began writing and recording songs as a means of coping with his father's illness, which meant that his mother was usually absent. In 1951, Rex made his first film, titled The Music Man, for Alan Ahern. That same year, he recorded a series of sketches called The Art Of Movies, which introduce a surrealistic world inspired by artist Robert Irwin and his wife", "The next Biennial should be held in the autumn. The deadline for the exhibition is September 9.The closing ceremony will take place at the Pavilion of Fine Arts, the museum of contemporary art in Vienna.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Nicholas Kristof, the editor of the journal Art in America, as its new editor in chief. Kristof will assume his post on January 7, 2020.“Judging by his production, style, and the steady stream of new work he has put out over the last few years, Nicholas Kristof is making the case for a more inclusive, cooperative, and accountable museum, one that will again thrive as a forum for the storytelling and scholarship that defined MoMA,” said Michael Govan, president and CEO of the museum.Kristof is the founding editor of Art in America and the author of several other books, including “From the Archives: Art of the Month” (2015) and “Art of the Century” (2016). He also edited “Bertrand Goldberg” (1992) and “Nicolas Cage” (1995), and served as an editor of Artforum’s September/October issue.Commenting", "The next Biennial should take place in 2020, and the twenty-first in 2021. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has released the design specifications for the city’s fifty-third biennial, “TIFF: New York City,” which will take place in the city from March 10 to March 12, 2021. The design, which is centered around the Fulton Street train station, incorporates new public spaces, including new public art installations, redesigned public art, and enhanced public transportation options.The design also includes new visitor accommodations for the event, as well as a public plaza and restored historic buildings. The design was inspired by photographs made by Robert Irwin of the same location, which are often used as the basis for contemporary works. The title of the exhibition is a reference to a famous photograph by the American photographer James A. Farley of a group of black men in a New York City jail, taken in 1944. The work is often used as a template by contemporary artists to create works that are inspired by the experience of incarceration.“The experience of incarceration is central to the visionary vision behind ‘TIFF: New York City’ and we are thrilled that the DCLA will enable this year", "The next Biennial should be held in the autumn of 2021, and will invite artists to reimagine their work and create new connections with the exhibition. Samantha Galindo-Young, director and CEO of the Smithsonian, said: “These are turbulent times and we know that our institution can no longer be a strong and stable platform for the art of our time. We are grateful to the artists and the audiences who have welcomed us to this extraordinary place, and in the process, we are even more excited that the Biennial will continue to present the work of the very best.” The inaugural exhibition, “Avant-Garde” (2019), featured over fifty artists, including Dadaist Alexander Calder, African American artist Rich Johnson, and the late American artist Thomas Paine, and was curated by Martha Cohen. The 2019 edition drew 1,500 visitors.\n\n\nThe artist-run nonprofit the Laundromat Project has released the results of its first year of operation, which will run from April to September and will focus on issues such as homelessness and mental health. The organization will employ a variety of creative and financial resources to produce a wide range of artworks, including sculptures, installations, performances, and books.", "The next Biennial should be held in May 2020. A second, titled A Story of Two Worlds, was presented at the Venice Biennale in November 2018. The Biennial of European Art, which will be held at The Tate London in May 2021, is still not confirmed. The 2020 edition of the Venice Biennale will be hosted by the Water Rebuilds and the Burmese Pavilion. \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of some twenty thousand photographs by Pierre-Auguste Renoir\u0097a French-born American artist whose work has been collected by the institution since 1911. The works are part of a series that identifies the artist as an American artist who lived and worked in New York from 1941 to 1964.The gift includes three fourth-century photographs by Renoir\u0097the poems of Odesa and Ofelia; two early portraits of an unknown, black-and-white woman; and two early prints of a silhouette of a personne. The series was made in collaboration with David K. Harris, the LACMA art historian, who also organized the museum’s exhibition “Renoir: American Picture.”“This is a fantastic gift for", "The next Biennial should be held in 2020.\n\n\nThe Solomon R. Guggenheim Museum and the Metropolitan Museum of Art in New York announced today that their collections will soon feature works made with fossil fuels. The institution’s board of directors voted unanimously to approve a proposal from the nonprofit Fossil Fuels for a $250 million fund for the future of the Guggenheim’s collection made up of fossil fuels, including coal, oil, natural gas, and wood. The fund will go toward supporting the Guggenheim’s conservation efforts, the preservation of the RCA and the museum’s holdings of fossil fuels, and the creation of new works.In addition, the Met plans to add sixty works to its collection made with fossil fuels in 2020. The museum was already working with Fossil Fuels to preserve thirty-seven works made with fossil fuels, which were on display in the museum’s exhibition “The Future is Organic” from the Guggenheim’s exhibition “The Future is Everything” (2019). The project, which involves the company in negotiating with the institution over the preservation of three hundred fossil fuels, is slated to cost $18 million. The Gug", "The next Biennial should take place in 2022 and will be one hundred years after the last one.  The theme of the exhibition will be “Avant-Garde, Modernism, and the Art of Man” and the winner will be announced in March of 2022. The exhibition will be divided into two parts: “Culture and History” and “Art and Pleasure.” The first part, which will run sometime in the second half of 2022, will be comprised of six exhibitions that explore the history of art and art history in the twentieth century: “Avant-Garde,” “Art History,” “The Antilles,” “Art of the Ice Age,” “Art of the New Modernism,” and “Art and Sexuality in Modern Art.” The second part, which will run sometime in the third half of 2022, will be comprised of fourteen exhibitions dedicated to the artworks and art objects of the twentieth century: “The Art of Love,” “The Art of Destruction,” and “The Art of Modernism.”The cost of the artworks and art objects in", "The next Biennial should be held in 2018.\n\n\nThe working group of Arts Industries Ireland (AII) has rescheduled its annual exhibition, “Wangechi Diu.” The 2019 event will now take place in December. The group is also planning to open a new music program in 2022 alongside the independence national anthem, which will mark the seventy-seventh anniversary of the country.The upcoming exhibition was originally slated for March 12–March 20. The announcement came as the theme for the exhibition was the relationship between artists and their legacy. The exhibition will be curated by Dario Catellani, Head of the Arts department at the National Gallery of Ireland. The list of participating artists is as follows:Arts historian and theorist, Gavin BrownArts historian and theorist, Samantha BrownArts historian, Eleanor Campbell, author of The Body in Time (2014)Art historian and theorist, Alan DonkinBehavioral scientist, Anne DunsworthBehavioral scientist, Vivian DonoghueBehavioral scientist, Michael DonoghueBehavioral scientist, Catherine Donoghue, author of Shapes of Life: The Psychology", "The next Biennial should include a selection of exhibitions that will reflect on the history of art and will integrate all of the elements of Biennial of Italy into one exhibition. The opening of the exhibition should also be an occasion for the gathering of the public at the exhibition.The reopening of the exhibition should take place as part of the Biennial of Florence, which will ­​continue to take place in August at the Udine Palace in Rome. The institution will also host a public exhibition of works by artists from the Ivory Coast. The third edition of the festival will take place in the Almine Brescia in Northern Italy, as well as in Dusseldorf, Vienna, and Milan.\n\n\nThe New York City Department of Cultural Affairs (DCLA) and the New York Public Library (NYPL) have teamed up to give $500,000 to twenty-eight arts organizations in the city to encourage the distribution of new work by women artists. The grantees are the New York Institute of Technology, which received $250,000; the Museum of Modern Art, which received $200,000; the Museum of the City of New York, which received $200,000; and the Museum of Modern Art (MoMA), which is collaborating", "The next Biennial should be held in 2022. El Borghirmeh will be inaugurated in 2021. The last exhibition of the year, “2018,” will be held in 2021. There will also be an exhibition of work by artists from the Künstlerhaus in Berlin and several other international galleries in 2020.\n\n\nThe California Academy of the Arts (CalArts) in Los Angeles has appointed Elizabeth Anne Robinson, the author of “The Electric Kumbaya: Beauty and the Black Hole in the Soviet Union” (2016), as its next board president. Robinson will be the first trans-Atlantic artist to lead a major arts institution in the US. Robinson will take up the reins at CalArts in December.“I’ve worked with Elizabeth for some time and admire her vision and energy,” said Mark Block, chair of the board of trustees. “Her commitment to bringing interesting and thought-provoking work to our campus and community through exhibitions and programs that engage with contemporary issues and challenges, as well as our own personal histories and our wider world, is essential to the future of the Arts at UC Los Angeles.”Born in London in 1963,", "The next Biennial should take place in 2020, and it is hoped that this will be the year of the biennial. In addition to the exhibition, the new biennial will introduce new programs, including a new platform for research and an exhibition of work by artists and other groups. \n\n\nCape Town—Nelson-Atkin’s recently announced that it plans to open a new 300,000-square-foot, new art museum in the city of Cape Town, South Africa. Called the Museum of Contemporary Art, the new space will be inaugurated by an exhibition of work by the Los Angeles–based collective the Nude in the City of Los Angeles (LACMA), which will be followed by a presentation of work by Richard Serra. The institution will also host a number of events, including an artist-in-residence program and an annual art show. The museum opened in the city’s famous Art District in 2012. “The Museum of Contemporary Art is an exciting step forward in expanding our mission to reflect the contemporary South African landscape,” said LACMA director Cilvia Balo. “Richard and I are thrilled to open the Museum of Contemporary Art with a new vision for", "The next Biennial should be ready this fall. It will likely be two thousand square feet and will feature work by forty-five artists. \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of eighty rare works by five visiting artists from Italy. The donation includes works from the Giglio di Rivoli, a modernist masterpiece from the early 1900s, as well as works by Percival Bacon, Mary Cassatt, and Bridget Riley.The works were donated by Andrea Cossu, a curator at the Milan-based museum; Elena Cattani, a curator at the Museum of Contemporary Art, Naples; and her husband, Giovanni Cossu. They were selected by LACMA director, Victor Muñoz. “This gift is a great news milestone for us and represents an important step in the development of the art collection and the LACMA mission,” said LACMA director, Harlan M. Griffith. “We are thrilled that this gift coincides with the opening of the Giglio di Rivoli and the museum’s upcoming exhibition ‘Anatomy of a Scene: Italian Modernism, 1900–1930.’ The entire collection is now", "The next Biennial should focus on changing the paradigm of the exhibition by incorporating a larger-scale public installation, a digital platform for reflection, and other activities that engage with the themes of the exhibition. “The Future of Art: Art and the Future of Life” will be presented at the newly expanded Biennial in the Biennial of Exposition, which will be guided by a new director, Barbara Camille Bilello-Grau, in collaboration with an august board of curators and curators-in-residence. The thirty-oneth edition of the Biennial, which will run from March 17 to March 20, 2020, will feature work by more than 300 artists and will be curated by Lizzie Raubert, the director of the Biennial of Exposition. “The exhibition that is Biennial: Art and the Future of Life” will be inaugurated by artist Raubert’s first solo exhibition at the new venue, a four-minute video installation that assembles photographs from her own personal collection and from that of her husband, the French architect Yves Raubert, and includes a five-minute documentary footage that captures the artist’s relationship with her mother and her two", "The next Biennial should be in 2022. In the meantime, the museum will continue its work of restoring and organizing the work of contemporary artists, and it will continue to host programs that demonstrate the museum’s commitment to the public.“We are absolutely committed to supporting the newly appointed director, Jera Adams, and the mission of the museum,” said Wayne Koestenbaum, a former chief curator of the museum and now chief operating officer of the museum. “As we look to the future, we will continue to push for greater diversity of exhibitions, collections, and curation across our collection and in our exhibition space, and we will continue to give our guests a platform for a wide range of art.”\n\n\nLivestock producer and billionaire Richard Branson has pledged $1 billion to British Columbia’s new climate-change-fighting carbon capture and storage (CCS) system, which aims to reduce carbon dioxide emissions by converting carbon dioxide and other greenhouse gases into electricity and used by businesses and industries. The $8 billion scheme, developed by British Petroleum and the British Columbia government, is expected to be operational by 2021 and will help the world reduce its carbon emissions by 32 percent below 2005 levels by 2050.The", "The next Biennial should be transdisciplinary, incorporating both the history of the art and ecological issues of contemporary life, and should include a literary and a performance work.”The next Biennial of Curators will focus on the history of the art, with a view to the future. Its theme will be “Plausibility and the Production of Art.” It will be held at the Art Museum Helsinki and will run from March 15 to March 17.“It is a great honor to present the Biennial of Curators to the public at large,” said Elisa Hietaniemi, the chair of the upcoming edition. “The theme of this year’s Biennial of Curators is ‘Plausibility and the Production of Art.’ The artists who will participate are Teppo Rautela, Mahélio Zingaretti, Ola Ianno, Marta Jost, Juha Papic, and Kimi Tane. The event’s program of exhibitions, residencies, lectures, workshops, and other programming will be a reflection of the theme of this year’s Biennial of Curators.”The next installment of the Biennial of Curators will", "The next Biennial should be held at a location appropriate to the time and place of the exhibition and ideally should be a combination of the two.”In a separate development, Sony Pictures Entertainment, the parent company of the studio where the upcoming exhibition will be staged, announced today that it is now paying tribute to the late producer and director Lynn Forester, who is credited with inventing the modern jazz style, by donating $50,000 to the organization that organizes the biennial. Forester’s husband died when he was only forty-nine years old, and her children were born in 1972. Sony Pictures also announced that, in honor of the biennial’s fifty-fifth anniversary, the studio will donate $100,000 to the Walt Disney Company, the Walt Disney Family Foundation, and the National Endowment for the Arts.The Walt Disney Company, which runs the studio, helped raise the funds for the exhibition. The Walt Disney Family Foundation also agreed to contribute $100,000. Sony Pictures gave $100,000 to the Walt Disney Memorial Foundation, which helps raise funds for the Walt Disney Memorial Museum, and the Walt Disney Foundation agreed to give $100,000 to the Walt Disney Memorial Foundation, the Walt Disney Family Foundation", "The next Biennial should be held in 2021. According to the New York Times, the decision was made after the Festival signaled its intention to continue with its planned event, in a statement that said that it is still evaluating the situation. The change of heart was made amid growing concern in the art world and beyond the country over the political climate brought about by the coronavirus. On Monday, the festival was forced to cancel the event, which was set to take place in the art-historical town of Biennale di Biennale, in Rome, Italy. It also announced that it was planning to move the event to a different venue in Milan and that it would be unavailable until March 22. Dubai: Turmoil Continues at Dubai Art Biennale As the coronavirus continues to spread in the Arabian Peninsula, more and more art institutions and cultural sites are closing their doors and moving their events and programming online. As countries with the virus continue to announce their phases of quarantine and restates the ban, the number of cases has slowed to just over 2,300, but the coronavirus has already claimed the lives of more than 3,000 people. The Curators Guild of America (C", "The next Biennial should be held within the next decade, and it is estimated that if implemented, the eventual event will draw approximately 1.5 million visitors. The work of the British artist, educator, and activist, as well as that of the late Lebanese artist Marwan Rubbisher and the late sculpture-maker Ali Haidar, among others, will be included in the 2019 edition. As part of the International Biennial “The Concept of Life” , Kameel Ali Khan, the director of the London-based arts organization London Biennale, and the British artist and activist Mark Lynas, have launched a petition urging the British government to take an active role in the creation of a new cultural enclave in the Old City of Beirut. According to The Independent, the petition reads: “The government has a vital role in preserving and promoting the cultural heritage of modern and contemporary art, and we believe that an international exhibition and a new pavilion should be launched in the Old City of Beirut to reflect the breadth and spirit of the city.”\n\n\nThe Allen Memorial Art Museum in Los Angeles has appointed Mark S. Nelson as its next director and CEO. Nelson's appointment was announced by the museum", "The next Biennial should be held in 2021, but the dates have yet to be set. The first iteration of the event, titled “Art in the Age of Black Power,” was held at the University of Missouri in 2013. The second iteration, titled “Race in America Today,” was held at the Museum of Modern Art in New York in 2019. For Wangechi Mutu, the fifty-fifth iteration of the exhibition will be “a great way to start a new chapter of our history.”\n\n\nThe Museum of Chinese in Japan (BHMJ) has announced the addition of ten new works by eighteen artists to its collection. The works will be part of an attempt to create a more diverse collection of works by contemporary Chinese artists. The exhibition will open in the museum’s new Westlake building in Tokyo on January 27 and run through March 14.“The exhibition is a combination of new and traditional forms of communication,” said BHMJ director Yasuhiro Nakamura. The new works will be presented by artists who have lived in the country for a period of years, including Chu Yichang and Min Lin, as well as newcomers such as J", "The next Biennial should take place in 2020. “The biennial should be a chance for the Art of Beijing to be seen, heard, and felt in a way that was not possible before,” the Art Newspaper quoted Zhang Lei, a former director of the Art Museum Beijing, as saying.The first edition of the Chinese pavilion was held at the Guangdong Coast Art Exhibition in Guangzhou in 2012 and was staged in Beijing, Shanghai, and Xiamen. The second edition, held at the Xishuangbanna Art Museum in Xian and curated by Zhang Lei, was also held in Beijing in 2016 and was staged in Xiamen and Xian.\n\n\nThe Arizona State Museum of Art in Tempe, Arizona, has appointed Amy C. Gray as its next executive director. Gray comes to the institution from the Museum of Contemporary Art, Arizona, where she has served as interim director of public engagement since July 5.“Amy brings one of the most respected and admired stories of Arizona State University history and contemporary art to Arizona,” said director Michael Rinder. “Her tenure has been full of moments when her leadership has made her a hero to many, and she has not shied away from a fight", "The next Biennial should be held in 2022.\n\n\nSydney’s Museum of Contemporary Art (MAS) has announced that it will present a retrospective of works by the late Australian curator Don Quayyum in the city for its 249th anniversary. The exhibition will feature works dating back to 1904 and will be held at the current venue at 1300 Main Street, the former location of the Sydney Opera House, until October 23, 2022.Quayyum’s more than three hundred solo exhibitions, including the exhibition “Beyond the Cycle: Modern Art in the Twentieth Century” (2018) and “Krishnamurti: Art in Transition” (2007), as well as the “Elena Andreyeva: Life and Death” (2017), “Oddities,” and “The Great American Painter” (2017), will all open in October. The September 2019 edition of “Museum of Contemporary Art, Australia’s’s Best Show,” hosted by David Menzies, will also mark the institution’s first anniversary.The exhibition will run alongside the upcoming presentation of “Hard Times: Contemporary Art in the American West,�"]