["The next Biennial should be held in 2022, the artists said, and the first one in 2025. The next edition of the Biennale will take place in Rome, and the first show at the event will take place in 2021.\n\n\nThe Metropolitan Museum of Art in New York has added twelve new works by fourteen artists to its collection, bringing the total number of works in the collection to fifty-three. Among these works, which were acquired through gifts from individuals and foundations, are two works by Arne Glimcher of the Romford Museum (New York), and a work by John Gavin of the Shawshank collection (New York).Glimcher, whose photographs often feature intersecting landscapes that reveal different histories of human cultures, was commissioned to create a work for the museum in 1954. The work, Avant-Garde Oratoria: The Exactissima, was made in collaboration with the Romford Museum and presents an exhibition of Glimcher’s paintings from the collection. Gavin’s work, The Wind in My Head, was drawn by a woman in a gothic-fantasy setting and the Shawshank Collection’s sculpture The Girl in the Window, 1963, was created by", "The next Biennial should take place in the spring of 2020. The new date is also being considered for the series, which will be comprised of three times eight panels, and will run concurrently.“I will continuously seek to make the art exhibition that will be the best and most interesting for everyone,” said Hélène Laverrière, president of the Biennale de Paris. “The idea of the series is to bring together artists from different disciplines, and to create a long-term vision that will last for many generations.”The project will debut at the Paris Art Biennale in February 2021.\n\n\nThe National Gallery of Canada has announced that it will begin welcoming visitors again next week. The reopening date is March 24, 2020. The institution will have a full staff and a new exhibition, “The Nature of Things,” which will take up the theme of the biennial, “How nature creates its own world.” The exhibition will also include a new conversation between artist and collector, an artist and collector’s first joint project, an exhibition of work by Yinka Shonibare and a new collection of work by Jane Panayiotou, among others", "The next Biennial should take place in 2021. Jennie Brownell, director of the New York Museum of Art, said: “The next iteration of the Biennial will be as ambitious as the year we first hosted it. It will address the themes of our next visit to Egypt and the previous editions, which addressed themes of our past visits to the United States and the United Kingdom.”\n\n\nThe Turkish artist and curator Özan Kilar has been named the winner of this year’s Rotterdam Biennale. Kilar was selected for his “Erdoğan, Kültür,” 60-minute video installation, which combines images and text from the Turkish artist’s Erdoğan(s) final poem, which is published in English by the artist’s estate, and Kültür, which was written by the artist in 1954. Kilar was also selected for his “Question of History,” a three-minute video installation that transforms the themes of the Rotterdam Biennale into the lives of fictional Turkish leaders.In the video, which was filmed in Istanbul, Kilar says: “Istanbul is the canvas, the canvas is the power. There is", "The next Biennial should be held at the Endeavor, a new project of the Museum of Modern Art in New York, in 2021.  Meanwhile, a call for proposals for the 2020 edition of Art Basel Hong Kong is currently open.The full list of participating galleries is as follows:Art ArtasiaBicocca Art BaselBarcelonaBicocca GalleryBISCO BRICCA Contemporary ArtsCenterBISCO Contemporary Arts MarketBISCO Contemporary Arts Los AngelesBISCO Contemporary Art ParisBISCO Contemporary Arts SeoulBISCO Contemporary Arts Seoul DNVBISCO Contemporary Art ShanghaiBISCO Contemporary Art TokyoBISCO Contemporary Art Tokyo Gallery BISCO Contemporary Art TianjinBISCO Contemporary Art Tianjin InternationalBISCO Contemporary Art Tokyo JapanBISCO Contemporary Art Tokyo ParisBISCO Contemporary Art Tokyo Tokyo BISCO Contemporary Art Tokyo Tokyo BISCO Contemporary Art Tokyo Tokyo BISCO Contemporary Art Tokyo Tokyo BISCO Contemporary Art Tokyo Tokyo BISCO Contemporary Art Tokyo Tokyo BISCO Contemporary Art Tokyo Tokyo BISCO Contemporary Art Tokyo Tokyo BISCO Contemporary Art Tokyo Tokyo BISCO Contemporary Art Tokyo Tokyo BISCO Contemporary Art Tokyo Tokyo BISCO Contemporary Art Tokyo Tokyo BISCO", "The next Biennial should be on October 19, 2021.\n\n\nThe Museum of the African Diaspora (MAD) in Atlanta has been renamed. The museum, which was renamed after the late African American artist and activist Amara Darweesh, made the announcement on its Facebook page. The institution stated that it will now be known as the Georgia Museum of Art. “This is a major step in the direction of greater equality and equity in our collections and collections programs,” said museum director Ashley Williams. “We are grateful to Amara Darweesh and the entire African American community and especially to our visitors for the inspiration and support that she gave to this project.”The transformation of the museum will also introduce new programming that will explore the history of African American art and the art that has been influenced by AME. The museum will add two new galleries to its collection, a new public space for African American art, and several galleries that have never been seen before to the museum’s main building. The museum will also host an exhibition of African American art and artworks from the Carter-Dietrich Collection for the first time, and will undergo a $300 million expansion.The Georgia Museum of Art, which recently received", "The next Biennial should take place at least once a year, in accordance with the theme of the year. The twenty-fifth edition of the exhibition was moved to March 2019. The twenty-sixth Biennial will be staged at least twice a year. It will also be held on the fifteenth and fifteenth Saturdays of the month.\n\n\nThe Los Angeles County Museum of Art (LACMA) has celebrated its first anniversary as a museum. On Friday, March 21, the institution marked the occasion by presenting “Face of a New World: Los Angeles,” a new project by artist, designer, and educator Keith Parker, who was commissioned to create a new exhibition about urban life in the city, as well as a study group showing works by artists such as Vincent van Gogh and Pierre-Auguste Ren’s’s The City and the Moon,” which debuted at the museum on January 8. “The project was a response to the LACMA board of directors’ decision to sell the building that housed the museum’s collection and the museum’s current location in the city,” Parker told the Los Angeles Times. Keith Parker. Photo: LACMA.", "The next Biennial should have the theme of the artist’s relationship with the bodies of her subjects or, in other words, the bodies of her subjects in a way that will be related to the artist’s thought-experiment of my other life, which is that bodies are not bodies, bodies are living beings that have souls, souls are not bodies, bodies are not souls.” The project was first announced by the Museum of Modern Art and the Los Angeles County Museum of Art in 2009, and, for the first time, the Tate hosted a biennial. The show garnered over 60,000 visitors and featured work by more than 150 artists including Mark di Suvero, Joseph Beuys, and David Koons.\n\n\nThe Central Library and Museum in Atlanta has announced that it will send thousands of photographs by American photographer Annie Burnham to the Smithsonian American Art Museum in Washington, DC, to be displayed in a special exhibition called “America in the Photographs.” The thirty-sixth edition of the Annie Burnham & the Institutions North American series, “Between the Sun and the Moon,” will run in 2020 and will introduce Burnham’s famous “Sun and the Sun,", "The next Biennial should be held in the spring of 2022. \n\n\nThe Museum of Fine Arts (MFA) in Boston has announced that Nadiya Baghramian has been named curator of contemporary art. Baghramian comes to the institution from the Museum of Fine Arts (MFA), where she has served as director of exhibitions since 2017. During her tenure at the museum, she curated the exhibition “Between the Sun and the Moon: 20th Century Art in Iran” (2018), the fifteenth edition of “The Dartmouth Collection” (2017–18), and “Ishtar Art Museum” (2016).“We are thrilled to welcome Nadiya to the MFA,” said director and CEO Mary Anne Carter. “Her commitment and eagerness to collaborate with artists, communities, and audiences across the globe is evident. Her experience in curating and displaying work in a contemporary setting makes her uniquely qualified to guide our future exhibitions and programs.”The MFA has been working with Baghramian since 2013, when she organized “Kamala Harris: A Real American Girl” (2013), a presentation of work by twenty-three artists that was included in the", "The next Biennial should take place in 2021, when the exhibition will mark its thirtieth anniversary. The 2019 exhibition was the first ever devoted entirely to women in art history.\n\n\nThe City of Atlanta has announced that it will break ground next month on a new public art project that will connect the Silver Hill Arts District with the downtown core. The $500 million, seventy-two-acre overhaul will include the installation of more than seven thousand reclaimed materials, including salvaged art, sculptures, and photography equipment, as well as the redesign of public spaces.“The reconfiguration of the Silver Hill Arts District will allow the district to present a diverse range of work by contemporary artists and will include the opportunity to engage with established and emerging artists in a city-supported, community-based setting,” said Councilman Jimmy DeSantis. “With the expansion of the Silver Hill Arts District comes the expansion of the city’s cultural footprint and the city’s cultural economy, and the reconfiguration of the Silver Hill Arts District is part of that expansion.”The plan was first presented as part of a $6.2 billion plan for the District of Silver Hill, which was approved by Atlanta voters last year", "The next Biennial should be held in 2020, according to the organizers. Artforum reports that the 2019 event, which took place in the capital of Anatolia, was the first in the region to feature work by an indigenous artistic group. The group, called the Yerm Kalominsky Dance Company, comprised ten dancers, aged between sixteen and twenty-eight, who performed choreography that included traditional Russian folk dances, Russian military music, and, earlier this year, a performance of a folk song by the Bolshoi Ballet.\n\n\nArt historian and activist Olga Roldan has resigned from her position at the Pérez Art Museum in Miami Beach following a controversy caused by her association with a controversial painting by the Cuban-born, American-based artist Juana Corina’s Project/Haiti, Avant-Garde’s Television, 2011, which pitted her and her wife, Cara, against the island’s president, Joseph Boas, in an attempt to advance a pro-democracy movement.According to the Art Newspaper, the painting, which depicts a woman and a black, French-inspired chair surrounded by a constellation of eleven cigarette boxes, was commissioned by the artist in", "The next Biennial should be held in the second half of 2020, and the results should be announced by the end of the year.  Chair of the board of trustees of Artforum, a leading art-world magazine, said: “The Biennials are a very special occasion: because we are witnessing in the first instance the culmination of years of work by world-class artists, and because they are taking place in the beautiful city of Biennials itself. We are all delighted to work with the team and at the same time celebrate the art and the city that the Biennials are creating and bringing to life.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $5 million donation from the Sotheby’s International Art Prize. The funds will go to two programs that will help support the museum in its ongoing effort to bring new art to the city. The first, called Long-term Impact, will yield more than two hundred works on museum curatorial practice—a first for the institution—and will feature works on display in the newly expanded and expanded LACMA. The second, called Impact Maven, will showcase a selection of new work by thirty artists, including Walter", "The next Biennial should be held in 2021. The first was staged in 2010 and the two previous editions were staged in 2011 and 2013. \n\n\nThe House of Art, which celebrates the achievements and innovations of the past in the United States, is revamping its location, the Museum of Fine Arts (HFA), in Manhattan. The project, which is part of the renovation of the building, which is slated to open in the spring of 2021, will involve the relocation of the museum’s current exhibition space, the Hall of American Art, and will involve the rebuilding of an indoor and outdoor courtyard with 1,600 square feet of exhibition space, as well as the renovation of the museum’s existing building.“Telling the history of American art is a daunting task, but the House of Art is dedicated to bringing you the best stories from the collection, to how art can shape our lives and to exploring the most important artists of our time,” said HFA director and CEO Joachim Meineche Hansen. “We are delighted to explore the possibilities of contemporary art as we work to rethink what a House of Art is and what a Museum of Fine Arts might look like. The construction of the new Museum of Fine Arts", "The next Biennial should be held in 2021, when the Royal Academy of Arts (RA) in London will not be able to host the exhibition due to the Covid-19 pandemic. It will instead have to perform a series of programming that will run from June 12 to June 13. “The development of new technologies, new communications, new systems, and new ways of thinking about art and artmaking, is central to the future of creative work,” said Simon Charles, chair of the biennial. “With the departure of our executive director John Pritchard, the next Biennial will be a collective decision between the Board of Governors and the creative community, and will be a unique platform for reflection and community building.”This year’s biennial, “Feminine” (2019), brought together more than 150 artists and designers to examine the idea of beauty and its relation to social justice. The exhibition, which opened on March 24, 2019 and ran until October 28, 2019, encompassed the designs of poets, playwrights, photographers, architects, and other cultural and physical leaders throughout history.Among the artists chosen for the 2020 biennial are Irsha Jathus-Ishikawa, who", "The next Biennial should take place in the following cities:Annual Exhibition: October 7–November 23, 2021*We are currently in the process of creating this year’s exhibition as an immersive experience for the visitors of the Biennial, which will be guided by the artist and will be opened by the artist. It should focus on the themes of space, time, and the relationship between artist and viewer.\n\n\nThe British sculptor Tanya Schmidt-Davis, whose highly personal sculptures are infused with their subjects and their own experiences, has died at the age of eighty-two. Schmidt-Davis’s work is celebrated throughout the world for its—dramatic, sometimes violent—interconnections with her own personal life and the lives of those around her. A prolific creator, Schmidt-Davis crafts works that address the experience of loneliness, the body, and the body parts. Along with the body, the artist also creates works that address the challenges and vicissitudes of everyday life, both in and across cultures.Born in London in 1937, Schmidt-Davis studied at the Institute of Contemporary Arts in the City, London, before moving to New York to study under the famed J. M. W. Anderson at the Art Institute of Chicago", "The next Biennial should be called for “The Black Legacy: Palestine’s Art and Politics,” which will be held in 2022. It will be followed by “The Harvest: Palestine’s Journey to Independence” which will open in 2021.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that it is planning to lay off twenty-three staff members, or about one hundred employees, during a temporary shutdown due to the coronavirus. The museum is currently closed until March 11, when it will reopen in March.The decision to suspend operations at the museum was made following an investigation into a letter sent to the institution by forty-nine artists, academics, and activists who signed an open letter on March 6 expressing their concern about the coronavirus and urging it to 'implement immediate action to protect the health and wellbeing of our staff and visitors, and to consider the impact of the coronavirus on the wider community.” The letter, which was sent from Amsterdam, Paris, Madrid, and Shanghai, and was signed by sixty-six artists and cultural workers from forty countries, including Mexico, Pakistan, Egypt, Nigeria, Cambodia, Vietnam, Italy, Poland, Tunisia, Greece, Kenya", "The next Biennial should be held in 2020. Through partnering with the Aichi Prefectural Museum of Art (AIM), the new exhibition will highlight the work of thirty-four artists living and working in Tokyo, Yokohama, Nagoya, and Yokohina. The event will be organized as follows: Art and Culture: Research, Design, and Architecture from Japan. Art and Culture: A PREMIER LEADER STUDY. Art and Culture: RELIEF MOVES TO THE PLANET. Art and Culture: TRADING WITH TRADING. Artists in Tokyo: A-Z. Artists in Yokohama: A-Z. Artists in Nagoya: A-Z. Artists in Tokyo: A-Z. Artists in Nagoya: A-Z. Artists in Tokyo: A-Z. Artists in Tokyo: A-Z. Artists in Tokyo: A-Z. Artists in Tokyo: A-Z. Artists in Tokyo: A-Z. Artists in Tokyo: A-Z. Artists in Tokyo: A-Z. Artists in Tokyo: A-Z", "The next Biennial should take place in 2020.  Have a great year!  Samantha  This year’s edition of Samantha Keeling: A Beautiful Place to Be was a success, featuring work by twenty-four artists. The biennial was curated by Diane Alpert, artistic director of the Metropolitan Museum of Art, and Joshua Helmer, artistic director of the Museum of Fine Arts, Boston.“The sky was blue during the eclipse’s, and the sea was quiet,” Keeling told the New York Times. “I was very proud of being a part of the event and the exhibition. I think we can all look forward to seeing what it will mean next year.”\n\n\n\n\n\n\n\nJuliette Bianchi\n\nThe artist is currently on display at the Museum of Fine Arts, Boston, in the exhibition “An Autumn Forest,” which celebrates the autumnal equinoxes, vernal equinoxes, and equinoxes as well as the anniversary of her first show in the United States. The show will feature paintings and works on paper by Bianchi, who lives and works in New York, including “", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Nicoletta C. Trumbull as its next director. Trumbull will be the first director to lead the institution since 2004, when it was founded in the former Stillman Brothers dairy, which closed in 1996. She succeeds John Akomfrah, who retired in 2014 after a decade at the helm of MoCA.“Nicoletta brings a wealth of experience and knowledge to our team and we are extremely excited to have her on board,” said MoCA’s director, Deborah Alfaro. “This is a challenging time for the museum as we face a crisis of unprecedented proportions. MoCA is working hard to rebuild its infrastructure, implement new and innovative programs, and create new opportunities for the next generation of curators, researchers, and scholars. We are confident that Nicoletta will be instrumental in furthering our mission and enhancing the museum’s collection and exhibitions, while also ensuring the institution’s long-term sustainability through her leadership.”Trumbull will assume her responsibilities in early February.Commenting on her new role, she said: “I’m", "The next Biennial should be held in the spring of 2021, and will focus on the annals of twentieth-century art through the lens of the California Institute of Technology. “The course, like all of Biennial, will be based on a concept of art as a whole, and the artist as the center of a larger whole,” said Arne Glimcher, president of the Biennial Foundation. “It will also be a celebration of artists of the past, as well as the artists of the future. We are looking forward to seeing you there. We are and will always be at the forefront of the fight for social justice and for the arts.”In addition to the biennial, the foundation is currently working toward two other projects. The first is the city of Los Angeles’s Long Beach Station, a $100 million revitalization project that will add new galleries, offices, a hotel, and affordable housing. The second initiative, which will focus on artists’ labor and their community, is the $100 million artist’s strike fund, a growing collection of funds to help artists strike in support of social justice and workers’ rights. The strike fund is organized by the California Artists’ Association (CA", "The next Biennial should be held in Tokyo in 2022, followed by the United Kingdom in 2021.  The 2019 edition, which kicked off at the Metropolitan Museum of Art and ran for twelve days, was also open to the public. It is currently slated to return to the Met next spring.\n\n\nA new group dedicated to the preservation and study of works by the late Soviet artist Aleksandr Solzhenitsyn has been formed in Moscow. Its board comprises fourteen members, all of whom are artists, including the artist and designer Valentina Zagorodskoy, who was a cofounder of the brand Spetsnaz; the artist and educator Nadezhda Novitskova; and Kazimir Malev: one of the few remaining members of the Soviet Union’s permanent collective art movement.Its inaugural exhibition, “Das Kindern des Katzes” (“The Works of Alexander Solzhenitsyn”), will open at the newly reconstructed Solomon David Gallery in Moscow in June. The exhibition will include works by forty artists, including Nadezhda Novitskova, Alexei Gromov, and Oleg Cassini, among others who were active in the early 1980s, and", "The next Biennial should take place in 2019 and will offer lectures, panel discussions, and special exhibitions. The biennial of the Art Institute of Chicago will continue to be held at its existing location (the Art Institute of Chicago) on the city’s North Shore, which is currently undergoing a $320 million expansion. The biennial of Yale University in New Haven will continue to be held at its existing location at the university, which was converted into an arts complex during the university’s redevelopment plans. The Biennale di Espoli in Venice will take place at an adjacent venue in 2020 and will be hosted by the same architects and organizers. “This is an unprecedented and extremely challenging time for all of us at the Art Museum Chicago,” said Mark Hamill, the actor and director, along with director of the upcoming “The Rogue of Bellefonte: The Untold Story” at the museum. “It’s a challenging and exciting time to be an independent curator. We are grateful to Ms. Mone and the board for their vision, expertise, and commitment in helping the museum to become a strong partner for artists and creatives across the globe.”Last year, the museum relocated", "The next Biennial should be held at a location other than the Paris Alpes, and will examine the role of art in sustaining and transforming communities in the region. The institution has yet to confirm or deny the existence of the exhibition. Established in 2017, the biennial is sponsored by the Sétafrère Foundation. The Paris-based nonprofit will donate $300,000 to the institution. \n\n\nAmerican photographer Tim Minchin, known for his iconic photographs that depict urban landscapes with powerful, experimental, and sometimes surrealistic images, died on May 28 at age eighty-seven. Born in Detroit in 1943, the son of a former coal miner, Minchin moved to California in the early 1950s to pursue a career in photography. When he returned to the United States, he began working with the artist-run nonprofit the Detroit Institute of Arts (DIA), where he met Stefanie Cooper, the daughter of Michael and Grace Cooper, and became their collaborator. Together they began the series of photographs known as the Return, which combined Minchin’s own words, photographs taken in a lab in Lake Geneva, and words and images from the Return’s own collection, which includes photographs created during the artist’s childhood, as well", "The next Biennial should focus on explaining the compactness of the universe, its relation to the larger universe, the history of the universe, and the future of the universe, focusing on the anthropic principles that are central to the theory of the universe and its structure. The next Biennial should aim to develop a new concept of universal history, one that takes into account the dynamical, historical, and material processes that have shaped the universe we inhabit. The next Biennial should organize a project that would include a systematic analysis of the history of the universe, from the Big Bang to the present, and on the future of the universe. The next Biennial should engage with philosophers, scientists, and others in a way that is within the scope of the current exhibition. The next Biennial should take place in a place where people are actively involved in and can be, and have been, touched by art. The next Biennial should be inclusive of artists from all over the world and should provide an opportunity to connect with them. The next Biennial should be organized in a way that allows the public to experience it as an ecological project. The next Biennial should be organized in a way that coordinates social movement and ecological concerns internationally.\n\n", "The next Biennial should be pushed back by a year to June 2021. The programme will be redesigned in line with the evolving needs of the biennial and the public as well as the biennial’s artistic team. The schedule will be redesigned to take account of the demands of the year. “We are committed to supporting the art of the future in 2020,” said Yuki Nakaya, the director of the Biennial and the Exhibition Institute. “As a country, we are rapidly moving from the era of the biennial into the era of the exhibition. The best way to prepare for this transition is to create new and more viable opportunities to engage with contemporary art. By reopening in 2020, we hope to be able to present the most diverse and exciting exhibitions for an exhibition year in 2020, and to sate the growing demand for new and different ways of seeing art.”\n\n\nIn the first week of January, the French Ministry of Culture took a step that will give artists and cultural workers in the country the ability to create and export their own work in the form of photographs. The regulation, which states that the government may ask a museum to create a work for the purposes of “research�", "The next Biennial should be held in the spring of 2020. ​Artforum reported that the museum is currently reviewing biennial requests by twenty-one artists—including Sophie Albrecht, Agnes Martin, Anna-Sophie Ohlens, and Marianne Bouchard—who are seeking $10,000.Museum director Lévy Gorvy (the architect who designed the museum’s first installation, the Vincent van Gogh Biennial, in 1972) said: “We have been working for some time to prepare for the upcoming exhibition, ‘In Praise of Night.” The museum is currently working on a new setting: The Future Is Night, a new exhibition that will feature performances, sculptures, performances, and performances.  \n\n\nThe National Gallery of Art in Washington, DC, has announced that it will reopen to the public on August 29 after it was closed for three weeks due to the Covid-19 pandemic. The institution is currently closed until September 13 due to the coronavirus. The National Gallery of Art, which is currently undergoing a $75 million expansion, had previously announced that it would reopen with a significant renovation in September. The renovation, which will include", "The next Biennial should take place at the Art Institute of Chicago (AIC), where it will have the same opening as its predecessor. “The event has a unique relationship with the Art Institute of Chicago, which has always held a special place in my heart,” said designer and owner Mark L. Friedman. “I’m very excited to work with the team at the Art Institute of Chicago to create a new theme and an exclusive program for the museum that reflects the rich legacy of the Art Institute of Chicago and that will serve as a powerful reminder of the central role it played in my own life and art.”The Biennial will be inaugurated with a special exhibition of work by the Chicago-based artist Sohrab Mohebbi, who is best known for his multidisciplinary practice of painting, sculpture, and installation. The exhibition will be accompanied by a discussion group for artists, designers, and art-world professionals, and will run for three weeks.Curated by Barbara Clark, a curator and cofounder of the Chicago art scene, and featuring the work of forty-three artists, the biennial will also feature an exhibition of work by artist-run organizations, a discussion about how art can empower people,", "The next Biennial should be held in 2021. This is a clear example that a majority of museums are now in agreement with the new Digital Museum Act, which will establish an open platform for cultural exchange and cooperation between the European Union and Turkey. The legislation stipulates that the European Commission, the European Parliament, and the Council have the power to suspend visas and travel permits for individuals, companies, and foreign delegations. Culture Minister Şahin told the Hürriyet Daily News that the government is monitoring the #ArtAttackArt campaign and has taken necessary measures to protect cultural sites. She also noted that the restoration of a large-scale art work at a museum in Istanbul is not an option if the museum is attacked. The museum was attacked on Saturday, October 14, the same day the new digital museum project was launched. The works ultimately destroyed were the Turkish National Museum of Art (TAM), the Fenerbahçe National Museum of Art (FEMAM), and the Sultan Mehmet and Süleyman Museum of National Art.The damage was estimated at $3.2 million. According to Hurriyet, the attack was carried out by three groups: the Islamic State in Iraq and the Levant (ISIS), the", "The next Biennial should be on the island of Palau in September 2020. “I’m ready for anything,” Eriksson told the Art Newspaper. “I’m going to be able to move again. I’ll be able to walk again. I’m going to be able to run again.”Throughout her years of sculpting, Eriksson had competed in the Miss Hawaii USA and Miss America pageant; won a $20,000 prize from the International Galerie in New York; and appeared in numerous television documentaries. She has also had solo exhibitions at the Museum of Modern Art, New York; the Sargent’s Daughters, Los Angeles; the National Museum of Women in the Arts, Washington, DC; the Museum of Modern Art, Pittsburgh; and the Museum of Modern Art, London.\n\n\nThe Saskatchewan Contemporary Arts Festival announced today that it is returning to the city of Saskatoon, Saskatchewan, in February 2021. The event, which features a free general admission ticket price of $45, will be held at the Saskatoon Performing Arts Center (SPAC) between February 23 and March 4. The 2019 edition of the festival, which was also co-organized", "The next Biennial should be held in 2020.\n\n\nThe National Center for Biennial Studies in Washington, DC, has welcomed Kathleen Carrington and her husband, David Carrington, to the department of arts and culture. The biennial will be centered around a concept that dates back at least sixty years: the annual exhibition of a work by a single artist. The couple will collaborate with Brian Whitley, a curator and critic whose practice spans art, architecture, design, design-making, performance, and performance-art.Whitley will present the work The Great American Future, 1949–1949, with a selection of work by thirty-eight artists, including Robert Irwin, Alice Miller, Mark di Suvero, Paul Gauguin, and Vincent van Gogh. The exhibition will run for sixteen weeks in 2020.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that Rudolf Bangalter has been chosen as its next president. In his second term at the institution, Bangalter will lead the ICA through its inaugural season, which will kick off in March 2021. He succeeds the late chair of the board, Sir Tim Berners-Lee, who was appointed last year to the post of chief executive. Ralph", "The next Biennial should be held at the Museum of Modern Art, New York, in 2021. The first iteration of the symposium, titled “Two Worlds,” took place in the museum in November 2019.The 8,000-piece exhibition was organized by the Los Angeles–based nonprofit The Winslow Center for Art and Technology in California and is supported by the UOVI Foundation, a philanthropic organization that was started by the late billionaire Richard and Lucille Winslow. “The Transformation of the City,” co-curated by the Winslow Foundation and the Los Angeles–based firm Populous, will be on view March 14–March 21.\n\n\nThe Museum of Arts and Design (MAD) in New York has received a major gift of more than 7,000 works from the estate of the late British architect Sir Malcolm Rifkind. The donation included 4,900 pieces by more than 100 artists, including Piet Mondrian, Roy Lichtenstein, Mierle, and J.M. Wächtschalk, as well as works by Jacques-Louis Kahn, Robert Irwin, and Jean-Michel Basquiat.“We are incredibly delighted that Sir Malcolm has agreed to help us secure", "The next Biennial should be held in 2021.\n\n\nIn a move that will have a profound impact on the art world and the balance of power between creative and commercial galleries, the Museum of Modern Art (MoMA) in New York has appointed Marc Platt as its next executive director. Platt will take up the post in January 2021.“We are thrilled to welcome Marc to the museum, where he will assume an important role in shaping the museum’s future,” said Museum of Modern Art director Mary Anne Gillies. “It has been a great honor to serve as executive director of MoMA, and to work with Marc on his ambitious vision to build an immersive, world-class exhibition space in the museum. We are confident that his expertise and vision will ensure that we are able to continue to thrive as an innovative and robust center for art in our city and region.”The museum is working to raise funds for the $1.2 billion renovation of its former building, which opened in 1901 and houses the institution’s original collection, and is seeking private donations for the project. The fundraising effort is supported by gifts from the Mitchell and Ness foundation, the Rockefeller Brothers, Mary Mattingly, the Andrew", "The next Biennial should be attended by as many as 200,000 people. The first edition will be held in May, 2020, at the São Paulo Archaeologia. \n\n\nThe New York–based conservation organization Panthera has launched a new initiative to help Brazilians address climate change. Called Sustárdimento de Carbonístas (Sustainability of Carbon), the initiative will partner with local, regional, and federal governments to develop a national strategy for managing greenhouse gases and climate impacts.“We are launching this initiative in order to promote a more robust and inclusive discussion about climate change and to offer practical tools to help ensure that the climate emergency is not only averted, but transformed into a reality,” said Andrea De Sousa, president and CEO of Panthera. “The challenge is to do this while simultaneously delivering on the significant climate pledges made by the previous government.”Currently, Brazil has the third-largest carbon dioxide emissions in the world behind China and India. The country’s total emissions are expected to rise by 15 percent by 2020, surpassing the United States’ total emissions by 2050. According to the United Nations, Brazil is the world’s third-largest emitter", "The next Biennial should be held at a location that can accommodate the full exhibition, which will then move to a new location.The participation fee for the inaugural edition was $2,500 and will go towards artistic production and the acquisition of the necessary materials, including the exhibition materials, the series materials, the installation materials, the installation videos, and the website. The first exhibition will be held at the Museum of Contemporary Art (MoCA) in New York, which has been closed since July 24. The second will be held at the Brooklyn Academy of Music—an independent organization that provides a platform for artists to showcase their work.The competition committee comprises Jodi Swier, curator of digital media at the Museum of Contemporary Art in Los Angeles; Andrew Schoelkopf, director of Kohn Gallery in New York; and Peter Schoelkopf, curator of Modern Art at the Museum of Modern Art, New York.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released guidelines for the installation of new works by new and established artists, including artist-in-residence Alex Katz, who will be the centerpiece of “The Present: Stories of Artists,” which will be on view until March 22.", "The next Biennial should be held at the new museum in 2021 and will be curated by Roderick Mayhew, the former director of Tate Britain. The current exhibition, which will be hosted by the London-based artist Mary Beard, will resume in February 2022. The 2020 initiative drew ten thousand visitors to the museum from twenty-nine countries. The 2019 edition was held in Nelson Mandela’s home country of South Africa. Although the museum declined to name the participants for the 2020 edition, a spokesperson for the event said: “The theme for the museum is a humanist philosophy of art. The history of art is a history of artists.”Last year, the inaugural episode, titled A Humanist History of Art, was held at the London museum. The biennial was also an attempt to take the history of art back to the birthplace of the art and the British Museum. The exhibition also included a virtual reality experience and five works by artists from the exhibition.\n\n\nThe Albright-Knox Art Museum in Buffalo, New York, has agreed to pay $10 million to settle a wrongful-death lawsuit brought by a Buffalo native, who was killed by the bomb squad in 2010 shortly after a show by", "The next Biennial should be held between May and November 2021. The next Figure Eight Film Festival should be held between March and May 2022. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Mark B. Larson as its new associate curator of twentieth-century art. Larson currently serves as a curator at the California Institute of Technology in Pasadena. He will assume his new role in October.“We are delighted that Mark has agreed to join MoCA,” said director Anthony Burch. “It is a great honor to welcome Mark to the museum, and we are confident that he will be instrumental in our continued success as we embark on a new chapter of the Biennial. We are also optimistic and inspired by his career trajectory. We are excited that he will continue to present compelling exhibitions and engaging public programs that draw from art from across the globe.”Associate curator of twentieth-century art, Mark B. Larson, curator at the California Institute of Technology. Photo: Bill Ingalls. Courtesy of MoCA.\n\n\nThe Gordon Parks Foundation, a London charitable organization that supports artists and writers through the use of grants, has announced the launch of the Gordon Parks Prize, which honors excellence in the field of art", "The next Biennial should be held at the museum in 2021. The committee will decide on the date by June 1.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed David S. Hinkley as its next director. He will be responsible for overseeing the museum’s expansion and renovation projects currently underway at the institution. Hinkley joins the institution from the Metropolitan Museum of Art in New York, where he has served as director since March 2019. He succeeds Daniel H. Weiss, who retired in March 2020 after ten years at the helm of the museum.Hinkley comes to MoMA from the Museum of Modern Art (MoMA) in Miami, which he has led since 2018. During his tenure at the museum, he expanded its collection and oversaw opening and renovation of new exhibitions, including “The Future Is Present: Art and the Electronic Age” (2019) and “The Future Is Present: Art and the Electronic Age II” (2018–19). He also oversaw the acquisition of works by artists such as John Akomfrah, Anish Kapoor, Vincent van Gogh, and Agnes Martin.Commenting on his appointment, Hinkley said: “I’m", "The next Biennial should focus on “The Social,” a term coined by anthropologist and theorist of the body Shulamith Rosenberg to describe how cultural and political practices embody social forces. The 2020 edition will be staged at the Museum of Modern Art in New York from March 13 to March 16. Bernard Kamm, the director of the Metropolitan Museum of Art, and his team are currently working on a new title for the show. “The psychic effects that art has on the brain are the main subject of this exhibition,” Kamm said in a statement. “The exhibition will be framed as a history of art, and of the psychological and physical effects art has on the body.”\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to move the next edition of the Whitney Biennial—which was held on January 25—to February 21, 2020. The move has been made in response to the coronavirus, which has since spread to 16 countries and two U.S. territories.The latest iteration, titled “The Truth About Beauty,” garnered more than three thousand entries and featured work by seventy-five artists. The inaugural exhibition, “Eleanor", "The next Biennial should focus on the artist-in-residence (EIR), a project-based, community-based approach to teaching and scholarly exchange; “Art and the Body” will be the theme of the biennial; and “Graphic Design in the Age of Mechanical Reproduction” will be a poster of a work by a contemporary artist, Gertrude Alma, who was a member of the Vittorio Emanuele Artista.\n\n\nThe San Diego Museum of Art (SDMO) is planning to open a new public art museum in the city, in partnership with the San Diego Foundation for Contemporary Art (SDFA), on February 5. The new institution will be located on the third floor of the museum, in a building designed by architects Herzog & de Meuron. The foundation is funding the project, which was conceived in 2006 as a way to create a new center for contemporary art in San Diego, and will handle the day-to-day operations of the museum.“The museum will continue to be a center of excellence for art in San Diego, and the sponsors have been integral in bringing this project to fruition,” said Museum Director Edward Griffith. “All", "The next Biennial should take place in 2021 and will hopefully be a collaboration between the museum, the city of Vancouver, and the surrounding community. The theme of the exhibition is “Desert: Reconstructing the Place.” The first edition of Desert will feature work by twenty-five artists, all of whom have received the Diamond Jubilee Award. Begun in 2017, the award is given annually to a Canadian artist. The festival will also introduce new art and will be held at two locations: Exhibition Place, a new building designed by the same architect, and the Museum of Contemporary Art, Toronto. The exhibition will be hosted by the British architect Ralph Duckworth and the French architect Bernard Boudin, and will run for two weeks. “We are delighted to be able to deliver a stunning Design Museum in a city that has been a leading centre for art since the mid-1960s,” said Andrew Wiles, the museum’s director. “Desert: Reconstructing the Place will introduce critical art from the biennial, which we believe will serve as an important milestone in our ongoing journey. It will also be a chance for the artists to express their concerns about their place", "The next Biennial should consider the long-term legacy of the museum’s collection, and it should also consider the museum’s potential to serve as a model for future academic and institutional efforts.”The next edition of the Biennial, slated to take place in 2022, will focus on “the body and its function in human life,” and will feature a range of new exhibitions, including the first major retrospective of Rubens Roca, the architect who designed the Los Angeles County Museum of Art, and will feature the first large-scale sculpture from the new museum.\n\n\nThe John Simon Guggenheim Foundation (JGFF) in New York announced today that it is reopening its fourteenth-century abbey in Todi, Italy, with a new exhibition, “In Memory of Simon Guggenheim,” which will be staged in the autumn of 2020. The show will be organized as a “collection of his paintings,” “a story of his art,” and “a place to reflect and remain connected to the Guggenheim’s legacy.”The Guggenheim Society, which has hosted the exhibition in the summer of 2018, said", "The next Biennial should be executed in ten months.” The Centro de Histórias Revolucionario (CCH), which is jointly owned by the Congress of the Philippines and the National Association of Art Historians (NAA), plans to set up a committee to oversee the installation of the exhibition.The NAA is asking the curators of the upcoming exhibition to consider including artist portraits and local legends in an effort to create a story-based experience.\n\n\nArtist-run exhibitions and workshops have been banned from the New York state fair this year, as have some performances. But, despite the ban, artists are still working and are staging their own events. In early May, Tokyo-based artist Ryuji Kondo was selected to represent Japan at the Fifty-Ninth Venice Biennale. In addition to his residency, Kondo will present a solo exhibition at the Javits Center in New York in September. The announcement of Kondo’s presentation at the fair was made before a massive security operation was launched by the New York Police Department (NYPD), which has been conducting annual \"red alerts,\" or high-profile, events in an attempt to keep the public safe. Last month, the fair announced that", "The next Biennial should be held in 2021. Its next edition, to be held in Ljubljana, will be held in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in New York is working toward revamping its campus in pursuit of more environmentally friendly buildings that will help meet the city’s growing demand for art. The museum recently unveiled a new program, MoCA at Home, which will help families and senior citizens connect with works by and explore the museum’s collection in their own homes. The initiative was inspired by the Brooklyn neighborhood’s desire for new green spaces to promote neighborhood vitality. The museum hopes that the initiative will become a model for how cities can work together to address climate change.The institution made the announcement on January 4, 2020, the same day that the museum reopened to the public following a $1 billion expansion. The project included the installation of a new 1,200-square-foot theater, a new rooftop café, and the addition of a public green space, as well as the renovation of the museum’s former headquarters.In commemoration of the milestone, MoCA will also present the first-ever public tour of the building of the museum, as it was known during", "The next Biennial should take place at the Swarovski Institute in Prague, the Palazzo di Campiglio in Venice, the Università di Fribourgio in Rome, and the Università di Savoia in the island of Sardinia. \n\n\nThe Jordan Foundation announced today that it will no longer receive funding from the United Arab Emirates (UAE) in its various activities, including its annual Abu Dhabi Initiative, an annual fellowship program that has supported the visual arts of the United Arab Emirates in the past. The move follows a series of events and statements by Jordanians, artists, academics, and activists in the country; the United Arab Emirates; and the United States, which has been decrying the UAE’s human-rights violations since it began detaining and forcibly displacing thousands of people, including artists and activists, in the country.The foundation’s director, Anne Harden, said: “The recent events in the UAE have led us to consider the future of our fellowship program, and we are deeply grateful to the international community, particularly the UAE, for standing by the camp of artists and activists who have been affected by the displacement and repression in the UAE.”She also said that the", "The next Biennial should be held in 2020 and will be months from now. “This is not a time for illusion, a time for hubris, a time for violence,” said Maha Nabi, organizing director of the EI.City of Art and the Indonesian Arts and Culture Forum. “Rather the next one should be a time of reflection and reflection should be a time of hope.”\n\n\nThe National Museum of Art in Washington, DC, is planning to shutter its doors indefinitely as part of a deal that will see the museum reopen with a $100 million gift from Republican presidential candidate Donald Trump. According to the New York Times, the museum received the $83 million gift on June 1. “As part of a comprehensive deal struck between the museum and the Trump campaign, the museum will reopen with a $100 million gift from Donald Trump, giving the campaign a major gift in the form of an enormous display of Trump’s art,” Michael Browne, the president of the National Museum of Art, told the New York Times. The institution has yet to determine the exact date for the reopening of the museum, but Browne said that it would likely take place sometime this summer. “It", "The next Biennial should examine the history of the Netherlands’s National Museum of Modern Art (NHMo) and its recent reopening as part of the Dutch–Belgian strategy to reduce the country’s debt. The institution will also be the setting for a series of exhibitions and a concert series.Following the assembly, Nederlandskapital, which has been going since 2007, will stage four events next year. The first, “The Future Is Present: Art & the Present in the New Middle Ages” will be held in the Netherlands in September 2019. The second annual “Art & the Future,” which will also take place in October, will focus on the collection and conservation of twentieth-century art in the Netherlands. The third and final exhibition will be “The Universal,” which will be held in November 2019. Comprising Olivier Fitoussi, the director of the Rijks-Maastricht Museum in the Netherlands; Joi Ito, the director of the Museum of Modern Art in Taipei; and Hilde-Marie Wijers, the chairman of Nederlandskapital, the event will organize a total of seventy-five exhibitions and will include a", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid, which will host an exhibition of works by the artists who were selected for this year’s edition of the International Biennale in New York in 2020. The exhibition will take up the themes “Intellectual property rights and the exclusion of indigenous artists in Mexico’s art,” the newly formed state of Mexico City, and the growth of a new state-backed platform for indigenous cultural and artistic projects in the country.The 2019 international exhibition, entitled “Mexico’s Art and Politics,” toured Mexico City in collaboration with nine artists\u0097including César Morales, Nancy Mark, Laura de Barba, Andrea Rodríguez, Marlene Castro, and Jes Fan\u0097and opened on October 6. The show will feature work by sixty artists, including Jorge García-Alvarez, Kiki Smith, and Nicodemo Schemidt.\n\n\nThe Museum of Contemporary Art (MoCA), San Francisco, has appointed Mary Sue Wilkes as its next executive director. Wilkes succeeds Marc Glimcher, who has served in the position for", "The next Biennial should be chosen from the candidates outlined in the first round, and a jury comprising a group comprising art historian and curator Jannis Kounellis and art historian and curators Irene Mayhew and Wangechi Mutu should select the winner from among the remaining entries. The venue would then take a year to prepare and would enroll as many as three hundred artists.According to Artnews, the twenty-fourth edition of the Biennial will be held in 2020. The first round of entries, which are currently closed, were judged by a jury comprising Kasper Schloss, director of the Museum der Moderne Stiftung Zürich; Klaus-Dieter Zou, a curator at the Museum Freie Kunstverein Frankfurt; Paul Kuester, a visiting scholar at the University of Gothenburg; and Joachim Neumann, a professor at the University of Leipzig. The second and third rounds of the biennial, which are currently on display at the Museum Freie Kunstverein Frankfurt, will open in 2021 and 2021, respectively. \n\n\nTomas Lycan is planning to sue the Metropolitan Museum of Art (MoMA) in New York over a mural he painted", "The next Biennial should be staged in the fall of 2020. “The Art of Memory: The Art of Memory as Seen Through the Eyes of Others” will be presented by the NYC-based artist and curator Patrice B. Iberg, who has a theater background but is best known for his photographs, which capture the lives and deaths of young African American boys. Iberg, who is white, has performed at the Brooklyn Museum, the Bronx Museum of the Arts, and the Bronx Performing Arts Center; Ruba Ruparel, the CEO of the Brooklyn Museum, has also expressed interest in the project. The next edition, scheduled for July 23–July 26, 2020, will feature exhibitions and performances in forty-four cities across the US. The theme of the year 2020 is “memory, the body, and the soul.”\n\n\nThe retrospective staged earlier this year at the Museo de Arte Contemporáneo at the Museo de Industria in Madrid was abruptly canceled due to the coronavirus, the Spanish daily newspaper ABC reports. The show, which focused on the history of ceramics, became the first major event of its kind to be canceled and", "The next Biennial should be held in 2021.The full list of participating artists is as follows:\n\n\nArtistic Director: Theo SlobodchikDirector of the Rijksjunde Gallery in Amsterdam: Anna-Sophie OosterhuijsenArtistic Director: Bonham-Ward Gallery in London: Archte de Vetten in Amsterdam: A.J. SchillerArtistic Director: Andreas StrømArtistic Director: Alexandre Remarque Artistic Director: Michael RupprechtArtistic Director: Michael RupprechtArtistic Director: Natalie WaldmanArtistic Director: Patrick RoeslerArtistic Director: Karin Whitney’s group exhibition at the Art Institute of Chicago Artistic Director: Samantha Shetterly’s group exhibition at the Art Institute of Chicago Artistic Director: Sara Cwynar’s group exhibition at the Art Institute of Chicago Artistic Director: Samantha Shetterly’s group exhibition at the Art Institute of Chicago Artistic Director: Sara Cwynar’s group exhibition at the Art Institute of Chicago Artistic Director", "The next Biennial should address issues of contemporary life and society, and will be held over a period of twelve months.”The first edition of the biennial was held at the Museum of Contemporary Art, Boston, in November 2019. The new iteration of the biennial will take place in the Museum of Contemporary Art, San Francisco, from March 22 to March 31, 2020, with the opening of a free, all-ages event on March 22.\n\n\nThe Art Newspaper reports that the Swiss Federal Office of Culture (BfO) has opened a review of the Swiss Federal Republic’s 2020 budget by a committee headed by Jan Steidl, former chief of the department of cultural affairs of the Federal Republic of Germany. The BfO is examining a proposal that would reshape the social security budget by moving from an annual benefit to a monthly stipend. Although the change would entail a $0.25 increase in the amount of the Federal Social Security System (BIS), the BfO expects the change will not have a significant impact on the budget in any way.“In future years the BIS will continue to receive the old amount from the federal government, but it will be much less in 2020,” Steid", "The next Biennial should be in 2020 and will be hosted at the new venue Andreasa Gallery in Frankfurt. The opening will be on March 23 and the closing date is March 28.The next edition will take place at the newly constructed museum in the city of Frankfurt and will present the work of fifty artists. Among the artists chosen are Benjamin Britten, Paul Gauguin, Jean Marc Saussure, Saki Niedź, and Jules and Paul Tait. The exhibition will also be organized around a theme of the urban landscape, architecture and design, and urban struggles: “Between Futurism and State,” said Kline. The first exhibition, “Between Futurism and State,” will open on February 9 and run until February 10. The second, “Between Futurism and Landscape,” will be open on February 23 and open until February 27. “On the same day that our exhibition inaugurated the exhibition, we received an invitation to present the work of the great sculptor Janet and the astonishing Sophie Hadai,” said Kuhnen.  \n\n\nThe Modern Institute of Art (MI) in Los Angeles has received a $3 million donation", "The next Biennial should take place in 2021 and will open in North Korea.The 2019 event took place in the capital, Pyongyang, and was organized by the prestigious Seoul-based think tank the Institute for Korean Studies. In the run-up to the exhibition, South Korea and the United States signed an agreement pledging to cut their greenhouse gases by 26 percent and 36 percent, respectively. The agreement will also see the construction of a million metric tons of material and energy efficiency equipment for North Korea's struggling textile industry.\n\n\nChester A. Barlow, the director and CEO of the Tarrytown Museum in New York, has announced that the museum will suspend its exhibition “Theatre of Lies: The Untold Story,” because the show, which was part of the Tarrytown Woodworks’s ongoing reopening in January, has reemerged as a work that addresses the ongoing threat of climate change and the ecological crisis caused by extraction of natural resources. Barlow told the New York Times that the exhibition was motivated by a desire to honor the Woodworks’s longtime commitment to environmental preservation. The museum has since completed a $30 million restoration, which it says will “provide a path to understanding and appreciation", "The next Biennial should take place in 2021. The current exhibition, “NIRIN: Reflections,” will remain on view through April 23.\n\n\nThe Carnegie Museum of Art, the Detroit Institute of Arts, and the Museum of Fine Arts (MFA Detroit) have announced that they are reviewing their exhibition spaces for potential new construction. The institutions are currently discussing the future of the RCA, which has been on the market since January, and the Lowertown Center, which has been on the market since March and has been closed since March 15. The museums announced that they are also evaluating the future of the Art Institute of Chicago, which has been on the market since February, and the Whitney Museum of American Art, which is currently on hold due to Covid-19.\n\n\nThe Calgary Art Museum (CAMD) is preparing to open on September 14, 2020, following a $75 million expansion, the year-round arts institution announced on Wednesday. CAMD’s new home will sit in the city’s heart and will be named the Contemporary Arts Museum Calgary (CAFAM), after CAMD’s current location on the southwest corner of its former site.“This project, together with the", "The next Biennial should be held in July 2020. [Update: A separate and more recent interpretation of the word 2015 has been added.]\n The New York City Department of Cultural Affairs has released guidelines for the reopening of art museums in the city. Under the direction of commissioner Mary Anne Reuther, the guidelines outline the steps artists and cultural workers must take to protect and preserve their collections and staff. The guidelines were developed in consultation with the tenured and full-time faculty of the city’s museums and were drafted by the consulting firm Hirschman & Wirth. The guidelines were released on August 23.“This summer, we worked closely with our staff, faculty, and the general public to develop a comprehensive set of guidelines for the reopening of City institutions,” Reuther told the Art Newspaper. “We are now drafting new safety and preservation rules to ensure museum safety and to ensure that the museums will be able to serve the communities they serve. We will share more details about those steps with the public as we continue to work with our museums to understand their needs and local communities and to find the best ways to work with our museums.”The guidelines outline steps artists and", "The next Biennial should already be in progress and should be announced later this year.\n\n\nThe Solomon R. Guggenheim Museum in New York, which was forced to cancel a major art-world event following a bomb scare in which thirty people were killed and six hundred injured, has received a gift of forty-three works by twenty-five artists\u0097one of whom, Yinka Shonibare, was named the recipient of the $50,000 Kennedy Center Honors. The Guggenheim’s newly elected director, Richard Armstrong, announced the honor this morning, informing the public that the collection would not only include work by the late artist’s peers but also “a variety of new and older artists, including Jean-Michel Basquiat, Mark B. Evans, and Chris Ware. Together they will form the nucleus of a landmark exhibition, ‘Marking Time,’ ” which will open on June 22 and run through November 22.“Courageously, sensibly, and courageously, Shonibare and Basquiat’s exploration of the meaning of the body and its relation to the universe, respectively, are central themes of the show,” Armstrong wrote", "The next Biennial should be held in South Korea in 2020.  The Campópolis Museum of Art in Lisbon and the Museo de Arte Contemporáneo de Lisbon in Lisbon will also present projects focused on South American art. “South American art has long been recognized internationally and has been a source of inspiration for the minds of many,” said Adriano Fernandes, director of the Museo de Arte Contemporáneo de Lisbon and the Museo de Arte de Lisbon. “Since its inception, the Biennial has been a platform for thinking about the world through the lens of art, connecting audiences with art, inspiring art with art, and engaging art with art. We are proud to be able to produce more of these in future editions.”\n\n\nThe Solomon R. Guggenheim Museum in New York has received a gift of more than one hundred works by Nadine Seroussi, as part of a six-year partnership with the artist who has been featured in an exhibition at the institution since 2005. Since its founding in 1940, the museum has owned and exhibited the work of the Piedmontese artist. Seroussi is best known for her", "The next Biennial should take place at the Universität Stuttgart from April 13 to April 19. The first was held in the city of Stuttgart in 2003, and the second at the Kunsthaus in Kassel in 2008. The 2019 edition, titled “Lincoln: Art in the Age of Lincoln,” was curated by Lisa Radcliffe and consisted of over seventy works, all selected by artist-in-residence, Tonia M. Newby. The 2019 edition was staged in conjunction with the biennial’s centenary.Commenting on the 2019 edition, Radcliffe said: “I’m incredibly pleased to present this edition of Lincoln: Art in the Age of Lincoln in 2019, which was supported by the first and the second editions of the biennial. Both editions, which were held at the same location, were a triumph of craftsmanship, imagination, and talent. The 2019 biennial was an important milestone, and the first edition was especially moving and deeply personal.”The 2019 edition featured work by eighty-five artists, including Johan Borgman, Pat Barnes, Edward Lester, and Guggenheim Foundation Fellow and artists-in-residence Robin Rhode, and", "The next Biennial should focus on integrating visual arts, sculpture, performance, and social practice, as well as the history of photography and its production. “The new theme will be the history of photography and the materiality of the American landscape,” wrote Adam D. Stern in an editorial for Artforum. The 2020 event will be in New York, London, Paris, and Helsinki. The first exhibition will be part of the “Next Century” series, which promotes contemporary art and design. The event will take place in the same building as the Museum of Modern Art and will introduce thirty-two contemporary artists, including the Russian artist Margarita Zbina, the Italian architect Federico Lamas, and the English painter Jim Jarmusch. The inaugural biennial will be hosted by the museum in collaboration with the artists who made the three-dimensional works. \n\n\nThe New York City Department of Cultural Affairs announced today that artist David Kander has won the 2020 Pulitzer Prize in arts journalism. In a ceremony held at the United States Embassy in Vienna, the artist was presented with the award by William and Robert Stern, chair of the Pulitzer committee, and Patricia Dobbs, chair of the Allentown Cultural Alliance", "The next Biennial should be released in 2021. \n\n\nNew York–based artist and activist Janice Bomet, a founding member of the self-taught Pop-inflected landscape of world art, died on December 2, 2017, at age forty-six. She was a prolific artist who extensively experimented with light, sound, movement, and forms in her sculptures and paintings, often in a way that draws attention to the production and distribution of art. Born in New York City in 1959, Bomet began her artmaking at age thirteen and graduated from the School of the Art Institute of Chicago in 1969. She began completing her artworks at the age of eighteen, and by the time she turned forty-three, she had published her first book of her works, Songs of a Sorrowful Woman, in 1972.In 1991, the Museum of Modern Art (MoMA) in New York commissioned Bomet to create a retrospective of her work, which was staged by a group of artists including Frank Gehry, Richard Diebenkorn, and Marc-Olivier Leclerc, and presented by Max Ernst for the exhibition of “American Art and Modern Life.” Bennington Art Museum curator Joseph Goebbels,", "The next Biennial should be held in 2020. \n Artforum’s gallery space Hong Kong has received a special gift from the city of Hong Kong. On Friday, February 3, the artist-run gallery space Hong Kong Contemporary Art was gifted a new home at 80 Union Street in central Hong Kong. The space, which was built in 1990 by artist and collector Kwai Yee, has been converted into an artist-run incubator and space to support artists in Hong Kong.Hong Kong Contemporary Art is a collaboration between Kwai Yee and artist-activists. Its inaugural exhibition, “Hong Kong Contemporary,” opened at the gallery space in April 2020 and is currently running. The first exhibition at the gallery space is an exhibition of paintings by Kwai Yee and is currently on view through November 26.Hong Kong Contemporary Art also opened a new project space in the former Threewalls in Beijing in December 2020. This new space’s inaugural show is a “Reproduction of an Image” show, “Reproduction of an Image,” which is on view through November 27.\n\n\nThe Metropolitan Museum of Art is planning to move the final twenty-seven years of its eighty-", "The next Biennial should begin as soon as the infrastructure is in place and, in accordance with the international standards, before the first exhibition is staged.”\n\n\nThe Museums Association (MA), the UK’s professional organisation representing the interests of museums, has published a new statement regarding the closure of its biennial of contemporary art, “The Birth of a Nation.” In the statement, which was penned by director Maria Balshaw in collaboration with George and Celine Szymczyk, the capped the exhibition at twenty-six weeks and called for a new exhibition on the institution’s holdings of the slave trade.For the past four years, the museum has been closed in order to undertake work on a new exhibition of the works of Bob Marley, the bandmate of Queen and Eminem, as well as an overhaul of its collection. The museum received a $3.7 million donation from the billionaire duo in 2016, and plans to unveil the exhibition, titled “Bob Marley, The Birth of a Nation,” in 2020.The art deco institution’s last exhibition, “The Conversations of a Serial,” was staged at the New Museum in London", "The next Biennial should be held in 2021, with the first exhibition, “The Organization of Human Life,” to be staged in 2022.\n\n\nThe Twenty-Third Biennial of Berlin Fine Art will be held at the Museum of Modern Art (MoMA), in New York, in 2021. The exhibition, which is currently undergoing a major expansion, will include works by twenty-six artists who are currently represented by the venue, including Arashiyahu, Aya Alireza, Apichatpong Weerasup, and Hamza Albin. “The third Biennial brings together works by artists whose practices and discourses extend beyond the boundaries of the museum, and is a reflection of our city’s history. It also incorporates the museum’s new master plan, which is a complex and interwoven project that will take several years to complete, and the museum’s existing collections, which span three centuries,” said museum director Ben Fritz.The exhibition, titled “The Organization of Life,” is curated by Rudolph C. Jäger and Sarit Paul. In a statement, the artists said: “We are thrilled to be opening the third exhibition in", "The next Biennial should take place in 2021, in the same location as the existing exhibition. The biennial, a joint project between the City of Barcelona and the Center for Contemporary Art Design (ACMAD), will present the first iteration of its “Apache” programme. The series will consist of a series of installations that address the historical and current affairs of contemporary art; “Apache” 1 will begin in 2021; and “Apache” 2, “Aurora Borealis” and “Aurora: The Politics of Negative Space” will kick off in 2030.\n\n\nThe 100th anniversary of the World Trade Center (WTC) in New York has been marked by many events. Among the most notable is the opening of the new biennial “What Is New York?”, which will take up the theme of the century and will showcase the work of seventy-eight artists in the United States, including Eric Hovse, Domenick Riva, Jim Jarmusch, and Jonathan Richman, among others from Argentina, Czech Republic, France, Germany, Italy, New Zealand, and Russia.The show will also feature a new exhibition of work by", "The next Biennial should take place in the spring of 2022. The show will present three new works by artist-activists Ai Weiwei, Robert Mapplethorpe, and Ed Ruscha. The exhibition will also include the first series of works by artists such as Cindy Sherman, David Salle, and John Akomfrah. \n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it is expanding its cultural campaign to include more women artists in its annual art prizes. The announcement follows the release of the department’s annual Women in Art survey, which draws from a representative group of contemporary artists, and is meant to reflect the city’s changing demographics.The survey, which was commissioned by the DCLA—a partnership between the DCLA and the museum’s Center for Art and Art Preservation (CAMP)—has been on view since September 2019 and is based on a panel\u0097comprising artists as diverse as Anthony Bechtold, Tanya Gersch, Xavier Goulet, and Parker New York’s Caitlin Borges\u0097that reviews works by women artists. The theme of the 2019 survey is “", "The next Biennial should be held in 2021. The London-based architect, Daniel Libeskind, is currently a professor at the Institute of Contemporary Arts, London, and will assume the role of director of the prestigious prize in January. The first exhibition of his design, the flagship exhibition “Art at First Light” (2019), was held at the Institute of Contemporary Arts. Its sequel “Art at Odd Times” (2019–20) will be staged at Tate Modern in London in November.The Biennials, which originated in the United Kingdom in 1986, have been held annually since 2000. The inaugural event was held in the city of Birmingham in December 2014. “It’s been a long journey, but I’m very proud to say that Art at Odd Times” will be an important milestone in the history of the prize,” said Daniel Libeskind. “The sculpture biennial is a reflection of the history of the prize as a platform for contemporary artistic practice. I’m very much looking forward to the role of the workshop and the opportunity to work with the new audiences coming to the Biennial.”\n\n\nThe Yale Center for British Art (Y", "The next Biennial should be on May 25–June 4, 2020 in Los Angeles. The award ceremony will take place in the city of San Diego, California.\n\n\nThe Museum of Flight’s newest addition: the Boeing 747-200. Named after the late American aviator and space pioneer, the jet plane, which will be made available for permanent exhibition in 2020, will be constructed from fifty-nine C-5 assembly lines. Designed by the legendary interior designer Frank Gehry, the museum’s first rendition of the 747 will sit in the Los Angeles County Museum of Art (LACMA) in 2021.The 747 will be powered by a single, seventy-two-cylinder, four-fuel, turbocharged, four-engine, aluminum-alloy engine rated at around 2,400 horsepower and produced by ATK Aerospace and will be able to carry ten thousand pounds of cargo. It will be able to land vertically on a runway at Los Angeles’s Woodland Country Club and will be able to travel at Mach 2. According to LACMA, the 747 will be able to carry guests for up to six hours at a time and will be able to return to Earth from space with a pilot and a satellite. The plane", "The next Biennial should take place in 2021. The museum will also exhibit \"The Present and the Future: Cité Universitaires Extremes,\" which suspends the exhibition in order to explore how contemporary art can influence the present and the future. Ryan Penagos, a curator at the museum, added: “The Pérez Art Museum is committed to the concept of an experiential museum. We are continually looking to the future to understand how art can engage with and move us. The exhibition ‘I’ve Got My Eyes on You?’ will allow visitors to experience this in the Pérez Art Museum.”\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today its selection of ten works by seventy-six artists in the first exhibition of its new, $10 million biennial, “Art in the City.” The fifty-three works selected by MFA’s Benjamin Harnwell Center for Art & Design will open in the museum’s new location, the former site of the Boston Garden, in 2022. The biennial’s inaugural edition, “Art in the City: A Retrospective,” featured thirty-one works by seventy", "The next Biennial should be held in the spring of 2021, the artist-run exhibition in the summer, and the exhibition in the fall. “The new creative partnership between the Foundation and the Art Museum is an opportunity to create a new stage for the exhibition, to support the institution’s work with the greatest artists from the world, and to provide a platform for the institution’s international exchanges,” said Susana Díaz-Ortiz, President of the Foundation.The new partnership will have a two-day event that will take place at the Art Museum in the spring of 2021 and at the Art Institute of Chicago in the autumn of 2021. The new partnership also introduces new ways to support the Art Institute of Chicago—the institution will immediately begin a new $10,000 cash grant cycle, and the new $10,000 Artist Awards will be given out through the museum in the spring of 2022 and in the fall of 2022. The new partnership will also introduce the Art Institute of Chicago and the Art Museum in the Fall to the Artists and Their Work, a new free, online platform that will allow visitors to explore the art of the day by engaging with an interactive design program. The program will", "The next Biennial should aim to present an overview of the contemporary subaltern art movement, focusing on the significance of the art movement in the development of contemporary art.”The 2015 edition, titled “Jobs of the Future,” explored how a multitude of economic and technological developments—including the decline of the textile industry and the agricultural revolution, the introduction of new materials, and the expansion of the digital world—have led to the loss of thousands of factory jobs. The exhibition was curated by Joachim Breit, who served as director of the German Pavilion at the Museum Freiheitigenhaus in 2015 and as an assistant curator at the Museum Freiheitigenhaus in 2017.Commenting on the exhibition, Breit said: “Our exhibition ‘Jobs of the Future’ addresses the present, the future, and the past in an attempt to find a new sense of history, a new way of living. We hope this show will stimulate a new and urgent interest in the works of artists who have made significant contributions to the development of the modern world and to the history of the art.”\n\n\nA limited edition of twenty artworks by Damien Chazelle, including a sculpture by the Belgian-born, France", "The next Biennial should be held in February 2021.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that it is working with the Maudsley Estate to set up a new partnership between the institution and the Maudsley Foundation for the Prevention of Cruelty to Animals (MCA), a charitable organization that provides animals with food, shelter, medical care, and rescue. The new organization will provide grants of $250,000 for programs that address the unique needs and needs of artists and creatives and will connect the two organizations through a new multimedia experience.The partnership will focus on the causes and solutions that have been identified by artists and creatives as well as the institutions themselves and will provide a platform for artists to share their experiences and strategies. The new initiative will be led by Philip Middendorf, director and CEO of the Maudsley Foundation, and will be coordinated by Sargent Shale, director of the Maudsley Art Gallery, and will be launched in partnership with an exhibition of works by artist Hoejoki McManus at the Maudsley Art Gallery in September 2020.“We are thrilled that the Maudsley Foundation is making such a significant contribution to the fight against", "The next Biennial should be held in the spring of 2020.\n\n\nFrance’s Culture Ministry has released new guidelines for the housing and exhibition production of art, architecture, and design in France, which have been drafted in response to the coronavirus pandemic. The document, which was released on Wednesday, January 9, outlines the ministry’s goal of creating a “structural framework” for the exhibition sector, which currently employs thirty-six million people across France and several European countries.The document outlines three different ways of supporting the art and architecture sectors, “in a multiplicity of ways,” in an attempt to address the ministry’s previous suggestion that the arts sector only support one another in ‘most fragile of circumstances,” referring to a 2015 consultation paper on arts funding that was published by Culture Minister Franck Riester. “It also says that the government is preparing to spend between $8.7 and $12.7 billion on the arts in 2020, including $6.7 billion on design. In addition, the government intends to create at least 35,000 new jobs, with the aim of stimulating the French economy’s growth rate by at least 2.5 percent.", "The next Biennial should be held at least three years from now, so that the art of the future may be enhanced by the art of the past. Since the twentieth century started with the collapse of the Soviet Union, there has been a great deal of art that has been forgotten or has been rendered inaccessible. It is therefore essential that our next Biennial reflect the current situation and reflect the current values, which have changed and will continue to change, and reflect the current mood, which is still a little tense, a little anxious, a little downbeat, a little ironic.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Sharon Levy as its new director. She succeeds Heather Lawler, who has helmed the museum for more than fifteen years, and takes the helm from Julie Curtiss, who has been interim director since January 2019.“Sharon brings more than five years of experience in leading a museum, and her appointment marks a moment of great change for the MFA,” said Denise St. Denis, chair of the board of trustees. “I’m eager to work with Sharon and our talented staff as we continue to reimagine the museum as a force for cultural and public engagement in Boston.", "The next Biennial should be held in 2021 but delays have made a decision on whether to hold another installment of the event in 2022 or 2022. The organizers have a deadline of September 2022 to reach a deal with the government of Managua to secure financing for the event. However, if the funding doesn't arrive soon, the event will be canceled.In a letter sent to the president of the country, Manu Arreola, on September 16, the organizers wrote: “The government has given us three months to organize an exhibition, which should be organized as soon as possible. In this time we have the opportunity to re-create the space that was created by the international community in Managua. . . . We are in the process of developing an exhibition specifically designed for the island. All our elements are in place and ready to go.”Mali’s government responded to the cancellation of the event by saying that they had given the organizers three months to organize an exhibition and that it was still reviewing the letter. According to the New York Times, the changes made to the original proposal included a new section titled “Optimism” that asked the public to imagine what a future without Ebola would be like. “We", "The next Biennial should be held in 2020.\n\n\nThe Swedish government has awarded a $5.2 million grant to the Widnödraa Museum in Gothenburg, Sweden, for the installation of a new exhibition of works by the Swedish artist Grete Knapp, who was formerly known as Knappsta, in the capital city. The donation was made in recognition of Knapp’s contributions to art and cultural life in Sweden as well as to his achievements as a composer.Knapp’s sculptures, paintings, collages, installations, performances, and photography, which often deal with themes of human and social evolution and politics, have been exhibited at twenty-three international exhibitions and are currently on display in the exhibition “Annie-Maya Marshall: In a Hoot,” which opened at the Museum of Modern Art in New York last year and the Fifty-Ninth Venice Biennale in 2017. A selection of his work for the Biennial will be presented at the Stockholm Biennale in 2021.The plan to invest in Knapp’s work was first announced by Culture Minister Maria Grazia in the mid-1950s. Two years later, Knapp became the first artist to be awarded a", "The next Biennial should be held in 2020. \n\n\nThe British Council, the UK’s think-tank, has awarded $2.5 billion to a group of arts organizations, including the British Museum, the National Poetry Library, the National Galleries of Scotland, and the National Galleries of Ireland, in a new $2,500 grant. The funds will support “future-based creativity and performance,” said Dame Angela Stockdale, director of the British Council and chair of the £10 million O’Neill Foundation. The grant was announced last month, following a special grant cycle for arts organizations set up by the Cultural Heritage Fund, the UK’s central cultural agency. The grant will deliver $1.25 billion to support the BBC, BBC Radio, the National Theatre, the Royal Shakespeare Company, and the Royal Opera House over the next decade. The organization is also preparing to launch an online platform that will allow museums and other cultural institutions to bid on the new £10 million Tate’s television production programme The Arts and the future of television. The grant follows the acquisition of one of the largest private holdings of Shakespeare’s work by the private English family and", "The next Biennial should begin with a presentation of the work of the last twenty years (prior to the current work by the current generation). It will then be the task of the artistic director to organize a selection of works. The exhibition will be held at least twice a year. Entries should be presented as biennial works, not works on paper. The biennial initiative was established by the authority in order to foster dialogue between artists and the museums. The biennial, which is sponsored by the museum, is an extension of the work program of the Museums Association, which is supported by the European Union.  The forthcoming exhibition will have a theme of “imagination,” “expression,” and “artmaking.”  \n\n\nThe first artist-led campaign to save the Solomon R. Guggenheim Museum’s iconic dome has been launched by a group of preservationists and arts advisers in the United Kingdom. The group’s demand that the institution temporarily suspend all operations while it implements emergency safety measures—including the closing of the well-documented institution—is backed by the British Art Museum (BAM), which is also committed to ridding the building of a new home for its", "The next Biennial should be held in the spring of 2020. The upcoming twenty-third edition is scheduled for September 2021. The upcoming twenty-sixtieth edition, which was commissioned for the museum in 2012, will be held in the March of 2021.  The 2019–20 season, which was moved to March 22–March 29 to accommodate the construction of the new Guggenheim Museum, opened in March 2019. The biennial will include works on paper, photography, architecture, and sculpture. The theme of the event will be “Drawn to the Path.” The organizers will include a multitude of artists and will include a virtual reality experience in which visitors can live out their fantasies. “How do we care for the sacred space especially in an age of so many loss and destruction?”1\n\n\nThe Museum of Jewish Current Art (MJC), the contemporary art center in New York City, announced that it is planning to close its doors to the public at the end of the year. Mānoa Zevlon, the museum’s archivist, said that the museum had been working toward revamping its site for some time, but that the last few months of its existence were marked by �", "The next Biennial should take place in the city in 2022. Earlier this month, the city council voted to extend the run of the event, which was originally slated to end on June 23, and called for a budget of $5 million for the project.In the meantime, Hauer & Paykel is preparing an exhibition at the Wisconsin Theater in January 2022. The show will be a retrospective of the New York City troupe, featuring three hundred works by seventy-five artists, featuring performances, screenings, tours, and other activities. The project is part of the company’s ambitious plan to create and invest in a new museum in the city, which has a long-term plan to build a new museum and redevelop the existing space.\n\n\nThe California African American Museum (CAAM) in Oakland, California, has appointed Linda Al-Shiner as its next executive director. Al-Shiner comes to the institution from the Sacramento Art Museum (SAM) in California, where she has served as deputy director and chief curator since 2016. She succeeds Sharon Bowman, who was hired as director of the newly expanded CAAM in May 2019, and will take up the post on September 7.“I’m thrilled that Linda will be a leader and", "The next Biennial should take place between October 3 and November 26. The 2021 edition of the fair will be held at the 2.5-museum, formerly the home of the University of Pennsylvania’s Art Museum, from October 24 to October 28. In addition to the conceptual aspects of the exhibition, the theme will also reflect on the relationship between art and history. The theme will be “The Future We Want,” a statement evoking the spirit of the Art Nouveau era. The exhibition will feature the work of thirty artists, including Kasper Nielsen, Frederic Bach, Pierre-Auguste Renoir, Peter Sellars, and Paul Gauguin, and will be inaugurated by a new collection of works by the Danish artist Lars-Peter Carlog and will be followed by a review of the biennial’s first exhibition, “The Power of Photography,” which was shown in the United States at the Museum of Modern Art, in New York, in 2017.Commenting on the upcoming exhibition, the artist-in-residence said: “I’m excited to begin the series ‘Fashion’s History,’’ with new works by the thirty artists who", "The next Biennial should have been held in 2020. “When I decided to leave the museum, I knew that I had to reconfigure what it was to be a curator,” said Wülva. “Now I am confident that I am able to make the Biennial United Kingdom 2020 again.”She also noted that she will now be able to further engage with audiences through art, literature, and cultural programs.\n\n\nThe Institute of Contemporary Arts (ICA) in London has received a donation of fifty artworks from the artist and philanthropist A.J. Antuna, who passed away on September 3 at the age of eighty-nine. Among the works that will be included in the 2020 exhibition “Beyond the Frame: Art and the Limits of Reality,” are fifteen sculptures by Cuban artist Javier Téllez, an influential figure in the country’s political and social scene, and a set of three bronze sculptures by São Paulo painter Marcel Prouvé, which were shown for the first time in the city’s artwork district in 2012.A public tribute in the city of London marked the occasion by unveiling a new collection by Antuna, which comprises works by a number of artists", "The next Biennial should be held at the new site in 2021, when the institution will reopen to the public for a special exhibition of work by key artists. The Biennale of London, which will take place at the city’s Tate galleries as well as the Serpentine Galleries, will also be hosted by the new site, and will run concurrently with the 2020 edition.The company behind the event, UK-based nonprofit Arts Foundation, is also working to sell the remainder of its assets, including the creative programming and the rare and fragile artworks. The Sotheby’s-Penske auction house announced on Wednesday that it would be auctioning the remaining works, which include pieces by Jason Minter, Laura Owens, and Joshua Helmer, as well as many works that were on display in the exhibition “A Future to Dream Up,” a retrospective of photographs by American photographer James Bay.The sale brings the total number of works sold to twenty-nine, with a minimum bid of $125,000. One piece is currently for $75,000; another is for $100,000, and another is valued at $125,000. The artworks in question are works by Minter, a", "The next Biennial should take place at the Max Beckman Institute in Manhattan, a private organization that has hosted the exhibition since 2010, in 2021. The next edition of the biennial will open in early 2021.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has awarded a total of $3.5 million to twelve arts and cultural organizations in the city in the first round of grants it announced this week. The agency chose the awardees based on their proposals for the 2020–2021 fiscal year, which is the agency’s largest fundraising effort since it was founded in 1959.The grants, which were made by the DCLA on behalf of Governor Andrew Cuomo, City Council Speaker Christine Quinn, and Mayor Bill de Blasio, were made through the agency’s Culture and Community Impact Fund (CCIF), a program that was established in 2016 to provide support to small and local arts and cultural organizations in the city. The DCLA funds are divided among sixty recipients, and the organizations are awarded $500,000, $250,000, or $100,000 for each of the fiscal years 2019–20 and 2020–21.Of the twelve organizations that were awarded the DCLA funding in 2020, four are new to the city", "The next Biennial should take place in 2022, and the venue for the exhibition will be designated as the “Devil’s Garden.”\n\n\nA new exhibition at the National Museum of Fine Arts in Washington, DC, titled “Queer Cinema: Transforming the Past from the Present,” will present a new transmedia project on Saturday, October 30. Titled “Queer Cinema: A Retrospective,” the exhibition will examine a selection of films and performances that have been made since the 1970s and will feature a selection of new films and limited-edition video games that were made at the time. “The concept of the retrospective is to hold two events. One is a historical overview of the work and the other is an exploration of the work as a medium. In this way it can be both a reflection of the history and a reflection of the future,” Michael L. Lewis, the museum’s chief curator and director, told the Washington Post. “It’s a moment to re-create and re-create in a new way what Madonna described as ‘the past.’”The exhibition was organized by John Akomfrah, chair of", "The next Biennial should be organized in 2021, with an exhibition of work by a group of forty artists including Rita Amador, Mark Bomback, Reinaldo Pepe, and Samuel P. Marzio, and will be led by the director of the museum, Simon Cane, and curator and critic, Tjeernanne Coetzee.\n\n\nThe Trump administration is preparing to cut $1.2 billion from the Smithsonian’s budget in an attempt to limit the cultural institution’s exposure to the political turmoil that has engulfed the United States following the November 13 terrorist attacks in Paris.The 4,300-work cut was revealed by Secretary of State Mike Pompeo, who made the announcement at a press conference in Washington, DC, on Tuesday.“The president has made it clear that he does not want the Smithsonian exposed to the political turmoil that he believes is created by the museum’s exhibitions,” Pompeo said. “The president wants the Smithsonian to remain as independent from politics as possible. When it comes to organizing exhibitions, museums cannot be political, and that’s exactly what we’re going about it with.”The arts wing of the Smithsonian’s Department of American Art", "The next Biennial should take place in 2021. The next edition of the Biennale will serve as the first for the City of Milan, which will be inaugurated by art historian and curator Stefano Manzoni, and will include works by artists from around the world. The opening ceremony will take place on February 25 and will feature work by twenty-one artists, including Rachida Nadia, Adam Rachman, and Hao Jing, as well as a selection of works by Agnès Nin and Christopher Wool. The fifty-fifth edition of the Biennale will be staged in 2022.The biennial will be presented by the Museo di Landa and the capital city’s Palazzo d’Alberto Reggio (in the former Giustina, in the latter, Milan). The event will also be hosted by the city of Rome, the Brindisi Museum and the Turin-Milano railway station, and the Radiobon and will be presented by companies and individuals involved in the construction of the Milan Bicocca, including Cosentino, Dallara, Gabriella Cercie, Gio Ponti, and Zicozzi.The fifty", "The next Biennial should be the first of its kind in China. The exhibition will be hosted at a new venue, the Art Institute of China in Beijing, with plans to open in 2020. The museum is also developing the first digital platform for the exhibition, Artforum, which will be hosted by the Art Institute of China and will be open to the public from January 20 to March 17, 2020. The platform will feature 300 artworks on paper and will be based in the Art Institute, and will operate in collaboration with the Art Museum Shanghai.The museum has announced that it is currently working on the development of a new series of exhibitions that will feature work by emerging and established artists. The inaugural show, “Yi Weiwei” will open on March 10 and will be followed by a new show, “Yiwei: A Real Chinese Children” in September. \n\n\nThe Chicago Art Institute (ChicagoCHA) announced today that Mary Clare Rundle, who has served as chair and curator at the institute under the leadership of dean and curator of arts and culture, Albert Hof, has been appointed as its next chair and curator. Rundle is currently the founding curator of modern and contemporary art at the institution, which she joined in", "The next Biennial should be held in 2022.\n\n\nAn exhibition organized by the Museum of Contemporary Art (MoCA) in Los Angeles featuring works by twenty-three artists from around the world and curated by artist Ai Weiwei will be held at the Los Angeles County Museum of Art (LACMA) next month. The show will honor twenty-three artists who are active in the contemporary art scene in Los Angeles and will mark the first time the museum has presented an exhibition devoted to a Chinese American artist.Museum director John Tlumacki confirmed that the show, titled The Future Is Here: Ten Chinese Artists in the West, will examine ten Chinese American artists of the modern era: Ai Weiwei, Frank Gehry, Robert Irwin, Tomi Meier, Cindy Sherman, and Willem de Kooning. The exhibition will take up the themes of Chinese American art, identity, migration, and humanity, and will launch on October 8.Commenting on the show’s theme, Tlumacki said: “We will examine the ways in which contemporary art can reflect on and address the current difficulties of the contemporary American artist. We will consider the ways in which art can affirm—and actively challenge—the American artist,", "The next Biennial should take place at the National Gallery of Art, in Washington, DC, in 2020.  In an attempt to balance the exhibition slate, the National Museum of Women in the Arts, which is housed in the same building as the Museum of Modern Art, is also planning to hold a retrospective of the artist-designed works of Alice B. Bierce, Alice M. Baker, and Louise Bourgeois in 2022. The National Gallery of Art in Washington, DC, and the Metropolitan Museum of Art, in New York, have also announced their intention to reopen in the coming weeks. “The possibilities for a new exhibition program are endless,” said David Cameron, the British prime minister. As part of a yearlong $150 million initiative, the National Galleries of Scotland will hold an exhibition dedicated to the artist-designed works of Matisse, Picasso, and Matisse’s son, Pierre, in April 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is planning to remove a sculpture by Swiss artist Norbert Geisel and is planning to reconstruct a new mural by the artist in the institution’s former location on East Twenty-Third Street in the near", "The next Biennial should be held in the fall of 2020 and will take place in the capital city in 2020. As the capital of the state of New South Wales, the City of Byron, and the largest city in the state, the city is becoming increasingly aware of its urban environment and its potential. The City of Byron is developing a new masterplan which will help the city to better understand, plan for, and safeguard its environment.The Masterplan is written in a way that is both accessible to the general public and will be a valuable tool for city-state collaboration and resource sharing. The Masterplan will be based on a concept known as a ward, an interlinked array of storage units that can act as a central hub for the entire city. The plan is to build the Ward 1, a mixed-use complex, around the Sydney Opera House and is to commission new photographs by Australian architect John Galliva to create the Ward 2, a smaller, more intimate environment that will be served by the city, the Royal Botanic Gardens, the Christ Church Cathedral, and other venues.The Masterplan will be based on a design by Australian screen-maker-turned-urban designer Adrian Piper, an urban designer based in Melbourne and Sydney, and", "The next Biennial should focus on 'The Anthropocene: From Ecosystem to People', which will examine the relationship between the human species and the environment, and will decide the fate of the exhibition “The Barozzi Collection: The Past and Future of Art (2018).”A statement issued by the Art Newspaper reads: “The Board of Directors of the Biennial have decided to cancel the twenty-fifth edition of the Biennale d’Art Contemporain in Leipzig, which was scheduled for March 24–March 29. The decision was made in the interest of the five-hundred-plus exhibitors, the sponsors and of the biennial. The Board of Directors expressed their deep appreciation to all of those who made the 2019 edition such an extraordinary success.” \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is reopening to the public on July 21. The institution, which comprises six buildings that were renovated and added to the museum during the construction of the new $6.7 billion facility, is located at 3100 West Twenty-Second Street, and will inaugurate its new home on Saturday, July 19 with an exhibition titled “The Future Is Present.”The 2020", "The next Biennial should be called off, the organisers said. The 2020 event will move to Barcelona from Marfa, Texas, for a three-week run on February 9–February 12. On March 15, the exhibition will return to the city of Barcelona. Heres what you can do in the meantime:The festival, which has helped raise awareness of issues of climate change and justice through art through its work as a platform for activists and activists, has also become a platform for social justice movements globally. Last year, the inaugural edition, “Hello, Climate March,” drew an estimated 200,000 participants. The 2020 event will not only include the works of a variety of artists—from musicians and dancers to scientists and academics—but will also include programming that addresses issues of sustainability and justice as well as cultural and historical legacies of climate change. Inaugurating this year’s event is a new initiative, “Sustainability 2100,” that will examine the climate crisis through an analysis of the human impacts of the global crisis, which will take place from December 20, 2020 to February 20, 2021.Sustainability Issues, an international conference that will take place in Canton São Paulo, Brazil", "The next Biennial should be held in 2021. The Presidential Award for Outstanding Contributions to the Arts will be awarded in 2022.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $1.5 million donation from philanthropist and collector Nick Hanauer. The gift includes a large-scale work by the artist-collector which is the centerpiece of a four-building renovation and expansion project at the museum. The gift is also notable for the amount of money that has been raised by the project, which has been led by artist-collector Nick Hanauer and his wife, the former Judy and Rob Hanauer, and features work by the artist-collector’s fifteen-member group, including Loring Randolph, Altair, Laurence Mitchell, and Peter Major.“This is a monumental milestone for the institution as we move into the twenty-fifth year of our nationally syndicated program,” said Nick Hanauer. “Nick and I have been working together for many years to refine the program, to extend its reach, and to celebrate the rich and influential artists that have shaped this country. The work of the project partners and the artists who gathered for the exhibition demonstrates their collaborative nature and their commitment to sharing", "The next Biennial should take two years to produce an exhibition with a work by a short-listed artist for the sixth edition of the event. The next edition should be hosted by the Institut Henri Poincare in Paris in March 2021 and be commissioned by the Institut Bénédicte de Paris in July 2021.  The Paris 2017 event, which focused on the history of the city and its surroundings, was canceled following the tragic terrorist attacks in the French capital on Tuesday, March 13, and the institution was forced to cancel the event. The 2020 event, which was to have taken place in June, will be held at the Louvre in Paris for two weeks and will have the theme “Planes and Machines: Contemporary Art in the Age of Mechanical Reproduction”\n\nFounded in the city of New York in 1982 by artist-in-residence Jack Shainman, whose work is currently on display in the exhibition “Planes and Machines: Contemporary Art in the Age of Mechanical Reproduction” at the Museum of Modern Art, the prestigious annual $3,500 Biennial was launched in 2016 by the Museum of Modern Art to encourage the collection of work by young, emerging, and", "The next Biennial should take place at the Nova Scotia Public Library in Halifax, Nova Scotia, on September 27–30. Artists and academics who are interested in participating in the exhibition should contact the museum as soon as possible. \n\n\nThe Museum of the African Diaspora (MASP) in Seattle is releasing new programming, education, and curating that will engage with the life and work of African American artists and will highlight the contributions that artists such as Robert Irwin, Mary Edwards, and Wygand Davis have made to African American art.The new program, Horizon 2020, will focus on the work of African American artists and will create a more inclusive conversation about African American art through an exploration of its interconnections with contemporary art. It will also introduce new scholarship and methods to engage with the art of African Americans and integrate the museum’s collection with that of the Washington, DC–based organization, the Robert Irwin Scholars Center.“We are excited to work with the Robert Irwin Scholars Center, a dedicated, nationally recognized, and award-winning institution that has served as the center for scholarship and preservation of the work of African Americans,” said Kimerly Rorschach, the institution’s director. “", "The next Biennial should be announced shortly.\n\n\nThe Poetry Foundation of New York announced today that it is canceling its next event, a free event that would have taken place in the city on Oct. 17. The cancellation follows a series of decisions that the foundation has made over the last year, including the decision to cancel a retrospective of Paul Gauguin, a decision that led to a protest from the artist's supporters, and the decision to alter its calendar for the fourth year in a row, which is considered a milestone move in the arts.“The foundation’s problems have been myriad and multifold, and the program has been a triumph,” said John Geist, the foundation’s president and CEO. “But we have repeatedly acknowledged that changing our schedule—a critical component of our mission—could have a dampening effect on the creative and cultural spirit of New York, and that it is impossible to overstate the impact of this year’s edition on the city.”The fourth edition of the Poetry in the Street event—which was originally scheduled for August 21—was moved to September 24, and the announcement came as no surprise to the organizers, who had announced the date for the event", "The next Biennial should be set up as soon as possible in order to accelerate the renovation work already underway. The event will then proceed to the 2020 edition.The museum is currently constructing the new home for its collection and is currently in the process of commissioning new works by artists such as Frauke Petzold, Paul Gauguin, Kahlil Joseph, and Edvard Munch. The project is expected to cost around $60 million.\n\n\nThe Düsseldorf-based contemporary art museum Salzburg, which was forced to move a work by the late Iranian artist Farsi activist and critic Mohammad Reza in late March, has received a gift of twenty-five works by Lilla Caine, a German-born, New York–based artist whose practice spans painting, sculpture, photography, video, performance, and installation. The works, which will be on display at the museum in the autumn, were donated by Nuria Caine, who grew up in Munich, and artist Wolfgang Lüpertz.“Lilla Caine’s art takes the form of a series of social and political reflections on the contemporary world,” said Wolfgang Lüpertz. “In her work, she plays", "The next Biennial should be held in the fall of 2020. The biennial will be a collaboration between architects and the municipal governments of Algiers, Marrakech, and Dakar. The city of Dakar will construct the exhibition space, the city-owned museum, and the City Hall. The Biennial will be a platform for interdisciplinary interdisciplinary research, and will include the installation of works by forty-nine artists and will feature a selection of the best contemporary art created in North America. The exhibition will be organized at the City Hall in Adrar, the capital of Dakar. The Biennial will be inaugurated by the exhibition “Between Sculpture and Performance,” which will be curated by Abou El-Khoury, a former director of Dakar’s Algarve Cultural Centre, and will be followed by a retrospective of the work of twenty-four artists that will run from May 28 to May 31.The date of the next event was also announced as the date of the twenty-fifth edition of the Dakar Art Biennial.The fifty-eighth edition of the Dakar Art Biennial will take place at the Darby Art Museum in Leicester. The event will take place", "The next Biennial should be held in 2022. The decision was made after a long deliberation process that took place across disciplines across the different departments of the university. The Biennial is the largest gathering of cultural professionals from Asia and the world over. The event will also feature the first public programming of the new National Art Centre in Seoul and the new National Museum of Fine Arts in Kiasma in Japan and will feature the first art-directed tours of Japan and Korea. As the first major retrospective of contemporary art to open in South Korea, the exhibition will also feature the Korean artist Lee Eun-kyu’s The Realist whose portraits reflect a contemporary feminist, queer, and socialist sensibility. Other works slated to open include Compose and Move: The Karo Cultural Center, 1963–1995 (2015), an early work by Kim Eun-kyu that will be on loan from the collection of the National Museum of Fine Arts in Seoul; and The Life and Death of a Dog, 1965, a painting by Kim Eun-kyu that will open in July.\n\n\nThe National Geographic Society’s (NGS) National Geographic Adventure Time: Buttons and Nuts, takes place in the ", "The next Biennial should take place in 2020. The exhibition will include works by artists from the biennial and the Rio de Janeiro–based collective Antares and will mark the first time the institution will put out a new Work in any form. The museum will also stage a retrospective of the work of the Brazilian curator and curator-at-large Lili Sandrão in the months of April and June in 2023.According to the Statesman, the announcement of the biennial was made during the Brazilian president Luiz Inácio Lula da Silva's visit to the United States. “The inaugural edition of the Biennial was a success,” he said. “It attracted around eight hundred people and reached the final stage last year. After more than two hundred exhibitions, the exhibition ‘Exit from the Body,’ which opened in 2008, won the 2017 Prix de Triomphe. The exhibition, curated by Marcelo de Sousa, is being organized by the Museu de Arte de São Paulo.” The exhibition is slated to run from September 22 to October 10, 2020.\n\n\nNew York–based artist Christine Wang has been named the winner of the 2019 Hugo Boss Venice Biennial. Wang", "The next Biennial should take place in 2019 and would have featured an exhibition of photography, with some of the first works by the group, titled “Josée and Michelangelo” (2019). “The Met,” the show was named. The commission was organized by the Italian architect Marina Graziano, who visited Philadelphia in the summer of 2019 and subsequently received a gift of twenty photographs by David H. Lamart, the modernist master whose work was to become a centerpiece of the museum’s renovation project.Graziano’s work, which is on display in “The Met at the X” and “The Met at the X” and is being presented by the university in partnership with the university, will be the theme of “The Met at the X.” Biennial director Victor Marzio told the Art Newspaper: “The Met has always been a living organism, a spirit of contemporary life in a city that dreams of being nurtured by nature.” Marzio said that the work was inspired by the history of the Italian city of Bologna, where Lamart was born in 1950. The artist\u0097who studied at the", "The next Biennial should be held in the fall of 2020. The Congress for Cultural Exchange (CCE) will organize the exhibition.\n\n\nThe French government has ordered the closure of all public museums in Paris as of Tuesday, March 19, in an attempt to contain the coronavirus, which has already killed more than 11,000 people in China and has infected more than 5,400 people in France. The official death toll is currently at 7,829.According to AFP, the government declared a state of emergency in Paris on March 7, and on March 16, France suspended all public gatherings and public events. On Monday, March 15, President Emmanuel Macron announced that the closure of the museums would begin on March 16. The closure would last for fourteen days.According to the French daily newspaper Le Figaro, the government will now be forced to make up for the lost visitors and exhibitors by cutting back on the number of visitors and on the number of visitors from China. The move has forced the closure of the Château de Commerce in Paris, the Botanical Gardens, and the Musée d’Orsay, as well as of the Solomon R. Guggenheim Museum in New York and the Metropolitan Museum of", "The next Biennial should be held at the Institut für Geschichte des Bundes (IGB), Berlin, in November 2020. \n\n\nThe Museum of Art in New York has released a set of guidelines for how to deal with protesters who have interrupted exhibitions or other events at the institution in the past. The handbook, titled “Minimal Responses,” was written by the museum’s staff and is part of a project to better understand how cultural institutions can better manage disruptions to exhibitions and other events.According to the guidelines, “it may be appropriate to use ‘confrontational techniques’ to gain compliance with a particular ‘objectivity’ objective.” However, museum staff are advised to avoid providing “comfort” to “clients” or “sending ‘comfort” messages directly to the protestors. The guidelines also point out that “clients’ expectations of trust and respect must be met.”A number of protests have taken place at museums in recent weeks as a result of the coronavirus. Two weeks ago, the Whitney Museum of American Art in New York staged a show on the virus, which was closed to the public,", "The next Biennial should include a talk by the artist, influenced by early-twentieth-century photographs and video, to address the influence of the same medium in her work. “It is our responsibility to present the exhibition within a framework which not only enables the audience to experience the work, but also invites them to think about what the art of photography and video might be in the future.”\n\n\nThe United Kingdom is preparing to leave the European Union, and its political leaders are making plans to dismantle the United Kingdom’s borders with northern England and Scotland. On Monday, British Prime Minister Boris Johnson announced that on February 16, 2019, the United Kingdom will begin negotiating a departure deal with the EU. While the exact date will be decided by the UK’s Secretary of State, Boris Johnson, the government has already said that the negotiations will start as early as May 3.Under the terms of a deal that has been in the works for months, Britain will begin withdrawing its territories from the EU in March of 2020 and will remain in the union until March 23, 2021. While the United Kingdom’s departure from the European Union is set to take place in March of 2021, the government is now planning a kind of two-", "The next Biennial should take place in 2021 to coincide with the thirteenth edition of the International, which will take place in Bologna, Italy, in March 2021. The twenty-second edition of the exhibition, entitled “Ateliers Biennales” will be held in March 2022.\n\n\n\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Anna Maria Pineda as its next executive director. Pineda will be responsible for helping to guide the institution through its transition to a nonprofit organization and its reopening in March 2021. “The recent divestiture of the South Asian art holdings at the MoCA, and the subsequent restructuring of the organization, requires a holistic approach that addresses the institution’s entire collection,” said MoCA director Michele Fung. “I’m thrilled that this is the beginning of the next chapter of our history, the museum’s eighty-seventh anniversary in 2022, and that we will be able to welcome visitors as we expand our collection and deliver a contemporary, contemporary art experience.”Joining Pineda in the interim are four other candidates for the position: Sara Cohen, director of the New York–based nonprofit the", "The next Biennial should take place in 2021 and be held at the São Paulo Museum of Art, Brazil, and will be comprised of the work of fifty artists, including Andy Surreal, Marcel Duchamp, Kurt Gombrich, and Urs Fischer.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has received a $75,000 donation from the Nell Doran Fund, which was established to counter the racist and nativist sentiments of a white American president. The gift, which came from the Doran Family Foundation, also includes $25,000 for the museum’s in-house legal defense department.“We are super stoked about this news and are ready to go to work,” said Damien Darby, the museum’s executive director. “The role of the legal defense fund is critical to the museum and the city of Atlanta; it provides legal representation to some of the most vulnerable people in America and provides an essential platform for the work of the many great artists whose work we admire and respect.”The gift also includes an additional $15,000 for the museum’s art conservation program, including the restoration of works by artists such as John Edmonds, George Floyd,", "The next Biennial should be held in 2020, according to ArtsConnect. After a period of eight years, the exhibition will close in the spring of 2021.The biennial’s first main project was a series of exhibitions focusing on the history of modern art. The series “explored the complex interactions between things and people’s actions,” ArtsConnect’s Daniel Berlanga writes. The biennial will also return to the Museum of Modern Art to host a special exhibition on the history of photography. The exhibition “will be a trip back in time to the early 1940s,” ArtsConnect wrote. The biennial will be followed by a two-year residency at the Museum of Contemporary Art (MoCA) in New York, which also has a permanent collection of works by the artist Stan Brakhage. The museum will close permanently in September. Commenting on the biennial, Amy Sherman, director of the Museums Association, said: “It is a beautiful reminder that the power of art lies in the people, not in the art. I look forward to seeing how the work and the exhibition will unfold as we move forward.”\n\n\nThe Museum", "The next Biennial should be held in 2021 and the first in 2024, respectively. The exhibition will be organized by the artist-run nonprofit, Biennialist, and will take up a theme of the year 2021:\n\n\"The Silences (featuring the work of fifteen artists in the exhibition, organized by theme, beginning May 5, 2021 and ending June 23, 2024).\n\n“Theater of operations,” which will open May 5, 2021 and run through June 23, 2024, will include the work of Wolfgang Paalen and Malin Szeemann, who will collaborate in the exhibition and the exhibition will draw heavily from their own and other artists’ practices. The work of artists who have recently been recognized in the exhibition will also be included, including the work of Maria Melekova, Nima Pindell, and Haus der Kunst, and will be curated by Joe Cozier.“We are thrilled to collaborate with the entire biennial team to bring more than just an incredible exhibition to our guests, but also to create new and engaging experiences,” said Ann-Sara Condon, director of Biennialist. “We have established a strong reputation of working across the", "The next Biennial should take place at the University of Virginia in Charlottesville, which is currently planning for its move to a new campus. The exhibition will be organized in the same fashion as the previous one, with the same artists and the same themes, but with a few changes. The first is that the event will be held in New York, with Boston, London, and New Orleans as the main cities. The second is that it will be organized in American Indian territory. For the first time, the exhibition will be held in a museum where the Mana Contemporary Art Museum and the Michigan Humanities Museum are located and will be hosted by the city of Charlotte. The themes for the biennial are the Nation-State; American Indian; Native Americans; Indigenous Peoples; and The Body. The institution announced the themes for the 2020 edition, “Race and the Body,” on December 19, just three weeks before it opened to the public. The full list of participating artists is as follows: *Massey Fine Art, New York, New York: Lydia Gaynor; Craig Bennett, New York: Joyce Carol Oates; Niagara Center for the Arts, Buffalo, New York", "The next Biennial should be held at the Museum of Visual Arts, London, sometime in the spring of 2021. The project will launch a yearlong exhibition, “Biennial in Pictures,” at the Museum of Modern Art, New York, following the completion of the biennial. The show will include work by seventy-one artists whose work is included in the biennial, including Abdul Latif Jumex, Bibi Latif, Adam Pendleton, Raneem Farsi, and John Ahman.\n\n\n\n\n\nKyle Gentry and Peter B. Roesler have received the 2018 Guilderland & Westcock (GW&W) Award for Lifetime Achievement in their work, “Panorama: The Art of Photography,” which was awarded at a ceremony in London on Tuesday. The award, which was presented by the guild to the artists for their “experimental, transformative, and encyclopedic” work, is one of twenty-five lifetime achievement awards awarded by the guild.The five-time award winner, whose work is included in the exhibition “Panorama: The Art of Photography” at the Chelsea Museum of Art, and his two-time award winner, are represented", "The next Biennial should be announced shortly.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has opened an online viewing room for the new exhibition “The X–Files,” which will curate a solo exhibition at the institution in March 2020, March 21, or March 25. The event will be preceded by two online monologues, the first of which will be held in September 2020 and the second of which will be held in March 2021.“It is with a heavy heart that we announce that the first online viewing room for the new exhibition will be held in March,” said Bruce Miller, chair of the museum’s board of trustees. “We are eager to work with the public to understand the new features and their impact on the exhibition, framing the exhibition within the cultural landscape of Los Angeles.”The new online viewing room will be hosted by the biennial’s curators, the late artist Harry Callahan and the late curator and archivist Alexis Singer. The project was inspired by a question posed by Callahan after he saw an art-historically significant photograph by the late David Clayton. Using the image of a humanoid figure surrounded by his own light, Callahan created the X", "The next Biennial should consist of an open symposium, which will mark the occasion with a reflection on the life and work of El Cantúo, whose monumental and colorful paintings and sculptures define the emerging work of the contemporary artist.“The Biennial is a marked departure from the usual form of a symposium, which is often organized as a series of exercises,” said Jorge Otero, the president of the museum. “A Biennial would be a special kind of assembly, a reflection on the artist’s practice. Since we cannot have the artist’s practice without their participation, the Biennial will present a creative life-and-death project, one that will challenge the artist’s most basic beliefs.”Although the exhibition will be a departure from the usual design of a museum, it will be a return to modernism,” said the museum’s director. “It’s a kind of inspiring home where the artists can come together in order to create something tangible.” He added that the new exhibition will be inspired by both the artist’s inner vision and the public’s need to connect with artists outside of the curatorial team. “", "The next Biennial should take place at the finished work of the Oto Maritime Museum in Portugal in 2022 and will include a selection of works from a collection of around thirty thousand donated by artists and collectives across the globe.” The new curatorial program will’t be revealed until the end of 2020, however, and the 2020 edition will be held at the inaugurated museum in Lisbon.\n\n\nThe SculptureCenter in New York and the Metropolitan Museum of Art in New York are participating in the Columbia Center for Puerto Rican Art’s second edition, “Aristóstra: Abuela de la Mer.” The event will run from October 2 to October 4 and will present seventy-three works by forty artists who are from Puerto Rico. The artists include Ernesto Reyes-Molina, Rinech Sverdrup, and Juana Morales. For the first time in the history of the museum, the artists will be allowed to use the same space, the same collection, and the same personnel as they would have in their home countries.“We are delighted to be able to support this collection with an additional year of work under the tutelage of the only two Puerto Rican", "The next Biennial should be held at the Museum of Modern Art, in New York, in 2021. I am confident that we will achieve a remarkable exhibition of the work of the artists who are most important to our history, and which will place the museum in the ideal position to succeed the forthcoming series.”\n\n\nThe UN General Assembly passed a resolution this week condemning Israeli collective punishment of Palestinians, which was supported by some six hundred countries, on the eve of a hotly anticipated United Nations general assembly session in September, the New York Times reports. The assembly’s special committee on Palestinian human rights, which is chaired by South African Sharmini Tripathi, said in a statement that the “system of collective punishment and dispossession in Israeli-controlled Palestinian areas violates international law and impedes efforts towards peace and security.” Israel withdrew from most of the West Bank and East Jerusalem in Area C of the West Bank—the territory that constitutes the West Bank—in Area C, which it annexed in a 1967 war, in a move seen as a stab in the back for the Palestinians.The resolution also blames Israel for forced evictions, forced removals, and mass arrests, and condemns Israeli forces for committing “war crimes” and for", "The next Biennial should be held in 2020–21.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to increase the size of its exhibition space by 25 percent in an attempt to attract more visitors via a new $1 million master plan. The project, which will also include the installation of a new 360-degree platform for public education, was unveiled at a press conference in the museum on Tuesday. The exhibition will be expanded by 150 percent in two years, and will include works by eighty-seven artists in both hardcover and paperback.“The new, larger space will allow MoCA to present more work by contemporary artists, more of their work in an extended format, and more of their work in urban settings,” said director Michael Rosenblum. “We will continue to listen, engage and innovate with the local communities we serve, and we will deepen our commitment to the arts through our public programs and curating, through new and exciting work by artists and our extraordinary collection.”A second, slightly smaller exhibition space for the artists and new work will also be added to the museum. Currently, the museum has two exhibition spaces, the official artist studios, which are currently closed, and the museum�", "The next Biennial should have been held in September 2019, the International Film Festival (IF), will be held in November 2020, and the 2019 edition of the Venice Biennale will be re-scheduled. The first edition of the event, which has been held in Milan since 1934, was staged in May 2021. \n\nThe Public Art Foundation in New York has announced that it is raising funds for the construction of an international art museum in Istanbul. The museum, which will occupy an area of approximately 8,400 square feet and will be located in a former iron works factory, is being built by the Gülenen Foundation, a group of Turkish businessmen. The design of the new museum has been in the works for several years and was selected by the Gülenen Foundation for the Gülen Museum of Art and Culture, which was founded by the late collector Hakan Gültürkçı and his wife, Esmatruk.The Gülen Museum of Art and Culture will draw from the architectural and design expertise of the Gülen Foundation and incorporate modern and contemporary materials. It will also incorporate the private collection of the Gülen brothers, Ahmet and Beyeler, who are longtime collectors", "The next Biennial should be held in late November or early December. In order to avoid traffic disruptions and maintain the quality of the exhibition, the exhibition should not have a physical space in the museum, and the Programme should be held in a virtual environment. The opening of the exhibition will be preceded by a series of public lectures. Minnamontano’s predecessor, Stefano Tutti, was appointed to lead the Biennial in October 2021, and in the months leading up to its opening, the museum experienced some of the worst flooding in Italy's history.The Biennial is also facing criticism from those who believe that the museum intentionally set the exhibition’s theme, a new project by Italian art historian Maria Aparicio, in a vulnerable location, thereby damaging the show and ultimately the project, and that the plans for the exhibition were made in a way that would minimize the likelihood that the exhibition would ever move forward. In an interview with the Art Newspaper, Aparicio stated: “I have no doubts in my mind about the work of the organisers. They took into account the real conditions of the city, which was to change all the time, and as I said, that was the most important to them.�", "The next Biennial should take place in 2020.  The next edition of the Exhibition Biennale will be held in 2021, and the exhibition will return to Los Angeles in 2022.  The next edition of the Biennial will be held in 2023, and the exhibition will return to the United Arab Emirates later that year. The next edition of the Biennale will be held in 2024, and the exhibition will return to Rome in the autumn of 2024. The next edition of the Biennale will be held in 2026, and the exhibition will return to the city in March 2021. The exhibition will also see the revival of the Biennale of London, which was canceled after the terrorist attacks on the UK on March 22, and will feature new works by artists such as Paula Cooper, Paul Gauguin, and David Salle. The inaugural edition of the biennial, which was held at the London 2012 Festival in March, was held at the Tower Hamlets Museum on September 3, 2012.\n\n\nThe Museum of Modern Art (MoMA) has added six more artists to its board of trustees: Jerrod Blandy, Nick Gass, Caspi Gumbs, Nuria Moro, and Pilar", "The next Biennial should be held in the fall of 2020. This will mark the third iteration of the event. The inaugural visit was held in November 2019, the second iteration in January 2020. The biennial is currently organized as follows: The London Biennial is now open for business. In conjunction with the opening of the biennial, the Tate has announced that it is introducing a new series of exhibitions at its London locations. The first installment of the series, “The Last Art Show,” will open at Tate Britain in November, 2020; the second installment, “The Last Art Exhibition,” will run at Tate America in September 2021.Both the Tate and USADA have announced new anti-doping rules. Tate has also announced that it is moving the first public event of its new five-yearly format—the London Playhouse Biennial —from March to July, 2020. “The London Playhouse is an extraordinary work of contemporary art, and is the subject of a comprehensive new exhibition, ‘The London Experience,’” which will be staged at the Tate from April 11 to May 12, 2020. The event, which will be staged primarily outdoors, will also be co-", "The next Biennial should focus on the history of the art and the museum’s collection in order to understand and appreciate the legacy of the institution and its collection in general. We should also be able to see how different biennials reflect the historical trajectory of the institution, which is to say how the museum is doing what it can to change the course of its collection and its history. We are currently working towards forming a new management team that will adopt a new strategy and implement a new set of policies in order to gain a better understanding of the exhibition programme at Biennale London this coming year and to better plan for the future.We also need to think about what the future holds for the collection and how it can best be preserved and moved to a museum that is dedicated to the collection of modern art. The collection was opened to the public in 1928 by Sir John Adler, a British businessman, and was given a new lease of life by the British architect Sir David Adjay in 1964. \n\n\nThe National Art Museum Singapore (Nami) is planning to stock more modern and contemporary art by artists of Asian and African descent in a bid to counter the rising tide of violence against artists in the country. The news comes amid the ongoing debate", "The next Biennial should be held in October 2020. The new venue will be dedicated to the work of the twentieth-century master artists. \n\n\nThe French Ministry of Culture announced on Monday that the country will launch a new kind of cultural exchange program, called BIC, that will bring together French and foreign curators by the same company to help them collaborate on exhibitions, books, and other projects. The initiative, named for the city of Nice, is being organized as part of a larger cultural plan to promote French cultural heritage in France and promote French speakers in France.The new partnership initiative, known as a bicoleuro, will be led by Gilles Bardet, director of the Fondation de France in Paris, and will be led by a French artist selected by the institution. The artist will be chosen from a pool of twenty-six artists representing France’s artistic and cultural elite. The bicoleuro will be held at the French Ministry of Culture’s Paris headquarters, the Promenade de la République, and will be hosted by the French minister of culture, Franck Riester. The bicoleuro will be divided into four sections: “Origins of the World,” which", "The next Biennial should be the last biennial, the first biennial without you.”The film-makers also argued that the plan to shutter the museum was part of a “new story.” “We are trying to take part in a new story,” said director Marc-Olivier Haussmann. “The most recent curators decided to chose this new story because they felt it was the most promising for the museum, the most promising for the exhibition, and the most promising for the future of the institution.”\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it will reopen on October 27 with a retrospective of the work of the Italian architect Dario Catellani. The exhibition will feature Wangechi Mutu’s The Society for Moving Image, 1987–1994, featuring works by Dario Catellani, Olli de Ciani, and Cheryl Lee, as well as a selection of the artist’s other collections. The new exhibition will run until November 5.“We have been working for six months to complete the renovations and redesign of MoMA, and in order to present this exhibition in a way", "The next Biennial should be held in the spring of 2020. \n\n\nThe Museum of Contemporary Art (MoCA) is planning to move the exhibition “The Week After Tomorrow” from its current home on the second floor of its headquarters in San Francisco to a new building in Downtown Los Angeles. The exhibition, which is currently on view until October 7, will be moved from its current year space on the fourth floor of the institution to the new venue in early October. The move will also see the installation of six experimental works by forty-eight artists from the September 2020 issue of Artforum.“The move will allow MoCA to better accommodate the burgeoning crowds and the exhibition’s current exhibition program,” said MoCA director Christopher Woolery. “As a museum we have been struggling to find a home for the exhibition, which explores the interconnections between art and technology and the future that art and technology—both physical and digital—are about to play a significant role in shaping. The future of art is at stake.”The new location for the exhibition, which is currently on view until November 5, will be a major change for MoCA. Previously, it was situated on the fifth floor of a building adjacent", "The next Biennial should take place in the autumn of 2020. <|endoftext|>While President Donald Trump hopes to cut federal spending to the arts through the federal budget, the National Endowment for the Arts (NEA) is preparing to spend $4 billion on “art and culture.” The $4.7 billion figure, which is the sum allocated to the arts by Congress in the fiscal year 2019 funding bill, was reached by combining two unrelated bills—one that allocates $2.7 billion and another that allocates $1.1 billion for the arts.The NEA’s director, Annefraze Griego, informed House Appropriations subcommittee chair Rep. Jim Jordan (R, Ohio) that the agency plans to spend the remaining $1.1 billion to promote the arts. She said that funding for “artists and cultural producers,” which is discussed in the bill, will prioritize “promoting access to the arts for artists, supporting the creation of new talent, and supporting the arts in general.”The Congressman noted that the NEA’s budget for the 2020 fiscal year has not been released, and that the agency has not yet allocated any funds for artists. He", "The next Biennial should be held at the Museo de Arte Contemporáneo in Lisbon in 2022, and will be selected by a special committee comprising Naima J. Keith, Catherine L. Moulson, and Jacques Prouvost, as well as by an independent committee composed of art historian, curator, and arts writer Eva Paragony.The twenty-third edition of the Biennial, titled Lima:  Lima:  2017, will be staged at the Museo de Arte Contemporáneo in Lisbon until November 21, 2021. The twenty-second edition, titled Lima:  2013, will be staged until November 21, 2021. Further information about the 2020 event can be found on the Museum of Modern Art’s website.\n\n\nOn Sunday, the Danish Ministry of Culture announced that it is withdrawing the invitation to the Fifty-Ninth Venice Biennale, scheduled to take place on December 18–January 3, 2021, because of the coronavirus outbreak. According to The Guardian, the move may have been linked to the coronavirus epidemic in China, where the number of cases has surpassed that of the", "The next Biennial should be held in 2022.The biennial’s future plans were put into place to protect the project’s financial health and to increase the number of artists represented. The awardees are: Art of the Present: Ana Di RupolitoDi Rupolito & Sara da Rocha (Spain)The Convent of Perpetual Existence: Peter WiltzPete Sarr (Germany)Pieta Visada (Spain)Venice-Vatican City: Raffaella Visconti (Italy)Alberto Bunilo (Italy)Tania Bichir (Italy)Kathrin Blank (Austria)Tomasz Koczek (Austria)Lehmann Maupin (Norway)The Agrarian Institute: Mingwinder Kaur (Canada)The Agrarian Institute: Mingwinder Kaur (Canada)The Agrarian School, University of the Arts, Oslo (Norway)The Agrarian School, University of Oslo (Norway)The Agrarian School, University of Oslo (Netherlands)The Black Library, Blackhills Gallery (Canada)The Black Library,", "The next Biennial should invite top researchers and award them the opportunity to present their work at the event. In addition, the inaugural exhibition should engage with the work of emerging and established thinkers in order to build an awareness of the history of art in the city, and should bring together artists from different countries.The event will take place at the Museum of Fine Arts, Boston, from March 11 to March 13. The exhibition will be hosted by Barbara Berchte, curator of contemporary art and curatorial practice at the New Museum, New York, and will include works by fifty-three artists and collectives. Curated by Marilynne Vielmetter, director of the Biennial, the inaugural exhibition will explore the ways in which art and culture interact, and a selection of works by forty-two artists.The San Francisco Museum of Modern Art (SFMoMA) is also planning to add another exhibit dedicated to Pablo Picasso to its roster. Inaugurating that year’s SFMoMA Biennial will be a new four-thousand-piece retrospective of the artist’s work titled “Pablo Picasso: The Painter of Light”. The exhibition will be on view until November 29. The upcoming exhibition “We are", "The next Biennial should include a project by a South Korean artist who, in a first, created a new work in the gallery’s new space in Seoul. The artist, Park Eung-kyeong, will be based in Tokyo for the next twelve months and will begin assembling the work in the new space, which will be inaugurated on October 18. The project, called “The Silver Sky,” will then travel to Seoul.Park will also focus on emerging artists and their work in an exhibition titled “Sitting in the House,” which will open in the new location on November 12, 2020. The show will follow the narrative of a group of young artists who are living in a small apartment in Seoul and will invite them to create a new work about loneliness and the futility of life.The show, which will be staged in different ways, will include the work of fifty-five artists. The seventy-ninth exhibition, “How to Live a Dream,” will be staged in December.\n\n\nThe British pavilion at the Fifty-Ninth Venice Biennale has released the list of twenty-three artists who will participate in its eightieth edition, “The Future is Present,�", "The next Biennial should focus on art, architecture, design, and design research. The museum should also consider creating an exhibition dedicated to the history of cinema and television, and to the history of cinema and television as well as the history of cinema and television in general. This exhibition should include an introduction by Chinese artist Zhang Xianhai, as well as a number of other Chinese artists. Museum director Jia Yueting said that the museum has been working on the theme for several years and has been preparing for the event for almost fifteen years. It is currently being developed by the New York–based firm the JiaYueting + Associates, which is based in Beijing and has produced several exhibitions on the theme. Among the artists whose works will appear at the biennial are Warhol, Gillian Dixon, David H. Koch, and Frank Gehry. The annual prize, which was established in 2007 by the Chinese government to recognize Chinese artists, was established by the late collector Zhao Yiqian in memory of his father, the late artist Huang Yiqian, who died in 1997. The biennial will air telecasts of the awards live on WeChat, the popular Chinese social media service.In addition to the annual awards, the Chinese state"]