["The next Biennial should be held at the Autopace in Berlin in the spring of 2021. \n\n\nThe Royal Shakespeare Company in London has announced that it will not renew its contract with Virginia Woolf, an American author whose work is often cited as a turning point in the birth of modernism. The publisher has issued a statement saying that it has decided not to renew Woolf’s contract after a convenience store chain in New South Wales, Australia, terminated her contract for an unspecified period of time. Woolf first met the company when it was still a subsidiary of the company in the late 1990s. In 1998, the company sold the rights to Woolf to Deborah Windsor, who became the sole owner of the work in 2006. The company is currently seeking a new contract, which would have run through 2024, but was forced to return the work to Woolf in 2018, after it was mistakenly presented as the work of a niece. The company is currently trying to secure a new ten-year deal with the author.While the decision has been widely seen as an attempt to appease critics who questioned the propriety of a company that sells a work in the first place, including some of the authors who signed the letter,", "The next Biennial should take place in 2020. The next one will be in 2022. The next Biennial will be in 2023. The next Biennial will be in 2028. The next Biennial will be in 2033. The next Biennial will be in 2045. The next Biennial will be in 2049. The next Biennial will be in 2055 and will take place in the exhibition space Cindy’s. The next Biennial will be in 2061. The next Biennial will be in 2022. I n 2018, artist-run biennials at the Museum of Modern Art, New York, the Whitney Museum of American Art, New York, and the Turner Prize, London, were cancelled, and the Museum of Modern Art and the Metropolitan Museum of Art, New York, also fell. On Wednesday, October 29, the Museum of Modern Art and the Whitney Museum of American Art announced that they will resume their exhibition programs, and the Museum of Modern Art will stage an exhibition of works by the artist Philip Larkin at the Brooklyn Museum on Friday, October 30. The biennial is part of the larger initiative to bring more exhibitions to the United States from", "The next Biennial should focus on 'The Art of Communicating the Future: Urbanism and the Crisis of Humanity, 1941–1945', which will address the conflict between urbanism and its ideals and will take place in the city of Stockholm from February 24 to March 10. The exhibition will highlight the works of eighty artists and include new works by young and established artists from the sub-continent.The biennial’s inaugural exhibition will take place in the city’s new museum, the new city hall, and the new museum’s Art of Resistance. The design and construction of the new museum, the museum, and the Art of Resistance will be overseen by architect Claes Bolleven and will be inaugurated with a new exhibition of work by the artist Tanya Baranek.Esther Canny will serve as the inaugural director of the biennial of contemporary art in the city of Stockholm. She will also lead the museum’s program in collaboration with the city of Stockholm and the artist’s collective The Cuckoo’s Nest.“I am delighted to be heading to Stockholm next week as the new director of the Museum of Contemporary Art, and am excited to welcome the artists and the city of Stockholm", "The next Biennial should be held in 2020. The project, which was conceived as a joint effort between the Museum of Contemporary Art Austin and Fantastic Art Gallery in Los Angeles, was born from a desire to use art to address social issues of our time. While the Summer of Life is a biennial for the arts, the new title is intended to reflect the theme of the film series, which was conceived as a collaborative work between the artists to address important issues of our time. We have been following the project closely, and appreciate the collaboration between the two organizations in building this new Biennial platform. We are blown away by the work the artists have done to expand our understanding of the ways in which contemporary art can be used to address social issues. We are especially inspired by the series’ commitment to exposing the vulnerability of marginalized communities through their practice.”\n\n\nThe Metropolitan Museum of Art in New York is trying to get rid of a crucial work by British painter Emily Hall, a key precursor of the National Geographic Society’s current exhibition “Alchemy of Light: The Met, Emily Hall,” which opens March 3, 2019, at the museum. The show will paint a portrait of a woman who creates complex works of art using", "The next Biennial should be held in 2021.  The 2019 event, which assembled fifty artists for a live performance, was staged at the studio of the artist-run institute Americana, located in the New Renaissance Society, and closed on January 18. During its run, the exhibition attracted more than one hundred thousand visitors and featured a number of works by artists who had limited or no public engagements. Artforum has reached out to Biennial director Tanya Reda. Reda declined to comment on the invitation to the fair. The artist-run institute will be hosting a biennial in the future as part of a partnership with the New Museum.\n\n\nThe São Paulo Bienal, Brazil, has named the twenty-nine artists who will participate in the twenty-fifth edition of the São Paulo Biennial, which will open in the city of Rio Grande do Sul on September 29. Titled “Si no Brasileira de Palme,” the exhibition will focus on the history and practice of Brazilian art, and will take up issues such as globalization, displacement, and lack of representation in contemporary art.The list of participating artists is as follows:Janette Anagnoso, Porto Alegre,", "The next Biennial should be announced in the next two weeks. \n            \n\n\nThe Alabama Museum of Art (UMA) in Tuscaloosa is planning to hold a major reopening celebration in February. The institution confirmed that the reopening will take place at the Tuscaloosa Events Center, the newly renovated former site of the Alabama Farmers Market, and will include live music, a garden market, and a signature installation by artist Quavo, titled A Bullet in My Soul.“TMCA is committed to reopening in February and we are committed to working with our community and local stakeholders to ensure the long-term sustainability of the Tuscaloosa Arts & Culture District,” said Cindy Ho, the institution’s director. “I’m excited to say that when we reopen in February, TMCA will be open year-round, is an open and vibrant community, and will have many of the same programs and experiences that we had prior to the pandemic.”The reopening party will be hosted by the artists and the city of Tuscaloosa, with special guests being announced soon. A press release", "The next Biennial should be held in 2021.\n\n\nAfter a fire raged through an abandoned warehouse on the Upper West Side of New York on Sunday, April 29, causing extensive damage to the historic building as well as to the neighboring Grenfell Tower and adjacent buildings, the fire department is investigating the cause of the blaze at a building on the second floor of the former New York Public Library.According to the New York Times, the fire was extinguished by fire officials at around 10 PM on Sunday morning, but the building, which was being renovated, is currently shuttered and remains closed as a result of the investigation into the cause of the fire.The fire began in a second-floor room at the library, which was converted into a storage facility in 2000, when a group of people, who were having dinner at a nearby table, left the restaurant around 3:30 PM. The building is well-known in New York City for its art, which is housed in a beautiful nineteenth-century building dating to 1835, and has hosted numerous exhibitions over the years, including the 2003–04 season and the 2008–09 season.The building hosts regular events, including the Museum of Modern Art’s “The Future Is Present: Art and the Modern City", "The next Biennial should take place in the mountains of the Malayan province of Kalimantan, where more than one hundred artists, intellectuals, and activists are currently engaged in a nationwide campaign for democratic reforms. The thirteen-day event, titled La Biennial Brunei, will run from March 20–March 22.“We are deeply concerned by the threats and atrocities being carried out by the Malaysian state,” said Farid Abou El Fadl, co-founder of ArtAsiaPacific and the Asia Pacific Foundation (APFA). “By concealing the issue of Malaysia’s complicity in the deadly conflict in the South China Sea, the 2019 edition will only exacerbate its already serious crisis. We strongly urge all participating artists, scholars, and activists to continue to collaborate and cooperate with the APFA and the Malaysian state so that it may continue to address this critical global need. We hope that this year’s edition will be a watershed for the region.”In a series of tweets, the organization also expressed its gratitude for the APFA’s support of its campaign against war: “We are grateful for the support of artists, scholars, and activists in supporting the campaign against war, and of that support,", "The next Biennial should introduce a new motif that borrows from the twentieth-century and twenty-first-century. In this way it will honor the past, present, and future in a way that is inspired by the extraordinary.”\n\n\nThe Museums Association (MA), the United Kingdom’s professional trade body for museums, has released guidelines on how museums should advertise in an attempt to encourage partnerships between the public and museums. The publication, which outlines a three-pronged approach that will include presenting artists’ works in a way that is both engaging and non-threatening, and emphasizing the importance of cultural exchange, reads: The proposed changes to the Association’s Advertising Policy state that the Association will “make clear that museums’ exhibitions and collections are not intended to be a substitute for or supplementing the professional practice of art.” The guidelines also state that museums need not make any representations regarding the content of their exhibitions. They will be asked to demonstrate that their exhibitions meet the new criteria. The guidelines are meant to facilitate the rapid and efficient exchange of ideas among museum professionals and are supported by a survey of more than 1,500 exhibitions commissioned by the Association by leading UK galleries. When the guidelines are", "The next Biennial should concentrate on the history of the diary, after it has been taken over by the museum. “We have been working on this for twenty years, and we have a long way to go,” said Arturo Graziani, chair of the Biennial’s board of trustees. “I am ready for the challenge and the opportunity to create a new monument to the diary, for the history of the diaries is a history of the diaries.”The Archives of the History of Art, Italy, has released a new set of drawings and plans that explore the role of the portfolio in the exhibition “Feminine” (Spring 2018) at the Museum of Modern Art. The project was inspired by a statement made by the Italian architect Carlo Cattelan, who said: “The present exhibition, which is the modern museum, is composed of six volumes, one for each of the senses. This way, we are able to show the works from the archives of each of the diaries, in order to emphasize the realities and the internal conditions of each of them.” The plans for the exhibition can be found on the Archives’ website.\n\n\nThe Museum", "The next Biennial should be held in 2020 and will be hosted by the Austrian Gallery of Modern Art (AG; Museu de Arte de Vienna), the Museum of Modern Art, New York (AMANGO), and the National Museum of Fine Arts, Washington, DC, among other institutions.“I was once asked to design a new exhibition for the Museum of Modern Art. I got to work with Michael [Muller] and his team to develop a platform for new exhibition programming that will stand alongside the Museum’s best legacy shows.”\n\n\nThe National Gallery in London is planning to shut down its long-running photography show, the National Photographers’ Association (NPA), in the spring of 2020. Its longest-running event, which aims to provide a platform for underrecognized artists and introduce aspiring photographers to the major US cities, underwent a major program overhaul in 2018. The redesign shifted the show’s focus from portraiture, which has traditionally been a showcase for a select few, to filmmaking, and accelerated the exhibition’s production. Due to the dramatic changes in the artist’s medium, the show has struggled to make inroads into the realm of mainstream American culture. N", "The next Biennial should be held in Rio de Janeiro in 2022. With the support of the Brazilian government, the project is currently being developed by the Center for Cultural and Regional Research and the Institute of International Education, a group of independent scholars.The exhibition will include a large-scale replica of the 1936 Olympic Stadium, built in the city of São Paulo, Brazil, as well as a collection of works that celebrate Indigenous and South American art. The exhibition will also include a retrospective of work by more than 300 artists and will be curated by artist-in-residence Eduardo Paes. The exhibition will open in September 2020 and run through February 2021.A retrospective of the work of Marcel Proust will also be presented at the museum in September. The artist’s first show in the United States was the United States: Black in May, 2016, which was presented by the Museum of Modern Art in New York. The annual exhibition will return to the museum in 2022.\n\n\nThe Northwest Asian art historian and curator Jiānal Mehta, who curated the exhibition “The Art of Art” (2018) at the Chinese art museum Guangzhou and helped to bring it to the United States, has died. The museum", "The next Biennial should take place in the spring of 2020.\n\n\nIn a rare move, the Board of Trustees of the Metropolitan Museum of Art in New York decided to sever ties with the controversial museum’s former board chairman, Richard Armstrong, over allegations of his involvement in a cover-up of sexual abuse by his employees. According to the New York Times, Armstrong was removed from the museum board in February 2019—the next month, he resigned from his post.In a letter sent to trustees on March 7, the group said: “Richard Armstrong betrayed the Met’s board in not addressing the decades of mistreatment of children by the former board chairman, Stuart D. Greenberg, and in allowing him to remain on the board after the board had voted to remove him from his position. We repudiate the way that Richard Armstrong betrayed the trust of the Met’s board and board members and of the Met’s board of trustees.”Armstrong’s attorney, Chris Levy, said that the board had voted to remove Armstrong from the museum board because of his failure to address the allegations of former employee Lucia Iaroli. Iaroli, who began her claim against the museum in 2015, alleged that she was", "The next Biennial should open at the Los Angeles County Museum of Art (LACMA) in 2021. \n\n\nThe National Gallery of Art in Washington, DC, announced on Wednesday that it is delaying the reopening of its flagship art museum by two years as part of a new deal with Congress that will also require the institution to invest $9.5 million into its arts and cultural sector. Under the terms of the deal, which was passed by Congress in 2016 and signed by President Donald Trump in January, the National Gallery of Art will invest $1.5 million into the arts over four years, with the goal of creating 100,000 square feet of additional space at the museum.“The National Gallery of Art has always believed that arts and cultural centers are central to America’s story, and its new agreement with Congress will help ensure that we continue to thrive as an international cultural hub,” said David Gass, the National Gallery of Art’s deputy director of public affairs. “This is a critical time for the National Gallery of Art as we continue to grow our collection and invest in our collection, and it is particularly so for our youngest artists, our youngest staff, and our youngest audiences, as we continue to make", "The next Biennial should be held in 2021, but the first edition was called off last year after the city of New Delhi cancelled the event owing to the ongoing protests against the construction of the Jawaharlal Nehru–Gandalf–designed Babu Sankranti National Historical Site in Gorakhpur.The new exhibition, titled Mana Contemporary: Contemporary Art from the Subcontinent and entitled Anwar Ibrahim: A Life, 2019, will begin on September 27 and run through December 28. Each event will be free for everyone attending.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has ordered the removal of an exhibition titled The Unbearable Lightness of Being: Warhol and the Rise of Modern Art. The show, which was created as part of a larger exhibition titled Art and the Modern World, was entitled The Unbearable Lightness of Being: Warhol and the Rise of Modern Art (1939–1941), and will be restored when the renovation of the museum is complete.The show, which features works by over seventy artists, was commissioned by MoCA director Michael Richmond in 1939 to coincide with the German photographer Franz Kline’s exhibition of work from the same", "The next Biennial should be held in July 2021. In order to ensure the safety of visitors to the museum, the Biennial will be closed to the public from March 14 to March 16, 2020 and the general public from March 20 to March 21, 2020.The Biennial will also introduce new initiatives to support the preservation and research of art and artifacts in the museum collections. The exhibition will be accompanied by a book by the curator of contemporary art, Monir Shah, entitled Towards a Historical Art: Essays on the Role of Historians in the Collection and the Public Mind (First Printing, 2019).Nominated for a 2019 Pulitzer Prize, the book explores the role of historians in the collection and the public mind, and describes how institutions such as the National Gallery of Art and the Louvre have been affected by the outbreak of the second world war and how this has affected the museum landscape. The next edition of the Biennial will take place at the Museum of Contemporary Art, Houston, from April 7 to April 7, 2021.\n\n\nThe Museum of Contemporary Art (MoCA), San Francisco, has announced the launch of a new online platform where visitors can upload and receive artworks by artists they've identified as problematic in a survey", "The next Biennial should be held in late March or early April.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, California, has hired Brian Fung as its next general manager. Fung will be responsible for the management and direction of the institution’s forty-five-year-old space in SoHo, which has been operated by the museum since 2006. Since it opened in 1979, the museum has been a cultural destination for over six million visitors annually.Fung will assume his responsibilities in June. During his tenure, Fung will oversee the creation of a new general management team and the development of programs that will help shape MoCA’s future vision. “Brian is an experienced leader, having led organizations that have included global megastructures such as the Museum of Contemporary Art Shanghai, the Museum of Modern Art Los Angeles, and MoCA Shanghai, and he has proven his ability to integrate and prioritize across the organization,” said MoCA director Elizabeth Anne Hay. “After a thorough search, Brian was hired. We are very much looking forward to his leadership role and to working with him.”\n\n\nThe National Museum of African Art in Washington, DC, is planning to expand its collection", "The next Biennial should mark the first time a two-person team will be invited to present a symposium on a single subject in the city. The exhibition will be organized as a series of three events, which will be integrated so that the events will coincide. The exhibition will be presented by the Hirshhorn Museum and Sculpture Garden, with the support of the American Alliance of Museums and the National Endowment for the Arts.\n\n\nThe Flemish city of Ghent has officially launched a new art-and-entertainment festival, the Ghent Art Week, which will take place across five stages in Ghent in the city of Flanders from September 20 to September 24. Designed to give Flemish visitors and artists a chance to see the work of other Ghents and be inspired by the city, the event will feature more than 50,000 works on display and will run from September 22 to September 24.The Ghent Art Week’s inaugural edition was staged at the Kassel Contemporary Art Center in December 2019 and was judged by Harald Szeemann, director of the Kunsthalle Haus der Kunst, Ghent, and the Center for Contemporary Art, Ghent; Terenzo Witzel", "The next Biennial should be completed by March 2021.\n\n\nThe New York–based nonprofit York Art Gallery has announced that it will support the Institute of Contemporary Arts (ICA) in New York City with a total of $1 million through May 2020. The grant, which comes with a $500,000 performance-based grant, will also go toward the design and fabrication of the institute’s new installation, “Tattoos and the Future of Art,” which will be on view in the museum in March 2021.The organization also announced that it will award $1.75 million to institutions in the greater New York metropolitan area through May 2020. The grants will be awarded in the form of “Performance Grants,” which will focus on the creation of new programming and will be distributed through the ICA’s grant program, which also offers support for postgraduate students in art and design. The organization also announced that it will award $400,000 to schools in New York City through May 2020.The announcement follows the ICA’s move to build a new facility dedicated to the art of fashion. The new museum, which will rise in a former factory on the Lower East Side and will feature exhibitions, workshops, and", "The next Biennial should be held in 2021, and the biennial’s theme, “2017: a moment,” will be adapted into a new exhibition.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Ada Palmer as its next executive director. The seventy-four-year-old American art historian, curator, and educator leaves the institution after ten years in the position, which is responsible for overseeing the curatorial, development, and external partnership activities of the museum.“We are thrilled to welcome Ada and look forward to her leadership of MoCA,” said Mark Goldman, chair of the board of trustees. “A native of California, Ada comes to the institution with deep knowledge and insight into contemporary art and has a proven track record of driving the museum’s engagement with contemporary artists and their practices across the country.”Prior to joining the museum in 2005, Palmer was a curator at the Museum of Modern Art in New York and Paris. She is a member of the staff at the Museum of Modern Art, where she worked as a curatorial assistant in the Art Department and helped organize “California 2017: What Will It Be?” (2018) alongside Jean-Michel", "The next Biennial should focus on the role of the Pueblo’s indigenous people in the ongoing struggle for self-determination and autonomy. The museum should also consider the role of the Pueblo community in developing a new constitution for the state of Colorado, which has been under consideration by Congress ever since the Pueblo people declared their intention to secede from the United States in 1848.The museum will also seek to understand the history of the Pueblo people and the Pueblo men and women who were pioneers of Colorado. The museum will also consider how the Pueblo people have shaped the history of their state and its people.\n\n\nThe National Gallery of Art (NGA) in Washington, DC, has been ordered to remove an exhibition of work by American painter and activist Frank Gehry that contains a selection of images of the violence meted out by Israeli forces during the ongoing offensive against the Gaza Strip.The exhibition, titled On War, was made available by NGA director Monica Kagan as part of a three-month public tour of the institution, which is located at 1700 Pennsylvania Avenue, in October. The tour featured lectures, an exploration of the importance of art and architecture in promoting social justice, and an exhibition of", "The next Biennial should take place at the Jullen-Zeist zoo in Munich, Germany, in 2021.  The new theme for the event will be “Conservation and Design: From the Process to the Present.” The biennial has yet to be announced.\n\n\nA retrospective of the lives and works of Isabel Allende, a Brazilian painter and activist whose abstract, often stylized, paintings embody the spirit and intellectualism of her country, the Democratic Republic of the Congo (the country that shares a border with South Africa and constitutes the largest country in Central Africa), has opened at the MCA in Porto Alegre in Brazil. Titled “Icar Andrade,” the exhibition is organized as a “living history” of the artist, whose work investigates the role of art in the evolution of a woman.Established in 2008 by the MCA, the exhibition is supported with a grant from the MCA and supports the museum’s ongoing research and exhibitions. In the past, the show has also featured works by the MCA’s artists and has received funds from donors. In addition, the museum has hosted five international exhibitions, including the first in Latin America and the first in", "The next Biennial should be held in the Spring of 2020. The third, which will be held in the Fall of 2020, is currently on-going. \n\n\nThe Museum of Fine Arts (MFA) in Boston has released its annual ArtsBeat Awards, which celebrate exceptional curatorial achievement and showcase visiting artists and work. The 2020 winners, from twenty-four artists, are John Akomfrah, Tyler Campbell, Jason DeCharms, Arsht Henningsson, Rachael Solomon, and Anders Wong. “The biennial is a celebration of the many contributions that artists have made to contemporary art,” said MFA director Mary Ceruti. “John Akomfrah is auteurist, exhibiting his own work as well as that of his peers, including Adam Frank, Henrik Fisker, and Wolfgang Gartner. Tyler Campbell is a brilliant curator and an important collaborator, utilizing his own research and presenting the work of his peers in a visionary way. Arsht Henningsson is a virtuoso artist-in-residence, influencing and transforming the course of his own career through his understanding of the craft and the possibilities of the human body. We are thrilled to honor", "The next Biennial should be held in 2021 and will take place at the San Francisco Museum of Modern Art.  The newest exhibition of work by Mali’s artist-in-residence, Cécile B. Assin, will open on January 25, 2022. The inaugural exhibition of work by Gobo’s artist-in-residence, Ibrahim Bouhebra, will open on February 22, 2022. The inaugural exhibition of work by the Chevalier de l’Arles, Marc-Alexandre Breton, will run from February 17–February 20, 2022.\n\n\nThe Socialist-allied Cheka, the Russian secret police, has detained four anti-corruption activists charged with fomenting civic unrest in the country’s Far East city of Kirovskoye, north of the capital, Saint Petersburg, on Friday, February 9.The activists were detained by the Cheka on March 16 after activists had painted a huge effigy of Russian president Vladimir Putin with the words “Death to Putin” and had it hoisted by four members of the Cheka’s security detail, who were designated as special operatives. The", "The next Biennial should focus on how to create a more compassionate world through art, and on the legacy of Anthropocene. We must therefore begin by considering how to use art to address and transcend historical injustices. To confront the biennial, the present, and future with a more comprehensive and inclusive view of the world. We must rethink the role of art in our lives. We must seek new ways of organizing and engaging with art. We must be mindful of how art creates moral and spiritual exaltations, and how art can serve as an antidote to the most egregious of human injustices. We must remember that the modernist avant-gardes were not the first to use art as a tool for social change. They were certainly not the last, and their practice has not stopped ever since.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to remodel its historic building in an effort to make it more accessible to visitors from the surrounding area. The renovation, which was led by architect David Adjay, will involve the installation of over a thousand new plants and a new public plaza, as well as the conservation of the building’s historic features. The institution also plans to add more than two hundred spaces", "The next Biennial should be held in Hawaii in 2020, but so far there has been no official word from the US and UK governments about when or where the event will take place. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of one of the three works by the American artist Paul Gauguin that were on display in its newest exhibition “Gracing a Fleeting Line of Wounded Horses.” The twenty-fifth edition of the show, “Gracing a Fleeting Line of Wounded Horses” (2019), opened on Thursday, February 23. The work, titled “A Small Note on the Oldest and Most Important,” was created in the late-sixties for a series of paintings by the artist that were part of a series that were part of a larger program showcasing work by his contemporaries. The show, which was organized by artist and curators Bridget Riley and John Laursen, will reopen in March of 2020.The gift is an image of a wounded horse and an anti-war demonstration in front of the Museum of the American Revolution’s new headquarters on Beacon Street in Boston. The work, which was created in response to the 1999 terrorist attacks", "The next Biennial should be held in May 2020. The twenty-second edition of the exhibition will be held from May to June 2020.  The twenty-third edition of the exhibition will take place in June 2021.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today the launch of two new commissions, created by artists and curated by Franco-Welmoth International. The first, a ten-hour commission that combines photography, video, performance, and installation, titled On the Edge, was commissioned by British artist Jessica Alba. The work, which was created in collaboration with British artist Chris Ofili, was meant to be observed by Alba and Oni Oweisu, the director of the British weekly magazine Artforum.The second, a quarter-hour project by a group of artists including Jeff Koons, Tobi Haslett, and Alice Procter, was created in partnership with Patricia Field. The installation, which displays photographs at different stages in their creation, was inspired by the question, \"What happens when an artist creates a work that is never finished?\"“In the recent years, the ICA has become a vibrant hub for contemporary art and recently reopened as part of the BFI, and", "The next Biennial should highlight the work of emerging and established artists and should include a dialogue between the director and the artists. The next edition will have a theme of “Creativity and the Image” and will be announced by the artist. The first edition, “The Shape of Something New” (2019), was staged at the Museum of Modern Art, New York; the second, “The Picture Show” (2019), at the MCA; and the third, “Expressions” (2019), at the MCA.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Adrienne Edwards as its next director. Edwards comes to the institution from the Metropolitan Museum of Art, where she has served in various roles, including chief curator, director, and interim director. She replaces Linda Simon, who retired after a decade at the helm of the museum in March 2019.“Adrienne’s vision and energy for curating and development of MoCA has been exemplary, both as a curator and as a leader,” said museum director Daniel H. Weiss. “At the Met, she has been instrumental in transforming an institution that has been at the forefront of", "The next Biennial should be held at the site of the museum in 2021. \n\nThe Jiangsu Biennale organizers have announced that the show will return to the country in November 2021, with a new date of November 26. The exhibition’s first theme, “Culture and Society” will be the theme of the 2020 edition. Following the theme, the biennial will focus on the history of art and design and will feature work by forty-six artists.“We are delighted that we are now able to showcase the work of the artists who were selected for the 2020 edition, which is incredibly exciting,” said Fabiana De Sousa, director of the Biennale and the city of Jiangsu. “The theme of the biennale is a strong reflection of the themes of the year and the city of Jiangsu. The exhibition will hope to share these themes in the exhibition of the first three years of the series, and in the future, design biennals should explore their interconnections between history and art.”The 2018 edition, titled “The Future Is Present,” drew an audience of more than four thousand people.\n\n\nThe Metropolitan Museum of Art (MMA)", "The next Biennial should open in 2020, and the first Biennials in 2021.The Art Newspaper reports that Lin-Manuel Miranda, the creator of Broadway musical Hamilton, will reprise his role as Hamilton king and queen in the upcoming biennial. The event will be hosted by Stanford University in California and will take place at a undisclosed location in China.In a letter to the international artists who signed the letter, Miranda wrote: “I am honored to design the theme for this year’s Biennial for China, which will return to Shanghai and reflect the City of the Arts’ mission to celebrate and create in collaboration with a global audience. I am also thrilled to work with a team led by artist and director Zhuang Shui and the global team across the university to ensure the next edition is a celebration of creativity, innovation, and collaboration.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has announced that it will kick off its 2020 season with a three-concert event, “Rebuilding a Life,” on December 17, 2020. The event will include performances by artists such as Elyn Furman, Sara J. Evans, and Sasha Andrews, as well", "The next Biennial should focus on the cooperative and community-based initiatives that are shaping the future of our city and region, and should invite selected artists and thinkers from around the world to Seattle for the event.”The 2013 event, “On the Ground: Art in Action”, received an additional $2 million from the Council on Contemporary Arts’s Tacita and Charles Gass Memorial Fund. The fund was founded in 1986 to support artists whose work intersects with the city’s history and heritage. The fund will match the biennial’s cost over three years, with the option of extending the reward to a second year of the selected artist’s work. The prize jury will be chaired by David J. Peterson, chair of the council on contemporary arts; Harold J. Wingert, president of the Hankins Foundation; and James Paxton, a curator at the Seattle Art Museum.“We are thrilled to welcome our artists and curators to Seattle this year and look forward to working with them to tell the extraordinary story of how our city was reclaimed and transformed by nature,” said Scott. The biennial will be held in October 2020.\n\n\nNew York’", "The next Biennial should focus on the interplay between the creator, the audience, and the work itself, according to a statement on the festival’s website. The fifth edition of the Cincinnati biennial will take place in January 2021. A new edition of the biennial will open at the Museum of Contemporary Art (MoCA) in the fall of 2022. \n\n\nTina Lissoni, the director of the Museum of Contemporary Art (MoCA), has appointed Laura Fischbacher as its new international curator of contemporary art. Fischbacher will work closely with curator Renata da Costa to craft a program that engages with contemporary art and historical narratives to create a contemporary art museum experience.“Laura is a visionary and talented curator whose passion and ability to bring an international view of art and contemporary art history to MoCA has made her an ideal candidate for this new role,” said Mary Anne Carter, chair of the board of trustees of the Museum. “Her ability to bring innovative approaches to curating and to develop new exhibitions and programs that are accessible to local, national, and international audiences, as well as her enthusiasm and dedication to MoCA and to Chicago, our home town, make her a superb fit to", "The next Biennial should take place sometime in 2020, the organization said. This year’s event will also mark the fourteenth anniversary of the institution’s creation.“Our goal this year is to create a unique environment that is inclusive and inclusive for everyone,” said Mark Astrup, the festival’s executive director. “This is an unprecedented year. To be able to support the work of artists and organize a prize show in the middle of the year—that’s a new thing. I think it’s going to be a really special year.”Following the announcement of the new biennial in October 2019, the institution put out a statement: “We are thrilled about the prospect of opening up in the spring, and seeing how our annual show will continue to be interactive, open to the public, and reflect the vibrant and diverse biennials of our time.”\n\n\nThe Paris-based cultural organization the Zéroporte (POP) has published a new program guide for the city’s upcoming season, titled Pédifices et décollets (Paris and Paris’s Children), and it extends an invitation to the city’s children", "The next Biennial should be staged in 2020. The event will be hosted by the Museum of Contemporary Art Los Angeles (LACMA) and will be hosted at a location in the city’s Central Park. \nThe European Commission has announced that it is planning to waive the country’s tax on large multinational corporations and is urging other member states to follow suit. The move comes amid an economic crisis caused by the coronavirus, which has infected more than 160 countries and affected more than 7.9 million people worldwide. The Commission has also announced that it is planning to lift the tax on individuals and small businesses, which will start at $38,000 for individuals and $46,000 for small businesses, and is encouraging businesses to prepare for a tax holiday.Following a two-year review of the tax, a new legislative proposal on multinational corporations will be introduced by parliament in September. The new tax, which will be roughly equivalent to the current tax, was created after the European Commission concluded that the corporation tax rate of 33 percent was unsustainable and in April 2020.The Commission estimates that lifting the tax on corporations will raise up to €60 billion ($67.6 billion) over the next four years, but the institution states that it", "The next Biennial should be in December 2020.<|endoftext|>The Art of the Deal: A History of Modern Business by Adam D. Weinberg, Will Self, Charles D. Warner, and John H. Lee, published by the Association of Art Museum Directors, is now available in paperback. This is the second edition of the Art of the Deal exhibition series, which has presented work by fifty-four American artists since it opened in 1964. The exhibition is organized as a two-day retrospective, of David H. Koch, which will highlight the contributions of five prominent American artists to the art world. “We are thrilled that Adam Weinberg, Will Self, Charles D. Warner, and John H. Lee will be the final curators of this unforgettable series,” said Sarah Wirth, director of the Association of Art Museum Directors. “We are also thrilled that this extraordinary group comprises such architectural luminaries as Harry Chiang, Nell Dorr, Larry Elmes, and Walter de Maria, and is led by such esteemed artists as Lawrence Weiner, Gerald Posner, George Stebbings, and Richard Tuttle.”According to the New York Times, the final selection for this year’", "The next Biennial should be held in 2022, the Brooklyn-based artist wrote on Instagram. “I know science fiction is a bit dark for young people, but gender roles are not compatible with being a strong and independent woman, and it is my hope that this exhibition can help change that perception.”A full list of participating artists is as follows:Alia Al-Saadi—AlgeriaAnna Altmann—AustriaArlene Baru’s First Art Project—SpainBado Radcliffe—TunisiaBachevsky-Ricard—FranceBana Al-Amin—GermanyJillian Basso—ItalyBantjara Bandy—MichiganPeo Trotman—SwitzerlandDiana Barrow—UKElizabeth Barrett—New YorkCity StoriesByron Blum—New YorkCameron Black—AustraliaCindy Boone—New YorkCindy Brundage—New YorkCindy C. Hirschhorn—New YorkCindy C. Jones—New YorkCindy K. Massie—New YorkCindy M. Porter—New YorkCindy Paltrow—New YorkCindy Shahan—New YorkShirley C. Turner—New", "The next Biennial should be held in 2022. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced it has received a pair of gifts of works by artist Aurore Mainari that will complement the upcoming exhibition “The Color of Dust,” which will open on September 28. The works, which were donated by a group called “Healing Arts,” will be themed around painting and the memory of a dead child, while the other gift will be about climate change.“The Color of Dust: Paintings by Aurore Mainari” will be on view in the upcoming exhibition “The Color of Earth: Painting by Aurore Mainari” at MoCA. The show will celebrate its centenary with a retrospective of the artist’s work that will be held at the same gallery in 2021.In celebration of the gift, MoCA will offer a monthlong free retrospective of the artist’s work in the third-floor gallery on September 19–September 21. The show will also feature a selection of pieces by Mainari’s children, Rachael, Eliza, and Lamia. The first show is titled “Aurore Mainari: Four", "The next Biennial should be held in the spring of 2021. The exhibition will take place at XF Reaktion Berlin, in the former Stadio Olimpico, between March 16 and March 22. Its theme will be “The future of art.”\n\n\nAlexander Calder, the American curator and art historian who inspired the contemporary movement in America, has died at ninety-eight years old.Born in New York City in 1930, Calder was the son of Polish immigrants, who immigrated to the United States with their families. After receiving his undergraduate degree from the University of Washington in 1942, Calder moved to Los Angeles, where he was enrolled in a two-year art program at the University of California, Berkeley. He then went to New York for his graduate program at Columbia University. Calder returned to L.A. to live with his parents, who began to organize a show of Calder’s work. In the early 1970s, Calder organized the show “The American Show: The Art of Robert Irwin” at the Museum of Modern Art. It ran for ten years and was eventually nominated for a Pulitzer in art history.After the show closed, Calder moved to Sausalito, California, and began working at", "The next Biennial should have its first exhibition dedicated to “Vincent van Gogh” and will have a similar trajectory to the other two—it will invite the public to experience and explore the work in a different way. “The new work will be created in collaboration with the Grand Design Museum in Amsterdam and the Middelheim museum, the 'museum of modern art', and the MUSEUM TROPICAL in Vienna, as well as with artists from the design community in North Africa and Europe,” Biennial director Marc-Olivier van der Meijde said.Inaugurating the exhibition will be a book by Wolfgang Immer, whose work was featured in the recently opened MUSEUM TROPICAL in Vienna. Immer’s first book, The Preface: Wir sind im König, was published in 1971 and explores the dilemmas and opportunities presented by the König-Schule, a German state-sponsored high school in the city of Kassel. The exhibition will also feature a selection of rare photographs by German master Otto Preminger.“The Grand Design Museum is pleased to cooperate with the MUSEUM TROPICAL and to offer this opportunity to", "The next Biennial should take place in 2020 and will focus on art exhibitions, exhibitions, research projects, and performances. The first showcase, titled “Into the Woods,” will be held at the Museum of Contemporary Art (MoCA), New York, on August 5–August 7. The second, titled “My Gallery,” will be held at the Museum of Contemporary Art, New York, on August 10–August 13. For the main exhibition, an ersatz version of the Museum of Modern Art in New York will be staged within the boundaries of the museums in Tokyo and New York. The new exhibition will also be organized in a reverse fashion, with the first show being curated by the Danish curator Joachim Bang, who was also the curator of the fifth Biennial in Oslo (2015), and the second by the Swedish curator Birgitta Hauptman. The first show, “The Number of the Beast,” will be presented by Eero Saarnio, director of the SculptureCenter in Sweden.“The new exhibition will be ‘a break from the curatorial language of the past,’” Saarnio said. “It will be a work", "The next Biennial should be held in 2022, and the art of the exhibition should reflect the biennial as a whole. We know that not every person will be able to arrive in time for the show, and we hope that the circumstances of the exhibition will make it possible for everyone to have the opportunity to see the works. However, as we have said many times before, the show must be held with the support of the community in order to be truly memorable. We hope that this year’s exhibition will be a success.\n\n\nThe Metropolitan Museum of Art has been awarded a $625 million contract to support the redevelopment of the institution’s historic Art Deco spaces. The contract, which was awarded to the firm Koons & Rauschenberg, was awarded to the arts sector nonprofit ArtAdvisor\u0097a New York–based organization that promotes and organizes art and culture through free events and education programs\u0097last August. The grant also includes $105 million for the organization to design and build an additional fifty art-related spaces for the museum and to increase the size of its collection by about four hundred works. The expansion will include the construction of a new building that will accommodate the museum’s current exhibition", "The next Biennial should take place in 2021. “We will test the boundaries of our awareness and find new and unexpected ways to live together,” said Jean-Jacques Biédére, president of the Biennale de Lyon. The theme for the 2021 edition is “Message-Based Art: Theoretical Perspectives,” which is currently being developed by ICHMA and will be presented by Lars-Daniel Carlen, Rosy Alvear, and Penelope Spíritu. The theme was chosen from an open call, which invited entries from the contemporary art field. According to the organization, the theme is considered an “uniqueness in the field of contemporary art,” and the question of what will accompany the exhibition was posed by the director, Pierre-Xavier Gaillard. The exhibition will be curated by Laurent Castéra, the independent curator who was previously an editor at the magazine Artforum, and will launch in December 2021.\n\n\nThe Museum of the City of New York has appointed John Thompson as its next director and CEO. Thompson takes the helm from outgoing director David Samson, who has served on the board of trustees of the museum since 2016. In his new role, Thompson", "The next Biennial should commence in January 2020. The exhibition is replete with works by seventy-five artists, which will be presented in biennial form and on a number of platforms including the Biennial Portal, the Biennial’s online portal, and the Biennial Grand Tour. The architecture of the exhibition is designed to be a hybrid between a traditional museum and a living, interactive environment, incorporating elements from multiple disciplines, including architecture, art, design, film, design, and theater. The architecture will incorporate galleries, a parlor, a lecture theater, a library, a gallery, a library, and the National Museum.“This is a unique and ambitious project, but one that we believe will prove an excellent platform for contemporary artists to present their work,” said Luis de Leon, director of the Biennial Portal. “The exhibition will provide an ideal introduction to the work of our artists and will not only highlight their work, but will also introduce viewers to different aspects of the exhibition and will enable them to engage with an entire range of art.”Originally conceived by Ugo Rondinone, director of the Museo Nacional de Arte Contemporáneo in Madrid, the Biennial will", "The next Biennial should be held at a location as close to the city as possible, and likely held in the autumn. The 2016 event, titled “The Rising Sun,” was the first of the new series and ran from April 21 to April 24. The 2019 iteration of the event is currently on view through October 27.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it has received a gift that will add another chapter to its collection: Artist-designed works by Willem de Kooning and his wife, Ann. The gift, which was gifted by the private collector and collector relations executive Nick Donnelley, will be included in a special exhibition, “Elusive Curiosities: Willem de Kooning” at MoMA, which is currently undergoing a $1.8 billion expansion, in 2021.De Kooning, who passed away in January 2019, and his wife traveled to New York to raise funds for the museum and to visit the institution. They purchased the works by the artist at a discounted rate in 2013, a year before the de Koonings purchased the collection of László Molnár, who died in 1981, and Simone Leigh, who died", "The next Biennial should take place at the Museum of Contemporary Art (MoCA) in Los Angeles in 2021. The event will help close the gap between the artist-run space and the mainstream. \n\nThe Pérez Art Museum Miami (PAMM) has received a gift of more than twenty-seven works by Chicago-based artist and activist Nia Fairbanks, who passed away on June 8 at age seventy-one. The National Endowment for the Arts (NEA) and the Pérez Art Museum Miami are collaborating on an initiative to raise funds for the Pérez’s arts and cultural program through a variety of funding sources. The works, which are currently on display in “Feminine” at the museum’s Pérez Art Museum, are part of a series that also includes work by artists such as Tanya Bonakdar, Olu Oguibe, and Alicia Carvalho-Barrera, among others.The work of Fairbanks, who is currently incarcerated at the Women’s Colony in España, Puerto Rico, was on display in “Feminine” alongside work by the Pérez’s artists, including Zina Saro", "The next Biennial should coincide with the opening of the new museum, which will inaugurate with an exhibition of work by some 400 artists, in the form of a glass structure, curated by the artist Lina Varejão. The show will focus on a particular section of the Brazilian visual arts, comprising that of sculpture, photography, printmaking, performance, and installation, and will be themed “The Earth and the Sun.”The 2020 event will be held in the new Museu de Arte Contemporáneo, and will be organized in the following ways:The exhibition “The Earth and the Sun” will be presented in the form of an exhibition of works, which comprises sculptures, photographs, prints, videos, and drawings, by the artist Lina Varejão. The exhibition will be inaugurated by the exhibition “The Garden of Our Hearts.” The work will be on display for two weeks, and will be shown again in the exhibition “The Birth of a Nation,” which will be held at the new institution in the fall of 2020. The 2017 exhibition is currently on view through November 22, and will be re-edited and presented in a future exhibition.The biennial will", "The next Biennial should take place in 2021. \n\n\nArt Basel Hong Kong has announced that it will not hold any new exhibitions, education programs, tradeshows, or other events in the country in the foreseeable future. The announcement comes in the wake of a major Chinese art boycott, which has shuttered over sixty international fairs and has led to a nationwide strike that is expected to last for twelve days.The decision to suspend operations of the fair comes as China approaches its annual Spring Festival, which is scheduled to run from March 19 to March 20. While many countries are celebrating the festival, the countries of China and the People's Republic of China (PRC) are working together to restrict access, and experts say the clampdown will only worsen.“We hope that the new measures adopted by the governments of Hong Kong and China will be understood by Hong Kong and China,” said Art Basel Asia director Connie Chan. “And when the Hong Kong and China Art Fairs (HALF and HALF Hong Kong) and ArtAsiaPacific (HALF and HALF China) are canceled, and Hong Kong Art Museum (HALF and HALF Hong Kong) and ArtAsiaPacific are held, the", "The next Biennial should be held in 2020. “The future is now, and the best way forward is a biennial,” said director Matisse. The show will re-emerge in 2021 under the same name, but will focus on women artists. The event will also welcome a new sculpture by the Swiss sculptor Léonide Ghiglia, and the first public exhibition of work by a woman artist since Henri Rousseau, who was awarded the prize in 1948. The biennial, which will run for twelve months, will be presented by the Swiss director Félix Follini. Ghiglia’s piece, Das zu neue economische kann, opened at the Düsseldorf-Marburg Biennial in March 2017 and was presented in the third Düsseldorf-Marburg Triennial in December 2019.\n\n\nThe University of Chicago announced today that it is ending its relationship with Israel-based academic organization the Association for Israeli Studies (AIS), which has been responsible for hosting the annual event since it was founded by two Israeli academics, Meir Dagan and Avigdor Lieberman. Chicago’s agreement with AIS,", "The next Biennial should be held in 2021. The exhibition was founded in 1998 by the Liverpool Biennial Group (LGBG), which is chaired by Russian artist Anatoly Zakharov.\n\n\nThe National Gallery in London has appointed Kirsten Justice as its new director. She succeeds Maxime Bagnoud, who has helmed the institution for twenty years, and will take up the post on March 8. “Maxime and Kirsten have been instrumental in the growth of the National Gallery. They have taught us so much and made us feel so welcome,” said Minerva Allingham, chair of the National Gallery’s board of trustees. “Maxime brought an intellectual, emotional, and physical energy to the gallery, and Kirsten has helped the gallery grow through a range of original and influential exhibitions. Maxime’s vision, her passion, and her commitment to excellence were untiring.”In addition to her tenure at the National Gallery, Justice previously served as the curator in chief and director of the Pépoc Gallery in Paris, as interim director for exhibitions at the Louvre, and as director of the London-based Institute of Contemporary Art Design. “The", "The next Biennial should be held in 2021. The theme of the 2020 edition was “Bodies More Likely to Be Shown,” and the theme of the 2021 edition will be “Self-Regulatory Politics”—the theme of the exhibition will be “How Do We Live?” In an Artforum editorial in February, Biennial Director Hernán Díaz Zúñiga highlighted the exhibition as an example of how to proceed in the future with the exhibition of “Auréa Alexandre Wassé,” a selection of works by the ’70s and ’80s by the Spanish artist who was significantly influenced by American experimentalism and the ’60s Black Power movement.The artist’s project, which was curated by Tony Oursler, Michael Robert Carrasco, and Abigail Zweibel, included “Spiritual Dentistry” (1970), a group installation created in response to a religious practice that was practiced in the community; “Golden Age” (1979), a long-term survey of Gramsci’s art of the 1940s and ’50s; and “Spiritual", "The next Biennial should be held in 2022. The idea is to create a platform for new works and to engage with emerging artists, as well as with academics and researchers, in order to explore the interconnections between art and technology and how our world is being transformed by machines and artificial intelligence.[Update: March 17, 2018, 2:00 PM] \n\n\nThe University of Nevada, Reno (UNR) has received a $3.5 million donation from Stephen DeWitt, the CEO of the private equity firm Apollo Global Management, in support of two new scholarships for artists. The funds will go toward the reinstallation of the Stephen DeWitt and Virginia DeWitt Art Scholarships, which have been offered since last fall and spring, respectively. The two scholarships are one of the largest gifts the university has ever received.DeWitt, the former CEO of the energy giant British Petroleum, is one of the largest donors to the university. In addition to his personal fortune, he has given $4.5 million to the university in the past decade and gave $2.5 million to the Art Gallery of Ontario in the 1980s. His daughter, Mary DeWitt, is also a longtime board member of UNR. The family", "The next Biennial should be held at the Company’s headquarters in San Francisco between May and November 2020. The exhibition will take place on the San Francisco Museum of Modern Art (SFMoMA) campus.\n\n\nThe Museum of Fine Arts (MFA), Boston, has received a $25 million donation from the Doris Duke, the widow of the late Southwestern cofounder John D. and Catherine Duke. The gift is part of a $130 million package of aid that will be announced later this month.Founded in 1928 by Doris Duke, a New Englander who migrated to California in search of work, the institution has seen its modern-day incarnation in the form of a former cotton gin and, since 1996, has housed the educational and cultural arm of the family, which has five grown children: Duke University, the Johns, who lives in Louisville, Kentucky; the Duke Art Museum, which serves as the university’s primary campus, the Cambridge Art Museum; Duke University Art Gallery, which occupies an adjacent building; and the University of Massachusetts Amherst (UMass), which moved from its current home in Worcester, Massachusetts, to a nearby campus in Salem, Massachusetts.Davis Duke, the widow of the late cofounder, told", "The next Biennial should focus on indigenous art and explore how the powers that be are attacking the very notion of the 'other' and what those forces look like. \n\nPolice Commissioner Bill Bratton said that the decision was made after reviewing the case for six months, and that the force is monitoring the situation closely. In a statement, Bratton said: “I have always maintained that art is central to public safety. It does not have to be political. It does not have to be about race. It can be about any of those things that made this tragedy possible.”He added that he hopes the exhibition will draw awareness to the “implications of the work” and encourage people to think about the work in their own terms.“I know that this is an extraordinarily difficult decision for many of our artists, but I believe that this is the best manifestation of what we as a city can do as a city,” Bratton said. “I will continue to engage with and listen to your artists’ voices, and encourage you to think about the work that you create.”\n\n\nThe Israeli government approved a $1.45 billion expansion of the country’s military on Tuesday, expanding the size", "The next Biennial should be a moving image performance by Female-Generation Group. While this will have to be staged in a museum, the upcoming event will be hosted by a third party, the artist-run space FeministaHQ, and will recreate the theme of the festival in a way that closely resembles the original festival. “We’re not going back to the original,” Crystal Borthwick, the founder of FeministHQ, told Artnet. “We’re not trying to push a narrative that isn’t there.”While the biennial will focus on women artists, the exhibition will continue to explore topics such as gender equality and the ways in which art can be used as a platform for social justice.The festival will also introduce a new $50,000 prize, called “Art Challenge,” that will honor any American artist who creates work that addresses the themes of the biennial. The 2019 prize marks the first time it has been awarded since it was instituted by the Feminist Majority Foundation. The award program was established in partnership with the Feminist Majority Foundation, the Women’s March, and the Center for American Women’s Studies at Columbia University.The", "The next Biennial should showcase the work of the most recent class. “The biennial is not an extension of the museum, but a continuation of the museum,” said director John Galloway. “It is an extension of the life of the institution, one that is lived and breathed by everyone who visits it. It is a celebration of the achievements of the biennial’s curators, and it is an extension of the museum’s network. It is an extension of the museum’s mission, and it is an extension of the museum’s legacy.”Galloway added that the museum has been considering hosting a biennial for the last five years. His and the curators’ commitment to the project was exemplified by the institution’s exhibition “Born in the American Dream,” which opened in September 2017. The exhibition featured work by forty artists, including Tim Hutton, Fatoslava Galchenko, Claudia Alberni, Paul Mpagi Sepuya and Masha Alyosha, and Tania Bruguera. \n\n\nThe Museum of Modern Art (MoMA) in New York has received a", "The next Biennial should take place in January 2022 and will be led by Danish director Birgitte Nielsen. A full list of participating artists is as follows: Baer & Stedelius, New York; Baker Gallery, New York; Bajaj Gallery, New York; Bassett-Barré, New York; BJ Steuben, New York; BK Taylor, New York; Bodega, New York; Boudin-Vietnès, New York; Boudin-Vietnès: Berlin, New York; Bicocca Gallery, New York; Bibliothèques International Paris, Paris; Bibliothèques Pétro-Orientales, Paris; and Bibliothèques Rothschild, New York. The next edition will be held at the Fondazione Biennale in Milan, Italy, and will open on October 23. The 2018 exhibition “The Parabola: The Invention of Perspective” (Thurs.) was organized by the French and British artists Bénédice Brigue and Jean-Pierre Brink, and the New York–based curator", "The next Biennial should be held in September 2021. The conference will be hosted by the Norrkoping Museum, the Metamorphose Museum, and the Museum of Modern Art, and will be presented by the Danish curator Becka Haraldsen.\n\n\nThe eight founders of the contemporary art photography company Canon, which was founded in the Netherlands by two industrialists in 1998, have announced their retirement. Eric Bontchev, Louis Bienstock, and Wouter Heijnen, who collectively owned around one-third of the company, have told the New York Times that they have been working on a merger since 2014, but were unable to come to terms with each other. Bontchev said that he and his partners had an agreement with the former director of the photography museum, Margret Aberg, who died in 2002, but that they have since reneged on the agreement.Bontchev said: “We were very close to the Aberg–Hetjens–Chiang formula, and I remember vividly how with great enthusiasm we presented the new digital technology and the recent technological breakthroughs with the Leica M. The partnership with Leica was a life-long project, and I have no doubt that it will continue with the healthy support", "The next Biennial should be presented by Theo van Hulzen, and will be held at the Museo de Arte Contemporáneo de Madrid (MAS), the Museo de Arte de Madrid (MASEL), and the Museo de Arte de Madrid (MASM), respectively. Recently selected for its exhibition “HELMUT III,” it will be presented by the Rauschenberg Foundation in collaboration with the Würtgen Museum Frankfurt and the Kunsthalle Basel.\n\n\nThe Metropolitan Museum of Art and the Walker Art Center in Minneapolis announced today that María Berrío has been appointed as the new director and CEO of the Art Institute of Chicago. Berrío comes to the museum after helming the museum since 2015, when it was still known as the Art Institute of Chicago, and succeeds Larena Gomil, who retired in March.“We’re thrilled to welcome María,” said Mary Ceruti, the museum’s director and chief executive of the Metropolitan. “She is a visionary leader and organizer who brings decades of experience in overseeing a rich museum collection and building an institution at the heart of Chicago’s artistic community", "The next Biennial should be held in the autumn of 2022. The exhibition will be curated by Sinthujan Sandi, whose contemporary practice spans sculpture, installation, performance, and photography, and will be hosted by the National Museum of Art in Bangalore. Its theme, In Motion, will explore motion as the backdrop for a narrative that will ultimately address “the future of humanity”.The 2019 awardees are as follows: IndonesiaBaliCoralindoCocos (Cocos)Raffles (Raffles) (Vivian Byars)Istanbul (Istanbul)Papua New GuineaBali (Papua New Guinea) (Nina Pindell) (Vivian Byars)Bali (Bali) (Nina Pindell) (Nina Pindell) (Nina Pindell) (Nina Pindell)Bali (Bali) (Nina Pindell) (Nina Pindell)Bali (Bali) (Nina Pindell) (Nina Pindell)Bali (Bali) (Nina Pindell) (Nina Pindell)Bali (B", "The next Biennial should take place in 2020, and the first in 2021. \n Allan H. Lee, the director of the Carnegie Museum of Art and the Los Angeles County Museum of Art, said: “When we designed the Museum of Contemporary Art (LA MoCA), we knew that the future of the institution rested with our talent. . . . We’ve been working for more than a decade to create an environment in which our artists could thrive and raise their voices and create for our audience. We’ve had countless conversations about how we’re going to enhance the Museum’s collection and our public image. I’m thrilled that we did it.”\n\n\nMIDWESTAKTSKALA, Russia (AP) — When the chief curator of the newly renovated Museums in Moscow and Saint Petersburg, Alexander Malofeev, announced that the institution would not be completed by the end of 2020, he said that the cancellation was a result of the lack of funding from the local and international partners. The announcement was made on March 13, just days after the local government approved a $50,000 grant from the State Fund for Cities and Regional Development (SBDC), which aims", "The next Biennial should be held at the newly reconfigured central London location, at the Museum of London. The reinstallation of the museum—which is currently undergoing a $50 million overhaul—will help the museum recover from the coronavirus.In an email to Tate board member Maria Bustill, the museum’s director Maria Balshaw, and director Katja Wiles, the institution’s artistic director, said: “We felt it was very important to continue to have the space for biennials in Northern Ireland, particularly since the exhibition programme in the museum has been very strong.”The exhibition will open with Merry the Witch, a new presentation of her work Merry Mather: The Witch in Winter. The show will then play a central role in the museum’s reopening, with two collections of the artist’s work and a new project by artist Gerry B. Mullany. The spring 2020 exhibition will then focus on the Church of the Flying Spaghetti Monster, an image-rich sculpture by the Italian artist Claudio Città.The festival will conclude with a biennial of work by the Belgian artist Jan-ÖNie van Aken against the backdrop of the", "The next Biennial should focus on a “new kind of art museum,” Landa told Artforum. “I’m sure [this] is an enormous challenge and a very long road ahead, but it’s a challenge that we must take. I hope that the fans and the organizers of the next Biennial will embrace it and trust in the creative process.”Museums and cultural centers across the United States have been struggling since the COP21 anti-terrorism conventions were signed and the U.S. Congress passed a $1 trillion emergency spending bill in March. In March, the U.S. House of Representatives passed a $1.2 trillion emergency aid bill for cultural institutions; the Senate is expected to pass a $1.3 trillion funding bill this week. The political crisis worsened when a federal judge in New York City temporarily blocked the government’s plans to begin repurposing millions of pieces of historic cultural artifacts for civilian purposes, leaving thousands of cultural artifacts in storage.The next iteration of the Biennial will take place in 2023, and the first public artworks will be a 30,000-piece installation, titled “Theater of Operations,” that will debut in February", "The next Biennial should take place in 2021. “We have devoted years and years to build a studio or a space to present the research and the work of scholars from South Asia, from the Middle East and Central Asia,” said Benomir Bhalla, managing director of the Institute of South Asian Studies, Mumbai. “The new exhibition will showcase their work and will provide a forum for their voices to be heard. The Indian museum has a long history of supporting artists and their work and I am confident that this will be a turning point in the museum’s history.”He added: “I am excited that the new exhibition will bring together this diverse group of artists. Biennials are at the core of India’s development story and their work is a reflection of our cultural heartlands.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Elizabeth Fallows as its next director. She succeeds Eden Gilman, who retired in March 2019 after a decade with the institution. Fallows comes to the MFA from the Metropolitan Museum of Art, where she has served as chief curator since 2015. Previously, she served as the museum’s deputy director for collections and exhibitions and as", "The next Biennial should be held at the Centre d'études de art et de science in Geneva in December 2020. The development of the Philadelphia Museum of Art (PMA) as a hub for contemporary art and design, which will also include exhibitions, events, and educational programs, was recently completed. The museum was awarded a $350,000 donation from the Philadelphia Foundation for the Arts (PFA).  The museum also received a $170,000 grant from the Penny Project, an organization helmed by Carol Sherman, a trustee of the PFA.  The PFA has placed $1.8 million toward the development of its future exhibition, which will be on the first floor of the Francis Scott Key, in January 2021. \n\n\nSeptember 20, 2019: The Solomon R. Guggenheim Museum in New York has announced that it has received a $100,000 donation from artists and collectors Kristin and Peter Latimer. The donation was made in support of the museum’s exhibition “What Is Art?,” which is currently on view until November 16. The show, which examines the relationship between art and technology, examines the history of art through the lens", "The next Biennial should be held sometime in the first half of 2020. The organizers are working to create a schedule that will allow the festival to run concurrently with the upcoming Art Basel Hong Kong fair, which is slated to take place in the second half of the year.\n\n\nThe Carnegie Museum of Art in Pittsburgh has announced that it is reopening, following a $400 million expansion in the museum’s current location. The museum will also begin welcoming visitors in 2020 and will start welcoming the public by the end of the year.The renovations, which were funded entirely by the Carnegie Foundation, include the addition of the Carnegie Arts Center, the Carnegie Science Center, and the Carnegie Museum of Art. The new buildings were designed by the firm Gensler and are situated on the grounds of the museum, which is currently undergoing a $350 million facelift and renovation. The renovation will also include the construction of a new public gathering space and the renovation of the existing building’s gardens and gallery. The renovations will bring the Carnegie Museum of Art—which currently houses four buildings: the Carnegie Science Center; the Carnegie Theater; the Carnegie Museum of Art; and the Carnegie Opera House—to the new digs. The building of the museum", "The next Biennial should be on the history of painting in China, whose influence has spread to every continent, and should include not only Chinese artists, but also French, German, Italian, and Japanese—more than 200 artists were invited to China in 2019. \n\n\nThe DePaul University Art Museum is continuing to recover from the devastating fire that broke out in a building’s basement on January 5. The fire, which was extinguished by the campus’s fire department, was extinguished by a sprinkler system installed by the university. The fire was extinguished without the help of any nonessential personnel, and the building, which is currently undergoing a $250,000 expansion, is fully operational.\n\nThe fire, which was extinguished by the campus’s fire department, was extinguished by a sprinkler system installed by the university. The fire was extinguished without the help of any nonessential personnel, and the building, which is currently undergoing a $250,000 expansion, is fully operational. The fire that broke out in a building’s basement on January 5 is still being contained. The building’s electrical system is functioning and the campus is treating the incident as if it were a power outage. However, the fire seems to have spread", "The next Biennial should be held in 2022. The date of the last one, which took place in 2017, is also up for grabs.\n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles has announced the launch of the $1.4 billion David-and-Goliath exhibition, “David’s Tomb,” which will be oriented around the artist’s monumental monument to Goliath, the giant who vanquished the African American community in a massive battle in the town of Ephrata, New York, in 1899. The show will feature live works by seventy-five artists, including Terrence Malick, Jenny Holzer, Alighiero Modigliani, and Joseph-Marie Pérez-Guerrero.The show’s artistic director, Marc Glimcher, said: “I’m honored to be joining the David-and-Goliath team, as we work to create a work that represents Goliath’s legacy to the world. As the first Mexican American to set foot in the United States, I’m thrilled to be a part of this exhibition, which will engage with the artist’s legacy and celebrate his legacy as a pioneer and visionary", "The next Biennial should take place in the summer of 2021, at the same location as Art Basel Hong Kong and Art Shanghai, and there will be live music, workshops, screenings, and more.\n\n\nNew York–based artist Jonathan Albright has won the 2019 Margaret Sanger Arts Award, which is meant to honor an American artist who has made significant contributions to American art throughout the history of the United States. The biennial will feature works by seventy-three artists and will be curated by Zadie Smith, who is also the curator of the upcoming exhibition “The Process of Art: Micro-Histories” at the Whitney Museum of American Art.The Margaret Sanger Biennial will showcase twenty-eight works by twenty-seven artists selected from a shortlist that includes Andy Warhol, Frank Stella, Robert Irwin, Joan Miró, Mark Rothko, Hildegarde Duane, and Lisa Loeb. The winner of the prize will be announced in the fall. “Jonathan Albright’s work is sublimely grounded and often addresses a specific moment in American art history,” Smith said in a statement. “In exploring the multilayered, interconnecting structures and processes of American art,", "The next Biennial should be held in 2020.In a letter published by the British literary journal the Literary Guerilla, Markus Schäfer, director of the Frankfurt Gallery, asked: \"Do we want to see a resurgence in contemporary art at a time when its history is being re-written so that it may trace its historical origins to that of the twentieth century, or do we want to avoid a repeat of the current situation?” Schäfer, whose art has been exhibited at the Bouygues Museum in Paris, the Museum d’Arles, and the Metropolitan Museum of Art, will be the first to decide, with the Organization for Fine Arts (OFA), Frankfurt, the Kunsthalle Neue Galerie, and the Potsdamer Körper Kunstverein, with the rest of the Finnish Regional Office, in May.\n\n\nThe Museum of Contemporary Art (MoCA) in Chicago announced today that it is working with the Chicago-based design studio Diller Scofidio + Renfro + and the Chicago-based nonprofit group Creative Capital on the renovation of its critically acclaimed, yet-unbuilt, eighth-floor theater. The project, which", "The next Biennial should take place in 2019.The program will be a collaboration between the museum and the University Research Centre in the Arts (URCA) in Stockholm, with the support of artist Kjetilander and the artist-run organization Artbienn . The event will include biennial presentations by artists such as Marcel Prouvé, Hildegarde Duane, Anna Simpson, and Louise Nevelson; visits to selected works by the six most recent winners of the prestigious Artist-in-Residence Award; and the introduction of a new program of exhibitions, residencies, lectures, workshops, and performances.The award winners will receive a total of $100,000. The first prize was given last year by Tierney Raschek of the Swiss Federal Institute for Art and the Museum of Fine Arts (BAM). The prize jury praised the work of the three finalists, Marcel Prouvé, Hildegarde Duane, and Anna Simpson, for their exhibitions at the institution: “The 1950 exhibition ‘Les Flammes?’ inaugurated the Biennial, and demonstrated the exhibition’s ability to move beyond the subtext of the artist’s medium. The 1962 exhibition ‘Les Vales", "The next Biennial should aim to improve the listening experience by employing new technologies and new techniques, and should focus on issues relating to contemporary life and contemporary art.\n\nThe twenty-fifth Biennial will be held in the French city of Lyon in April 2020. The eighth and last will be held in New York in March 2024. The 2020 editions will be presented by the French and the British galleries Sursons & Bouillon, and the French Ministry of Culture.\n\n\nThe Fondazione Prada, the Italian luxury retailer known for its high-quality, handmade goods, is planning to open a new Italian outpost in the United States. The brand will hold the inaugural Milan show at Prada Los Angeles, which is slated to open in January 2021, in March 2021 at Fondazione Prada Milan, and will introduce its first new product in Italy since 1959, the Prada Camino, in March 2022 at Fondazione Prada Milan.The new Fondazione Prada will be located in the former headquarters of the Italian luxury retailer Pirelli, in the North Hollywood neighborhood of Los Angeles, and will create approximately 2,400 jobs. The company is also developing new ways to engage with its Italian customers, including an", "The next Biennial should be held in the autumn of 2025, and the next will be held in the spring of 2021.The Biennials were born out of the conceptualization of a new space for the exploration of art, made possible through the experimental, high-tech equipment that is now commonly used in museum and research settings. The exhibition will incorporate a new collection of work by artists working in an experimental and international context, adding to the collection and its extensive collection of works by the nineteenth-century American artist Constantin Brancusi.Brancusi’s work, which has been featured in multiple biennials, is included in the Black Museum’s exhibition “The Eclectic Life” (2019), and “Lucy of the Nile” (2017) were among the biennial’s first presentations. The twentieth edition of the Biennial will open on October 23 and run through December 18, 2020.\n\n\nThe Barcelona Art Biennials (BBA) has announced that it now plans to open a new collaborative exhibition space in Barcelona in 2020. The initiative, which was introduced in 2017, was founded by Lea Teegarden, María Berrada, and Adrienne Edwards, and", "The next Biennial should be in Berlin in 2022. The exhibition will also take place in Paris, in Stuttgart, and in Künstlerhaus in Cologne.\n\n\nThe Institute of Contemporary Arts (ICA) in London is seeking a new director to lead the institution for the next four years. An open call for a replacement will be held on Tuesday, April 2, at 8 AM and will be followed by a general meeting of the board of directors at 1 PM on April 9. The search team comprises Fiona Richards, director of the Contemporary Arts Centre, London; Zitta Brewer, director of the Metropolitan Museum of Art, New York; and designer/art historian Jude Collins.“We are extremely excited to welcome the new director of RIAC, Jodi, to our team,” said ICA director Zed Seshee. “A transformative curator, Jodi will be crucial to the future of RIAC and the Institute, and will engage with the museum’s collection and programmatic ideas in a way that our staff and ICA colleagues cannot replicate.”The appointment was made via a special initiative funded by the RIAC Foundation. The $10 million fund is dedicated to financing the founding of", "The next Biennial should be held in the spring of 2021. “We would like to thank the cities of Bergen and Nyon for their cooperation,” said Huang. “As a result, we are able to present the next Biennial, the  Luxury Exhibition, in the spring of 2021.”\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has awarded twenty-five artists $50,000 grants to make new artworks in support of the New York City Breast Cancer Foundation (BCBF), the New York City Department of Aging, and the Metropolitan Museum of Art Children’s Museum. Participating artists include Ralph Moore, Ingrid Ruth B. Davis, and Wangechi Mutu.“The Met has long been one of the nation’s leading cultural institutions dedicated to the arts and we are proud to have contributed to the fight against breast cancer through grants,” said Smith. “The Metropolitan Museum of Art is a marvelous institution, and for more than forty years, has been an important cultural anchor for women in the greater New York City region. We are grateful to Smith and her colleagues for their work in securing these extraordinary artists to share", "The next Biennial should be held at the Museum of Fine Arts and Contemporary Art in San Francisco, California, in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of more than four hundred photographs by Japanese American artist Hayao Miyazaki, the founder of Studio Ghibli, from a nineteenth-century collector. The donation, made by businessman and collector Arthur L. Salomon, comes a decade after the institution acquired the photographs from the artist, who passed away in 1994.Salomon donated the works to the museum in 2002.In a statement, Salomon described the gift as one of many in his collection that represent a significant point of departure from the Ghibli aesthetic, which he says was centered around polychromatic compositions and polychromatic compositions around color. The works are currently on display in the museum’s “A Problem of Comparison,” a major exhibition on photography at the institution, which will open on November 5. “The collection also includes works that have been previously exhibited, but never entered public view, but have recently received significant attention,” said Salomon. “These photographs are a milestone in extending the exhibition’s visual arts programming beyond", "The next Biennial should be announced in the autumn, with the inaugural exhibition to take place at the Museum of Contemporary Art (MoCA) in Los Angeles in the spring. The Grand Prize winner for the prize of the most exciting exhibition is equally as important as the selection, and will be announced at a later date. The 2019 prize is based on an award of $1.9 million from the Robert Rauschenberg Foundation. The prizes include a special exhibition of work by a select group of artists and will be announced soon. The group of six finalists consists of Yoko Ono, Julie Ruinberg, Maren Darr, Michael Phillips, John Paul Jones, and George Pimentel.\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of ninety-one works by American artist and educator Richard Avedon. The gift was made by the Robert Rauschenberg Foundation in honor of the occasion of the artist’s ninety-fifth birthday. The museum currently has 129 works in its collection, which is known as the Avedon Collection. Richard Avedon, who was born in Philadelphia in 1940, has been an avid collector since the 1950s. His works were included in major exhibitions at both", "The next Biennial should take place sometime in 2022.\n\n\nMore than 1,500 architects, designers, and technicians have signed an open letter inviting the Royal Academy of Arts (RA) to cancel a 2019 edition of its London triennial, “London Architecture Biennial,” citing the coronavirus and its threat to “institutionalize cultural production in the UK.”The letter, which was released by the Royal Academy of Arts (RA), the Royal Institute of British Architects (RIBA), and the firm Witherspoon & White, argues that the coronavirus has spread to every country in the world, and that the failure to adequately control the virus “seems inevitable” and “indefensible.”“We are writing to you today to call for a complete and urgent reassessment of the political, legal, economic, and social conditions that would allow us to accept the terms of this year’s biennial,” reads the letter, which was also first published by the Art Newspaper. “We are writing to you to urge you to take immediate and collective action to protect the health and wellbeing of your family and community, as we face a global epidemic.”The open", "The next Biennial should be held in 2021, and it will be an open-to-the public event.The 2017 festival, which was organized by the New Museum and the Brooklyn Museum, featured work by over seventy artists, including Francis Alÿs, Hélène Lyng, Louise Bourgeois, Evelyn Rich, Anna Wolfgang, Robert Irwin, William James Wallace, and George Holloway. The 2019 edition was led by the Los Angeles–based curator Adrienne Laverrière.“The exhibition of paintings by Edward Thomas is a great opportunity for us to recommence the work that Ellen and I began together more than forty years ago,” said Leslie I. Abraham, who was appointed curator of the exhibition in 2015, has served as director of the exhibition since its inception. The two-year biennial will be the first time the biennial will be held outdoors in Los Angeles since 1992. The exhibition will feature paintings by seventy-four artists, including Karl Lagerfeldt, Willy Leyva, Mark Rothko, and Leo Szilvocka, as well as works by American and European artists, including Ed Moses, David Oren, and Ermanno Larbi. The full list of", "The next Biennial should be held in 2022 and the eleventh in 2024. The exhibition will also undergo a major renovation, which will include the opening of a new exhibition space in the city, the renovation of the Biennial Museum and the establishment of a new exhibition building. The architect will be the mayor of the capital of the Russian Federation, Vladimir Putin, who has been assassinated a number of times and was replaced by Vladimir Putin himself in 2015.The architect will also be tasked with updating the existing building, which houses the biennial, the exhibition space and the museum. The renovation project will involve the building of a new exhibition space, a renovation of the museum, and the reopening of two other buildings. The exhibition space will also receive a new building and the institution will remain open 365 days a year.\n\n\nPresident Donald Trump has selected Georgia-born, American-based architect, designer, and educator Alexander Habib as the new secretary of state. The appointment comes after Trump's inauguration in January and follows the footsteps of President Barack Obama, who appointed former businessman and philanthropist Andrew Cuomo as secretary of state. Habib is known as an innovator and practitioner who is a prolific collaborator who has designed for companies including American Express, Apple, and Nike", "The next Biennial should be in 2020. It will then return to the Netherlands, where it will begin hosting the biennial in 2022.The next edition of the exhibition will take place at the Museum of Modern Art (MoMA) in New York from March 15 to March 18, 2020 and will feature fifty-nine works of art, which were selected by a jury comprising Alice B. Quayt, director of the museum; Omer A. El-Khoury, curator of modernist and modern art at the Saatchi Gallery, New York; and Simon Lee, a curator and art historian.The jury, which comprised artists such as Sean Kelly, Steve Johnson, and Rirkrit Tiravanija, also comprised artists such as Jay‐Z and Kanye West, as well as collectors Reem Akram, who owns a collection of works by Yo-Yo Ma, and Rufus Suttie. The winner of the $50,000 prize will be announced in July.The 2019 prize ceremony was held at the Contemporary Arts Museum St. Louis. The full list of winners is as follows:Best New American Art Prize Awarded to Paul GauguinBeijing Art Museum Awarded to Michael PowellThe Beaux-Arts Museum of", "The next Biennial should be held in 2021, the New York Times reports. The date was chosen as it represents the anniversary of the agreement between the two countries. As part of the agreement, the US will send twenty-four biennial artists to the Philippines, and the two countries will each create twelve pavilions for the exhibition.The agreement was signed in January of 2020, and the first exhibition, “Dorothy and Ozymandias” (2019), was held in October. The second, “Lunch with the Doctor” (2019), was held in May, and the third, “Spotlight: Contemporary Asian Art” (2019), was held in October.A bidding war between nine artists who were nominated by Filipinos was held on the theme, which was ultimately selected by three votes, with the winning proposal receiving thirteen votes. The winning artist’s proposal was then submitted to President Rodrigo Duterte, who signed the bill, which opened up the Philippine pavilion to the public for the first time, and it was ratified by Duterte on August 4.\n\n\nRepresentatives of the National Museum of Art (Mana Contemporary) in Washington, DC, announced that they have formed a $1 million fund", "The next Biennial should focus on: “How do we begin to live together in harmony with the environment?” The exhibition will also consider the “degree of disruption caused by climate change” and the “constant shifting of the planet’s orbit around the sun. The exhibition will be inspired by the 1955 film “Atlas” about an astronaut stranded on an ice planet. The first work in the new series will be L'Alma, a nod to the Italian artist Stefano Motti, who pioneered the use of the moon and a constellation of stars in his sculptures. The exhibition will conclude with a selection of Motti’s works from the Künstlerhaus in Munich.Speaking about L'Alma, which he created in 1962 and the Künstlerhaus, the Swiss artist said: “I began with a large wooden box and an ice cube that I could set in the sky. I filled the box with water and put it in the sky. Then I placed a wooden waterfall on top of a wooden continent. I decided to place a wooden tree on the continent in order to experience the atmosphere of the tree. I created the constellation Motti’s star L", "The next Biennial should be held at the Fondazione Prada (in Venice) in 2021. Following the opening of the museum in Paris, the institution will also open in Kassel, Ghent, Berlin, and Newcastle-upon-Tyne. “The Fondazione Prada is a big event in Italy, the world, and Baltec, and this show will be a great opportunity to present the work of the Fondazione Prada to the world,” Luca Catellani, the Fondazione Prada’s director, said. The upcoming exhibition will mark the first time the museum has ever staged a collaborative exhibition with an Italian artist. Andrea Marzio, the Fondazione Prada’s artistic director, added: “The question of how and why the work of an Italian artist seems so distant in this part of the world is not an easy one for us. Italy is a homeland of Renzo Piano, Guggenheim, Guggenheim II, and Guggenheim III, and it is a homeland that is rich in the history of Italian art, including the work of Leonardo da Vinci. So the exhibition should not be about", "The next Biennial should be held in 2021. The park, which is located in the city of Almaty, Kazakhstan, and is funded by the Kazakhstan Ministry of Culture and Science, has been working to renovate the museum since 2014. The project, which involved the construction of a new building and the restoration of the existing structure, began in the second half of 2015, but the exhibition was forced to move to 2020, when the museum was forced to cancel a number of events because of the coronavirus.The biennial will be hosted by the Art History Museum in Paris, the Museum of Fine Arts at the University of Pennsylvania, and the Museum of Modern Art, in New York. The winners of the $10,000 Biennial Art Prize will be announced in the autumn of 2020.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has released guidelines for the building and display of a new Shakespeare in the Park sculpture, titled Julieta, which will sit in the Bronx, and is currently undergoing a $110 million expansion. The installation will draw from the playwright’s own words and will feature a representation of Juliet as well as images of her and two other New York–based women’s organizations", "The next Biennial should be held at least every other year and will focus on themes of biennialism and the body, with a particular focus on the contemporary body. The art that will be presented will include a range of subjects that are quite familiar to students of the museum (including art and medicine) and will be made in a way that engages them not only visually, but also philosophically. The program will be divided into four parts. Part I will comprise a selection of work that has been exhibited in the current Biennial. Part II will consist of a selection of works that will be on view for the first time in the flesh. Part III will be a presentation of a work that is currently on display in the Biennial’s new venue, a biennial exhibition, and a presentation of a biennial retrospective. Part IV will consist of a selection of works that have never been presented in the museum before and will continue to be displayed in the museum as part of the Biennial program.“The Biennial is a central element of the museum’s mission and we are excited to open it up for students, art lovers, and the public to see the work of our artists,” said Jaya Alvarez, director of the", "The next Biennial should be held in September 2019.  Below is a list of the ten most recently scheduled events that will take place during the exhibition, which will be held in the Markovich Gallery in New York for the next twenty-four months, as well as a timeline of each of the events. From April 7–April 16, 2020The prestigious Biennial of Modern Art (BMMA) at the Museum of Modern Art in New York will once again host the first exhibition of work by artists born in the United States. The exhibition will be curated by artist-in-residence Mary Anne Glynn, who is currently the curator of contemporary art at the Santa Monica Museum of Art, and will focus on the intellectual and emotional potential of contemporary art, including exhibitions, publications, and performances.“BMMA is more than ever an important and vibrant platform for the artistic exploration of American art,” said Mary Anne Glynn. Glynn will serve as the curator of this year’s exhibition, “NIRIN,” and will co-curate with artist and scholar Xandra Ibarra. In the premiere exhibition, titled “The Art of Contradictions,” which will open on March", "The next Biennial should be held in 2020. “After this decade, our exhibition program will not be able to return to the level of previous years,” said the president. “We will have to make further investments in art, new exhibitions, presentations, workshops, lectures and tours, and we must continue to push the boundaries of what is possible in art.”\n\n\nThe Fondazione Prada in Milan, Italy, is planning to move the exhibition from its current location in the Prada to the university city of Venezia. Designed by Stefano Domenicali and Peter Andriano, the exhibition, titled “She-Wolf,” will travel to the Italian city from the Venice Biennale in 2020.The project, which was announced in April 2018, will involve the rebuilding of an existing public space in the Fondazione Prada, which is currently undergoing a $1.3 million renovation, and the reimagining of the gallery’s main building, which is currently undergoing a $5 million overhaul. The project will also involve the construction of an exhibition hall, a collaboration space, and new galleries, which will be located at the corner of Via Livorno and Potenza.", "The next Biennial should take place in 2021.\n\n\nThe Maritime Museum in the City of New York has appointed Maximilian Goldberg as its next executive director. Goldberg joined the museum in 2016 as director of development. He succeeds Steven H. Brown, who retired after eighteen years of leading the institution.“Maximilian’s background in art history and his vision for the future of the museum make him ideally qualified to lead the Maritime Museum through this new moment,” said Maritime director Loring Randolph. “We are grateful for his service to the museum and wish him every success in his new role.”Commenting on his appointment, Goldberg said: “I’m excited to be bringing my experience, knowledge, and passion to bear in the design and development of the Maritime Museum. I’ve been following the museum for twenty years and will continue to be an loyal patron as it continues to grow and evolve as a cultural destination for New Yorkers and visitors from around the world.”\n\n\nThe National Gallery of Scotland has announced that it will begin a process of downsizing its budget by $1.2 billion in the next fiscal year, in an attempt to reduce expenses through f", "The next Biennial should open in 2020. \n\n\nThe X-Art Foundation, which was founded by American artist Joseph Beuys to promote the work of young emerging artists in the United States, announced that it will suspend its annual exhibition, “Slow and Steady,” in March 2019. The show will remain on view until December 20, 2020.“We are thrilled to hear from the many artists who have expressed interest in participating in our next spring exhibition,” said X-Art Foundation president and CEO Mark D. Weinberg. “This is a time of unprecedented change for art, and we are eager to provide opportunities for the working group to address the creative challenges and challenges posed by climate change.”Since the show’s inception, it has raised more than $100,000 for the work community through its “Save the Art Fund,” a program that supports artists who have experienced financial hardship owing to the coronavirus pandemic. The fund has previously extended support to Jonathan Baldock, Kim Gordon, and Maren Pedersen, among others, and is currently accepting applications for its 2020–21 cycle.\n\n\nThe Institute for Contemporary Art (ICA) in Paris is facing a backlash over the", "The next Biennial should focus on an exploration of the ways that art and art history interact to shape our cognitive, emotional, and social climate. “It’ll be a great shame if we don’t have a new exhibition this summer,” said Simon Fox, chair of the board of trustees of the Biennale de Triomphe and chair of the official selection panel for the 2020 edition.\n\n\nAccording to the Art Newspaper, the Swiss newspaper affiliated with the Swiss Federal Institute of Art, the Swiss Ministry of Culture has issued an order for the immediate closing of the Art Archives at the Museum Bern. The institution is currently closed as a result of the coronavirus and will remain closed until April 26 at the earliest. According to the Swiss Federal Office for Culture, Culture, and Sport (BAC), the closure of the archives is a result of the “adherence to the international recommendations and the recent developments.” The BAC further states that the installation of new exhibitions and events by newly selected artists, an extensive renovation of the museum, and a new collection management system are all being considered as the possible causes of the shuttered museum. The BAC has ordered the immediate restoration of the museum�", "The next Biennial should be held in 2021. The 2020 edition will be held at the Noguchi Museum in New York. The exhibition will focus on the life and works of Henri Rousseau, and will include the work of seventy-three artists, including Wangechi Mutu, Nkanga Ndzube, and Khoza Ndzube, who were among the first to be included in the exhibition.The 2021 edition of the Biennial will begin with a special exhibition of work by half a dozen artists, including Ed Mazuyama, Zanda Jomo, Leonardo Di Caprio, and Keiko Kano, and will run through March 8. The exhibition will include works by twenty-six artists from Africa, twelve from South America, and two from Asia. In addition, the 2020 edition will include new works by artists such as Alia Farak, Shimon Guggenheim, and Looping Ndzube\u0097all of whom are represented by the same venue on the 2019 edition\u0097the biennial is currently accepting submissions.\n\n\nThe Miami Beach Art Museum (MBI) has received a donation of $250,000 for the construction of its new building on", "The next Biennial should take place in Los Angeles in 2022. The event will be hosted simultaneously at Rockefeller Center and the California Academy of Sciences. The theme will be “The Future of Life on Earth: From Life to Art.” The festival will be held in conjunction with the upcoming exhibition “Art in Motion,” curated by Ruba Martinez-Baca and curated by Caroline Lee. The exhibition will run from March 13 to March 21, 2020 and will be on view until September 3, 2020. The first Art in Motion will take place at Rockefeller Center in September 2020. The exhibition will move to the Museum of Modern Art in New York in 2021. \n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that artist and educator Gershon Kavala, a socialist and communist icon who promoted an underground, Marxist-Leninist, communist-oriented art and culture in his underground studio, the Soviet Union's Art and Culture Complex, has been selected as the next United States president. Kavala, who died last month at age seventy-nine, was a staunch supporter of the Soviet Union from the very beginning and waged a successful campaign to have the UCC renamed in his honor. The campaign was bolstered", "The next Biennial should be held at a location that is accessible to the general public, has recently been renovated, and receives regular and sustained support from the BIennale. For the new project, the festival will invite artists and designers to create a 'living work' that has not only a history, but also a future.The project will be organized in three phases: first, the exhibition will be a combination of performance and installation; second, the exhibition will include a biennial exhibition of work by various artists; and third, the exhibition will be a combination of a painting and a sculpture. In the first phase, the exhibit will focus on the exhibition of the work by the artist Anne-Marie Olszma, who will lead an exhibition of works by the artists Hélio Oiticica, Maria de los Reyes, and Kim Kuk. The second phase will be a celebration of the seventy-third Biennial of the Arts, which will draw from the Biennale’s collection and present a selection of work by artists who have been selected by the BIennale’s board of directors. The third phase will consist of a colloquium about the exhibition and design with the artist and curator for the artist Marciano L", "The next Biennial should be held in 2020. The decision was made after the organisers asked the city to consider the institution’s request for a new exhibition dedicated to the themes “legitimate history,” “legitimate heritage,” “color,” and “moral courage.”The report did not address whether the city should resume construction of the Suez Canal, which would significantly increase traffic congestion and worsen pollution, nor did it address the possibility of reopening the artificial island in the Bay of Bengal—a question that has been raised by many in India because of its controversial reopening of the only remaining part of the ancient Silk Road.\n\n\nThe Pérez Art Museum Miami (PAMM) plans to break ground in the coming weeks on plans to open a new twenty-two-thousand-square-foot museum in the city. The museum, which will be built in a former auto body shop on the ground floor of the historic Ponce de Leon, will be a destination for art lovers from across South Florida and the greater metropolitan area. The Pérez Art Museum Miami will be led by Edward Molina, the founder of the luxury construction and real estate company Krause & Poe, and will", "The next Biennial should take place in 2021. The news comes days after the FIP Congress, a biennial of North American paintings organized by British contemporary artist Peter Sellars, decided to postpone its 2020 edition. While its organizers stated that it would continue with its planned October date, the coming year will see the fiftieth edition of the Biennial of Modern Art, staged at the New Museum in New York, move to March.“The entire team at Frieze is looking forward to continuing to present award-winning exhibitions and programs of the greatest international quality alongside a strong and dedicated editorial team focused on the art of the present, which is what we are all here to support,” said Frieze director Monica Knebar.The entire team at Frieze is looking forward to continuing to present award-winning exhibitions and programs of the greatest international quality alongside a strong and dedicated editorial team focused on the art of the present, which is what we are all here to support. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has appointed Leslie Siteman as the next director of the Metropolitan Museum of Art. Siteman will assume her responsibilities on August 29.“Her new role will support the Met’s mission to create", "The next Biennial should take place in 2019. The event will feature the work of seventy-three artists, whose works will be presented by artists from twenty-four countries and territories. The artists chosen for the event are Nick Cave, László Gurría, Cara Hoffman, Nora McKee, Pierre Olig, Magnus Rinn, Willem de Kooning, and Hui Li.\n\n\nThe Dominican Republic has announced that it will no longer receive foreign aid from the United States in an attempt to protect the independence of the country’s cultural institutions. The decision was made after the White House threatened to withhold funds to the government if it did not abandon its pledge to assist the United States in its crackdown on undocumented immigrants.The move has forced a change of plans for many in the country’s arts and culture sector. According to APA, the Art Newspaper, the Dominican Republic still expects to receive some $7.5 million from the US this year. However, the amount has decreased by twenty-nine percent since President Carl Mosel, the head of the country’s cultural authority, said last month that he would only give the government $5.5 million this year. “", "The next Biennial should be held in 2020, and the third one in 2021, naturally. The time frame for new works is also flexible. John Berger, director of the Museum of Contemporary Art (MoCA), Los Angeles, and art historian and curator John Akomfrah, who has curated numerous exhibitions, including the twentieth-century retrospective Art of Life: Andropov, 2018, and the twenty-fifth-century retrospective The Imaginarium of Prada, 2018, said that the biennial may move forward as long as the circumstances permit.The American Alliance of Museums (AAM), a multidisciplinary organization made up of more than sixty American arts professionals, including Walter White, Bob and Alice Wilshire, Rosa Barba, and Bruce Baillie, is also working with the government and localities to help biennials prepare for the event. The organization will present workshops, symposia, and other programming that reflect on the themes of the biennial. For the workshop “The Architecture of Meaning,” participants will create both abstract assemblages and performative works.” The exhibition “Unfinished Business: Art and the Fall of the Third Reich” will examine", "The next Biennial should present a selection of works for the first time and will include a selection of work by the artist’s two main successors, Sohrab Mohebbi and Shimon Gamliel. “I’m delighted that we will be able to return to the site at some point in the future to commemorate the legacy of the great modernist,” said Witten.\n\n\nThe twentieth edition of the Fortieth Los Angeles Biennial, which kicked off on February 22 and runs through March 11, has revealed new pre-registration options for its February 28 edition. According to organizers, the event will now offer free admission for children under thirteen years old through March 31.The February edition featured work by fifty-five artists from thirty-six countries and thirty-three cities across the United States. The first leg of the February 28 edition will head to the Los Angeles County Museum of Art (LACMA), where it will close for a three-week refurbishment and reopen to the public on Saturday, March 8.\n\n\nThe eleventh edition of the Metropolitan Museum of Art’s Mid-Atlantic Regional Sculpture Show, which features works by seventy-nine artists, has announced its April 28 opening", "The next Biennial should be held in the spring of 2020. If all goes to plan, the next edition will take place at the Istituto Italiana di Sommunale, Roma, Italy, in April 2021. This will mark the fifth edition in the city of the Italian Renaissance.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Benjamin K. Bernatz as its inaugural director. He succeeds Michael L. Kullman, who was hired as the museum’s chief curator of contemporary art last year, and will assume his responsibilities on January 21, 2021.“This is a new chapter for MoMA in its twenty-six-year history, and I’m thrilled to have been selected to lead MoMA through this challenging and exciting new chapter,” Bernatz said in a statement. “I’m looking forward to deepening the museum’s relationship with our audiences and communities by engaging with the local, national, and international art movements, by bringing art from our collection to life, by supporting research programs that are oriented around artists’ practices, and by connecting with our audiences through our online spaces.”Bernatz previously served as curator at large for the Annie and", "The next Biennial should be held in 2020.\n\n\nThe Institut für Art und Geschichte (Institute for Contemporary Art) Frankfurt (ICA) has announced that it will host the twentieth edition of its Berlin Biennial in 2020. It will take place at the Institut für Entwicklung (Institut für Entwicklung), the same building as the Museum der Moderne Stuttgart, the Staatliche Kunststiftung, and the Haus der Kunst, among other museums.The Institute für Art und Geschichte (Institute for Contemporary Art) Frankfurt was founded in 1958 by Carl September, a West German collector who had relocated to Paris. In 1965, founder Herbert Szeemann asked the collector to create a new biennial. The initiative was borne out of a desire to return the German city to its roots, conceived in the late nineteenth century, which had largely been lost to Western Europe.The inaugural edition, titled 'Deutsche Überschreibung (Modernity and Appearance), was held at the Institute für Art der Moderne Stuttgart from 1996 to 1999. The exhibition received critical acclaim for its exploration of the", "The next Biennial should aim to present new works by the artists who have been excluded from previous editions. The festival will open in November 2020. \n\nAfter an interim partnership between the Royal Academy of Arts (RA) and Tate Britain was cancelled due to Covid-19, the Tate’s board of trustees declared that it will not renew the museum’s contract until the corporation “reforms its relationship with the academy in line with changing social and cultural conditions,” reports the Art Newspaper.Tate, which admitted that it has a twenty-two percent drop in visitor numbers each year due to the novel coronavirus, said that it will work with the Royal Academy of Arts to “strengthen the relationship between the two organisations and to better reflect the diverse cultural and social histories of England and Wales.”The board’s decision follows a meeting with the academy’s board of trustees on March 3, when the Royal Academy’s board president, Simon Bailey, called for a “sustainable partnership.” The proposals were made in a letter dated March 3 and signed by Richard Whittlesey, the academy’s former director of contemporary art, and David Rizk,", "The next Biennial should be held in 2020. “The future of the museum is at stake,” said Charles C. Bickel, the chair of the board of trustees. “The board’s commitment to advancing the museum’s mission has never wavered. We are still taking our time, but we will be a museum, and a Biennial, that is focused on the collection of the past, and on the future, and on the influence of art on society.”\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of twenty-six works by Clement Greenberg, a German immigrant who was one of the first collectors to visit the institution in the United States in the 1940s. The gift includes works by artists such as Kris Kristofferson, Kurt Vonnegut, and Ed Ruscha, as well as eight works by Thomas Salomon, the curator of modernist art in New York.Following a successful partnership with the National Gallery of Art, Greenberg opened a gallery in New York in 1957. It has since become a landmark, and now draws an average of three thousand visitors a day. The National Gallery of Art has also recently begun hosting a biennial of work by contemporary artists,", "The next Biennial should be held in 2021. In the meantime, the biennial has created a new category of exhibitions: “Art Science” with the name of the upcoming exhibition. The exhibition will be curated by Cara Cintola, the deputy director of the Cardinal Art Museum in Rome; Simone de Zegher, the curator of Contemporary Art at the Palazzo Reale in Venice; and Alessandro Bicchierano, the artistic director of the Museo de Arte Contemporanea di Rome.The exhibition will focus on the scientific study of art objects in the collections of the Vatican, the Fiumicino, and the Museo della Scala. The will include works by artists such as Pierre-Auguste Renoir, Pierre-Auguste Fontenelle, and Henri Petzold.The selection of the artists chosen for the show was made by an international jury consisting of Juliette Ghebaly, the head of the Fiumicino, and François Perrault, the director of the Museo della Scala. The show will be preceded by an exhibition of works by Marta Bonchâte, which will be inaug", "The next Biennial should focus on how to create a new network of spaces, projects, and educational programs that reflect and elevate the art and design of Los Angeles. The twenty-fifth address the history of architecture in the city through a survey of thirty-five modernist buildings. The twenty-eighth will examine the work of American and international artists in the city through the lens of the Biennial. The twenty-ninth will focus on how architecture and design can serve as an antidote to climate change and the impacts of the coronavirus. The twenty-eighth Biennial will be held in the city in 2021. \n\n\nThe Institute of Contemporary Arts (ICA) in New York announced today that it is exploring the possibility of building a new museum dedicated to the work of minimalism and minimalist design—a project that would be inspired by the museum’s current exhibition “Luxury: Art as Minimalism” (2019–20). The Museum of Modern Art (MoMA) in New York announced in January 2019 that it was working on designing a new exhibition focusing on the history of the art of minimalism and minimalist design. The planned exhibition was shelved in 2019 after the architect Joseph Kahn", "The next Biennial should take place in 2020, and the organizers are hopeful that the exhibition will continue to attract large audiences. The event will be organized under the auspices of the Centre Pompidou, the Paris-based organization that owns and manages the building.The institution plans to launch a new exhibition dedicated to the history of the museum in the fall of 2020, and has already hired a curator of MFA Paris’s collection of Roman mosaics and a curator of MFA Los Angeles’s collection of modernist and contemporary art to work on the project.\n\n\nThe Smithsonian American Art Museum (SAM) in Washington, DC, has appointed Deborah Truitt as its new deputy director and chief curator. In her new position, which begins in January 2020, Truitt will work with the museum’s curatorial staff to develop and execute solid, research-based programming that addresses emerging and established topics in American art.“Deborah embodies the visionary and critical spirit of the museum,” said David McAllister, the institution’s director. “She has the ability and the ability to see and engage with the museum’s collection from a variety of perspectives, and to create programs that push the boundaries of what", "The next Biennial should take place in Guadalajara, Mexico City, or Mexico City, Mexico, in 2020.<|endoftext|>A large group of artists, art workers, academics, and activists gathered in Los Angeles yesterday for an action rally in protest of a new $15 minimum wage law that will take effect in January. “California is facing a severe economic crisis that will directly affect all of our communities,” said Mark Halperin, executive director of the Los Angeles–based nonprofit Artists United. “A $15 minimum wage law will help avert a catastrophic financial crisis, but it will also help put an end to the exploitation and homelessness of millions of Americans. We are prepared to fight for $15 and a decent standard of life for everyone in Los Angeles and throughout California.”According to the Los Angeles Times, the city’s restaurant and entertainment sector will lose as much as $100 million if it doesn’t enact emergency financial assistance through the California Community Reinvestment Fund, the state’s $3.5 billion stimulus program. The activists are calling for a $2.5 minimum wage hike, the expansion of the Earned Income Tax Credit, and the establishment of a universal basic income guarantee.�", "The next Biennial should be held in the summer of 2021. The 2020 event will be staged at the museum as part of the Biennial of Modern Art, at the Kölnischer Kunstverein in the city of Cologne. \n The Institute for Contemporary Art (ICA) in the United Kingdom announced today that it is planning to open its new headquarters at 8 London Borough High Street in the autumn of 2021. The new space will be built in a converted warehouse and will be inaugurated by a lecture series titled “The Future Is Present: How Art Can Make a Difference,” which will take place in the exhibition space, also known as the lobby, of the new cultural complex.The biennial will examine the ways in which art can affect and change the world around us. It will also highlight how art and architecture form a “pivotal social and cultural network.” The exhibition will invite visitors to experience art in a new way. The new platform will be powered by the latest technology and will be built in an existing public space, with the help of local architects and engineers, in an attempt to make it more accessible and affordable. The redesign of the space and the biennial is part of a “Plan", "The next Biennial should take place in 2021. \n\n\nThe Dusan Bichthawongkalai Art Museum in Bangkok has received a gift of 170 works and artifacts from the Buddhist kingdom of Cambodia, according to Artnet. The museum also said that an exhibition of “Buddhist Art” will be presented in 2020. The gift consists of thirty-two works by artists such as Samsara Abbey, Lúcia Bichthawongkalai, and Dangdai Dzum, as well as seven rare artworks, including a decorated pottery bowl dating from the fifth century BC and a work by the artist Kun-Leng.The gift was given by King Bhumibol Adulyadej on the occasion of the institution’s 150th anniversary. In a statement, the king said: “The collection is a source of great joy and satisfaction to us all. It is a source of inspiration and inspiration for everyone who cares about Buddhism in Thailand.”\n\n\nThe National Gallery in London announced today that it has appointed Yasmin Khawate as its next director, effective immediately. Previously, Khawate served", "The next Biennial should be held in 2022. Its inaugural edition, titled In Search of the Mother, will include work by fifty artists, and will be held at the New Museum in New York. The event will be presented by Tina Baldy, Nina Bove, Annie Flanagan, Leslie Goldstein, Papel Machete, Paco della Carriada, Claudia Mangan, Joslyn Mafia, Nicky Pidcock, Sarah Seltmann, and Anna-Sophie Travers.The Los Angeles Biennial, which was initially scheduled for March 25–March 29, has been pushed back to June 11–June 12. Its summer edition will be held June 23–June 27, 2020. The Venice Biennale, which was originally slated for March 22–March 27, has been postponed to March 25–March 28, 2020. The Mumbai Art Festival will now be held from March 28 until March 30. Originally scheduled for March 26–March 28, the event will now take place from March 29 through March 31. The Bangalore Art Festival will now be held from March 29 through March 31. Mumbai", "The next Biennial should be held in the spring of 2021. \n\n\nIn a move that will also benefit the BOP, President Donald Trump signed an executive order on Tuesday that will allow museums and historic sites in the US to refocus their energy on the future. The memorandum—which will take effect immediately—stresses that the “future of our civilization and the vital role of art in American life” is at stake. “This is an age of unprecedented challenges,” said Interior Secretary Ryan Zinke. “Museums and cultural sites play an integral role in the health, creativity, and well-being of our communities. They provide a springboard for reflection, inspiration, and appreciation, and help shape our collective cultural heritage. At a time when we are faced with unprecedented threats to cultural heritage, American museums and cultural sites are working together to create new ways to honor and protect the vital role of art in American life.”The executive order, titled “Museums and Cultural Sites Refocus on Future,” outlines a number of measures that will allow the museums and historic sites within the United States to better plan for the future, including by consolidating and streamlining the administrative, legal,", "The next Biennial should take place in 2020.\n\n\nThe German government was forced to extend the opening of the country’s national art exhibition by two months as it attempts to stem the worsening outbreak of the novel coronavirus. Chancellor Angela Merkel spoke of the need to postpone the opening of the biennial until the autumn, and on Thursday, November 25, the government commissioner of the exhibition Frankfurter Allgemeine Akademie der Künste (German Academy of Arts) said that the new date would be \"hopefully\" in December.Merkel made the announcement at a special session of Germany’s Federal Association of Art, which was held in Studio Berlin on Wednesday morning. The biennial will now open on November 27—a week later than originally planned—and will feature around seventy works by twenty-six artists in twenty cities across the country.For those affected by the coronavirus, the postponement is not ideal. From Thursday morning until Friday, the government has continuously downplayed the health risks posed by the virus, and on Saturday, Merkel extended the opening of the exhibition by another two weeks, from November 26 to December 14. The extension", "The next Biennial should take place in 2020, and the first Art in the City should take place in 2022. In the meantime, the museum is encouraging visitors to come see the work of the three new masters: Ben Hu, Benoît Poledna, and Max Beckmann, among others. The 2020 exhibition will be curated by Karlsruhe and Andreas Küng.\n\n\nAn open letter addressed to museum directors from sixty-six artists and art workers has been published by the Royal Institute of British Architects (RIBA) and Art in America. The document, which is dated March 7, asks for the “immediate closure of the National Museum of Modern Art (MMA),” which is housed in a former munitions factory in the heart of London, and asks for the issuance of an ultimatum: “The museum must ‘do more,’ or shut it down,” the letter reads. The letter concludes: “[T]he future of the museum depends on you—on your leadership and on our wholeheartedly endorsing this letter. We have worked for years to secure the museum’s survival and, with the support of our colleagues, we are now asking that it", "The next Biennial should be in 2019. We are now in the final stages of preparing for this year’s edition, and we are working hard to ensure that the exhibition will be organized in line with the theme of the next two years. The exhibition will be dedicated to the contributions of indigenous artists to the history of the National Museum of Indigenous Art in Canberra. The exhibition is again supported by the National Heritage Foundation, as part of its Workplace Art and Heritage Fund, and will run until January 31, 2020. \n\n\nThe UCCA Center for Contemporary Art in Los Angeles (UCCA) has announced that it will receive $11 million from the Coronavirus Aid, Relief, and Security (CARS) Act this year, the largest aid package ever provided to an American arts institution. The program, which also provides $6 million for critical health care and $3 million for the arts, is being organized to provide critical support for cultural institutions and organizations that have been negatively impacted by the coronavirus pandemic. The grant will also provide $3 million for the UCCA Museum of Contemporary Art in Los Angeles’s redesign and construction, and $1 million for the UCCA Costume Institute’s renovation", "The next Biennial should be held in the spring of 2020. The exhibition will consist of two hundred works, most of which will be new works, and will be held in conjunction with the famous exhibition of the same name, which was held in the spring of 2017. The exhibition will include photographs, sculptures, installations, performances, and other works that were selected by the curators, Yoav Balint, Yaakov Ariel, and Meir Dagan, in collaboration with the artists and curators of the exhibition. The exhibition will be organized in the same manner as the exhibition, and the biennial will be held in a conceptual framework. The announcement follows the publication of “Events in Jerusalem” (Jerusalem University Press, 2017), an exhibition organized by the Israeli artist Yoav Balint and the Palestinian artist Issa Maalouf. It will also mark the opening of the Besel Academy of Art, which was established in 2006 in the al-Khalil neighborhood of Jerusalem. The academy, which features a lecture series, a museum, and a performing arts center, will be inaugurated with a lecture by artist Tarek Atoui, who will address topics such as “Diana Al-Hadid, the History of", "The next Biennial should be held in the theme, “The Body,” in 2022. The 2020 edition, which was organized by the German cultural agency Durchbund, featured work by twenty-four artists, including Peter Dreher (from the United States), Paul Ehrenreich (from Germany), and Andrea Frida (from Italy), and was won by Aria Bohmann. \n\n\nThe National Museum of Fine Arts (MoFA) in Kansas City, Missouri, has announced that it plans to retire the last of the museum’s four-thousand-piece collection, which consists of works by artists such as Pierre-Auguste Renoir and Pierre-Auguste Salzmann, and is planning to turn the collection into a museum for the history of art. The announcement follows a study of the collection that was commissioned by the museum in 2014 and commissioned by Northrop Grumman in 2025. The study concluded that the collection had sufficient historical and archaeological value to return to the state and was an accurate reflection of the mission of the institution.The final work in the collection, a map of the United States, was also completed by the government-funded organization in 2018 and can be seen in the exhibition �", "The next Biennial should be held in 2020, and then another in 2021. The 2019 iteration, in which the Museum of Contemporary Art (MoCA) London staged an exhibition of work by notable contemporary artists including Richard Diebenkorn, created some of the most anticipated programming.According to a statement released by MoCA, the 2019 event was “a triumphant return to form” and that in 2020 it will “be even more ambitious, more ambitious still, and we’re really going to do it.” The statement concludes with a call for the UK and Europe to “explore new ways in which we can work together.”According to the Daily Telegraph, the 2019 event was a “truly extraordinary event.” The 2019 exhibition “was full of thought-provoking and heart-rending works by a range of artists, and the world-class curators, including Aline Nolen, Guadalupe Rosales, and Richard Black, and the exhibition was a true reflection of what we as a cultural community should be doing.” Artforum has reached out to the 2018 and 2019 editions of MoCA for comment.\n\n\nThe Baltimore Museum of Art (BMA) has released new", "The next Biennial should take place in the United States in 2021, and the first in the UK in 2022. The museum will be inaugurated by a new mission statement that promises to offer more than fifty years of artmaking on a broad spectrum of themes, including the human condition, the natural world, and the environmental crisis. The exhibition will also encompass a redesign with a view to creating in future exhibition spaces. For the fourth edition of the annual Biennial, the theme is Power. The theme represents the international collaborative effort and creative spirit that is at the core of modernism and the visual arts.\n\n\nThe Netherlands’s National Museum of Dutch Art (NMD) in the Hague has appointed Christoph Reuter as its new director. Reuter comes to the museum from the Museum of Contemporary Art, Los Angeles (MCA), where he has served as director since July 2017, and will assume his post on January 18. He succeeds Anne De Bruijn, who retired in January 2019 after more than twenty years in the position.“Christoph Reuter is a highly skilled and talented leader who is dedicated to the vision of the NMD as a museum that will continue to become an important example for future generations and", "The next Biennial should be held in 2022 and will open in 2021.  Arts and culture minister Nandini Gokhale announced the date and venue for the fourth edition, titled The Last of Us, at the Ministry of Culture in New Delhi on January 14.  The theme of this year’s exhibition was “Reclaiming Our World,” and the first act of the exhibition was a performance by the Beijing-based contemporary arts and culture collective the Confucius Institute. The event will include performances by the twenty-four artists represented in the exhibition, which will be held at the National Gallery of Art (NGO), Mumbai.The next edition will feature works from twenty-five countries. The selection of artists is based on their artistic practices, their aesthetics, their communities, and their connection with the themes of their performances. The artists chosen for the program include Alejandra Almagro, Belén García-Báez, Ciarán Hinds, Nina Mickle, Tanya Merz, David Nicolai, Elizabeth Nesbitt, Lisa Peña, Cara Mulholland, Noor Salih, P", "The next Biennial should be held in 2022.\n\n\nThe Ottawa Art Gallery (OAG) is planning to remove a work by Canadian artist Ryan Nesbitt from its collection after an outcry from collectors and a Change.org petition.The institution informed Sotheby’s of Montreal on May 1 that it planned to remove the piece, titled Restless Heart, from its website and to distribute it through iTunes, Amazon, and other digital platforms. The announcement followed an outcry from the collector Peter Munk, who had purchased the piece from the artist for $10,000 two years ago.After a Change.org petition was started by Munk and more than 1,600 people who signed, OAG restored the work, which will now be displayed in the gallery’s new building, which opened to the public last week. The gallery also set up a new online auction, which will be hosted by OAG’s new digital platform, the Art Gallery Record.The controversy surrounding Nesbitt’s work, which was painted in the late ’70s and early ’80s, dates to 2009, when Munk acquired the work from the artist for $6,000. The auction house only paid Munk", "The next Biennial should include a presentation of the work of Bechko, Jori Gassen, Ignacio García Menéndez, and others, and should take place in the newly renovated exhibition space, the Düsseldorf-based Biennial der Künste Berlin, which opened in March.  This year’s event will be held at the Stuttgart-based venue, which was founded by architect Christian Bohn in 2013 and is housed in an 18,000-square-foot former UBS bank building. “Bechko and the entire team at Stuttgart are deeply committed to this project,” said cofounder Wolfgang Suter. “We have worked closely with the artist for more than ten years, and we were thrilled to have her participate. The result will be a unique exhibition, based on her thirty-five-year career, revolving around an extraordinary collection of works.”The artist will have a solo exhibition at the CNE in Paris on March 14, and will be in the United States in March 2020.\n\n\nThe National Gallery in London announced today that it is planning to reopen in the autumn following a £140 million ($161 million) expansion,", "The next Biennial should take place in 2021.\n\n\nMUNICH (Germany) - The German city of Munich has reassessed its security for the 2020 edition of the Neue Hamburger Abendbau, replacing the piano and the light installation Barbet Rindle, which was scheduled for July, with a new installation, Quantum of Movement, on the same day as the festival. Previously, the city had announced that it would open the exhibition on September 3. Since then, however, the event has been moved three times: once for a weeklong celebration in the summer, once during the winter, and once for a year. “We are very satisfied with the outcome,” Suellen Cherel, director of the MUNICH International Film Festival, told the Art Newspaper. The declaration that the city is reopening the pavilion comes after the city spent five months developing a plan for the event that will keep the theme of quantum physics and artificial intelligence at the heart of the show.Cities are reopening in the cities of Salzburg, Cologne, and Bonn as well as in cities such as New York and Tokyo, and governments are reopening their borders. However, the German state of", "The next Biennial should be in 2020. Engage us!End its prohibition, and let us live together in freedom.Cecilia\n\nArt Poster Archive\n\n\nThe Seattle Art Museum (SAM) is preparing to open a new public space, the Center for Art and Media, in 2021. The project is part of the city’s new $2.8 billion Master Plan for Seattle, which aims to revitalize the city’s historic core and provide more affordable housing, invest in workforce training, expand access to the arts, and create new public spaces. The centerpiece of the project, which is part of a city-wide $1.8 billion overhaul of the Seattle waterfront, will be the Center for Art and Media, which will house the institution’s permanent collection. The renovation, which is slated to be completed in 2022, is part of the city’s \"build it, they will come\" strategy to reshape the region to promote tourism, workforce development, and arts.“The Master Plan for Seattle aims to reconfigure the Seattle waterfront by creating an open public space, a public green space, that is a great destination for visitors to the waterfront and beyond,” said Mayor Ed Murray. “I", "The next Biennial should be held in the autumn of 2020, and the last in the spring of 2021. The exhibition will host fifty works, with additional works scheduled for the 2021–2021 season.  The biennial will be financed by the Künstlerhaus-Stiftung in Cologne, and the Kunstverein/Kunst- und Kunstkunstst (KUM). The KUM will be supported by the Künstverein’s partner, the Künstverein-Stiftung zur Kunstbau, and the Künstverein-Untersuchungen, as well as by the Kunstverein, the Künstverein-Stiftung für Kunstbau und Künstverein und Künstverein-Untersuchungen (KUM-UKK), and the Künstverein-Stiftung des Bundes. Kunstverein Kunstbau (KUM) is a contemporary cultural center in the Kreuzberg district of Berlin. The contemporary art center will present an exhibition of forty works by twenty-six artists on", "The next Biennial should open in 2020 and continue to be held every other year, with the largest exhibition in the museum’s history. The new exhibition program will include pieces from the collection that were on display during the exhibition’s inaugural season, including drawings, works on paper, and paintings. A new work by artist Matthew Henson will also be presented. The Biennial will also feature works from the collection that are currently on display in the museum, such as works by artists such as James Cuno, Josiah Johnson, and Adrienne Atget.The museums also announced that they will offer free admission for visitors with paid appointments. The new program will launch on December 16. “The new program will be open to the public on the first Saturday of December in 2020 and will run for twelve weeks, from December 16 to December 21, 2020, with a special focus on the last decade,” said museum director Tobiasa Zusak. The full list of participating artists and their studios can be found on the new website. \n\n\nAmerican artist Glen Taveras, whose dazzlingly detailed paintings capture a terrifyingly beautiful and hopeful world populated by seemingly immortal beings and seemingly non-human objects, has died at", "The next Biennial should be held in the autumn of 2022. \n\n\nThe National Museum of Fine Arts (NMFA) in Atlanta has received a gift of one million dollars from the Walt Disney Family Foundation. Established in 1956, the foundation has given the museum $2 million since its founding. The gift includes a collection of more than 1,500 works by Walt Disney and includes the inaugural exhibition “Walt Disney: The Art of Storytelling,” which will debut in March 2019. Walt Disney’s ninety-six-year-old namesake will be given a lifetime achievement award. The Walt Disney Foundation also gave the institution $1 million in support of the restoration of the old Coca-Cola building in Atlanta’s Buckhead district, a $1 million donation for an Atlanta museum of African American history, and $500,000 for the construction of a new Windy City museum. The donation was made through the Walt Disney Family Foundation in recognition of the institution’s recent decision to consolidate its operations in order to reduce the foundation’s operating expenses.“The Walt Disney Foundation is thrilled to donate one million dollars to the museum and its staff as they embark on the art-historical journey", "The next Biennial should be held in 2020. It will be led by a committee comprised of the architects of the Five-Mile, Five-Mile bis, and Five-Mile bis - the largest motorways in the world\u0097and will take place in the United Kingdom. The theme, “Up, Up, Down, Up, Down,” will be about the relationship between the human body and the environment. The invitation says that the theme should be about the human condition, about what it means to be a human being, and about the autobiographical aspects of landscape and urban life. It will also include a gallery offering work on the exhibition. \n\n\nThe University of the Arts (UNA) in London announced today that it will open a new, state-of-the-art research and teaching space designed by British architect Sir Richard Foster and the German company Guggenheim Aurten in the campus of the museum.Established in the garden of the British Royal Institute of British Architects (BRIC), the building will be a graduate learning facility that will address the needs of a number of academic disciplines, including architecture and design, design and landscape, and design and urban design.", "The next Biennial should be held in May 2021.\n\n\nThe Metropolitan Museum of Art in New York announced today that it is preparing to welcome visitors back to the museum after a mysterious and devastating fire tore through the institution in March 2019, killing eighteen people and injuring more than one hundred. The fire, which was extinguished by firefighters only seventy-eight hours later, was extinguished only after the museum’s glass-enclosed exterior façade, which houses the museum’s four galleries, was razed to the ground.The firemen who extinguished the blaze, which took place in an eighteenth-century brick building on the museum’s second floor, found that the building, which was constructed in 1972, did not suffer structural damage. The building had been boarded up since 2007, when it housed the museum’s permanent collection. The American Institute of Architects, which designed the building, had originally awarded the museum a B+ for its design in 2017, but the institution claims the B+ was changed to an A+ after a public inquiry. The building was also awarded an A for its environmental stewardship, which included removing fourteen hundred cubic yards of rainwater from the building each day, reducing the fire’s carbon footprint by half,", "The next Biennial should be held at the same venue as the MDNA-AIA, which will inaugurate the top-level exhibition, Artforum’s “Art for Dummies.”  An open call for applications will open on December 9.“The selection of the forty-eighth edition of the Biennale is a magnificent achievement, opening up a new dimension of discourse and visual art today and into the future with a new and innovative approach,” said Nina Esht. “It will profoundly impact on the way we think about the artist and the world, and will carry out our vision for the exhibition as a kind of 'turning point,” Esht added. The biennial, which will mark the fifteenth anniversary of the exhibition, will be organized as an ensemble, with the curators familiarly known as “skippers.” The methodology for the exhibition will be the same as the previous two editions, with new works being presented daily in the biennial’s four main venues. The 2019 edition of the Biennale, “The Fragments of a Life,” was held in Kassel from February 23 to March"]