["The next Biennial should be held in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is working with artist Ai Weiwei on a massive renovation of its campus in the city. The $150 million project, which will revolve around the building of a new museum on the campus, is expected to take five years and will involve the relocation of the museum from its current location on Tenth Street to a new, larger building.“Weiwei’s transformation of the Museum of Modern Art into a center for contemporary art, both on-site and beyond the museum walls, is a love letter to the city we love and to the city we’ve become,” said MoMA director Marc Straus. “In order to make this possible, we have been changing the Museum’s interior landscape in collaboration with Ai Weiwei and are now transforming MoMA’s exterior. The results are breathtaking.”The first phase of the renovation, which is slated to end in February 2021, will consist of the removal of the museum’s existing building and installation and the construction of a new two-story museum in an industrial park across the street from MoMA. The new museum", "The next Biennial should take place in 2021. Artforum has contacted the organizers of the biennial for comment. The exhibition will be held at the Art Institute of Chicago (AIC) in Chicago in 2021. \n\n\nThe Art Newspaper has revealed that the British Council will donate £1.5 million to the British Museum in support of the institution’s air of scientific and technological elitism. The donation will also enable the museum to open a biennial exhibition, “Air,” in November 2021 and will mark the museum’s thirtieth anniversary.“This is a pivotal year,” Ken Lloyd, executive director of the Art Newspaper, told the Art Newspaper. “The Museum of Modern Art (MoMA) in New York is currently fundraising for its biennial—and this is the first time the MoMA has given money to the British Museum.”While the MoMA and the British Museum have been collaborating on the biennial since 2014, it only opened to the public in April 2019. Inaugurating the biennial will be “Air,” a major retrospective of the MoMA’s design and a new exhibition about the museum’s trip", "The next Biennial should be held in 2022, and the next in 2021. The current format of the biennial has been criticized by many, including artists, activists, and scholars, for its pretension to scientific inquiry. In response, the Biennial Commission has released a statement saying that it wants an end to the exhibition, but only to “decipher and reinterpret history.” The statement also says that the exhibition will be relocated to the Museum of Contemporary Art, San Francisco, and that the upcoming edition will draw from the “previously published” work, but will present works “previously excluded” from the exhibition.The statement does not mention the exhibition’s long-awaited reopening, which was long anticipated. However, the commission’s statement reads: “The next Biennial will be a new show. It will be different than the current show. The show will be a creative experiment. It will explore what it means to be human in a digital world. It will be a show of the artist’s body ‘in the search of a new form of self-representation.”\n\n\nIn a major blow to the museum’s longstanding prosecution of the Epstein/", "The next Biennial should be called for the 'Detention and Resettlement of Jews in Nazi-Germany’s Concentration Camps; a new edition of the Artforum\u0097in conjunction with a special exhibition, “Why We Must Stop the Holocaust,” at the Berlin Gallery Kunstverein from March 25 to March 27, 2020.If the event is postponed, the next edition of the Artforum will be staged in London and New York, and the first chapter of its forthcoming sixth edition will be published online on March 24. The tour will also cover the history of the newly-formed museum, which will open in the middle of the night on the eve of the Jewish Passover seder and in the room where the historical exhibition “The Infiltration of Jewish Children” is currently on display. \n\n\nThe Shelby County Museum of Art in Alabama announced this week that Kelly Osbourne will be the next director of the institution. In the position created by President Donald Trump in June, Osbourne will oversee operations at the museum before departing in September. During his tenure at the helm of the institution, the fifty-one-year-old will seek to reestablish the institution’s reputation as one of the most important", "The next Biennial should be convened within the next three years and will be devoted to the creation of a new Centre for Contemporary Art (CCCA), which will focus on the research, teaching and exhibition of contemporary art, in collaboration with the University of Exumas, the National Gallery of Victoria, the Art Gallery of Victoria, the British Museum, the National Gallery of Canada and other institutions.The Biennial was established by the King and Queen of England, Prince Charles and Diana, in recognition of their philanthropic efforts to promote British art. The Biennial will be hosted by the Institut Nationale de Art et d’Histoire (INAH), the French Ministry of Culture, the Institut Royal de Paris, the Institut Nationale de l’Avance (INSAT), and the Condé Nast, with the collaboration of the City of London and other world and national museums.The exhibition will celebrate the collection of the late artist Ron Gorchov, who frequently illustrated the works of his peers. Gorchov’s work will be displayed in the exhibition “Ron Gorchov: Directions,” which will be on view through November 14, 2020.\n\n\nThe Museum of Contemporary Art (MoCA)", "The next Biennial should be held in 2021. The highly anticipated event will feature a new selection of works from Chisenhale Gallery in New York and the Museum of Modern Art in New York. The museum is currently working toward the construction of a new venue and is in the process of securing funding for the project.The new exhibition, titled “The Depth of Black,” will feature work by thirty-seven artists from twenty-four countries. The seventy-sixth edition of the event will be hosted by the London-based organization Dublin Fine Arts Museum (DFAM) in September 2021. The event will run concurrently with the upcoming Biennial of European Art in Ho Art.Called “The Moments that Matter” and curated by Paula Meehan, the show will focus on “ordinary moments of our lives” and will showcase the work of the seventy-three international artists who will participate in the exhibition. Among the artists chosen for the exhibition are Sander Breure, Ursula von Rydingsvard, Ariana Pindell, Nadine Tung, Krista Yu, Laura Owens, Bénédicte Saville-Smith, Martin Luther King Jr., Harald Szeemann, Anna Atkins,", "The next Biennial should be in the near future, I believe. The exhibition was already closed for over six months, and the next one is scheduled for March 2021.I wonder whether there will still be room to change things in the interim. \n\nThe Necker Museum of Art in New York has reopened, after months of construction, following a $250 million expansion. The institution, which was forced to move up the opening of its inaugural exhibition “Paintings from the Ground Up” due to concerns over Covid-19, announced this week that the show will return to the Hudson Valley in 2020. The move means that the museum will once again host a major retrospective of the artist’s work, this time focusing on the work of contemporary artists such as Richard Diebenkorn, Brian Eno, and Russel Britten.The renovation began in the summer of 2019, after Necker received a $100,000 donation from the many collectors who donated works in support of the museum’s work-in-progress program, “Paintings From the Ground Up.” The $300,000 grant also helped fund the expansion of the museum, which added a gallery for the collection, a new theater", "The next Biennial should focus on the history of art, science, and technology, Istanbul’s largest art and design exhibition, and should include a selection of works in the exhibition’s first iteration, “The Global War on Terror,” which will open on August 14. The second installment, “Hope and Despair,” will be held in December 2020.\n\n\nThe museum in New York City that plans to install a new $1.5 billion replica of the Lincoln Memorial in its grounds has received a $700,000 donation from a group of civic and religious leaders. The Lincoln Memorial Legacy Network, which is supported by a variety of philanthropic organizations, including the Charles and Lucille King Family Foundation, the John D. and Catherine King Family Foundation, and the Andrew W. Mellon Foundation, has awarded $750,000 to the institution for its first project, a $500,000 grant for a new Lincoln-Lincoln Garden.The Lincoln Memorial Legacy Network was founded by the Charles and Lucille King Family Foundation to advance a new plan for the reconstruction of the memorial. The foundation is funding the project out of a $1.5 billion reconstruction budget that was allocated to the event", "The next Biennial should take place in 2020. The next show should be based on the same themes and locations. Focusing on the history of the museum, in the same manner as the previous show.The best way forward for the museum is to be a platform for experimentation and experimentation, for people to come together and share their ideas and to have their own stories.”\n\n\nLoring Randolph, president and CEO of the American Ballet Theater (ABA), announced today that the organization is launching a new $5 million prize for emerging artists, which will help advance the careers of thirty-eight artists. The ten finalists will be chosen by a jury made up of Deborah Baldor, director of the Metropolitan Museum of Art in New York; Andrew Scheer, ABA’s executive director; and artist-in-residence Laura Jane Grace, who serves as the ABA’s legislative director.“We are thrilled about this opportunity to support thirty-eight talented artists and their families through this challenging time,” said Loring. “It is an opportunity to build on the foundation that is the foundation of the ABA’s history, to engage with the lives and work of these artists, and to fulfill", "The next Biennial should be held in 2021. “We are truly honored to have contributed to this cultural milestone,” said Nari Ward, director of the Biennial. “We are incredibly grateful for the steadfast support of the Los Angeles County Museum of Art and the city of Los Angeles. We are excited to return to the Museum of Contemporary Art in the Arts to share these works with our community in 2020.”The institution also revealed that it will receive a $2 million contribution from the estate of Robert Rauschenberg; a move made in recognition of the seminal work of the German industrial designer. The proceeds of the estate will go toward the construction of the new pavilion, which will open in 2021.“The Rauschenberg Estate is honored to receive the contribution from its collection,” said David and Donna Rauschenberg. “The collection is an absolute benchmark for the highly esteemed craft of our times. It is a monument to the rich and powerful who have shaped the course of modern art and the world.”The new works will be unveiled on September 22, 2020.\n\n\nThe Bechdel Test, a groundbreaking 2015 study conducted by the Los Angeles County", "The next Biennial should be held in early 2020 and will include an exhibition of works from the artist’s forthcoming exhibition “Anomalisa,” which will open at the Biennial in early March.\n\n\nThe Metropolitan Museum of Art in New York has received a gift of seventeen works by the late Polish-American painter Konrad Kajewska. The works, which were given to the institution by his widow, Zora Jódzka, are among the thirty-four works that were sold by the museum in a deal that valued the artist’s work at $36 million.Kajewska was an American immigrant who grew up in Chicago and moved to the United States in the early 1950s. He studied at the University of Chicago and the University of Pennsylvania before moving to New York in 1971 and studying with Frank Gehry, Frank Lloyd Wright, and Pierre Haussmann. In 1979, the duo Kajewska/Blum and Kajewska/Krotos, which were inspired by Kajewska’s father, together won the Premio Marucci in Venice. The same year, an exhibition at the museum featured Robert Irwin’s work, which included a new interpretation of a", "The next Biennial should take place at the Städelschule, the University of Bonn in Germany, and the Institut Labex, in Switzerland, in the fall of 2022. The festival cofounder Ulrike Lunacek said that the new venue would be closer to the artists’ homes and would introduce a new series of lectures.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a $3.5 million donation from the Robert Rauschenberg Foundation. The gift includes $2.5 million for the Institute for Contemporary Art Research (ICA) in New York, and $1.5 million for the Stedelijk Museum in Amsterdam’s Institute for Contemporary Art History.Curator and art historian Lora Mendoza and art historian and curator Tristana Alter, who worked closely with the foundation on research for the exhibition “Diana Al-Hadid: Art in the Age of AIDS,” will receive $1.5 million from the foundation. The gift also includes $1 million for the 2015–16 academic year. Among the exhibitions the foundation is planning to stage this year are “Sisters: an exhibition of modern and contemporary art from the Jewish and Christian traditions", "The next Biennial should be hosted at the Museo de Arte Contemporáneo Pedrales in Madrid, Spain, in December 2020. The event will showcase the work of thirty artists in a variety of media and will be organized as a multi-media exhibition, with each artist coming to the venue to present their exhibition in their own exhibition. They will also share their work with the public through a digital experience and an interactive stage.\n\n\nThe New York City Department of Cultural Affairs has launched an initiative to support artists and their families struggling financially as a result of the coronavirus, acting in conjunction with the New York–based nonprofit the Artists’ Union. The program will offer grants of up to $100,000 for individuals and small businesses struggling to afford rent or food during the coronavirus pandemic. Los Angeles County has also allocated $100,000 to assist artists and their families. The funds will go towards prohibiting evictions, providing financial assistance to artists in navigating through eviction proceedings, and providing information about financial aid. The initiative follows a wave of cultural and labor solidarity campaigns in the United States that have mobilized workers against the coronavirus and other threats to workers. On Monday", "The next Biennial should be held in 2019. The 2017 event, which had been planned for Spring, was moved to Summer to maximize the number of international artists participating. Since then, the Biennial has continued, with the assistance of the Arts and Cultural Centre in Zürich, and has had a number of international exhibitions, including the opening of “Ai Weiwei: Life on the Road” (2015); “Theodoros Pindell: The Truth of Nature” (2017); and “Spencer & Storm: The Performance of Art” (2018).The Biennial will be held in the Stadio Olimpico, in the city of Zug, Switzerland, from March 22 to March 25, 2020; it will also hold a second edition in 2020 in the Státřska, in the city of Västra Götaland, in 2019. The exhibition will be presented by the Swiss architect and director Arnaud Resnais, director of the German Design Museum Bonn, and the Swiss artist Jules Verne.The first edition, titled “The Third World,” was organized by the Swiss architect Klaus-Dieter Franziska,", "The next Biennial should take place in 2020. For different reasons, the Biennials in the cities of Miami Beach, New York, and LA have been postponed, with the exception of the latter, which will now take place in 2021. The rest of the world is still waiting on the showpiece from the biennial: a new installation by the Danish artist Jacob Gäch, titled Angels, which will open in the US and Germany in 2022, but also in the New York and London biennials in 2020, 2021, and 2022. Much speculation surrounds its inclusion, with many observers predicting that it will be in the country of its namesake.\n\n\nThe National Gallery of Canada has announced that Hauser & Wirth’s depiction of the birth of Canada’s first prime minister, Pierre Trudeau, is the next edition of the National Gallery Canada Presents, which will debut in October. It will also feature performances, a museum-wide book signing, and other activities that celebrate the institution’s rich history.The eighty-six-year-old Canadian institution was invited to participate in the 2019 edition of the National Gallery Canada Presents by David Lebovitch, who is currently the director of the College", "The next Biennial should include a lecture by Professor R.J. Reynolds, the creator of the now-defunct website Avatar’s Art Department, as well as a Q&A session with representatives from the development sector.The biennial will be hosted at the university’s new $53 million Biennial of Art and Design, which is currently under construction, and will be inaugurated by a lecture by designer Kiki Smith, who is working on a new line of male-designed dresses. The program will culminate with an exhibition curated by the artist Tenga Lipson, who has staged solo shows at the Canadian Institute of Fashion and the Museum of Modern Art in New York, and will be presented by the university in conjunction with the Royal College of Art, London, the School of Fashion, the School of Creative Studies, the School of Fine Arts, the School of Economics, and the School of the Arts.A selection of the newest works by biennial artists will be presented by participating artists in separate performances. The first show, titled “Creating Frames Across Time,” will include performances by four artists selected by Tenga Lipson: Nari Ward, Raimond de Sarthe, Norihiko Kit", "The next Biennial should focus on “social and political reality in the contemporary world,” the organizers said. They cited the current conflict in Syria, where more than ten thousand people have been killed since the uprising against President Bashar al-Assad began in March 2011, as an example of the difficulty of organizing large-scale art exhibitions, which are now banned by the government. They also cited Europe’s ongoing migrant crisis as an additional obstacle to their plan to push forward with the show, which was originally set to take place in September. \n\n\nThe British Museum in London is planning to raise an additional $63 million for the museum over the course of the next four years. The sum, which will come from the sale of 3,600 works, was included in a $7.5 billion funding package that was released by Prime Minister Boris Johnson and Parliament on Tuesday. According to The Guardian, the British Museum will spend $56 million on acquisitions next year and expect to raise another $56 million in 2020. The sum is nearly three times the sum spent by the National Gallery in London, which is planning to spend $46 million on acquisitions next year and expect to raise another $45 million in 2020. “The UK is facing a moment", "The next Biennial should be held in 2022. The 2018 event, titled “The Costume of the Modern World” and held at the London institute Tate Modern, featured work by seventy-two artists, and the first exhibition was a presentation of Cultural Historian Dorothea Rockburne’s “The Costume of the Modern World” (1885).The 2019 edition will be held at the Museum of Contemporary Art, Los Angeles. Its inaugural themes are “Latin American Art” and “Modernism and Democracy.” Details about the event—which will feature a number of new works by artists from Central and South America—will be announced in December.\n\n\nThe Ketchikan Art Museum in Alaska has appointed Jeremy T. Dennis as its next director and CEO. Dennis previously held the position of director of the Kunsthalle Bonn in Bonn, Germany, from 2013 to 2017 and worked at museums such as the Musée d’Arles, the Musée d’Arles-Marie Curie, and the Musée d’Art Moderne in Paris. He succeeds Ann-Marie Ooi, who departed the institution in March 2019 after twenty-five years at the helm.�", "The next Biennial should be held sometime in 2021, and its theme, “Inky in Time,” should surely be as \"inky\" as possible. “Inky’s Reality*” may be the only other theme that will be presented on the Museum’s campus as part of the renovation project.The Biennial will also feature a new performance series, a new visual arts installation, a new book, and a new film. James Turrell, who has served as director of the Contemporary since 2012, will oversee the renovation of the museum’s collection. The renovation of the building’s collection will also include the opening of the museum’s first public viewing room, a new, permanent exhibition space, a new public gathering space, a new public courtyard, and the construction of a new entrance on the southwest corner of the institution. The renovation is expected to cost an additional $50 million.The renovation team originally designed the building in 1996 as a gathering space for the Contemporary’s art collection. The building has undergone a number of notable renovations in the past. In 2012, the renovation of the interior of the museum was completed, and in 2018, the building was awarded", "The next Biennial should be held in 2020, according to the National Gallery, and will be held in conjunction with the Centro de Cultura Arte Povera. The opening of the forthcoming exhibition will mark the first time the pavilion will be inaugurated by a woman. The inaugural exhibition will feature “Diana Al-Masri” (“The Body,” 2019), which is a project of the Los Angeles County Museum of Art and the Metropolitan Museum of Art in New York. The work is an exploration of the concept of the body, its relationship to the body, and the relationship between the body and the body, and the body and material objects, and the body and objects in general.The upcoming exhibition, titled “The Body and Material Objects,” will be curated by Mari Rudensky and will run through March 31, 2020. The exhibition will highlight the work of women artists, including Alireza Ali (Alamogordo) and Nadia Edidi (Feminine Farmhouse), both of which are works that engage with the form of the body in “The Body and Material Objects” (2016), and next week will feature “", "The next Biennial should occur in the spring of 2020. This will mark the centenary of the first exhibition, which was held at this venue in the year 1110. The exhibition will cover a wide range of topics and will be organized in a multidisciplinary style. Biennial will reunite the two museums: The Biennial of Modern Art will present the Künstler- Künstler (1918–1922) in the Künstler-Künstler (Künstler-Künstlerschlag, Künstler-Künstler) half-yearly exhibition, while the Biennial of Modern Art will also present the works of Künstler-Künstler.“We are delighted to present the works of Künstler-Künstler in the new Künstler-Künstler Kunstbau and to continue our partnership with the German architect, Künstler-Künstler-Kunstern Museum in Munich, and the Künstler-Künstler-Kunstern Museum in Cologne, ", "The next Biennial should take place in the city in the second half of 2020. “In order to give the city the possibility to develop a new exhibition program, and to bring much needed attention to the city’s art, the city has selected the Biennial of Design to be the centerpiece of its 2020 edition,” said the mayor of Paris, Anne Hidalgo. Helsinki, Tokyo, and Berlin are among the major international cities expected to host the 2021 edition. \n\n\nThe Museum of Fine Arts (MFA) in Houston has appointed Alison Baylis as its new deputy director of curatorial affairs and chief curator. She will be responsible for overseeing the development of programming across the museum, as well as furthering the MFA’s mission of providing a platform for the work of emerging and established artists.“Alison brings to the museum years of experience in museum management and operations and a proven track record of success in connecting the museum’s curatorial staff and visitors to the art of the museum,” said James Dwyer, chair of the museum’s board of trustees and chair of the Houston Metropolitan Council. “Her appointment will allow the MFA to more effectively engage with", "The next Biennial should take place in September 2021. The event will also feature a retrospective of the work of artist Winston Churchill, and will be inaugurated by a presentation of work by the artist Gertrude Stein.\n\n\nThe Maryland Institute College of Art (MIA) in Baltimore is moving forward with an ambitious $75 million redesign that will revamp its grounds and interior in an attempt to make the institution more inviting for visitors. The redesign is being led by Francis Rouleau, the cofounder of Lyle Stuart and Rosalind Franklin; the project is part of a $153 million overhaul of the institution that will include the construction of a new, more than 2,500-seat theater and a new public gathering space in the courtyard.The organization of the redesign has been an ongoing process over the past twelve years. In January 2019, after the renovations were completed, the institution announced its intention to become a master of arts space. The redesign was inspired by the work of the German architect Reinhard Gehring, whose monumental plans for the MK7, where the museum is located, were scrapped when the building, known as the Schloss, was completed in 1996. The museum also borrowed several architectural elements from the former site of the Schloss", "The next Biennial should take place in 2021, an industry official said, and it will be organized alongside the Olympic Games. Nordic countries have also pledged to provide $500 million in aid.\n\n\nThe UK government is planning to spend $5.5 billion to repair Britain’s damaged infrastructure following a devastating fire at a luxury art museum in southwest London on Saturday, May 24. In a statement, UK Culture Secretary Sajid Javid said: “The fire is still ongoing and the work is far from complete. We are fully assessing the situation and working with the local authorities. Eventually it may be impossible to put out the fire and keep the fire at bay. But we are working hard to put in place the most robust emergency plans possible.”The £7.9 billion ($9.7 billion) Fire and Rescue Authority (F.A.R.A.) has estimated that the fire, which broke out at the Barbican Art Gallery in central London on May 22, is still at large and estimating the number of buildings damaged at between eighty and one thousand. On Sunday, May 24, the fire service confirmed that seventy-two buildings are currently standing, seventy-two of which are occupied by the Barbican, and", "The next Biennial should take place at the Haus der Kunst in Frankfurt, on September 29, 2020. The exhibition will be inaugurated by an exhibition of the works of Alexander Calder and will continue with a presentation of works by the Prague-born artist Werner Hahn on November 15 and a performance of the work of Klee and the Center for Contemporary Art (CAC) in New York on November 19.\n\n\nOn Tuesday, January 4, several hundred workers at the Danish Department of Culture (Denmarkbureau) staged a walkout in protest of the government’s decision to cut funding to the arts, reports the Art Newspaper. Organized by the Danish Writers’ Association (DHK), the action was organized by the group Artworkers Denmark. “Denmark is striking because the arts are the lifeblood of Denmark, and arts workers are the backbone of the Danish economy,” Daniela Hjortenberg, a cofounder of Artworkers Denmark, told the New York Times. “The government must prioritise funding arts and cultural needs and not turn them into a political football.”According to the Danish newspaper VG, the workers plan to stage a demonstration outside the Ministry of Culture in Copenhagen on Wednesday at 7", "The next Biennial should be held in the same building as the Museum of Modern Art, where the show will be staged in 2020. When asked how she would like the biennial to begin, the artist responded: “I want people to see God’s work, and to be able to hold onto it. I want them to see it in their own breath.”\n\n\nThe Museum of Fine Arts (MFA) in Boston is preparing to reopen next week following the completion of its reopening, but with a significant reduction in the size of its outdoor space. The institution will now be surrounded by a new glass-enclosed courtyard and will open with a new selection of works by artist-in-residence Lonnie Aarons.Funded by a gift from the Levitt family of Dorchester, the new venue will be called the Dorchester Foundation. Its opening reception, which will be held on Friday, April 22, will be followed by a series of public events that will culminate in a free public concert by the Aarons Trio on Saturday, April 25.The Dorchester Foundation, which will have its headquarters in Dorchester, Mass., will have a fully staffed administrative center as well as a small satellite space", "The next Biennial should be held at least ten years after the original theme of each pavilion, and should be an extension of this. The Art Basel New York is an obvious choice, and a great platform for the Biennial, as it is for all the museums, for its exhibitions, and for its programming.”The symposium’s director, Julien Ghesquière, said: “Though we cannot yet say when this will happen, it will be a momentous occasion. The renewal of the Art Basel Biennial is one of the most important achievements in its history, and a great source of inspiration for future projects. We have been actively working on the theme for a number of years, and were delighted to see great success in the first iteration. We are confident that with the support of our talented team and the support of the public, the next edition will be a success.”\n\n\nThe Metropolitan Museum of Art, the Paris-based cultural nonprofit, is facing a lawsuit from the late collector Georges Apostuil, who accused the institution of violating copyright laws by selling works that were in poor condition when they were donated by his son. According to France24, the lawsuit has since been filed by", "The next Biennial should open in 2020. The next San Francisco Art Fair will be held in 2021. The next Art Basel Basel Hong Kong will be held in 2022. The next Art Dubai will be held in 2024. The next Art Dubai will be held in 2023. The next Art Dubai will be held in 2027.\n\n\nSpearheaded by the Mumbai-based artist-run nonprofit P.A.I.N. (Prescription Addiction Intervention Now), a coalition of artists, designers, writers, and other cultural producers, and the New York–based nonprofit ARTists United, the International Center for Near-Death Experiences (ICDE) in Santa Fe, New Mexico, is launching a major expansion in its arts and culture-focused outreach programs addressing the challenges of addiction and the impact of opioids.The $3 million initiative, which will integrate art, culture, and artmaking in a number of central locations across the United States, will focus on focusing on a two-part strategy for engagement that will incorporate both online and offline resources and will bring together artists, creatives, and other cultural producers. The first part, called the Art and Culture Battlefront, will involve the U.S. Surgeon General and", "The next Biennial should be taking place at the University of Oxford in the summer of 2021. It will be titled Art: From the Fall to the Present. \n\n\nThe Metropolitan Museum of Art in New York has appointed Jennie Puzder as its next director. She will assume her post in April. The appointment was made before President Donald Trump’s inauguration in January and was made before the museum’s board of directors voted to fire Puzder, who recently faced backlash after she publicly criticized the museum’s board of directors over their compensation and vacation policy.“I’m looking forward to working with Jennie and to guiding the Met through this moment,” said Met chairman James D. Suhey. “Jennifer is a smart, talented, and talented leader and I’m confident that she will further the Met’s mission of championing the arts and promoting diversity and inclusivity through engendering a culture of inclusivity, tolerance, and collaboration.”During her tenure, Puzder will lead the Met through an expansion that added twenty-eight galleries, expanded the museum’s collection by nearly two hundred thousand items, oversaw the exhibition of a new work by", "The next Biennial should be held in 2022, when the new $65 million Whitechapel Gallery will be inaugurated. The 2020 edition, which was staged at the Venetian in Paris, was entitled From the Ambiente to the Beatitude\u0097and will focus on the paradoxes of human form and the self in relation to the Beatitude. The 2019 edition, titled From the Ambiente to the Beatitude II, was held at the Giardini and was organized by Arashiyo and Lutz Bandera. A new edition of the exhibition, entitled From the Ambiente to the Beatitude, will take place at the Palazzo Nazionale di Marzio in Rome in 2021.A new exhibition dedicated to film will open at the Museum of Modern Art in New York in 2021. The Museum of Modern Art Hamburg, which recently completed its renovation, will hold its first exhibition dedicated to film in 2021. The Museum of Modern Art, New York: From the Ambiente to the Beatitude will open at the Hammer Museum in Los Angeles in 2021.\n\n\nThe Centre Pompidou in Paris has announced it will remove a portrait of late French president Nicolas Sark", "The next Biennial should take place in 2021. “The current exhibition is not a reflection of the current artistic situation in the city, and it is not connected to the events of the past thirty years,” Nusseibehre told the Art Newspaper. “We want to keep the theme of the exhibition, which is not about the past, but about the future. It should reflect the spirit of the city, the city of Istanbul, and the city of Istanbul’s diversity.” The next iteration of the show will be curated by a group of curators led by Saritay Mavka, a fellow of the Süleyman Center for Contemporary Art, Istanbul; İsintörek Urfa, director of MAMMA Istanbul; and Mehmet Şızıncı, founder and director of Art+Art. In the coming months, the organizers will invite artists to the exhibition to form a panel to discuss their work, and the public will have the opportunity to participate in the construction and renovation of the exhibition venue.\n\n\nThe National Gallery in London recently announced that it plans to close all of its current exhibitions in an attempt to reduce the number of exhibitions it produces under the new", "The next Biennial should be held in the autumn of 2020.” Osho, who was appointed as the new curator in 2016, was named director of the inaugural edition of the Biennial in 2017. In October 2018, the institute announced its intention to take over the management of the Biennial. After consulting with the curators, the board of trustees, and the staff, the board of trustees decided to create the new role and retained O’Sho as director.\n\n\nThe Museum of Art (MCA) in New York announced today that Jennifer Egeran has been named its next executive director. Previously, Egeran has been the deputy director of curatorial affairs at the Museum of Modern Art (MoMA). She succeeds Anne-Marie Allen, who has served as interim director since October 2019.“Jennifer’s new role is critical to our work moving forward to develop and advance the museum’s collection strategies and to ensure that the museum continues to be a vibrant center of artistic and academic life in the city, state, and country,” said board chair Daniel H. Weiss. “We are grateful to Anne-Marie and the MCA board for their leadership in selecting Jennifer and for their dedication to", "The next Biennial should launch in 2020 and will be hosted by the same building that houses the Grantobch Museum. You can reserve a space in the Museum from September 4 to September 9 and from October 18 to October 21.\n\n\nThe Danish artist Lars von Trier, whose surrealist paintings and drawings evoke images of flying saucers and other mythologies, has been named the winner of a new Carnegie Medal. The prestigious award comes amid a major resurgence in the international art world. “By all measures, he has achieved a remarkable renaissance,” said Carnegie’s director, Mary Anne Carter. “His work is part of the long-term trajectory of modern art, and its connection to nature and landscape is as important now as it was when he first began in the early 1950s. Indeed, for decades now, his paintings and drawings have inspired and defined the Danish way of thinking about art. It is the first time he has won the Carnegie Medal.”The Norwegian artist Jørn Sæther, a pioneer of avant-garde paintings and drawings, who lived and influenced many of the modernists of the 1960s, is also receiving the prize. The Norwegian artist, who won the prize in 1991,", "The next Biennial should be held in 2021 and will be curated by the painter and writer Humberto Revoluci, who has been involved in the field of contemporary art for thirty years. The exhibition will include more than 180 works that are currently on display, and will celebrate the 70th anniversary of the official formation of the CNE.\n\n\nThe National Association of Independent Colleges (NAC), an organization that represents more than 2,000 public and private colleges nationwide, has announced that it is launching a new initiative that will bring together students and professors to encourage them to become involved in campus life. The initiative will begin with an introduction to the institution-based programming that is currently provided by academic institutions but will expand to include classes, seminars, and other events that are organized on a larger scale.“The NAC initiative is a radical departure from what has been the norm for a generation,” said Mike Kelley, president of the Association. “Culture is central to a person’s existence and the NAC initiative will expose students to the power of art and the transformative power of arts education. Students will be given a very clear sense that they can go to the NAC to learn how to enter and remain embedded in the campus experience", "The next Biennial should be held in Zug in November 2021.\n\n\nThe Italian architecture critic Daniel Berrio has been appointed director of the Museo de Arte Contemporanea in Florence. Berrio, who previously served as editor of the journal Arte Povera and as the director of the museum of modern art in Milan, was chosen by the Italian government to lead the institution. In his new role, which will be announced in December, Berrio will be tasked with advocating the creation of a new institution, which will be housed within the walls of the Grand Museum of Florence, and spearhead the institution’s cultural life.“The decision to create a new institution was made in the context of the renovation of the Grand Museum of Florence, which is an international masterpiece,” said Berrio. “The new Museo de Arte Contemporanea will serve as a bridge between the two cultures,” he added, “while demonstrating the centrality of Italian architecture to the development of contemporary Italian art.” Berrio also praised the new Tunisian ambassador to Italy, Martine Hujar, for her work with cultural institutions in the country.\n\n\nThe New York City Department of Cultural Affairs", "The next Biennial should be held in 2022.\n\n\nAlberto Cervoni, the Italian architect who designed the transatlantic crossing of the Alps and the Sargasso Sea in the 1960s, has been appointed the new director of the Museo Nacional de Arte Contemporanea in Rome. Alia Farooqi, the president of the environmental organization Lega Nord, welcomed the appointment.“This is an important moment for the Museo Nacional,” Farooqi said. “This is a crucial step in the further development of the Museum of Modern Art in Rome as an institution for contemporary art. It is a new and inextricable link between Italy and the United States, and a new and vital dimension of European art.”Cervoni, who�s most recent projects include the LAINTER MUSEUM (2011–2012) and the SPRING/FALL MUSEUM (2017–18), was appointed director of the Museo Nacional in November 2020. He succeeds Paolo Camill (who had led the institution since the early 2000s), who announced that he would retire in December. “Cervoni combines a vision for a universal language and the", "The next Biennial should launch in the spring of 2021. The first exhibition, “Biennials: A History,” will open at the Saatchi Gallery in Milan in March 2022. The second exhibition, “The Emperors of Art and Design,” will open at the Museo de Arte Contemporanea in Madrid in September 2022. The third exhibition, “The Age of Modern Art,” will be held at the Museo das Beauxions in Brussels in September 2022.\n\n\nThe Chicago-based arts nonprofit the Museum of Contemporary Art (MoCA) is being sued by a group of ten artists who claimed that the institution failed to protect them from a fire that broke out during a renovation of its Exposition Park building in February. The defendants are asking for an additional $150,000 in punitive damages.“The defendants are claiming that MoCA failed to protect them by not requiring that two workstations be connected by a fire-retardant system and by not requiring that one of the two workstations be capable of sustaining extensive fires,” said attorney Michael Rosenfeld, who represents the plaintiffs. “This is a massive problem in a modern building, in a", "The next Biennial should be held in 2021. The 2019 event, titled “Spring/Autumn/Spring: Resistance,” was held at the end of May and featured works by forty-eight artists from thirteen countries.\n\n\nSunil Damodaran, director of the Indian Institute of Art in New Delhi, has announced he will resign from the post of director of the prestigious Tata Institute of Art in December 2020. In a statement, Dhanush Mishra, director of the institute, said: “The board has decided to extend the terms of Sunil and to offer a new three-year period of possibilities. Sunil’s decision to remain in India is a significant step in our ongoing work together as an institution. Sunil has been instrumental in developing the Tata Institute and its reputation as one of the leading instituions of art and culture in the country. We are extremely proud of his achievements and his leadership.”The Tata Institute has been closed since March 28, 2020 after it was forced to cancel a lecture by a group of history and science academics led by Professor K.C. Sivasankar in February 2019. During the lecture, he criticized India’s colonial legacy and the Indian government�", "The next Biennial should take place in 2021, when the final exhibition will be staged in the city.\n\n\nThe Metropolitan Museum of Art in New York announced today that it has appointed Elizabeth Chiu as its next director and CEO. Chiu comes to the museum from the Museum of Contemporary Art (MoCA), where she has held various leadership and curatorial positions, including its first director of women’s art, Mira Dantas. In her new role, Chiu will oversee development of the museum’s collection and collections programs, oversee the museum’s exhibitions, and create the biennial’s final curated exhibition, the twenty-ninth.“When I was hired, I set out to build a new museum for the art of the twenty-ninth century, one that would engage and inspire audiences with a visionary vision of how the future looks to the art of the twenty-ninth,” said Chiu. “I’m honored to be able to serve as the next director of the Metropolitan Museum of Art and am excited to share more of my vision for the museum with our talented and dedicated staff and the community.”During Chiu’s tenure, the museum has added more", "The next Biennial should be the Art of the Present (2017), a joint production between the Sixteenth and Fifteenth Hong Kong Biennials and the National Taiwan Museum of Fine Arts. The first exhibition of the new collaboration will open in October 2021.\n\n\nThe Albright-Knox Art Museum in New York has appointed Mia Asper as its new chief curator. Her appointment is a continuation of the institution’s recent expansion plans, which will see the museum expand the collection by more than 20,000 works in 2020, and will mark the first time the museum will host a major exhibition of an artist’s work.“Mia is a curator first, a thinker second, and an innovator,” Yale University Art Gallery curator and director Stephen L. Conway said. “These attributes make her an ideal candidate for this critical role, and are highly innovative and compelling for museums and research centers alike.”Born in 1950 in Pittsburgh, Mia is a New York native who has lived in New York City since 2016. She graduated from the City College of New York in 2004 and has lived in New York City since 2016.Her appointment was announced by Albright-Knox director Kimerly", "The next Biennial should take place at the venue in 2020. \n\nThe reinstallation of the institution’s campus in Bologna, Italy, is part of the plan by Italian architects Silvio Vescovi and Dario Catellani, who won the Prix d’Arles last year, to bring Biennale de Lyon to life once more. The pavilion was inaugurated by the French artist Théophile Gautier, who used pieces by contemporary artists Jean-Michel Basquiat and Pierre-Auguste Renoir, as well as pieces by Jacques-Louis Agassiz, to create a reimagining of the pavilion, the Palais de Tokyo, in Paris, and the Palazzo d'Italia in Venice.The French pavilion was initially presented as a single installation, headed by Vescovi and Catellani, on May 15, 2020. The event was marked by a retrospective of the artist’s work, the 'Art of Life, ” which was curated by Laurent Breguier, and a presentation of works by the French curator and architect Guy Debussy. The second Biennial, which is currently on view in the French pavilion for", "The next Biennial should aim to provide a contemporary perspective on the exposure that art museums have undergone during the long and debilitating illness, and should consider the contribution that art making has made to the promotion of social good. It should address institutional strategies to promote a sense of solidarity between museums and the wider community and should consider ways in which art institutions and the wider economy can work together.The fifteen artists who were selected for the award are Harvey Fortier, Henry Anagnos, Daniel Borowy, Zakarina Bhatia, Loni Tursi, Elizabeth Leibovitz, Paul Mpagi Sepuya, Tanya Shea, Yoshitomo Kawamura, Kathrin von Kapp, Matthias Kremer, and Braund Allemann. The list of awardsees is as follows:Daniel BorowyAlessandro CattelanAlessandro DalluziAlessandro SegreAlessandro VittiAndrew SachsBastien GlimcherAnne-Joëlle BollenBenedict JenkinBianca ZugdakBibi EttelbachBibi LauterBianca Lombardi", "The next Biennial should be held in 1992. The date for the event has yet to be set.\n\n\nThe Museum of Fine Arts (MFA) in Houston has received a donation of $10 million from the family of George and Jean Catanzaro. The gift is one of the largest gifts made by the Catanzaro Foundation since it was founded by the brothers in 1994.The donation comes after the foundation’s board approved a $6.5 million gift to the museum in September 2019. The donation was made to support the renovation of the Catanzaro Collection Research Center and the creation of a new gift of $6 million. The new gift is part of a $50 million fund that will also include the construction of a new gift of art by the family in 2017. George and Jean Catanzaro, who had opened a gallery in Houston in the early 1960s, began the foundation’s work in 1988 and were partners in a Houston arts space called the Catanzaro Gallery. The foundation established the Catanzaro Collection Research Center in 2005 and expanded the museum’s holdings of California and other south-central California artists in the process.\n\n\nThe Museum of Fine Arts (MFA) in New York has appointed Michael", "The next Biennial should take place in Tokyo in 2022, and the theme should be “The Future Is Present.”\n\n\nThe Egyptian Museum of Modern Art (MoMA) in New York is planning to move the exhibition “The Tomb of the Pharaohs” from its location in the museum’s basement to the new T.J. Jones Theater on West Twenty-Second Street in the city in 2021. The museum has already announced that it will bring the show to Broadway in the fall of 2022.“Tomb of the Pharaohs elicits a sense of awe and wonder from the audience,” said Ali ElShorbagy, director of the T.J. Jones Theater. “The exhibition’s immersive display of works by the artist and his family from Egypt, including works by Ismet, Naguib, and Tutankhamun, with the help of the Egyptian National Gallery, will allow our audiences to see the impact and longevity of the Egyptian ruler, Amenhotep III, in the twenty-first century.”In September 2018, MoMA donated eleven works by the Egyptian artist Hussein Baba, whose body was exhumed from the pyramids of Giza in 2018, to", "The next Biennial should be in May 2020. The next Biennial should be in May 2020. The next Biennial should be in May 2020. The next Biennial should be in May 2020. The next Biennial will be the twenty-fifth in the Pacific Standard Time. Using the same philosophy that was advanced in the previous year, the biennial will examine contemporary issues through a combination of art, history, technology, and visiting artists and will take place in a facility with a capacity for more than four hundred thousand people. The next Biennial will be the twenty-fifth in the Pacific Standard Time. Using the same philosophy that was advanced in the previous year, the biennial will examine contemporary issues through a combination of art, history, technology, and visiting artists and will take place in a facility with a capacity for more than four hundred thousand people. The next Biennial will be the twenty-fifth in the Pacific Standard Time. Following the first event, the biennial’s curators announced that the new format would be a “twenty-first revival.” “We are delighted to offer an opportunity for visitors to share in the exhibition’s ‘future vision’ and to help", "The next Biennial should be held in 2021. If all goes to plan, the show will be staged at the Palace of Fine Arts in Beijing from December 8 to December 10, 2021. The theme of the 2020 edition will be “Memory and Memory: Toward a Sensitivity of Emotion.”To support the Hong Kong artists in their work, the artists occupying the Legislative Yuan during this legislative session are demanding that the government do not cancel their contract. “We have made it clear that we would like the government to show some respect for the Hong Kong artists,” said Adrian Fung, a Hong Kong-based artist and an organizer of the protests. “But there can be no meaningful engagement with history without respecting Hong Kong’s sovereignty.”Hong Kong’s artists are protesting the results of a 2017 official survey, which revealed that only 5 percent of Hong Kong residents believe that the region should be allowed to secede from China. The artists are demanding that the government cancel the results of the survey and instead of using the money to prop up pro-democracy protests, redirect the funds to “social and cultural development.”Hong Kong’s cultural institutions are also protesting the results of", "The next Biennial should be held in 2020.\n\n\nThe Jerusalem Biennale, which was scheduled to run from March 19 to March 21, 2020, has postponed the event from May to September. The announcement was made in a statement issued by the Israeli Ministry of Culture, which was responding to the recent wave of Palestinian terror attacks on Israelis.Since the wave of violence began in March, the Palestinian Authority (PA) and the UN have accused Israel of holding more than 400 Palestinian security detainees without charges, and of stalling investigations into dozens of killings and disappearances. According to the New York Times, the PA has been accused of hiding the fate of hundreds of Palestinian children killed in Israeli military operations, and has denied the allegations. The PA also argues that the Israeli authorities are selectively attacking suspects in order to guilt them into making statements against Israel.The exhibition, titled “The Biennale: an open letter to the Palestinian people” and organized by the organization Peace Now, was to feature works by seventy-four Palestinian artists, including Anwar Sadat, Hisham al-Hashem, Jamila Toubia, Ibrahim Hamdallah, Sadat al-Jumaili, Khaled al-Asad, Omar Khouri,", "The next Biennial should focus on “The Past in Art,” said Mariko Silver, chair of the museum’s board of trustees. “It should present a new perspective on how art and history are woven together in everyday life. We hope that this exhibition, which will last for two weeks and will present twenty works by twenty artists, will draw the attention of a new generation of curators and scholars to our collection and to the museum’s mission.”\n\n\nThe Ohlone Museum of Art in New Mexico has appointed Steve Berns as its next director. Berns comes to the institution from the Museum of Fine Arts, Houston (MFA), where he has served as director since 2011. He succeeds Karen McAllister, who retired in June 2019 after ten years at the helm of the institution.“Steve brings a wealth of experience and knowledge to the Ohlone, and we believe he will continue to have a strong and positive influence in shaping the Ohlone’s collection and exhibitions program,” said director Rochelle Adams. “We look forward to working with Steve. Once again, we see his energy, enthusiasm, and vision as a key to the transformation of the Oh", "The next Biennial should be held in August 2021. Become a fan of the show on Facebook and follow our Twitter account #NYCComics, where we will update you with upcoming special projects and other events. The biennial will take place at Rockefeller Center from January 8–January 10, 2021. The next iteration of the Biennial will take place at the Hudson Yards site in midtown Manhattan from March 12–March 15, 2021. The next installment of the Biennial will take place at the Museum of Modern Art in New York from March 19–March 21, 2021. \n\n\nThe British artist, activist, and educator Sara Cohen, whose work blends magic and science and examines black magic and the occult, died on August 23. She was eighty-eight years old. Born in London in 1936, Cohen moved to the United States at age seventeen to study at the University of California, Berkeley, and then to New York in the 1950s. Her early art projects included creating black-box illusions to study the effects of LSD, a trip she later credited to a certain Dr. J.D. Salinger. She later collaborated with the British artist Paul Gauguin and has produced works that were inspired by the", "The next Biennial should be held at the Henningsjø, where the Danish architect, producer, and teacher Pieter Brink, who has been a mentor to Knoedler, is also a professor, in 2021. “The Biennials were born from the creative and the personal life together, but they are also the culmination of a growing movement, one which deeply re-conceptualizes the world,” Brink told the Art Newspaper.  In his introduction for the exhibition, Knoedler wrote: “There is a great affinity between the Biennials and the Museum Tagg, the museum of contemporary art in Copenhagen. We have been collaborating for ten years and have made many new discoveries together. I am thrilled to be able to create the next Biennial at the Henningsjø. It is an enormous honor and I am ready for the journey.”Knoedler is currently developing the new Biennial for its twentieth edition, “Art and Architecture” at the same venue as the exhibition, which will take place in 2021. The biennial will focus on “Art as a tool to bring about change,” he said. \n\n\nThe São Paulo", "The next Biennial should be on the city’s East Side, where more than 300 artists will converge for a one-day celebration. The event will feature a selection of artists from around the globe, including Tanya Bonakdar, Alice Aycock, Xalpina Chakravarty, Marc-Franco, and Zoya Juma. The bank, which is now attempting to sell the fifty-fourth edition of the event to the city of New York, will hold a public referendum on the future of the site in September.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has launched a $1 million fund for cultural nonprofits affected by the coronavirus, which has confirmed the coronavirus as the cause of the illness in at least three states. The fund is a response to the coronavirus—which is spread mainly from person to person by breathing in or coughing—and is being organized as part of a partnership that also includes the sale of works by artists, organizations, and individuals.“The partnership’s collective vision of supporting MoCA’s global community of artists is deeply rooted,” said museum director Matthew Teitelbaum. “As the first institution to isolate the virus outside", "The next Biennial should start as soon as possible and will be held at the Paine Webber Contemporary Art Museum in Richmond, Virginia, from November 16 to November 18. Inaugurating the exhibition will be the first public show of work from the forthcoming exhibition “Plastic Birds,” the biennial’s first exhibition.The biennial will be a continuation of the Paine Webber Contemporary Art Museum’s program of exhibitions, residencies, talks, and other programming, which has featured artist residencies, exhibitions, and tours since 1997. The first event to be staged at the museum was “Plastic Birds,” which was staged at the museum in 2009 and 2009’s biennial. The exhibition has hosted artists in various stages of their careers and has showcased their work at various times throughout its history. “Plastic Birds’ first exhibition was in 1989, at the same location as the museum, and with the same artist. The show was an instant success, and the show was so well received by the museum that in 1996, the museum moved the show to its new home in the historic St. Paul’s Cathedral. Since then, the exhibition has experienced many updates and improvements", "The next Biennial should be held in the spring of 2021.  The show’s director, Carolyn Preston, said: “We had long dreamed of an exhibition that explored contemporary art from Spain, the Americas and the Far East, but never had the opportunity to present it. Now we have. We are so excited to share it with you.” \n\n\nArt historian Werner Pritt, who founded the institution, the Institut für Internationale Kunstbild und die Internationale Kunstbildung (IKB), in Frankfurt, has died at age seventy-seven, according to the Art Newspaper. The German magazine added that the cause of death was asphyxiation, a result of the actor’s threesome partner and the psychologist Frankfurt am Main’s Helmut Newton, who was arrested last year after allegedly forcing himself upon Pritt.Born in 1961 in Vienna, Pritt studied at the Academy of Fine Arts in Vienna from 1974 to 1983, and at the Kunsthalle Graz in Vienna from 1987 to 2011, the Art Newspaper said. His books include The Art and the Body: A History (2006), which is divided into three parts: the first, a history of", "The next Biennial should be set in the New Mexico desert, in 2018. Our next exhibition should focus on the history of the polymer arts in the United States, focusing on the emergence and development of the American craft in the late nineteenth century. A selection of works by contemporary artists should be staged at the Museum of Modern Art in New York in 2021.The 2020 iteration of the \"Variations in Serenity\" biennial will take place in the Pacific Palisades in South Los Angeles in September, with the exhibition opening on December 4. The twenty-fifth edition of the Long Island City Biennial, which will open on February 21, 2020, will draw from the contemporary art of the city. Its first organizing architecturally by John Lucas and will focus on interiors, public art, and re-creation. The thirty-fourth Venice Biennale will take place in the city of Venice in May, 2020, with the opening of the exhibition on June 11.\n\n\nThe National Gallery of Canada in Ottawa is planning to open a new digital platform, the National Gallery Network, in 2020. The first digital exhibition organized by the National Gallery of Canada will be a “Take the Fifth” (T4) biennial, which will include works", "The next Biennial should be held in May 2020 and will be hosted in New Delhi. Prizes will be awarded through an online application process. The exhibition’s inaugural season will also mark the first time that the institution is staging a major exhibition in India. \n\n\n\n\n\n\nRICHARD AADY, THE history connoisseur whose international reputation positioned him as the architect behind the landmark installation The Rickshank Project, a massive, two-hundred-foot-tall, sixty-one-thousand-work sculpture made of more than one hundred thousand materials and valued at an estimated $70 million, died on Saturday, March 16, at his home in New York at age seventy-one.Born in New York City in 1941, Richard Aady studied under Alan Lynne at the School of the Art Institute of Chicago, where he earned his master’s degree in 1955. His work, which explores the relationship between landscape and sculptural forms throughout history, has been exhibited at The Museum of Modern Art, New York; the Three Rivers, California; and the Institute of Contemporary Art, San Francisco; among other institutions. His earliest exhibitions consisted of two exhibitions at the College Museum of Art in New York (", "The next Biennial should be held at the Borgst in Basel in October 2021. The festival will be comprised of a series of interactive projects that will invite visitors to experience and experience themselves, and will run both on-site and at the Borgst. This will be the third iteration of the event, which has been held every March since its inception in 1980. The first iteration, which were held in 2002, was penned by Francisco Girotto and Erika Gently and was presented by Robert Gass. The theme of the upcoming edition of the show is “Biological Diversity” and how it affects the flow of life on earth. The inaugural exhibition was staged by Joachim Fries and was curated by Ali Cammock. The exhibition will include a series of pieces created by artists including Agnes Martin, Oscar Murillo, and Wolfgang Paalen; a selection of works by indigenous and international artists; and a special exhibition of work by Taira Altantas, Cécile B. Evans, Karin Hartigan, and Norman Rockburne. In addition, a new introduction and overview of the history of art and art", "The next Biennial should be held at the Museum of Contemporary Art San Francisco (MCAF), in 2020. The 2020 event will be hosted by the restoration team of the Arts and Culture District of San Francisco and will unfold as follows: · Opening Ceremonies:   Wednesday, June 16, 2020· Free Entry for All Ages (May 16–June 17)“The Future of Art ” Thursday, June 18, 2020· Free Entry for All Ages (May 16–June 17) The Future of Art: Art and Future in Transition” Friday, June 19, 2020· Free Entry for All Ages (May 16–June 17) The Future of Art: The Architecture of Existence” Saturday, June 20, 2020· Free Entry for All Ages (May 16–June 17) The Future of Art: A Visual History” Sunday, June 21, 2020· Free Entry for All Ages (May 16–June 17) The future of art and future in transition” MCAF Director and CEO Mike Magee said: “We are thrilled to welcome MCAF’s talented team to the community and to launch this new", "The next Biennial should be held at the University of the Arts, London, in 2020.\n\n\nThe National Art Museum in Ottawa (NMA) has received a gift of 1,500 photographs by American artist Gilbert & George (1874–1985) from a collection that includes works by nearly four hundred artists. The National Gallery of Canada also announced that it sold the remaining works in the collection, which includes artworks by Claude Monet, Henri Matisse, Ed Ruscha, Don Quijote, Frank Stella, and Edward Hopper, for $3,500 in 2017.The works were acquired through a partnership between the National Gallery of Canada and the National Museum of Canada. The NMA is the national custodian of the Gilbert & George collection. The institution previously sold the works in 2016 for $3.5 million.In 2017, the NMA donated the remaining works to the Museum of Fine Arts in Boston. The museum plans to display the work, which was made in a studio in the gallery, in a major exhibition dedicated to the collection in 2020.\n\n\nThe National Gallery of Canada (NGA) has received a gift of 1,500 photographs by American artist Gilbert & George (1874–1985) from a collection that includes", "The next Biennial should take place in the autumn of 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to begin welcoming visitors again next week, following a costly closure due to the Covid-19 pandemic. The institution received $125 million from the California Community Fund in support of its reopening, but it faces an April 26 deadline to reopen.Curator and philanthropist Kiki Smith told the Los Angeles Times that the reopening date will depend on whether MoCA \"makes the investments in the right way.” She added that the museum will need to invest in training and the development of new curatorial staff, and that rehabilitation and preservation work needs to begin as soon as possible.“Our team is committed to making the most of our limited resources and working through the most complex issues,” curator and director Rachael Weil told the Los Angeles Times. “We will continue to do our best to support you, whether you are in person or in email, and will continue to be responsive to requests from the public.”In addition to the March 25 opening date, the Museum of Contemporary Art Los Angeles is pushing back the opening of the exhibition “The Female Body: Contemporary", "The next Biennial should be held in 2020.\n\n\nA group of artists, designers, filmmakers, and creatives are calling for the United Kingdom to leave the European Union. The twenty-three-member group, which also includes art historian Rose Ehrlich, writers  Christopher Hitchens and Tania Bruguera, and philosopher George Williams, have released an open letter calling for the UK to withdraw from the bloc. “The creative economy in the UK is not set up to withstand the consequences of leaving the European Union,” the letter reads. “We therefore call for a UK withdrawal from the European Union and for the UK to become a full member of the European Union.” The letter also calls for a “UK-wide economic and political revival.”In a statement, the art nonprofit the Art Fund said: “As the letter from the artists and designers in this letter is shared, we hope that this letter will encourage you to consider the artists and designers who signed it and encourage you to consider the work that needs to be done to make your voice heard. We hope that this letter will make you think deeply about whether your voice is being heard. We hope that this letter will give you a sense", "The next Biennial should take place in the fall of 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Greg Garcia as its next executive director. Garcia replaces Mary Anne Carter, who retired in February 2019 after nearly four decades at the helm.“We are thrilled to welcome Greg to the MoCA family,” said Mary Anne Carter. “His record of operations and achievements as a leader and organizer make him an ideal fit for this critical role. His proven track record of delivering innovative and transformational experiences for our guests and community makes him the perfect person to build on our strong legacy.”The seventy-four-year-old administrator and curator served as MoCA’s executive director from 2014 to 2018 and in that capacity oversaw the organization’s expansion to its new home in the historic LACMA complex in Los Angeles; the extension of the institution’s footprint to the west coast; and the renovation and expansion of the center.In a post on Medium, Garcia wrote: “As a visionary curator and educator, I’ve long been interested in MoCA’s role as a cultural incubator for cutting-edge ideas and work in the arts, and have been inspired", "The next Biennial should be held at the Museo de Arte Contemporáneo, in Lisbon, in 10 years' time. According to the Los Angeles Times, the museum is developing a new custom-built, high-tech, artist-designed museum to house the collection. The institution is working with partnerships with the local and national arts and cultural organizations, as well as with the private collections of Leonardo da Vinci, Ana Mendieta, and Ed Ruscha, as part of the project to create a new collection.The museum is also working with the nonprofit Artmobil to create the first-ever public sculpture park in the city of San Francisco. The park will showcase works by artists such as Henri Matisse, Frank Stella, and Frank Ockenfels. \n\n\nThe Manchester Art Museum (MA), England, has appointed Rachel Bennett as its new director. Bennett comes to the institution from the Leicester Square gallery, which she founded in 2008 and later sold to the Tate for $350 million. She succeeds Liz Bowman, who retired in July 2019 following a decade at the helm of the museum.“Rachel’s long history with the museum shows her commitment and ability to take MA to new heights,�", "The next Biennial should take place in 2021.The festival will be hosted at the Stedelijk Museum in Amsterdam and will be led by a team comprising artist, curator, and writer Tobias Lichtenstein, curator of the upcoming exhibition “Post-Modernism,” Katja Flach, and the artist Katharina Holle. In addition to the exhibition and the biennial, at least four other events will be held at the venue, including an open-air workshop for new artists; a public lecture series; and a tour of the exhibit space. The 2020 edition will be held at Rijksmuseum Amsterdam.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that Amanda Rose-Like, who has served as the curator of contemporary art exhibitions at the institution since 2004, will be the next MCA director. She succeeds João Maradís, who left the institution in February 2020 to become the director of the Museum of Modern Art in New York.“While it’s been a joy and a privilege to work with Amanda, her curatorial career has been the driving force behind her success as a curator and as a matériel\u0097she has been instrumental in elevating our", "The next Biennial should be in December 2021. The first was held in September 2018, and the last was in March 2019. While the fourth arts biennial, curated by Maia Biennale, will take place in March 2019, the Venice Architecture Biennale will be held in March 2022. All of these events will be supported by the Alliance of Italian Art, the Italian Ministry of Culture, and the Mayor of Venice, Luigi Brugnara. The first edition, curated by Lino Brugnara, was held in June 2019 and the last edition, curated by Fabio Solmi, was staged in March 2020. The new dates are based on the assumption that the new exhibition Season of the Horse will open on January 31, 2020 and end in March 2021. The Venice Architecture Biennale will be staged in the city’s Museo del Prado from February 29 to March 19. In addition, the venue will stage the first exhibition of Laureate director Stefano Boetti’s work in Italy since the 70s, and the first show in the country of Bali. The exhibition will be accompanied by a museum exhibition featuring works by some fifty artists, including both selected and unsalaried,", "The next Biennial should take place in the early 2020s and will consist of different works, such as a new exhibition of photography and video art by US artist Bruce Nauman, which was staged at the Los Angeles County Museum of Art in 2016. Both the Los Angeles County Museum of Art and the San Diego Museum of Art will announce the theme and the artist selected for the short-lived exhibition, which will run for thirty days. “I’m excited to see how the artists come together in San Diego,” said Lorenzo Fusi, the museum’s chief curator. “The Californian landscape is filled with pivotal moments when radical experimentation is possible. These works and others from the exhibition will illustrate how a critical imagination can change the course of a landscape, as in the case of California. In this case, the work is by Bruce Nauman.”The 2017 project, California: From Landscapes to People, explored the relationship between landscape and people in a series of photographs. It was staged at the Los Angeles County Museum of Art, the Los Angeles Public Library, and the Los Angeles County Museum of Art. \n\n\nThe Library of Congress recently approved a series of landmark conservation projects for the", "The next Biennial should be held in 2021. \n\n\u0097  \u0097  \u0097    \n\n\nThe French Ministry of Culture plans to establish a new monument to the victims of the devastating terrorist attack in Paris on November 13, 2015, and will begin the process this week. The announcement follows a year-long campaign led by the museum, backed by French President Emmanuel Macron, to raise awareness of France’s role in the conflict that followed the attack, which remains unresolved.The new monument will honor victims of the siege, which lasted for nearly four weeks, and will depict the cityscape of the ancient city, which is located in the Bourse de Commerce in Paris, in flames. It will also include a long gallery for the museum’s permanent collection. The proposal for the monument was shared with the public in June, with the history of the site marking a turning point in the museum’s history. The plan was first presented by the museum in a public ceremony in September, and is being implemented by the Culture Ministry. \u0097  \u0097  \u0097   \n\n\n\n\nThe Smithsonian’s National Museum of African Art (NMAA) in Washington, DC,", "The next Biennial should take place in the summer of 2021.\n\n\nThe Metropolitan Museum of Art (Museum) of Art, the New York institution that recently undertook a $1 billion renovation and expansion project that added two levels of galleries and opened a new artists’ residence in midtown Manhattan, has announced that it will welcome visitors once again in the spring of 2021. The museum will also expand its collection through the sale of works by artists who have not previously been on display. Its new exhibition series, “Art after the Fall: Art in the Eighties,” will present works by artists who have had work removed from exhibition in order to avoid litigation. The exhibition will also include the exhibition “Art of the Century” (2019), “Art of the Middle: ‘Seth Dorsky’s ‘The Name of History’” (2017), and “Art of the First: The Modernist Sculpture” (2017–18).The institution also revealed that it is preparing to reopen to the public in the fall of 2021. The opening of the museum is being marked with a biennial “New Year” celebration. According to the New York Times, the opening of the", "The next Biennial should take place in London in 2021. The date was changed in an attempt to make it more palatable for the British government to suspend its annual grant of £7.4 million to the museum over concerns over the coronavirus. British Prime Minister Boris Johnson told the BBC that the museum would be able to reopen if the government would guarantee its long-term funding. The museum is currently closed for the duration of the coronavirus pandemic due to concerns over the spread of COVID-19. According to the Art Newspaper, the museum is estimating that it will lose around $55 million in revenue during the first six months of its closure. The National Poetry Collection in London, which is currently undergoing a $120 million expansion, has also laid off or reduced the hours of around one hundred employees. The news comes on the heels of a report by the London-based think tank Artnet, which found that around 40 percent of people who work at London’s Tate galleries are not employed.  The Art Newspaper reports: Tate is facing a loss of more than $100 million if it does not reopen by the May 2020 deadline. The Tate, which announced on Wednesday", "The next Biennial should be held in the year 2033–2034, and the MCH Group is currently developing a new program for an upcoming exhibition of this work, titled “The Truth of Life”–a collaboration of the European and American Biennials.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Allison Mendoza as its new executive director. She will be responsible for building the museum’s board of directors and steering the institution through its next chapter, a budget crisis in 2018.“Alison represents a thoughtful and forward-looking understanding of the museum’s role as an emergent institution that embodies the California dream,” said museum board president and CEO Kim Ghattas. “Her leadership will enable us to collaborate and collaborate in ways we haven’t in decades to address the future needs of our community, and will encourage a more focused focus on curatorial research and the museum’s collection as a whole.”Mendoza joins the institution after serving as executive director of the British Museum in New York City from August 2019 to March 2020. During her four-month tenure, she oversaw a $1 billion overhaul of the museum’s collections and", "The next Biennial should take place in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that Andrea Schoelkopf will become the next chair of its board of trustees. Schoelkopf will be a professor and chair of the Department of Fine Arts at the Graduate Center in Art History at Columbia University. She succeeds Susanne Vielmetter, who accepted the position on June 16 and will begin her tenure in July.“Adriana and I are thrilled to be working with our talented and dedicated board of trustees to help them shape the future of the museum,” Vielmetter said. “We are confident that Dr. Schoelkopf will continue to advance our mission and mission as a room of curators, artists, and scholars with a passion for exhibitions and performances, as well as ensuring the museum’s relationships with our audiences.”Schoelkopf comes to the institution from the Metropolitan Museum of Art in New York, where she has served as a professor since 2002. In 2009, she was named the recipient of the Lisa and Todd Lauterbach Prize. \n\n\nThe National Gallery in London announced today that it will", "The next Biennial should happen in the spring of 2022, after the Paris-Plimated in March.  The next will be held at the University of Oxford, a move that has been described as geographically convenient for a number of UK arts institutions. Organizers were quick to note that the decision to postpone the exhibition was not made lightly and that it was made with a view to maximising the impact of the platform.  \"We are aware that not everyone will be excited by the exhibition at the same time, and we do not wish to make any excuses for anyone who is not able to see the exhibition in its entirety, but we believe that it makes the most sense for the festival to move forward at some point in the future, with the exhibition as a part of the programme at this year’s festival,\" the statement read. The move follows the decision to remove the exhibition sections of the festival from the institution while it worked on a reopening plan following its immensely successful opening in April.Since the exhibition was put back on track, the festival has been attracting increasing numbers of visitors, with crowds of between ten and twenty thousand, and has been showcasing new work by artists. Many anticipated the event would return to the UK following the move", "The next Biennial should take place in 2020. The museum will then reopen to the public for a second edition in 2022. The 2019 exhibition, “Reality in the Movies,” screened at the Museum of Modern Art in New York and attracted more than five hundred,000 visitors.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has received a gift of twenty-nine works from the collection of Anton Chekhov, including The Vase of the Russian Revolution, 1917, and The Sign of a Woman, 1986. Chekhov donated the works in the collection of his wife, Annie, whose father was a Russian Jewish immigrant named Lila Chekhov. In addition to the works, which were part of her father’s collection, Annie’s mother also gave the couple a collection of Russian art.The couple began collecting in the 1980s and began giving the works away to the many families in the Los Angeles area who needed them. The collection includes works by artists who are still living and works that have yet to be displayed to the public.“The Chekhovs are devoted collectors, and their generosity and caring for the art of their community is unsur", "The next Biennial should take place in the summer of 2020.\n\nThe Water Mill in Long Island City, New York, has put out a statement about its decision to remove a painting by artist Mark di Suvero from its collection. The work, which depicts an Italian boat, was set to be on display at the museum last fall, but was never installed. The artwork, titled Arte Povera, or World Without Paintings, was part of a series by the artist in which he painted a world without paintings. The show, titled Art in Balance, was organized by the artist and his wife, Anna, in collaboration with artist and collector Yoko Ono. The institution said “over the years, the artist has demonstrated a great talent for drawing and painting in a non-traditional format and for developing and presenting works that were not defined by their medium, Emmanuel Basquiat’s The Different,” in an exhibition at the Water Mill in 2014.The exhibition faced backlash for including the work, which depicts a man with a metal head, and for its inclusion of the work of Basquiat and his wife, Grazia, as well as works by Henri Matisse, Robert Mappleth", "The next Biennial should be held in 2021. \n\n\nThe City of New York approved the sale of 1,050 artworks by thirty-nine artists for the National Museum of Asian Art, which opened in December 2016. The sixty-six works previously on display, which were produced in China, Hong Kong, Japan, Korea, Taiwan, and Thailand, were originally part of the acquisition program of the National Museum of Asian Art, which was founded by James Cameron in 2007.“The National Museum of Asian Art is an innovative institution that brings together the most important and underappreciated works of contemporary Asian art, in a central location, onsite, and with real community support,” said Mayor Bill de Blasio. “With the sale of these works and the upcoming reopening of the Museum of Modern Art, the city has made it easier than ever for New Yorkers to experience and appreciate the work of these artists.”Including the works on display—which range from the contemporaneous to the contemporary—the twenty-third edition of the National Museum of Asian Art will open on October 29. The exhibition will be inaugurated with the exhibition “In the Time of Strangeness”, a contemporary installation by", "The next Biennial should include the exhibition of work that is currently on display in the exhibition “Inner Life: The Art of Living,” which currently has a curatorial team of Li, Tung, and Tung, and will be held in the BAM Collection in the city of Beijing from March 18 to March 20.\n\n\nThe sixteenth edition of the Venice Biennale, which opened yesterday in Downtown Venice, has announced its full list of artists participating in the event. The thirty-six artists in the ten-day event were chosen by a jury comprising artist Emmanuel Trockel, director of the København Museum in Denmark; Kjetil Hjortenberg, director of the Flemish Folk Museum in Erfurt; and artist Andreas Knapp, director of the Museum in Kiel. The jury was composed of artist Kjetil Hjortenberg, artist Andreas Knapp, the curator of contemporary art at the Museum in Kiel; artist Stefan Spiegler, the curator of modern art at the Neue Galerie in Berlin; and the artist and curator of contemporary art in the Netherlands, Martijn Tapp.Other than a few notable absentees, such as the Polish and Russian artists ​", "The next Biennial should focus on “the architecture of the body and the body of art,” the artist said. “I hope that the ten-year cycle will invite us to rethink the role of art, and so we will not only be able to create new art, but art that will also change us.”\n\n\nThe William Shakespeare Company is planning to stage a production of Richard Linklater’s The Visit at the Cambridge Arts Centre (CAC) in Cambridge, Massachusetts, in 2020. The adaptation of the play The Visit is based on the novel The Visit (1992), of which Linklater is the author, and will take place in four locations throughout Cambridge: the CAC, the CAA, the CAA2, and the CAA. Each venue will host an equal number of actors and there will be a total of twelve plays. Linklater will be a soloist.“We are delighted to be partnering up again with the CAC, the CAA, and the CAA2 for a biennial of the play,” said David Mullen, the director of the CAC. “The Visit is a timeless tale of an impulsive young man who's accompanied by a beautiful", "The next Biennial should take place in the United States in 2020.  The artist-run museum will also host an international exhibition of works by artists such as Renzo Piano, Jessica Conant, and Pierre-Auguste Renoir. \n\n\nThe National Gallery of Canada (NCFC) in Ottawa has received a gift of twenty-six works by the late artist and feminist activist Tina Turner. The gift, which came from the Turner Family Foundation, includes paintings, sculptures, and installations by Turner (1905–1976), The Abolitionists (1986–1990), and The Beatles (1964–1966), among others.In addition, the gallery received six works by Turner’s protégé, Dorothea Rockburne, who organized “Strawberry Fields,” 1972, and “A Light in the Panorama,” 1987, after the artist’s death. The latter piece, a set of twelve paintings by Turner, is currently in the collections of the British Museum and the Metropolitan Museum of Art.The Turner Family Foundation also donated twenty-five works by Turner’s niece and collaborator, the British artist Hazel Herring. The gift includes six works by Herring’s", "The next Biennial should take place at the Düsseldorf Museum of Art, Germany, in the spring of 2020.  The next edition, titled Headlands, will take place at the Margaret and James Nonis Museum of Art, Denver, Colorado, in the fall of 2020. The next edition of the Detroit Projects, will be held at the Detroit Institute of Arts (DIA) in the spring of 2021. The next edition of the Woodward Art Museum in Grand Rapids, Michigan, will be held in the summer of 2022. The next edition of the Museum of Contemporary Art Chicago will be held in the fall of 2022. The next edition of the Contemporary Art Museum St. Louis, Missouri, will be held in the fall of 2022. The next iteration of the National Gallery of Art in Washington, DC, will take place in the fall of 2022. The next edition of the Jim Thompson Art Museum in Tulsa, Oklahoma, will be held in the fall of 2022. The next edition of the National Museum of African Art at the University of Washington is scheduled to open in November 2022. The next edition of the Metropolitan Museum of Art in the capital of the United States, in the fall of 2022,", "The next Biennial should be held at the Museum of Modern Art in New York in 2022.\n\n\nThe National Endowment for the Arts (NEA) is asking the government to create a new $3 billion fund for arts and cultural organizations amid the Covid-19 pandemic. The funding comes from a special levy approved by Congress in 2016. The funds are slated to run out in 2021, but the agency anticipates a further funding shortfall in 2022.“One of the many challenges facing the National Endowment for the Arts (NEA) is managing the different levels of collaboration and cooperation between our arts and cultural institutions as they respond to the Covid-19 pandemic,” said NEA director and CEO Cara Doran. “The new funds will enable us to continue to deliver an outstanding national collection of arts and cultural heritage, while protecting critical funding for critical programs that strengthen and support arts and cultural life.”The NEA’s 2018 fiscal year ended September 30. The agency had previously earmarked $3.7 billion for arts and cultural preservation, reconstruction, and modernization as part of a $8 billion federal stimulus package enacted in 2016. The NEA had previously earmarked $2.5 billion for", "The next Biennial should take place in 2020).In the meantime, the museum is working with the Chicago-based artist, activist, and curator Ilana Solomon, who was also awarded a $10,000 honor at the event, to create a new work that will examine the deep connections between art and technology. The artist will create a three-dimensional digital model of the museum so that visitors can experience the museum through the artist’s eyes. The work will be released in mid-October.The full list of the 2020 honorees is as follows:Design Art Center, Chicago, and the National Endowment for the Arts’ New York City-based design organizations: Bettie Aitken, Chicago; Cindy Halborn, Miami Beach; Claudia Bullock, New York; Ed Clark, Chicago; Claudia Bullock, New York; Eric García-Real III, San Francisco; Aaron Gilbert, New York; Amy Herzog, San Francisco; Jean-Marc Leclair, New York; Kasimat Fallah, Dubai; Kate Fabian, Chicago; Valeria Zuleta, New York; Chandra Georgi,", "The next Biennial should be held in 2020. The show will feature the works of twenty-four artists and will present the winner of the first biennial, Saba Mahmood, and will also include the work of two new artists, Umar Farooq and Hishamat Ali. The exhibition will run for twelve months. The 2020 edition of the Biennial will be organized in partnership with the Museum of Contemporary Art Dubai and will run from June 6–June 12. \n\n\nThe Museum of Contemporary Art (MoCA) Japan has revealed that the institution will hold its first exhibition in the country since the global pandemic is over this fall. It will be titled “Takeda,” and will be presented at the Tokyo Metropolitan Museum of Art (JMA) from September 9 to September 13, 2020.The show will feature work by thirty-four artists. The first show, “Takeda,” will include work by Hiroshi Hosokawa, a director of the Matsui-based collective the Black Dahlia Group, and will focus on the history of a certain ‘ghost’ who recently visited the museum, which is located on the first floor of the JMA. The work", "The next Biennial should take place in 2020, but the date has yet to be set, and an announcement about its eventual location will be made, as is common with major international events. Dozens of academics, including Makada Kiyotake, Tadao Ando, Yoshitomo Usui, Katsu Kurouchi, and Katsuya Nishimura, and art collectors Hiroki Takagi, Masahiro Kawamura, and Nara Shonibare have signed an open letter addressed to Prime Minister Shinzo Abe, calling for the exhibition to be relocated to a different location in Tokyo. “We greatly value and appreciate your ongoing collaboration with the Biennials Museum of Art and the Tokyo Metropolitan Museum of Art, and we hope that the Tokyo Metropolitan Museum of Art will also participate in this year’s Tokyo Biennials,” reads the letter, which is addressed to Prime Minister Shinzo Abe and is dated March 19. “We look forward to participating in, and supporting, your new exhibition, Tokyo 2020: We are honored to participate in your upcoming Tokyo Biennials. We look forward to watching the exhibition unfold under your robust guidance. We wish", "The next Biennial should take place sometime between March and July 2020.  Subscribe to the Artforum  to be notified when the exhibition is announced. \n\n\nThe National Geographic Society (NGS) in New York has released the list of the ninety-five artists represented in its next major presentation, titled Blackout: A Visual History of the Black Outs, which is slated to run at the Smithsonian American Art Museum (SAAM) in Washington, DC, from April 8–April 10, 2021. Credited with redefining how we think about and experience the world, Blackout will be an exhibition of works from the collection of the late tenured art historian and curator Mary Beard, the late president and CEO of the National Gallery of Art, and will be curated by David H. Goldberg, who was named curator of the show this year.“NGS has long been committed to cultivating a more nuanced, intersecting, and inclusive history of storytelling through the study of the art of the African diaspora,” said Matthew Jennings, the exhibition’s artistic director. “With Blackout, we are creating a new introductory level of exploration and presentation of African art.  We are reaching beyond the historical and", "The next Biennial should, in theory, be completed by the end of the year. The announcement, made at a function at the Innsbruck Art Museum in Austria in the spring of 2018, sparked outrage from some art historians and some artists concerned about the exhibition’s future. The museum, which is currently undergoing a renovation, said that the decision to suspend the exhibition was made at the request of the organizers, who were not involved in the decision to cancel the exhibition. The museum also said that the development of the exhibition was not affected.The contemporary art biennial was founded in 1999 by Wolfgang Geldhof, who had previously organized the show Infinity by Jean Renoir, and Lemme, whose father-in-law had founded the family dynasty that controlled the supermarket chain Aldi. The show was first held in 1998 and has been staged annually since. The inaugural edition, titled “Sensuality and Surrealism” (2017), featured work by twenty-eight artists, including Andre Breton, Agnes Martin, Ulla and Vanesa, and one by Paul Gauguin.\n\n\nThe Sackler family, the industrialists who amassed their fortune through the modern-day whiskey distilleries of Louisville and Cincinnati, are", "The next Biennial should be held in 2020. The full list of participating artists is as follows:ARTICLEI:Alberto Barbera - Thematic for the 2019 edition in Barcelona.Artistic Experience: CURSES Artisānico: Artistic Experience: Encyclopedic|Artistic Experience: The First Man (2017)Artistically Experienced: Artistic Experience: Avant-Garde’s Art and the Art of ’19 (2015)Artistically Experienced: Encyclopedic: Artistic Experience: Bibliothèques’ Remerci and the Art of Artistic Experience (2018)Artistic Experience: Artistic Experience: Convergès: Artistic Experience: Artistic Experience: Artistic Experience: Artistic Experience: Artistic Experience: Avant-Garde’s Art and the Art of Artistic Experience (2018)Artistic Experience: Artistic Experience: Artistic Experience: Artistic Experience: Artistic Experience: Artistic Experience: Artistic Experience: Artistic Experience: Artistic Experience: Artistic Experience: Artistic Experience: Artistic Experience:", "The next Biennial should be held before the end of the decade, and will feature fifty works from the exhibition, which is currently on loan to the Ministry of Cultural Affairs and the National Museum of Fine Arts in Beijing.The CCP’s previous flagship exhibition, “A Contemporary View of China,” staged in Beijing in 2008, was canceled following the country’s sixth-consecutive massive anti-government protests. Though the event was restarted in 2017, it was not until 2022 that the CCP finally brought the exhibition to Beijing and staged it in the capital.\n\n\nThe Kassel-based nonprofit space Petronas’ new subsidiary, Petronas Workspace, has appointed Jan Borken as its new executive director and chief curator. Borken will take up the post in February. Previously, he was the artistic director of Kunsthalle Basel, where he developed the platform for exhibitions and music and curated several shows.“Borken is a true visionary and has been integral to the development of the Petronas Workspace as a platform for artists and museums to present their works in a contemporary and international context,” said producer Petra Kassel. “Borken’s relationship with the", "The next Biennial should take place in 2022–23. The 2019 edition, titled “The Commons,” was held in the Solomon R. Guggenheim Museum in New York, and the organizers of both events are aware of the initiatives #metoo and “sustainability” have introduced to gain awareness of the plight of the environment and the environmental issues of our world.“I’m excited to do a biennial project centered around the themes of the ‘20s and explore how art and culture are impacted by issues like climate change,” said Laura Mulvey, director of the museum. “These themes are particularly relevant for us in the Pacific Northwest, where we have the unique opportunity to reflect upon the natural world through art, and how art, and art history, and culture can shape and shape again.” The 2019 event, titled “Art in the Air,” explored the interconnected relationships between atmospheric art and art history and its relationship to climate change, and was held at the Hauer & Bartlet building in the arts district of New York from January 19 to January 23, 2020.The 2020 biennial will be curated by Oliver Higgs, a curator and art historian who curated the", "The next Biennial should be held in 2019.\n\nThe exhibition is curated by Jonathan Goldblatt from the Tate. The sixteen artists selected for the 2020 edition are: Carlos Álvarez Hernandez, Ariana Alkmaar, Nino Borghi, Marilyn Maas, Sami Musil, Rizkal Karimi, Tarasup Mukherjee, Sunjeev Mathur, Sudheeta Mukherjee, and M.S. Rajagopal.\n\n\nThe British artist Rebecca Black, who experimented with her body in paintings, videos, installations, sculpture, and performances, died on February 3 at the age of seventy-nine. She was commissioned by the Tate to create the work, titled The Body, for a retrospective titled “Beyond the Body: Art and Body Politics,” in 1977, and was told that the installation would be “a celebration of the artist’s body as well as the body politics of art.” The body politics of art are central to Black’s conceptualization of art history and her own practice. “I’ve always regarded my body as a kind of history of art,” Black said in a 2014 interview. “My work", "The next Biennial should be held in the spring of 2022.The museum’s current exhibition, “chronicles the evolution of modern art from the eighteenth century to the present. Each year, the collections will present a new story, highlighting the contributions of one hundred artists selected by curator of modern art, Muys Snijders, and the awardees of the year 2020.”In addition to the annual exhibition, the museum has three other programming programs that are currently running concurrently: a symposium on art history, a special exhibition of work by the twentieth-century British, and an online masterclass. The biennial will also continue to be held.Last year, the biennial received a major award from the Royal Academy of Arts (RA) of Arts, the British Royal Historical Society, and the Royal Institute of British Architects. The academy said that the exhibition “provides a unique example of the modern art movement, offering a glimpse into the heart of art for those interested in the subject.”The museum is also developing a new digital experience that will allow visitors to the museum to revisit works on display in their private viewings rooms, and will introduce a new kind of interactive 3-D experience that will allow visitors to experience the", "The next Biennial should attempt to assess the current state of the art in museums and how it might inform the design of future exhibitions. In addition, it should include recommendations for how the exhibition should be organized. \n\n\nThe Shanghai Museum of Art (SMAC) is planning to close its doors on March 31, 2020, to allow the institution to undergo a major renovation and expansion project. The new building will incorporate a 1,700-seat auditorium, an extension of the collection, and an auditorium that will double the exhibition space. The institution’s holdings, which range from the nineteenth century to contemporary art, and the collection and exhibition spaces that will be part of the project will be transferred to the northern part of the museum.“The SMAC’s collection, exhibitions, and collection-based experiences are strongly rooted in Chinese culture and history and we are convinced that the renovation process will help maintain the SMAC’s historical integrity and the theme of ‘spaces’ in the museum,” said SMAC director Yang Liu. “We look forward to the eventual opportunity to present the collection in a new environment as well as the new exhibitions and experiences.”The new space will be inaugurated by a", "The next Biennial should be held at the end of June 2020, and the 2019 and 2018 editions were held at the end of October and the end of November respectively. The 2020 edition will also feature a new mission statement dedicated to the history of architecture and design in the context of a new millennium, an exhibition of new works by artists whose works have been selected for the 2020 biennial, and the reopening of the museum in conjunction with the inauguration of the fifty-eighth edition of the Golden Lion.The 2019 and 2018 editions of the Biennale were curated by Kristen Anderson-Towner and Nick Beach, respectively, and were staged at the new museum “in partnership with the Los Angeles County Museum of Art, the Museum of Contemporary Art, Los Angeles, and the National Gallery of Art.”The 2019 edition of the Biennale was organized as a “museum for people to see” with the help of a group of local and international curators. The curators selected six works by thirty-nine international artists, including Anton Kerns, Fanny Pendergrass, Jodi Picoult, and John Henry Newman. The exhibition will also feature the work of twenty-three artists from eighteen countries, including Belarus, Armenia, South", "The next Biennial should be held at the earliest opportunity. It will be able to draw a large and very vocal audience. We should remember it as the last chance for the Swedish people to see and hear the works of Michelangelo and Raphael. We should also remember it as the last chance to see and hear the operas by Johann Sebastian Bach and Anna Franke. I hope that it will not be forgotten. I hope that it will be transformed into an important collection of works by the foremost present and future Swedish composers. I hope that it will become a model to other countries in that way.” The new exhibition will be curated by the Swedish artist and screenwriter Arne Gjästervik.\n\n\nThe Metropolitan Museum of Art in New York has opened an investigation into whether the institution mishandled the sale of works by German artist Georges Apostu, a leading member of the Bauhaus movement, in a deal that valued the artist at around $7 million. The investigation will examine whether the museum made false statements about the sale, which occurred in 2019, reports the Art Newspaper.The New York Times reports that the investigation will determine whether the charges against the Met are unconstitutional and will publish a final report by the Met in the coming", "The next Biennial should unveil a new craft at the institution in January 2020. The museum hopes to host the inaugural exhibition of the new initiative, “The Place,” in January 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than 4,000 photographs by Cassandre-Louis Chedid’s famed “Legacy of a Woman,” a series that explores women’s representation in American art, from the artist’s son, Michael Chedid, who is now a senior curator at the Los Angeles County Museum of Art (LACMA).The donation, made by the Chedid and his wife, Kate, coincides with a three-year grant program through the LA County Arts and Arts Initiatives (LA CA), which is supporting the construction of new outdoor spaces for the museum. The goal of the program, called “The Place,” is to present Chedid’s works in an outdoor setting in order to better engage visitors to the museum, who are often drawn to the show’s intimate interior settings.“The Legacy of a Woman,” was photographed by Chedid in her studio in Los Angeles", "The next Biennial should take place in the Summer of 2020. Artists for the upcoming edition will be announced in the coming weeks.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of eighty pieces of Egyptian art from the Egyptian Museum of the American Renaissance (EMRI), in Cairo, Egypt. The donation includes forty-two works, including works on paper and wood, as well as “Arabs,” an 18th-century work on paper dating from the reign of the Prophet Muḥammad (1924–1977), and “Al-Kindi,” a piece on paper dating from the reign of King Farouk (1919–1977).The works were gifted to LACMA by the Antiquities and Culture Foundation (ACF), which was established in 2007 to preserve and present the works of the late Egyptian director and sculptor Naguib Saad. Saad, a researcher and avid collector who was an avid collector of Egyptian art, was one of the founders of the institution, which was founded in 1922 to support the institution’s artistic mission through the acquisition and display of works by Egyptian artists. For the last four years, it has been working with curator", "The next Biennial should be held at the Stedelijk Museum in Amsterdam or the KW Institute for Contemporary Art, the National Museum of Fine Arts, the Museum of Modern Art, the Museum of Contemporary Art, and the Centre Pompidou in Paris. The first edition of the exhibition will be held at the newly renovated National Museum of Fine Arts in Paris in 2021.As the biennial moves into its third year, the exhibition will continue to present a variety of works by female artists, including Hanna Rosas, Minayan, and Leila Weems, as well as new works by artists from underrecognized regions such as the Philippines.\n\n\nThe museum has created a new position for an artist-in-residence in its program of cultural exchange to the United Kingdom following the Brexit vote, which sees the UK negotiate a departure from the European Union. The UK’s chief artistic representative, Jo Brand, will be asked to create a new residency program for artists. The concept of the position, which is part of the UK’s official Brexit strategy, has yet to be developed.“We are currently in the earliest stages of setting up the new residency program and its impact will be felt across the country—particularly at a time", "The next Biennial should take place in 2019 and will go on to hold a series of exhibitions and residencies that will culminate in an exhibition at the heart of the institution in 2020. “The Biennial is a platform for social change, a vehicle for reflection, and a platform for dialogue,” said Domenick Fusi, director of the Italian Cultural Institute, in a statement. The Biennial will only be inaugurated in 2019 and will be closed to the public from January 2 to February 1.\n\n\nThe Guangzhou Jewish Museum in China has announced that it is temporarily closing its doors to the public in an attempt to reduce the number of visitors it expects to visit in the months leading up to its reopening on March 11. The museum, which had previously been considered one of the world’s great cultural institutions, had previously faced a similar fate after it closed in March 2019 following a devastating fire, but it has since been able to reopen and has been able to stage large-scale exhibitions since then.An exhibition of works by the legendary Chinese artist Lei Wanying, entitled “Shenzhen: The Laundromat,” will open in March 2020, and a new show of his work, �", "The next Biennial should take place in New York, in 2021, and will be presented by the architect and curator, Olafur Eliasson. The theme of the exhibition will be “In Defense of Life, Consciousness & Creation” and will focus on the philosophical foundations of the existence of the Absolute.Commenting on the theme, Eliasson said: “This is an hour of crisis for the physical universe, an hour of crisis for the earth, an hour of crisis for man himself. But first, for the first time, for the human understanding of itself as a living entity. The exhibition will be designed to challenge the ways in which the mind and body are connected. It will be an occasion to reveal the limits and the limits of the body, to embrace the contradictions of the body and the mind. It will be a place to listen to and to be heard, to experience and to transform the world.”Elijah Miro, the director of the Biennial, said: “It was an honor to join the talented team at Miro + Filsch, who have built a huge and dedicated following for the platform over the last fifteen years, and receive their support in this way. Now more than ever", "The next Biennial should be held in 2021 at an appropriate venue, such as the Museum of Contemporary Art, New York and will include a selection of works by contemporary artists such as Frank Gehry, Roger Deak, and Miró. The year 2022 will mark the centenary of the birth of Karl Kapp, a German Jew who was born in Berlin in 1845. Kapp was deported to the Soviet Union in 1940 and died in exile in Switzerland in 1952.In a panel discussion at the Biennial on March 20, Buckner said that the 2019 event, which was staged at the Vogue Hong Kong and curated by Alexander Glimcher, had been organized to reflect the “historic moment,” given the current political climate. The event was also meant to coincide with the start of the commemorative year, which, according to Buckner, is now “only two and a half months away.”The 2018 event, “The Future Is Present,” saw twenty-three works by artists including Adam Pendleton,  Wangechi Mutu, and Tawana Naidu. The 2019 event, “The Future Is Present,” will have the same theme. It is rumored that", "The next Biennial should focus on the relationship between art and society and will consider the interconnections between the physical, the natural, and the spiritual worlds. In addition, the Art of the Future exhibition will address how new technologies, including artificial intelligence and robotics, are transforming our world, and the upcoming exhibition “Art in the Future: The Next Mass,” will present works by artists such as Paul Gauguin, Luis Buñuel, and Jean-Luc Godard.“While many art institutions have been established to serve the needs of industrial and commercial audiences, the future of art and culture lies with the artists,” said the festival’s director, Mary Anne Carter. “We look forward to participating in the next Biennial in our place of worship and hope you join us in celebrating our legacy of provocative exhibitions, extraordinary exhibitions, and exhibitions that have challenged preconceptions and established the boundaries of art.”The 2019 event, titled “Art and the Future: The Last Days of Miriam and I,” will be held at the Church of the Holy Sepulchre in Rome. The exhibition, which will feature thirty-three works by forty-two artists between 1979 and 2013, will be organized", "The next Biennial should be held in 2021. The new structure will be located in the city’s Pacific Palisades, a 1,300-acre enclave between the Pacific Ocean and the city of Santa Monica. The news comes during a time when the city’s art is experiencing a moment of transformation.New York’s Metropolitan Museum of Art (MoMA) announced on Tuesday that it is planning to remodel its current museum in the city’s Tribeca neighborhood. The plan is part of a larger $450 million overhaul of the institution, which will incorporate the museum’s collection, exhibitions, and visitor experiences. Artnews reports that the $120 million overhaul of the Whitney Museum of American Art, presented as part of a $125 million overhaul of the Metropolitan Museum of Art, is still on track for completion.The $130 million overhaul of the Hirshhorn Museum is also ongoing. New paintings by Russian Impressionist Anton Chekhov will be added to the Hirshhorn’s collection. Additionally, the institution will welcome back the works of Italian painter Casanova Borghese, the Italian artist who created the monogrammed Italian pavilion, and the artist who created the French Pavilion, Michel LeBlanc", "The next Biennial should take place in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed the thirty-nine-year-old American painter and sculptor Jack Hennings as its next president. He succeeds Susan Matthews, who took up the post in January 2019.“We are extremely pleased to welcome Jack, whose deep experience and commitment to the museum make him uniquely qualified to lead us through this challenging and exciting time,” said MCA’s director Lynne Bonta. “We can’t wait to get started.”Hennings, who recently won the Prix de l’Amitié (France) for his work “No Shortcuts,” is the founder and artistic director of the nonprofit the Center for Modern Art (CMA) in Philadelphia; the Museum of Modern Art (MoMA) in New York; and the Museum of Contemporary Art (MoCA) in Los Angeles. He is also a cofounder of the art-centered nonprofit the Artists’ Saving Project (ASP), which provides financial and other support to artists whose work is in danger of being lost or destroyed.“We are grateful to the C", "The next Biennial should take place in the autumn of 2020, and the theme should be “Emergence.” The announcement of the biennial was made at a commemoration ceremony for the anniversary of the end of World War II, which was in March. The biennial was organized under the leadership of legendary curator Joachim Neugroschel, who was one of Biennale South Africa’s founding members. Neugroschel successfully lobbied for the institution’s inclusion in the fifty-ninth edition of the pavilion, which opened in June 2019. The biennial will take place on the ground floor of the former United Nations building in Durban, South Africa, and will focus on the legacy of the Nazi regime. “The Biennale South Africa pavilion is a vital contribution to the fight against the insidious threat of racism and racism-inspired violence, undermining the radical notion that racism is a global threat,” said Alexis Agnes, director of the Creative Laboratory. “The Biennale South Africa pavilion is a powerful act of resistance against the global scourge of racism and the pandemic. It is an act of reflection on our history, a reflection on the world we live in", "The next Biennial should take place in Miami Beach in the summer of 2021. The 2019 edition, titled “Selection,” featured more than fifty artists and gained attention for its selection process. The award-winning artist and poet, Rosalind Wiseman, a founding member of the museum’s advisory board, described the event as “a celebration of the work of women and African American artists.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has removed a sculpture by the late Los Angeles–based conceptual artist Erma Bombeck that was part of a series of works that were part of a project that challenged the assumptions of contemporary art, art history, and art history, the arts, and the academy, and turned art history itself into a mode of public education.In a statement issued on Tuesday, the institution said that the work\u0097originally titled “California Dream,” which was part of “California’s Dream,” a series of paintings that was completed in 1996\u0097did not meet MoCA’s standards of modernism, abstraction, and sculpturality. “Their’ opinions, beliefs, and practices are not aligned with our mission of celebrating", "The next Biennial should take place in 2021 and will host a selection of works by a select group of the fifty-six artists who were awarded the Nobel Prize in Art in 1989. The biennial’s organizers, the Swedish Foundation for the Arts and the Hirshhorn Museum, have yet to publicly announce a date for the twenty-fifth edition of the exhibition.\n\n\nThe Pérez Artes in Madrid, the city of the world’s most important contemporary art museums, has announced that it plans to shutter its doors on August 19, 2021 following a major renovation. The Pérez Artes, founded in 1963 by architect María Berrío, and the Casa de Arte Contemporáneo in the city of Campeche, in the municipality of Piedras, have been working together to plan the renovation for nearly a decade, and this marked the first time the museums collaborated.The renovation, which will be led by architect Daisuke Baba, will include the upgrading of the facilities of the Pérez Artes, as well as the renovation of the Casa de Arte Contemporáneo. In addition, the museum will introduce new exhibitions based on the artist’s", "The next Biennial should take place in 2021 and will include ten works nominated by the public for the prize. The winner will be chosen by a jury comprising Diana Batista, director of the Biennial; Etienne Ney, director of the Biennial de l'Institut de Paris; Emmanuel Séguin, president of the Biennial de l'Homme; and Jean-Marie Walshe, the winner of the Silver Lion in 1997 for his exhibition “Les Tribes du Coeur.”\n\n\nIn a major blow to the collective museum’s longtime international reputation, the Royal Shakespeare Company (RSC) in London has canceled a major tour of the company’s new venue in Stratford-upon-Avon, England, due to concerns over the coronavirus. The company issued a statement on Monday expressing its “deep concern at the rapid spread of Covid-19 and its potential to affect our work and our travels.”The decision to cancel the tour follows a wave of public health warnings about the virus in the United States and the UK, and was made after the Royal Shakespeare Company (RSC) received some 2.5 million Covid-19-positive", "The next Biennial should focus on the contribution of African artists to the development of the art world in South Africa and the United States, among other countries, and on the current exhibition program. \n\n\nSinger-songwriter and artist Liège-born, French-Brazilian, and Berlin-based artist Alexis Zouma has been selected as the winner of the 2020 Pulitzer Prize in Arts. The $60,000 prize, awarded by the the Pulitzer Center on Crisis Arts, was announced by Pulitzer Prize Foundation president Mark F. Abrams and Pulitzer Prize board chair Charles Ehrlich, Jr. Liège-born, a Brooklyn native, is the first English language winner of the Pulitzer Prize. The poet and playwright was selected for her poem \"Ghosts,\" 2017’s eleventh Pulitzer Prize, and for her writing on the life and death of Soviet dissident artist Aleksandr Solzhenitsyn, and on the lives and work of American Indian artist Walter De Maria.Liège-born, who will deliver her first poem at the prestigious awards ceremony at the Saint Louis Art Museum on April 7, 2020, will receive $60,000 in support of her prize-winning candidacy. The winning artist will receive a cash award of", "The next Biennial should be held at the Anais-Bicocca in Rome, in late December, and will include several new works by artists such as Marc-Olivier van Heijlen and Maarten de Kooning.\n\n\nThe Center for Contemporary Arts (CAA) in New York has appointed Samuel Riggs as its next director. Riggs comes to the institution from the Museum of Modern Art (MoMA) in New York, where he previously served as director of exhibitions and education. Prior to joining MoMA, Riggs served as director of curatorial affairs at the Brooklyn Museum, where he taught art history from 2009 to 2012.“Samuel Riggs is an extraordinary curator and an accomplished art historian who has played a significant role in shaping the Museum’s curatorial program,” said museum director Christopher Campbell. “We are thrilled to welcome him to the CAA and to continue his legacy as an institutionally recognized expert in contemporary art. We look forward to working with him.”Previously, Riggs served as a curatorial staff member at the San Francisco Museum of Modern Art (SFMoMA) from 2002 to 2009 and as a lecturer at the Rhode Island School of Design from 2006 to 2009", "The next Biennial should take place in 2020.  The full list of participating artists is as follows:Brutus Mager, Berlin: Max Mehrich Gallery, Chicago: Sister Academy, New York: Max Mehrich Gallery, New York: Sidney and Lois Pyle Foundation, New York: Sidney and Lois Pyle Foundation, New York: Geneva Contemporary, Geneva: Fabienne Beauharnais, New York: Sidney and Lois Pyle Foundation, New York: Pristin Contemporary, Paris: Brillianto Bongi, New York: Sidney and Lois Pyle Foundation, New York: Lorena Bonsu, New York: Sidney and Lois Pyle Foundation, New York: Marlene Bonsu, New York: Mercedes Bonani, New York: Sidney and Lois Pyle Foundation, New York: Catherine Babineaux, New York: Sidney and Lois Pyle Foundation, New York: Tarek Bensimon, New York: L'Art Escrits de Paris: Sidney and Lois P", "The next Biennial should be held at the end of the third quarter of 2019.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Elizabeth Banaji as its next executive director. Banaji comes to the organization from the Boston Museum of Art, where she has served as interim director since October 2019. She succeeds David Sullivan, who was hired by the MFA as its director and chief curator last February.“Elizabeth is a seasoned leader who has led MFA through a number of challenging times,” said director Michael Govan. “Her leadership qualities, vision, and energy make her a strong fit for the future of the museum, and for the role of a curator. We are thrilled to welcome her to the MFA.”Prior to joining the MFA, Banaji worked as a curatorial assistant at the Harvard Art Museums, where she helped organize “In the Age of Blackness: Painting Black, 1965,” a show that was included in the ’70s exhibition “Feminine/Male: Painting Women, 1965” and was the recipient of an award in 1995 for excellence in art criticism from the American Association of Art Museum Directors.Commenting on her new role,", "The next Biennial should mark the transfer of the Museum’s holdings from the former National Gallery of Art in Washington, DC, and will be celebrated as part of “The Visitor Experience,” a $10 million initiative that will target the homeless and will run from March 22 to March 27.The exhibition will include works that examine the museum’s holdings of artists that have never been on display, as well as works that have recently entered collections. The majority of the works in the exhibition will be on display in the Museum’s current exhibition “Diana Alighier: Black, White, and Yellow: Reflections of a Canal.” The exhibition will also include original works by artists that have yet to be exhibited, and will include a reception for the public at 7 PM on March 22.In a press release, the museum said: “In recognition of the significant contributions made by Diana Alighier, Peter Wieder, Pierre-Luc Godin, and others during this fifty-year period, the Museum has made the highlight of her work, which has been transformed into a seven-thousand-piece monument to them. This year’s exhibition will include two works by the late artist Judith and", "The next Biennial should be held sometime in the second half of the year. The institution has also pledged to double the museum’s current exhibition space so that it can be used by longer-term projects.\n\n\nThe Whitney Museum of American Art in New York has appointed Frances Rossoni as its new deputy director of collections and exhibitions. Rossoni comes to the institution from the Chicago-based firm of Miriam and Ira Lubin, who has represented the museum in various capacities since 2014. She succeeds Sarah Schroth, who was hired to the position in June.“Wilmington is thrilled to welcome Frances to its team,” said director David McAteer. “Her deep experience, passion, and knowledge will shape the future direction of the museum as we work collaboratively toward transforming the building. Her appointment furthers our commitment to the collections and exhibitions program in a way that will make them even more relevant and exciting to the public.”Schroth came to the institution in 2016 as a curatorial assistant. In 2017, she was promoted to assistant curator, and she became the first person to helm the museum’s collection of nineteenth-century art. In 2018, she was hired as director of exhibitions and collections.Commenting", "The next Biennial should be held in 2021. \n\n\nThe Art Newspaper reports that the Los Angeles County Museum of Art (LACMA) is planning to shutter its doors permanently in March 2022. The institution’s director, Marc-Olivier Haussmann, told the publication that, in light of a projected $143 million shortfall in funding from the California Community Foundation (CCF), the institution will have to revamp its current programming in order to stay open.“We are in the process of designing a new exhibition that will enable us to present a new series of works by a different contemporary artist each week,” Haussmann said. “The theme for the 2019 edition was ‘Embedded in Life: Art in the Age of Black Power’\u0097and for the 2020 edition we wanted to present an ‘Art of the Absurd.” The institution will begin presenting works by artist-in-residence Christina Hausmann, a Brooklyn-based artist known for her high-concept, often surreal installations, in April. The California writer-in-residence will be remembered for her ​series of short, three-minute works, “When Solidarity Is Not Enough,” from", "The next Biennial should be held at the museum within eighteen months of its opening, and should take place in 2020. The museum’s director, Gregory Coleman, said: “The other thing that could improve the Biennial is the audience. That’s the real challenge. We have to keep the people coming back.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) revealed today that it has designated the space in the city’s Central Park, formerly known as the Coney Island Boardwalk, as a historic district. The designation, which was made in advance of the upcoming fiftieth anniversary celebrations of the city’s Boardwalk, was made on behalf of the City Council, which approved the historic designation in October 2019. The designations follow a $35 million expansion of the park, which has been overhauled by the city in order to create 344 new affordable housing units, expand public transportation, and improve accessibility.“This is a historic district,” said Councilman Jimmy Van Bramer, who represents parts of the ward where the space is located. “This is a critical piece of what makes Central Park special. It is a vital gathering place for Central Park Families, and it", "The next Biennial should take place in 2019.\n\n\nThe Galleria Ferollin (Giard) in Milan has appointed Roberto Cicutto as its new artistic director. He is the founder of the Italian production house Ferollin, which produces films, video games, television, and sculpture.“Giard has been founded by Luca Battista, Andrea Cicutto and Andrea Basso. It has always been a space for experimentation and creativity and has produced films and video games, which have influenced the careers of many filmmakers,” Cicutto said in a statement. “On behalf of Giard I thank the board and our staff for their outstanding efforts and I am delighted to be a part of creating an amazing new generation of films and video games. I look forward to working with the new director to deliver an exciting new generation of projects.”Giard’s current directors are Mario Bickel, Luca Basso, and Luca Cicutto. Battista and Cicutto have also produced several projects based on art and design, including the recent installation at the Galleria Ferollin in Milan, which marked the twenty-fifth anniversary of the Italian brand, and ", "The next Biennial should be held in 2021–21, in order to’t disturb the delicate balance of the exhibition, which is currently being organized in partnership with the Institute of Contemporary Arts in Rome and will be held fourteen years from now.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to move the exhibition “The Art of Animals” from its current home in the Los Feliz Art Museum (LFA) onto the first floor of the Pacific Standard Time building in downtown Los Angeles, in an effort to prevent any disruption to the upcoming exhibition “The Power of the Body in the Body of Art: Art and Body in Motion” (2019). The exhibition is currently on view until January 21, 2020.“The exhibition ‘The Art of Animals’ will now travel to the Pacific Standard Time in Los Angeles\u0097where it will reside for the foreseeable future\u0097where it will be showcased in conjunction with the forthcoming exhibition “The Power of the Body”’s opening,” said museum director Dan Castellanos. “We are grateful to LFA for its opportunity to present the exhibition and look forward to the future.”The move follows the announcement of an", "The next Biennial should be held in 2021. “This is a critical moment for the arts,” said Jane Glazier, chair of the board. “The biennial is not yet able to meet the challenges that the future holds. The board takes seriously the prospects of the art for a challenging and innovative future.”\n\n\nCIMAM has called for the resignation of the director of the Rothko Institute, Amy Goodman, after she sent a letter criticizing the institution’s decision to move the museum’s permanent collection out of the United States and into a storage facility in Paris. The letter—which was signed by twenty-five other former staff members and was published on August 21—accused the institute of “castigating its founding director and chair, Max Hetzler, and the value placed on their positions,” the New York Times reports. “Upon learning that the museum was considering relocating its holdings, the staff were outraged,” Goodman told the New York Times. “They had this idea that we had this network of people [working with] the collections, but we weren’t. We were a very small group, and we didn’t have the resources,", "The next Biennial should be held in May 2020 and will organize a retrospective of the work of renowned contemporary artist Frank Gehry (1930–2009). The theme for this year’s edition will be “social responsibility.” “I am thrilled that the Biennial will make a new selection of work from the ‘truly remarkable artists that have given us so much,” said David Nolen, director of the Museum of Modern Art and the Biennial. “Some of the most important and influential artists of our time are here, and the exhibition will bring their attention to the new exhibition format and to the museum’s collection.”The Biennial of Modern Art is in the process of organizing a new exhibition, “The Non-Cultural,” that will include work by the following artists and will be launched at the Museum of Modern Art in September 2020: Anne-Marie Benoit, John Barrymore, Edward H. Weinman, Paul Gauguin, Jean-Luc Godard, Urs Fischer, Mark Rothko, Michelangelo Antonioni, Ellen Kornfeld, Richard Serra, and Jean-Michel Basquiat.\n\n\nRenowned French architect Pierre-Auguste", "The next Biennial should present a dialogue between the contemporary work of African-American artists and their European and American counterparts, drawing from the imagination, politics, aesthetics, and history of the African diaspora. The target of this year’s Biennial is “to reflect the transformative cultural and political history of the African diaspora.”This year’s inaugural exhibition, “In the Front Row,” organized by the African American Museum in New York, featured work by six artists. The the event was co-organized by the Smithsonian American Art Museum and the National Endowment for the Arts. In the Front Row was curated by Nari Ward and Hernán Díaz.The exhibition was curated by Nari Ward and Hernán Díaz. \n\n\nThe Museum of Contemporary Art (MoCA) in Atlanta has appointed Natalie Steward as its next director. In her new role, she will oversee the development and execution of programming that will encompass curation, scholarship, and conservation. Steward will assume her new role on January 20.“Natalie has demonstrated an exceptional track record of developing and executing compelling exhibitions and programs that are culturally relevant, contextual, and grounded in", "The next Biennial should be held in the first quarter of the twenty-first century. A new, innovative platform for presenting and thinking through art-historical works of art should also be established. It will be a living entity, presenting contemporary exhibitions in the form of an open forum in which biennials will have a space to develop their own programming, to engage with the arts and culture of the city, and to be shaped by the city and the city’s artists. How will the art world respond to this? Will they be inspired by the city’s artists to create new exhibitions? Or will the biennial be a cautionary tale about the dangers of falling into the trap of \"walking through walls\" and the damage that can be done by such behavior?\n\n\nMarc-Olivier Huyghe, the French curator and filmmaker best known for his photomontages of architecture, landscape, and sculpture, has been appointed the next director of the Museum of Modern Art (MoMA). Huyghe will take the helm from Janinef Moritz, who is retiring after twelve years at the helm of the institution after her husband died in May.Huyghe has worked at MoMA since 1998, when", "The next Biennial should take place in 2022.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Catherine Lutz as its next director. Lutz comes to the museum from the Museum of Contemporary Art (MCA), where she has served in various leadership and curatorial roles since 2009. During her tenure, she has coordinated exhibitions and collections that address a wide range of contemporary art and has introduced new programs and experiences for visitors to the museum.“Catherine’s unique and engaging knowledge of contemporary art makes her uniquely positioned to lead the next iteration of the Museum of Contemporary Art,” said museum director Marc Glimcher. “Her expertise and insight will be essential to our continued success and we look forward to working with her.”Prior to joining MCA in 2011, Lutz served as a curatorial assistant at the Los Angeles County Museum of Art (LACMA), where she worked on “The Vimes,” a three-part exhibition series that moved from LACMA to the Museum of Modern Art (MoMA), the Museum of Contemporary Art Los Angeles, and the Whitney Museum of American Art. She also worked as a freelance curator at LACMA and as a curator at the", "The next Biennial should be held at least once a year, with a view to a twenty-four-hour day. The first exhibition should be in the spring and the last in the fall. The biennial should be a mixture of new and classic works. It should be a celebration of the life and work of Michelangelo, of Renaissance and modern art, and of the cultural industriousness and passion of the people of the State of Thuringia. The theme of the exhibition should be “The Future Is Present,” and the number of the biennial should be chosen by the public.\n\n\nThe Walt Disney Company is reopening its eleven-year-old animation branch, Disney Animation Studios, with a new festival, Walt Disney Animation Weekend, to be held at least once a year. The company is also introducing new series, such as Beauty and the Beast, Alice in Wonderland, and The Little Mermaid, as well as a new animated film, Frozen, which will premiere at the Renaissance Festival in Milan, in the spring of 2021.“We are thrilled to be returning to Venice next year, as usual, and to have the opportunity to create new and exciting programming for the next Disney Animation Weekend,” said Michael Graziano", "The next Biennial should take place in 2021–22, and will be hosted by Biennale de Lyon in the city of Lyon. According to the French daily Le Figaro, a date for the forthcoming event has yet to be set. The theme of the second edition of the fair, titled Episode 14, which takes place in 2024, is the impact of the exhibition on the exhibition’s local community. The first edition of the fair, titled Episode 10, was held in 1988 and featured works by artists such as María Berrío, Debora Graf, and Agnes Martin, among many others, and was designated a success in 2017. Last year’s event, titled Episode 7, drew a total of 8,907 visitors from 40 countries and was judged by the award-winning curator Marcel Prouvé.\n\n\nSally Kohn, the New York–based collector and philanthropist who founded the Dorothy and Thomas Lippard Foundation in 1994 to protect artists and their intellectual property, has died at age seventy-eight at her home in New York. She is survived by her husband, Thomas Lippard, and their son, Thomas Jr.; her daughter, Nancy Kohn;", "The next Biennial should hold at least two hundred works by women artists, independent of the biennial. The event’s organizers said that the next iteration of the Biennial is “built on the strength of the work of women artists,” a statement that is in line with the committee’s philosophy of staging a diverse array of works by artists of all ages.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) has appointed Yvonne Delahanty, who has served as the museum’s senior curator of modern and contemporary art, as its next director. Delahanty is the first woman to lead the museum since the institution’s founding. She will take the helm from director Marc Straus, who will retire in December 2020.“In her new role, Delahanty will focus on how to engage with and reimagine the history of art,” Strauss said. “We are grateful for the work of all of our talented and dedicated staff and supporters, and especially for their dedication and commitment to this museum in the last year, and for the incredible work that they and David and Marc did to bring this institution to where it is today. I’m confident that she will", "The next Biennial should be like a river, She said. “The water is moving us, it’s moving us forward.”\n\n\nThe Art Newspaper has revealed that the upcoming edition of the Art Basel Hong Kong will take place in 2020 and will be hosted by the Taiwanese archival museum at the National Museum of Fine Arts (MFA). The event, which will be hosted at the MFA from November 19 to November 21, will feature forty artworks by forty-six artists. The thirty-third edition of the fair will take place at the Pacific Ocean’s Changi International Airport in Hong Kong in 2021.\n\n\nPace: An Image Journal, an annual publication published by the National Gallery of Fine Arts in Washington, DC., has announced that it will cease publication of the current issue of the magazine, which is slated to run July 23–June 26, 2020. The March/April 2019 issue featured work by thirty-four artists, including Nine Inch Nails’ Desmond McEvoy, Matt Cardy, Awol Erizku, and Samuel Davis Polk.“The Board of Management and I are extremely proud of the work that these artists accomplished in their short time together,” director", "The next Biennial should be held in 2021 and the date of the next iteration should be decided by the artist’s choice. Foto-Expo, which occupies a space in the former Y-block in central Tokyo, is currently undergoing a major renovation and will be completed in 2023.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Holly Peña as its next head of curatorial affairs. Peña comes to the institution from the Museum of Fine Arts in Houston (MFA Houston), where she has served as an assistant curator since 2015. She succeeds Ruth Ann Manley, who retired in April after six years at the helm of the museum.“We are thrilled to welcome Holly to the MFA,” said Michael Siefert, the MFA’s director and CEO. “Her proven track for bringing works to our attention and her commitment to innovation and strategic thinking will ensure the MFA’s curatorial program continues to thrive as a major cultural gathering site for Boston and beyond.”Peña’s appointment marks the first time the MFA has appointed a woman to its curatorial team. In addition, she is the first to hold the post at a museum that", "The next Biennial should be in October 2020.\n\n\nInstituto de Artes Plásticas (ICA), a conglomerate of eighteen regional and state-level organizations in the city of Menorca, Italy, has canceled a planned show of works by Pablo Picasso. The organization informed the museum of the artist’s plans to open up a new exhibition, titled “Pablo Picasso: The Lie of Youth,” at the Instituto de Arte Contemporàneo (IAC) in Lisbon, which will be curated by Maria Luisa Avignone, the president of the State of Sicily.The institution announced that it received the news on August 18 through an anonymous source. “The decision was made in order to take into account the circumstances that we face,” said IAC director Marco Latella. “Pablo Picasso was a great artist and the work of the IAC is not only important for generations to come, but also for the future of the institution. The development of this exhibition has been a long-term project of the IAC. I am grateful for the support of the IAC staff and the wider society, and particularly of the newly elected president, Valeria De", "The next Biennial should be held in the United Kingdom, and the year 2020 should be the theme of the venue. \n\n\nThe Museum of Contemporary Art (MoCA) is planning to move the bulk of its collection from its current home in downtown Los Angeles to the Los Angeles County Museum of Art (LACMA) in an attempt to save money as it works to reduce the environmental impact of this century’s biggest exhibition, “The Big Short.” The move, which will also involve the closing of four of the museum’s current exhibitions: “The Life and Death of Pablo: A Visual History,” “The Skinny: Beauty and the Black Body,” “Art in Pictures: The Passion of Joan Miró,” and “Sylvia Mann: Beyond the Frame.”The announcement follows the successful California campaign to save the Redwood State’s iconic building, spearheaded by local artist Tom Golisano, who donated $50,000 in support of a campaign to save the building and the funds will be shared between the two organizations. The museum’s board of directors approved the plan on Monday, and the museum’s staff is currently working on the", "The next Biennial should be initiated in 2021, and the first event will take place in 2022. Its organizers are planning a number of events to celebrate the event, including exhibitions, screenings, art walks, and performances.The first exhibition of the new format will be “Rethinking the Museum” (2016–17). This will be followed by “The Future Is Present,” which will highlight the ‘future of art.’ It will also feature ‘The Zoo,’ an exhibition organized by the United States-based nonprofit the New Sanctuary Movement, which has been campaigning to secure the protection of the animals in the institution. The exhibition will open at the museum on January 10, 2020.\n\n\nThe Fondazione Paolo Cannavaro in Rome has received the approval of Italian Prime Minister Enrico Letta in a cabinet reshuffle. Cannavaro, who is currently the minister of the Arts, Culture, and Sport, was announced in a cabinet meeting on Thursday, January 8, as minister of culture, arts, and education. He will be given two years to implement a comprehensive strategy in the area of contemporary art, culture, and education, and will assume his responsibilities on January 27, 2021"]