["The next Biennial should take place in 2021. “I want to thank everyone who has been involved in this movement,” said Artadia president John Hartigan. “We have now reached a stage where the Biennial now has the potential to be a defining moment in the history of the festival. We shall continue to work with our partners to deliver a remarkable exhibition in 2021. I have long believed that the Biennial has a brief, but long-term, future at the Festival, and I am confident that with the support of the Board and the talented and dedicated staff we will be able to take the next steps in that direction.”\n\n\nThe European Court of Human Rights has ruled that a photographer in the country who purposely discriminated against a transgender woman by putting her photo above a sexualised version of an iconic photograph of a naked woman, taken by Georges Seurat, must pay her $180,000 in damages. The photograph, titled Ishida (Sirens) (Georges Seurat), 1966, and the resulting video which dramatises the artist’s lesbian relationship with the photographer, is currently on display in the exhibition “Helen Sacramento: Heart of a Lion.”In the", "The next Biennial should be held in 2020, but there is no guarantee that it will be held in the US or the US-based institution. In a statement, the National Gallery of Canada said: “We are grateful for the support of our Canadian colleagues and friends, and we look forward to the opportunity to present our first exhibition at the Central Gallery of Canada and to continue to work collaboratively with our partners and audiences in Canada and around the world.”\n\n\nThe Tate has announced that it is working with the South African Museum of Contemporary Art (SADMC) on a new immersive, multimedia work, “Theatre of Instability,” that will highlight the ongoing displacement of large groups of people by their surrounding environment. Titled “Instability,” the project will present six narratives over a period of twenty years, each centered around a different source of instability in South Africa.“Theatre of Instability” will be a reimagined version of the popular South African musical, “The Concert,” a 1964 performance that, according to the organizers, was tasked with addressing the “instability and instability” of the city of Durban. The work will consist of six films, which", "The next Biennial should focus on the history of trans-species collaboration and how it might be reconsidered in the twenty-first century. “We must ensure that this remarkable work of art, and of the artist and of the city, is treasured for what it is and preserved for the future,” said curator Sabine Vergne.The 2018 edition featured a reconstruction of a Johannesburg art installation by the late sculptor Bantu Talu, and a new work by the late Indian painter Ram Singh. Both artists have been designated as the biennial’s artists in residence; both have won the $50,000 prize.“This year’s Biennial will focus on a theme that has been recurrent in both our exhibitions: the interdependence of art and culture and the interplay between humanity and nature,” said David Albright, the chair of art at Tate Britain. “This year’s Biennial will also see the artist-versus-nature combination of Ram Singh’s The Eye of the World and Bantu Talu’s The Visitor.”Terri Garrity, the director of Tate Britain, said: “The best way to describe this", "The next Biennial should focus on “practical practices that address systemic inequality and systemic injustices,” said Gelb, who is also the CEO of the New York–based construction company Gensler. “Building on the work of Fellini, Mille, and others, the 2020 edition will focus on themes that address the systemic oppression of marginalized communities through art, architecture, and design, as well as its impact on the art that we love.”Representatives of the two exhibitions were not immediately able to respond.\n\n\nThe University of Washington in Seattle has appointed Beau Foy as its next president and CEO. Foy, who has served as a UW professor of art history and director of the Visual Arts Center since 2017, has served as the chief curator of the museum since 2011 and has been on the job for more than five years.“We are thrilled to welcome Beau to our team,” said UW president and CEO Cara Carpenter. “He has a long history at the University of Washington and is a leading scholar in his field, having been awarded a MacArthur Fellowship for his innovations in curating and writing in 2009. He has been instrumental in raising the Museum’s profile within the city of Seattle,", "The next Biennial should take place in 2022 and is being organized by the museum and the Institute of Contemporary Art, London. “The Art of the Spectacular,” which is listed among the museum’s holdings, will also be restored. Museum director Maria Bellino said: “This is a time of great change and I believe that the exhibition of the Biennial Collection will provide a new and exciting experience for the museum. This exhibition is not about rehashing old history, but about making the most of the most complex current moment; about creating a new kind of themes, new stories, and new characters.”\n\n\nThe Museum of Modern Art (MoMA) in New York has received a $100 million donation from the Michael Rosenbaum Foundation. The gifts come as part of the Michael Rosenbaum Foundation’s new $5 million fundraiser, which raised $150 million for MoMA. The funds will be used to restore the Nara and Jorge Luis Borgas–designed Feminine, a September 1974 work by the artist that will return to the museum the work’s fragments. The donation includes $100,000 for the restoration of Joan Miró’s sculpture ", "The next Biennial should be held in 2020. The art of the past might once have been considered the essence of art, but is no longer. The present can be regarded as the object and as the form. The museum is now concerned with the understanding and the construction of the future. This is the task of the biennial. Museums and cultural sites: transformation.  *The Greenwich Biennial celebrates the role of extreme beauty in shaping a better world. This includes the work of artists and thinkers whose practices have been historically neglected or who have yet to be fully understood. It will feature the work of contemporary artists such as Paul Gauguin, Simone Leigh, and John Nash, and will emphasize contemporary art as an antidote to the narrow and increasingly phallic: contemporary art is the record of the radical transformations that continue to shape our world.”\n\n\nThe city of New York is preparing to welcome visitors to the city once again in 2021. The announcement follows the completion of a $200 million expansion project, dubbed the City of Dreams, which added a twenty-four-story, 137,000-square-foot museum and a Jewish museum that was completed in 2017 and opened in 2018. “This is an exciting time", "The next Biennial should take place in the spring of 2021. The art world is now in the final stages of its greatest cultural experiment, namely, the following year.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, California, has appointed Amanda King as its next director. King will assume her role on March 29. She succeeds Leslie Schubert, who is retiring after more than twenty-five years at the helm of the museum.“The board and I are thrilled to welcome Amanda to the museum,” said director Tamara Halsey. “She is a highly talented leader and will help us deliver on our promise to present the most compelling exhibitions in our history.”King succeeds Leslie Schubert, who has led the museum for twenty-six years and most recently served as chief curator of modern and contemporary art. During her tenure, she helped raise the museum’s profile, increased the museum’s curatorial focus, and introduced new exhibitions, including “Polaroids: From Film to Drawing” (2017), “Carlos Campanella: Time Travelers” (2018), “Tower” (2017), and “Wolf Architects: The Shape of", "The next Biennial should be held at the Museum of Contemporary Art, Boston (MCA) in 2021.  The Museum of Modern Art, New York (MoMA), in 2024, and the Los Angeles County Museum of Art (LACMA), in 2021, respectively. 'The future of art is now, and we are in the process of dismantling a lot of what we once knew, through the destruction of our planet, and through the proliferation of useless materials and the exacerbation of social ills, particularly climate change,' said Mark Beasley, president of the International Association for Art Preservation. “In a time when so many organizations are trying to be reorganized in order to cut costs and streamline operations, we are at a turning point. We must seize this moment and do all that we can to ensure that the next Biennial is a vision of the future, one that reflects the very essence of the art that we love.”\n\n\nThe Philadelphia Museum of Art (PMA) has come under intense scrutiny for its handling of sexual-harassment complaints following the release of the landmark documentary Dear John, which documents the alleged liaisons between a group of senior staff and a high-profile donor. The allegations against John Le", "The next Biennial should be held within twelve months. In accordance with its pledge of support for the 'shining light of art and architecture, we are prepared to participate in it, to support the artistic process, to organize exhibitions, organize lectures, and present our programs in the spirit of a dialogue.”\n\n\nThe Pulitzer Prize–winning curator and art historian Wayne Newton has been appointed the new director of the Metropolitan Museum of Art in New York. He succeeds David K. Brown, who retired in May after twenty-five years at the helm of the museum. “Wayne embodies the essence of the Met, a warm, welcoming, and sometimes melodramatic heart,” said Brown. He added: “His devotion to the museum as a community, his desire to advance art through experimentation and innovation, and his relentless pursuit of new and better ways to experience the art of our time make him the perfect person to lead the Met.”Born in Chicago in 1962, Newton moved to New York City in the early 1970s. He studied at the University of Michigan and the University of Florida before landing at the University of Chicago, where he has taught for thirty-five years. In 2009, he was awarded a MacArthur Fellowship. He", "The next Biennial should be held in the autumn of 2021, the organizers said. The museum will be hosting an exhibition of works by artists such as Abigail and Marian Hubbuch, Andrea Mangano, and Georges Seurat.\n\n\nThe Rijksmuseum, the Amsterdam’s oldest and largest contemporary art museum, has announced plans to reopen in the summer of 2021. The institution was forced to postpone the event due to concerns surrounding the coronavirus, which has since spread to other parts of the world. The institution is currently working to identify the virus and is working with the scientists at the Netherlands Institute for Disinfection and Microbiology (NIV) in the Netherlands to develop a new treatment.The museum is now looking to partners for funding. The institution has raised an additional €1.5 million from the Amsterdam-based charitable organization World Vision. The new museum, which is located in the former Amsterdam Stock Exchange, will open on September 12. The institution is also planning to build a building to house the collection of the Rijksmuseum’s Dutch masters, the J. M. W. Meeuwis museum, and a new exhibition hall.The news comes amidst the coronav", "The next Biennial should take place in the spring of 2021. The date of its inaugural exhibition was originally set for the end of the twentieth, but the French department of Culture and Sports decided to hold it in May. The exhibition will be an adaptation of the first exhibition, “Les Arts et l'Art et l'Homme: avant-garde manuscrits” (1921–2007), which is currently on view in the National Museum Paris. The show will feature a selection of works (excluding works that have not been previously exhibited in France) by  Leslie Bachelet, Jean-Luc Godard, Michelangelo, Frank Stella, Pierre-Auguste Perec, and Pierre-Auguste Renoir, among others.The financial assistance program will initially provide $60,000 to the first year of the program, which will expand to $165,000 for the second year. Jean-Jacques Perot, President of the Biennale de Lyon, said: “The addition of the Jupp Song and the end of the biennial are a turning point in the history of the Biennale. The two exhibitions which are coming together in Paris in the months of May and June are the", "The next Biennial should be held in 2021.\n\nCommissioned by the Riga-based museum, the exhibition will showcase work by seventy-two artists from thirty-two countries. The exhibition’s first public retrospective was held at the French museum in Paris in 2011. Its current project is titled “Museum Doréal,” a word association between the words Doréal and Jerusalem. In 2018, the exhibition was chosen as the final work of the Rotterdam Biennial. \n\n\nThe UES Art and Design Foundation (UESF) in New York has received a gift of fifty-eight works by forty-seven artists from twenty-six countries. The gifts, which comprise a portfolio of the foundation’s first MUSE’s program in the United States, have been made by artist Aisha Harris, who was selected for a project titled “I Will Go,” which was exhibited at the UESF’s annual gala in February 2018, and ten-person group of artists whose works were on display in an exhibition titled “We Are All in This Together.”“On behalf of the board and staff of the UESF, I’m thrilled", "The next Biennial should have taken place in the spring of 2021. The first exhibition, “The Blob,” is currently on view in the US now.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Cynthia Cox as its next director. Cox arrives in the city from the Museum of Fine Arts (MFA), where she has served as deputy director for the past four years. In her new role, Cox aims to increase MFA’s visibility and strengthen its relationship with the communities it serves through programs such as the museum’s Black Box Theatre and the MFA Latinx Institute. Cox’s first project as director will be to launch a new media and performance platform, CecilmwoodCooper.com, to promote the work of emerging artists. The platform will feature artist’s work in the form of a collection that will be organized by decade and will be curated by the artist. “Cynthia’s background and passion for artists and her commitment to connecting with and engaging communities make her a strong choice for this critical role at MFA,” said Mark Feldman, chair of the museum’s board of trustees. “Cyn", "The next Biennial should be held in the first quarter of the decade, and the first exhibition of the new artwork should open in the second quarter of the decade. The first show of the new work will exhibit two works by the artist, which explore the relationship between human and machine intelligence. The second exhibition will consist of two works created by the artist which address the relationship between art and technology.Both works will be organized in a biennial format, with a single exhibition (the first show at the Biennial will be held at the Museum of Modern Art in the year 2020) and will be presented in the form of interactive 360° experiences that will be designed to teach visitors about the art of AI, and the art of AI art. “The Future Is Not What It Used To Be,” a work by the artist Taina Ghebrey, is scheduled to open at the Biennial in 2021, and will be presented by artist Adrienne Edwards in the exhibit “AI: The Art of Artificial Intelligence” at the Museum of Modern Art in 2021.\n\n\nThe Bechtel art and technology complex in London has been sold to US multinational defense contractor Constellos Aeronautical in a deal worth $4.5 billion", "The next Biennial should be held at the Museum of Modern Art in New York in 2020, and the first exhibition should open in 2022. The next exhibition should be themed “Celebrating Life” and will be led by an artist-in-residence. The biennial, which will be held in conjunction with the festival, will feature works by eighty artists and will include a viewing platform for visitors to the museum.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has received a gift of twenty-nine artworks from the California Institute of Technology (Caltech) in Pasadena, California. The works were donated by Michael Mina, a Los Angeles native who previously worked as a curator at the Los Angeles County Museum of Art (LACMA), where he curated “The Shadow of the Wind: An American Painting” (2017), a work by John Turner, which is scheduled to open at the museum next month.\n\n\nThe Art Newspaper has revealed that the British American Tobacco Company (BAT) in New York City is preparing to introduce a new flavor of cigarette, one that will feature a tobacco-derived chemical compound called diacetyl, in 2020. The news comes amid a flurry of activity", "The next Biennial should start in 2020. The Art Newspaper reports that the pavilion will be uniformly white. The concept of the exhibition is to provide a platform for the work of new and established artists, to create a dialogue between contemporary practitioners and one another and to foster an appreciation for the historical traditions of the art field. “The next Biennial will offer an alternative to disjointed exhibitions,” Tomasz Klimczak, director of the Museum of Modern Art in Warsaw, told the Art Newspaper. “It will be a very high-quality exhibition. The talks will be able to become contemporary experiences.”\n\n\nA group of artists, designers, writers, and other cultural workers in the Philippines have come together to protest the construction of a controversial new $5.2 billion megaplex, set to open in the capital city of Davao, in a move that activists believe will further erode the rights of indigenous people.The February 20 launch of the new exhibition spaces the Contemporary Arts Center (CAC), the National Museum, and the National Gallery of Art in Manila, which will form the centerpiece of the $40 million megaplex, drew fierce opposition from local residents and officials from the city of Dav", "The next Biennial should take place in the spring of 2021.\n\n\nThe Danish Museum of Art (Denmarkborgskekke) and the Danish Academy of Fine Arts (DAFA) have been awarded a $4 million grant by the Danish Ministry of Education and Science. The funds come with a commitment to support the creation of an online master class on the art and architecture of architecture.The grant was made by minister Lars Løkke Rasmussen, who also announced the launch of a new educational initiative, 'Art and Architecture in Denmark, 2020–2030.“The Danish Museum of Art and the Danish Academy of Fine Arts are two of the most important cultural institutions in Denmark,” Rasmussen told the artforum. The Danish masterclass will be hosted by the museum and will take place from February 23 to March 3, 2021. The program will finance the cost of the museum exhibition and the development of the online masterclass, which will be led by Lena Zborova.In order to facilitate the international mobility of students from Denmark, Denmarkborgskekke and DAFA will share the cost of the online masterclass; however, the institution is requesting that the public contribute their own funds to help cover the associated operating costs. The Danish", "The next Biennial should be held in 2022, in a location not far from here, and will be on a smaller scale, with a budget of $150 million, and will be produced by the Los Angeles–based, nonprofit organization, Artspace. It will be curated by the Los Angeles–based and New York–based artist Andre Jay-Z and will take place in partnership with the Pacific Institute for Contemporary Art in San Francisco.The next iteration of the Biennial will be staged in 2020 in Hawaii. Its next edition, “Between the Sea and the Moon,” will be hosted by the Los Angeles–based nonprofit Gallery Space Hawaiʻi and will take place in the Lālanai Theater in Honolulu.This year’s event will be held at the Landmark Theatre in Santa Monica, California, and will be organized as follows: “This Year’s Biennial: A Retrospective,” will be the theme of the 2019 edition, which was curated by Arthur Jafa and featured work by forty-eight artists working in the contemporary art field. In 2020, the theme will be the ‘Human Journey,’ and the biennial’s inaugural theme will be Ghost in the Window. The", "The next Biennial should take place in Helsinki in December 2021. The show will introduce European art to North America. In the past, the exhibition has drawn a steady crowd of more than forty thousand.\n\n\nThe Venice Architecture Biennial is once again postponing the event, reopening in April 2022. The schedule will now be unveiled in March. The forty-ninth edition of the fair, which has been held every March since 1993, will be held at the Palazzo Reale in Venice, Italy, from March 19 to March 21. The event will run parallel to the Venice Architecture Biennale in April.In a statement, the fair said: “We are deeply concerned about the anticipated postponement of the 2018 edition. The organisers of the Venice Architecture Biennale have committed themselves to giving our artists and collectors the best possible exhibition programme, and we hope that all of our artists and collectors will be able to participate in the upcoming edition. If we have to move our fair back a few months, we will do everything in our power to make that possible.”\n\n\nA new survey of South American art spanning the twentieth and twenty-first centuries, “Art and the Americas,” will begin presenting works by artists in Buenos", "The next Biennial should be “Conceptual Studies,” the biennial that began in 1973 and has presented work by artists such as Toguo Tatem, Ming Wei, and Bob & Rosalind, and will be a retrospective, not an exhibition.  The exhibition will contain work by thirty-three artists, including Jacky Guadagnoli, James Turrell, Nadine Paoli, and Pierre-Auguste Renoir, and will be staged at the Museum of Modern Art, New York; the Musée d’Art Contemporain, Paris; the Bibliothèque Nationale de Paris, Paris; the House of Pancakes, Los Angeles; and the Tenement Museum, New York.The 2020 Biennial will be held at the Museum of Modern Art (MoMA), New York; the Art Institute of Chicago; and the Eastman Museum of Art, New York. \n\nThe Metropolitan Museum of Art in New York has announced that it is planning to extend the life of its longtime artist-in-residence program, which was implemented after the 2011 eruption of Tropical Storm Irene, by two years. According to the New York Times, the change is made in order", "The next Biennial should focus on “The Art of Success: Women’s Leadership in Modern Art,” according to the organizers. But the biennial will not be a “return to basics.” Instead, it will focus on how to more effectively employ art history, cultural traditions, and crafts to advance the theories and practices of feminist, queer, antiracist, anti-imperialist, and anti-racist perspectives. “We are creating a new space, a new work, a new exhibition, and a new dialogue, one that will address contemporary issues and ideas,” said Laura Mulvey, chair of Biennial Los Angeles and director of the Hirshhorn Museum. “This is a time of great uncertainty for many arts institutions, but we are committed to continuing the work of the Venice Biennale, and of the work of our curators and to the work of our artists.”The Biennial’s inaugural edition, “The Art of Black Life: Theory and Practice” (2019), was held at the Hammer Museum in Los Angeles in March. \n\n\nThe Kölnischer Kunsthalle Münster (KKM), Germany, has", "The next Biennial should be in 2021. However, the usual dates are 2021, 2023, and 24. The institution has also been working on a redesign that would feature more spaces for education and collaboration and would introduce a series of new exhibitions and events. “We will continue to refine and design the program in accordance with our long-term vision,” the museum said in a statement. The project will be financed by a $12 million donation from the life-size sculptor and the Noguchi family, who donated $10 million in support of the renovation of the museum. The offer also comes two years after the Noguchi Foundation pledged $5 million to the museum in support of a major renovation of the museum and the Noguchi Collection, which comprises more than four hundred works. This is the second year the foundation has committed to supporting the museum. In 2015, the Noguchi Collection was placed on display in “Noguchi 2020: Art and Design in the Twenty-First Century” at the Museum of Modern Art.\n\n\nThe Museum of Modern Art (MoMA) has awarded art historian and curator Andy Warhol $20 million in a settlement over his role in the punk rock band Pussy Riot’", "The next Biennial should aim to deepen the understanding of the contemporary art world in both the United States and France. For the United States, the theme “Art and the Future: From the Crossroads to the Walls” should draw from the biennial’s inaugural exhibition “Spaces of Influence,” which opened at the Odyssey in New York in May 2019. For France, the theme should be “La France Infériale,” which opened in the French pavilion in the 2021 edition of Art Paris. The 2020 festival will focus on the art of the twenty-first century, with special attention paid to the American Southwest.“I hope that even more than ever the artists here in Los Angeles, the region, and the world will feel the impact of the Biennial Paris,” said William Desmond, chair of the board of trustees and the director of the Los Angeles County Museum of Art (LACMA). “The exhibition ‘Art’s Futures: From Southern California to the United States’s Southwest,” which opened on February 5, 2020 and runs until March 10, 2020, has drawn a new audience for the institution. The upcoming edition, which will include twenty-", "The next Biennial should have a set list of forty works by forty-two artists and should be held in 2019. In fact, the fifty-seventh edition, titled “In the Time of Crisis,” will be held in 2020.The next edition of the Venice Biennale will be staged in 2022. The exhibition will be accompanied by a programme of public lectures and a biennial exhibition entitled “The Need for a New and Modern Life.” The theme of the event is “The End of Life as We Know It.”The Venice Architecture Biennale will also be revisited in 2022. The eighth edition of the Architectural Biennale will take place in 2021, the eleventh in 2019, and the twelfth in 2018, with the twenty-fifth and twenty-seventh editions to follow in 2020 and 2021. “The architecture of the future is right here: the future is what we make,” said Yoko Taro, chairman of the Japanese art fairs association. “From the bottom of our hearts, we are proud to be able to celebrate the twenty-fifth and twenty-seventh editions of the Art Biennale with a new collection of works by", "The next Biennial should take place in 2022, the year of the birth of Peter the Great, and will invite 100,000 participants from fifty-eight countries to the capital of the Russian Federation, Moscow. Grand Prize Winner: Konstantin Kudrin, Konstantin Kudrin: The Silent Voyage, 2019.  Winner: Nina Laudel (Germany), Nina Laudel: Sennheiser Concertos  (2013), Nina Laudel: Einführungen,  Nina Laudel: Trilobuschka Ingres (2018), Nina Laudel: The Lululemon Show, 2007, and Nina Laudel: The Night That Never Was, 2019, as well as three shortlisted artists from the inaugural edition of the Berlin Biennale, which will be held in 2021. The 2019 winner is Norwegian artist Torbjørn Knutsen, who was nominated for his work The End of the Real, 2016. He was selected from an audience list that included Konstantin Teitelbaum, Matt Mullen, and Shirley Worthing", "The next Biennial should be held sometime in the spring of 2020. Comments?\n\n\n\nThe Art Newspaper has published an excerpt from a newly translated book by French-Canadian artist Damien Hirst. Titled The Voodoo Landscape: A Vision of a Zombie in Paintings, it traces Hirst’s interest in the supernatural and the surreal in his works. It also draws attention to the role of mirrors and mirrors in his work. Hirst’s work is currently on display in the exhibition “The Conjunction of Politics & Pain: French and American Art in the Era of Jean-Marie Leclerc,” which opened at the Rosenau Museum in Paris last week. The exhibition will be led by artist-in-residence Jean-François Auger, a prolific and seminal French painter.Auguster, who is currently based in Los Angeles, will explain why the book will be a “treasure trove of historical and stylistic insights, not least of the most recent.”In The Voodoo Landscape, Hirst writes: “I have been interested in the strange, the uncanny, and in the strangeness itself. By using mirrors as a key element in the dreamscape I", "The next Biennial should be held in 2021, with the hope of having it completed by 2024. “The exhibition will have an important role in recognizing the contributions of the artists whose work we have had the opportunity to see through the exhibition. We are convinced that the exhibition will also contribute greatly to Greece’s image internationally.”The exhibition will focus on the work of the last hundred years of the Greek-American artist, whose paintings are in the collection of the Metropolitan Museum of Art and the Museum of Modern Art in New York, and will follow the artist’s most recent projects, including his monumental series “The Triumvirs,” 1955–1956.\n\n\nThe Museum of Modern Art (MoMA) has removed two of its sculptures from display in an attempt to rebrand itself as a museum that serves the public, not the artist, and is now the subject of a lawsuit brought by the heirs of Charles and Ray Eames, the legendary owners of the iconic \"cigar box\" sculptures.In a complaint filed in federal court in Manhattan on September 8, the heirs claim that the museum failed to “adopt the art ‘wrongfully’ and [has] failed to stop the", "The next Biennial should be held in 2021, said the museum’s director, Erik Neugroschel. “I believe the work of the current team is very good, and that the future of the museum should be as exciting and exciting as the present team.”He added: “I wish to thank our guests for their understanding and confidence in this process. The biennial is only a part of the work that we are doing to strengthen our relationships with local communities and to develop our exhibitions and our programs. We are working hard to do what we can to stay connected with our audiences in different parts of the world and help them understand and appreciate our work and our history.”\n\n\nThe Los Angeles County Museum of Art (LACMA) confirmed on Thursday that it will hold a major reorganization and expansion of the institution, which was founded in 1967 by conservative Christian parents to house artworks and has expanded to become the largest museum in the United States. In a statement, LACMA said that it “completed a thorough and creative rethinking of how the museum will engage with the various communities it serves, while ensuring that the museum remains a cultural destination for everyone’s enjoyment.”“With", "The next Biennial should begin next week.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is expanding its program in support of the city of Los Angeles’s homeless population. During its new program, which will run through March 31, the museum will host twenty-two artist and nonprofit projects to address homelessness. The fourteenth edition of the Los Angeles Homeless Biennial will begin on April 3.“As we work to find new and creative ways to support the homeless and to support the arts, we thought it would be an important platform to showcase the talents and creative energy of artists and organizations working in the community,” said Mark Rubinstein, director of MoCA. “We also wanted to set an example for how we think about the impact of art and culture on our surrounding environments, and to recognize that homelessness is an issue that affects every community in America.”The biennial’s inaugural project, The Architectures of Homelessness, will focus on the work of ‎Anna Atkins, Ron Chernow, and Micah Blake, among others, and will present works by Christine Aical, Jes Fan, David Geffen, Steven H. Johnson, Roger Guyett, Alexis", "The next Biennial should be held in 2021, the age of the Black Death, and the date for the next iteration of the Grand Prix will be moved. ·  On the next edition of the Art of War, Kasmin and Global Art + Design will collaborate with artists to create a new interactive experience for the event, which will be staged in conjunction with the annual Art of War art fair at the Rijksmuseum Amsterdam, and will present a series of interviews and demonstrations. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of twenty-six works by the late artist and activist Angela Davis. The works are from the Davis Collection, with the donation of which the museum will launch a new commission program. The program will introduce the gift as part of the institution’s ongoing commitment to showcasing the work of contemporary artists in an exhibition that addresses contemporary issues. The gift comes three years to the day after the MFA gifted forty works by the renowned artist, who was a pioneer at her own pace working across many genres and her own body. Davis’s work will be included in the exhibition “A Time for Statement: Angela Davis’s Art,” which", "The next Biennial should take place in the city of Biennale di Storia in Milan on September 27–September 29, 2021, and should include “Feminine,” a feminist exhibition aimed at the middle and upper classes, and “The Unbearable Weight of the World,” a documentary about a young Filipino artist.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than 150 works by twenty-six artists, including Artsakhn Gerasimov, Dance Dance Dance/Nirvana, Gina Israel, The Ballad of Édouard Manet, Ringo Ruiz, and Vincent van Gogh. The collection includes works by Marc Chagall, David H. Koch, Antony Gormley, Mark Rylance, and Jacki Hillerman.LACMA director Edsel Ford said: “This gift is an extraordinary moment for LACMA as we begin the new century together with these artists and their families. We are honored to welcome them and look forward to their continued work as we work together to shape the next chapter of our history.”Norton Simon Museum director", "The next Biennial should be moved to the water, rather than the urban setting of the city, to avoid overcrowding.”Nominated by the audience, including The Atlantic, Essence, Artforum, Artnet, and Artforum Plus, the exhibition will feature work by seventy-five artists, most of whom were not chosen for their visual art but for their political views. Among the biennial’s first artists was the Palestinian-American artist Mahmoud Darwish, who also works in painting, architecture, and sculpture.His exhibition entry for his work “Art as a Weapon: Pro-Israeli and Anti-Arabs in Contemporary Art” was submitted by Anwar Saeed, who was imprisoned for almost nine years for stabbing an Israeli soldier in the army’s camp near Nablus in 1993. He is now serving a twenty-two-year sentence. Darwish’s work was included in the exhibition “Fighting for Israel: Palestinian Artists in the Israeli Occupation” (2017).\n\n\nThe San Francisco Museum of Modern Art (SFMoMA), which has been temporarily shuttered since mid-February due to the Covid-19 pandemic, is planning to reopen before the end of April. The", "The next Biennial should take place in the spring of 2020. \n\n\nThe British Museum has appointed ten new artists to its staff, bringing the total number of curators to seventeen. The appointments were made during a three-month recruitment period beginning on January 18 and running through February 21.The biennial is devoted to the exhibition and experimentations of visual arts, and is organized as follows:• Arts and Crafts • Modern Art and Design• Art and Performance—Continental Asia and North America• Art and Design—Europe• Art and Design—Africa• Art and Design—United Kingdom• Art and Design—United States• Art and Design—Australia• Art and Design—Asia and Africa• Art and Design—South America• Art and Design—Asia• Art and Design—Africa’s Powerhouses: Art and Design from the Middle East and North Africa• Art and Design—Asia and Africa’s Powerhouses: Art and Design from Central and South America’s—continental and modern Art and Design from the Middle East and North AfricaArt and Design—Asia and Africa’s Powerhouses: Art and Design from the Middle East and North Africa’s Art and Design—Asia and Africa’s Power", "The next Biennial should take place in 2020. “I’m very happy with how this has all come together and feel very confident about the project going forward,” said  Ethan Key, chief curator of the Art of the Art of the Americas. The twenty-fifth edition of the show will kick off at the Museum of Contemporary Art in San Francisco, California, with a preview of the work of artist and rapper 2 Chainz, which was on display for a half-hour and a solo exhibition of work by the artist and rapper Big Sean in January 2020. The 2020 edition will also mark the centenary of the invention of the American painter John and the twenty-fifth anniversary of the release of the book The Man Who Sold the American Humanities (1947), by John von Neumann. The 2019 edition of the show was staged at the Burlington Museum of Art in Vermont. The 2020 edition of the show will be held at the Serpentine Galleries in London and will include a selection of works from Kate Millett’s collection, as well as works from the artist’s large-scale paintings.\n\n\nLocal authorities in Hamburg, Germany, have ordered the temporary closure of the city’", "The next Biennial should be held at the Royal Academy of Arts, London, sometime in the next twelve months, where it will open in October 2020. The next edition of the Pride Awards, which is being organized in collaboration with the Royal Shakespeare Company, will take place at the Royal Festival Hall in February 2021. The 2019 awardees include Jenna Gordon, Zoe Kazim, Christine Sunjung, and Missy Elliott. The 2019 prizeees are: Alternate Presentation: The Final Cut, Papé Toussaint, The Art of Freedom, The Brothers Webb, The Black Book of Art, ​Bourgeois Brut, Bourdieu Pompidou, The Three Musketeers, The Three Musketeers II: The Chateaux de Lyon, The Three Musketeers III: The Toussaint Collection, The Three Musketeers IV: The Soustani Collection, The Three Musketeers V: The Drawing Room Collection,The Three Musketeers VI: The New Martyrs Collection, The Three Musketeers VII: The Three Musketeers III: The Spoletti Collection, The Three Musketeers VIII: The", "The next Biennial should take place in 2020, the archives said. The next edition of the event will take place in 2022. The Biennial will have a theme of the exploration of the historical figures involved in the revolution and will be hosted by the National Museum of Fine Arts and the National Museum of Modern Art in Athens.The announcement came amid a continuing debate over the role of artists in supporting political change through the mass demonstrations in Athens and other cities across Greece last August. The demonstrations—which were mostly peaceful but also took a violent turn when a group of far-right activists started throwing stones—had a devastating impact on the Greek economy and resulted in the government sacking of the head of the country, Yanis Varoufakis, and his cabinet. Varoufakis was replaced by Giorgos Venizelos, who was elected as the country’s new prime minister on August 8. Venizelos was also reelected on September 3 and will have his first term in office in 2021.\n\n\nThe Barcelona-based nonprofit organization Art+BARCADER will launch an international digital platform and educational initiative in support of the Catalan artists who have relocated to the United States in the last two decades. The platform, which will", "The next Biennial should take place in 2023.  Expected to last eight weeks, the event will be hosted in the City Museum of New York, which will be transformed into a museum dedicated to the life and work of Richard Avedon, a leading member of the Amish community. The museum’s presenter’s selection of artworks will include The Birds of Paradise, a series of photographs by Anton Chekhov that depict the life and work of animals such as the cuddly cormorant, the large-eyed turkey, and the polar bear. The exhibition will also feature a project by artist Mott Campbell on the life and work of Saint Francis Xavier, a popular figure in early twentieth-century American art, and will feature a selection of modern and contemporary artworks by Richard Avedon.The museum has struggled for over a decade to secure $140,000 for a new exhibition space after the museum closed in 2009 due to a crippling $25 million debt. In 2012, the institution was awarded a $15 million loan from the Colbert Museum of Art, and in 2017, it was awarded a $30 million loan from the Hagens Berman Foundation. In a statement that", "The next Biennial should be held in 2020. About the Work of the Art Institute of Chicago: The next edition of the institute’s New Art Issue will be held at the institution in 2021. About the Museo de Arte Contemporáneo, Mexico City: The next edition of the museum’s X-Artnews will be held at the institution in 2021. About the Museo de la Universidad de Mexico City: The museum will not be able to acknowledge the achievements of the recent years in an exhibition of the works of the twenty-sixth edition of the Museo de la Universidad de Mexico City, and will instead commission two works by two artists of the same natal nativity. The 2018 edition of the museum’s New Art Issue was widely criticized for its lackluster curatorial team and for its exclusion of women artists. The next edition of the show will take place in 2021. About the Museum of Contemporary Art, Houston: The 2021 edition of the museum’s New Art Issue will be held at the museum in 2021. About the Museum of Modern Art, New York: The museum will host an exhibition of work by Victor Vasarely and ", "The next Biennial should be held in 2020. Igor M. Gogol, who was instrumental in opening up the museum in the late 1940s by bringing many of its former holdings onto his own, has announced that he is withdrawing from the project. Its twenty-fifth edition will be held in two formats: an exhibition of works by shortlisted artists and a compilation of works by the best-known names in American photography\u0097Nancy Jayne and Marilyn Neumeier, among others. In a letter written to the organizers of the biennial, Gogol wrote: “While I greatly admire your efforts to produce an exhibition of the artists whose work will most effectively serve the theme of the museum, I believe the current exhibition in the museum has reached a milestone and needs to be adjusted.” The letter concluded with a request to work with MCA to create a new exhibition that would be “free to the artist and open to the public.”The museum said that the changes will be “minimal and responsive to the museum’s mission, in keeping with the reduction of formal and theoretical focus in the works in the collection, which have been intended to create a universal visual language for documenting the work of", "The next Biennial should be held in 2020. The deadline was set by the city of Beijing for a new agreement between the museum and the State Administration of Cultural Heritage. The Art Museum Shanghai is currently holding a special exhibition dedicated to the life and works of the great Chinese artist Fan Bing. \n\n\nThe Chinese government’s blueprint to overhaul the country’s antiquities and heritage sites is in limbo. Though President Xi Jinping outlined a three-pronged strategy in his 2016 State Council meeting, the National People’s Congress (NCC) rejected the sweeping reform plan on October 29, causing Xi to announce his resignation the next day. Since then, countless activists and scholars have petitioned the Chinese government to press ahead with the overhaul, which would involve the demolition of more than one hundred historic monuments and the replacement of Chinese symbols with modern equivalents.As China prepares to mark the centenary of the founding of the People’s Republic of China in 1949, a group of South-Eastern European artists created the artwork \"In Praise of the Three Emperors: Xi Jinping, Hu Jintao, and Hu Jie\"\u0097a three-dimensional monument that depicts Xi Jinping, Hu Jintao, and Hu Jie,", "The next Biennial should take place in May 2020. The twelve artists selected for the biennial will be announced in April 2021.\n\n\nThe Musée d’Art Moderne in ParisÖs Pierre and Georges Pompidou, on Wednesday announced that Olivier Fauvist has been appointed as the next director of the museum. “Fauvist brings with him a wealth of experience in both public and private sector and brings a new perspective to the Père Lachaise, which is a core mission of the institution,” said the museum’s director, Nathalie Bondil. “He is a man with a vision for the Père Lachaise who brings with him a deep knowledge of theory and practice and a keen sense for the art of museum design.”The Pérez Artologie has announced its representation of the French artist's first solo exhibition, “arriving at Père Lachaise in the summer of 2017. The exhibition ‘Arts and Design’s New Heart,’ opened at the Père Lachaise in June 2019, and the Père Lachaise Collaboration with the Artist’s Work began as a project at the", "The next Biennial should begin in 2020 and conclude in 2022. The theme of the 2020 edition will be “life after death.” The 2022 edition will be “Thee, the Other, and Beyond: An Essay on the Life and Death of Jesus Christ.” The 2021 edition of the Biennial was held at the Art Institute of Chicago and the theme of the exhibition was Life After Death.  The 2020 edition featured works by fifty artists, including van Gogh and his sister, Marian, and the first work to be selected for the prize was David H. Koch’s The Big Shift. The award ceremony took place at the Institute on Contemporary Art in the City of New York on March 4.\n\n\nThe Milwaukee Art Museum (MAM) in Wisconsin has received a $100,000 donation from the decedent’s heirs. An anonymous benefactor donated $100,000 in support of the institution’s new $750 million renovation and expansion project, which is slated to be finished in 2021. The gift follows the reopening of the museum in March 2019, when the family’s beloved museum, which has served as the site of several of David’s favorite sights, reopened", "The next Biennial should take place in 2022. It will also be the last to examine the exhibition in-person, having moved to a digital format in 2016; it will be presented by the Biennale Foundation as part of a collaboration with the Museum of Contemporary Art.The eight artists selected to represent the United Kingdom at the Fifty-Ninth Venice Biennale in 2019 were Otka Ward, Nino Malan, Kamel Cuando, Siân Grisard, Alberto Sánchez-Báez, Andrea Giunta, Jessica Lex, and Amara Dar. The British artist will also represent Australia at the twenty-fifth Venice Biennale, which will take place in 2021.In a letter released by the British Alliance of Arts, Culture, and the Environment (BAME), the artists who were shortlisted in 2019 are:Alison Warhol (United Kingdom), Alexander Solzhenitsyn (Russia), Aleksandra Nilsson (Sweden), Alice Oramo (United States), Amalia Vielbas (United States), Benedict Cumberbatch (United Kingdom), Benedict Gates (United Kingdom), Jean-Luca", "The next Biennial should begin as soon as possible, and will then focus on exhibitions on the history of contemporary art. It is hoped that the exhibition will be staged at venues in and around Gdansk, including museums, universities, and the city. The exhibition will then conclude with a public exhibition of work by the author Tadeusz Klimczyk.Previous exhibitions have focused on the history of Polish art, with exhibitions at the library of the Polish Academy of Arts and the History Museum of Poland in Warsaw and at the Museum of Polish Art in Kassel. Berlin-based curator and educator Krzysztof Wojtas will also helm the inaugural exhibition.\n\n\nThe Lebanese-born American artist and filmmaker Ahmad al-Khatib has been named the winner of the third and final annual Prix de l'Europe, opening in Milan on September 8. The exhibition, titled \"Letters from Beirut,” was organized by the Chalcraft Foundation, the Art Center at Columbia University in New York, and the American Foundation for the Arts in Beirut.“I will send you my notes from the Muslim world,” al-Khatib wrote in a letter dated March 11, 2017 to the American Foundation for", "The next Biennial should take place in the spring of 2021.The exhibition will open on October 16 and be on view until November 30. The exhibition’s first floor will feature work by nineteen artists, including Kamala Harris, Nari Ward, and A.S. Larson, and the second floor will include works by forty-eight artists. As part of the event’s enlarged campaign for the future of the exhibition, the biennial will launch a new website, www.art6.org, and a new blog. “The future of the exhibition is at risk,” said Laura Mulvey, chair of the board of trustees of the Biennial Foundation. “The exhibition and the Biennial Foundation have been at the forefront of the fight to protect the legacy of the Biennial and to secure the future of the exhibition. We are ready to take the next step and to lead the way for the future of the exhibition.”\n\n\nYale Union, a nonprofit arts center located in downtown Portland, Oregon, was awarded a $10,000 grant from the Art Fund last week. The $5 million grant, which is the largest amount the organization has ever donated to an arts space, will allow the", "The next Biennial should take place in 2021 and would enable museums to be more transparent about their exhibition programs\u0097an issue that the institution has previously faced. “The first response we got from many was that we were crazy for opening in the first place,” DI Simon Tilson, the head of the biennial and curator of drawings at the Hammer Museum in Los Angeles, told the Art Newspaper. “We have been working hard to understand how our exhibitions would work with each other, how to work with other artists, and how to work with our audiences.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it has awarded $3.5 million in grants to eighty arts and cultural organizations across the city. The funds will allow the city to produce half a dozen new works by artists under the age of forty, and will support the development of the DMA’s Print on Paper Program, which will strive to produce seventy-three new works by forty-six artists by the end of 2020\u0097the first program in the city since 1991. “Over the past forty-six years, Print on Paper has delivered significant results for New York City,” said cultural affairs commissioner", "The next Biennial should be held in 2021 and will be hosted at the Württembergische Kunsthaus and the Württembergischer Kunst. Both the Kunsthaus and the Kunsthall have announced that they will not be able to bear the enormous costs associated with hosting the event. The Württembergischer Kunst has also pledged to reduce the size of its annual exhibition and has pledged to donate 1,500 artworks to the collection of the Kunsthaus in Berlin. In addition, Germany has issued a total of 20,000 fines and has committed to paying out an additional 12,000 by the end of the year. The Art Newspaper reports that this number will rise to 18,000 by the end of the year. After the news broke of the devastating fire on the building of a nearby warehouse, which houses the MCA, the German town of Beheira, and seventy other businesses, Germany’s Federal Association of Art and Design (Bundesauskunst) released a statement condemning the incident and pledging to support the Kunsthaus. The statement reads: “We express our solidarity with the Kunsthaus in", "The next Biennial should be held in 2021. The subject of the event will be “Art and the Human Body” (2019), curated by Lawrence AbuHamdan, and will host twelve artists representing forty-eight countries. The 2018 edition featured four artists from South Korea, including Kim Eun-sung and Kim Eun-go. The 2019 edition will be “The Future is Present” (2019), curated by Hiroshi Sugimoto, and will be held at the Museum of Modern Art in Tokyo. The event will be preceded by a series of exhibitions at the National Museum of Contemporary Art, Japan.The museum will also present a new exhibition, “Wowshow: Contemporary Art in Japan” (2019), at Gallery Iwo, Tokyo, on October 9. The exhibition will be followed by a solo exhibition of works by the Kim Kyung-ho and Kim Kyung-wo at the Museum of Contemporary Art in Seoul, which will be organized by the National Museum of Contemporary Art in Japan, and an award ceremony at the Kunsthalle Stuttgart, Germany, from October 15–19. The event will be held simultaneously in both Japanese and Korean, with an option to visit either language.", "The next Biennial should showcase the work of forty artists who have made important contributions to the field and should take place in the city’s central location. According to the artists, the change of location will allow the museum to “focus on the artists’ home countries,” while also “encouraging local participation by giving an opportunity to a select few to showcase their work in the museum’s collection.”\n\n\nThe University of Toronto announced today that it is collaborating with the Toronto-based nonprofit Tabitha B. Strong to create a new series of lectures and other public programming designed to offer a critical perspective on the human condition. Dubbed “Lets Talk About Things,” the event will take place at the city’s more than seventy public spaces across the city. The five-week program will focus on topics that are “at the core of our lives,” such as the connection between pain and social justice, and will be co-curated by two of Tabitha’s former students, Marisa Carrière and Julie Halbreich, and will be presented by the DuMont-based artist and musician Jamey Johnson.The partnership between the University and the", "The next Biennial should run from May 21 to May 28. The ten artists nominated for the award are: Salman Ghani, Sara Myles, Anwar Raad, Liu Yijun, Emanuele Brizzi, Alexandra Haiduk, Andrea Simon, Korra Sanchez, Noor Sultan, and Shirley Thompson.The award ceremony will take place on October 29 at the Contemporary Art Museum St. Louis. For the full list of winners, click here.\n\n\nNew York’s Metropolitan Museum of Art has received a gift of more than four hundred paintings from the American Civil War veteran and collector Joseph Papp, who passed away at age eighty-two on Tuesday, December 13. The works, which were acquired by the museum through a business partnership with the Papp Foundation in 2014, include works by such notable postwar American painters as Catherine O’Connell, Edsel & Edell, Sam Peckinpah, and Lane Adams.Among the works that have recently made the Met’s collection a museum sensation are Joseph Papp: The Waiting Room (1914), a tribute to the late American painter Henry Grimes, and", "The next Biennial should examine the contribution of the mid-twentieth century to the preservation and advancement of the Painted World (1930–2005), a statement of artistic principles that should consist of three stories. In the first part, the exhibition will explore the relationship between the Painted World and the twentieth century, including the Painted People, the Painted Land, and art and culture historically and culturally connected to the Painted World. “In the second part, the exhibition will explore the impact of the Painted World on contemporary and contemporary art,” the organizers said. “The third part of the exhibition will be a retrospective of the Painted World and the Painted People, which will be followed by a Q&A session with the artists and the Painted People’s children, Elisek and Sveinu, in the student section.”\n\n\nThe twenty-second edition of the Art Basel Hong Kong fair, which runs from March 8 to March 10, will be held in the city from June 5 to June 6, 2020, in a full Separate Exhibition Hall, the first time the event has been held in mainland China. The event will present twenty-six artists in twenty-four", "The next Biennial should open in 2019.\n\n\n\n\n\n\n​\n\n\n​\n\n\n​\n\n\n​\n\n\n​\n\n\nNew York: The Metropolitan Museum of Art, which has been working to cut 5,000 jobs in its branding and communications departments in an attempt to reduce costs by $40 million over the next three years, has revealed that it is now attempting to restructure the museum’s collection. According to the New York Times, the institution is also attempting to reduce the size of its outdoor space in the Hudson Yards development project and is planning to furlough or reduce the hours of some of the museum’s employees.“The restructuring plan was developed in consultation with the staff and with the advice of our board,” Mary Pat Dolan, the museum’s board chair, said in a statement. “We are making significant progress toward reopening as quickly as possible, but I believe we have a ways to go.”While the restructuring plan will reduce costs and improve the museum’s collection, the new staffing levels will only partially address the city’s demand for new works. State Senator Brad Hoyo, who represents parts of Chinatown and Lower Manhattan, has introduced legislation that would", "The next Biennial should focus on the conceptualization and visualizations of the urban ecosystem. The theme should be the 'Fertile Ground: Urban Life and Environment in the Age of Mechanical Reproduction” The exhibition will be organized as follows: The exhibition will be held in the city of Bologna under the collaboration between the local authorities of the city and the Biennale of the Italian city. The exhibition will also include a seminar on the theoretical implications of the exhibition. The year 2020 will be a critical point for the exhibition. The institution will be inaugurated by a series of performances and a symposium on the works presented in the exhibition, which will take place in the city of Bologna. The inaugural exhibition will be �The Periphery: An exploration of the human condition in the context of the environment,� which will feature the work of thirty-three artists from thirty-six countries, including Brazil, Austria, France, Germany, Mexico, Portugal, and Spain. The biennial will also include a special exhibition of the work of Christo, who will present the first exhibition devoted to his work, “Nirvana” in the city of Rome on October 26. The", "The next Biennial should be held in 2020, and the fourth in 2021. Both the museum and the artist will be forced to move the exhibition to the San Francisco Bay Area (SFFA), the East Coast, and the West Coast in order to accommodate the construction of the new museum. The move has forced a change of plans for the artists involved, who are now working to find a new venue in order to continue their work. “We are always working to find new ways to amplify the cultural life of the campus and to explore new ways to support the campus as it continues to grow,” said MCA director Christopher Scott. “The new museum is a critical step in that process. We are excited to see where this exhibition will take us next.”\n\n\nArtforum has learned that Zaha Hadid Architects, the Los Angeles–based firm responsible for the $5.9 billion redevelopment of the former headquarters of the Enrico/Giugiaro steel mill in West Los Angeles, will receive a sizable cash payment of $330 million from the bankruptcy auction. The funds will be split between the company and its creditors, including the steel mill’s former owner, the City of Los Angeles, and the Metropolitan Water", "The next Biennial should take place at the Ortega y Gasset Port of Spain, London, in 2022. Saying that the new work by Zoltán Kovacs—the director of the Art Institute of Chicago—is a “reflection of things that are different about our society,” the museum said: “It reflects the themes of our time, the questions we are all asking, and the possibilities of what images can be.”The 2019 edition featured work by forty-three artists, including Olaus Magnus, Ursula von Rydstorp, and Kiki Smith, among many others who were selected for their “experimental, politically oriented and self-taught” ways. The museum also revealed that it will hold its next edition in January 2021.\n\n\nThe Institute of Contemporary Art (ICA) in Berlin has announced that Svetlana Volkova, a Russian-born, Czech-raised artist whose industrial-grade paintings and sculptures invoke a feeling of weight and weightlessness that is both profound and bittersweet, has been awarded the Artistic Prize. The 2019 edition, “Avant-Garde: Modern Art in the Twenty-First Century,” was curated", "The next Biennial should be held in the spring of 2021. The museum will also be reopening in March 2022, by which time the original June 5 opening date for the exhibition will have been extended to June 30. The exhibition will then be followed by a series of artist activations in conjunction with the biennial, culminating with a special exhibition of work by the Belgian artist Jean-Luc Moulène, which will also be held at the museum in March 2020. 'The Future is Bright, but Not for Longer,” is scheduled to open in February 2020.The institution has faced mounting pressure to move the exhibition after the catastrophic terror attacks in Paris on November 13, 2015, which left twelve people dead and dozens injured. The Museum of Fine Arts (MFA) in Boston, which reopened in March, furloughed ninety-seven employees. The Boston Art Gallery, which reopened in April, furloughed ninety-two staff members. The Museum of Modern Art (MoMA), which reopened on June 14, furloughed seventy-three employees. The Museum of Modern Art and the Whitney Museum of American Art in New York, which reopened in May, respectively, furloughed eighty-five and", "The next Biennial should aim to present an intergenerational collection of works by women artists. The fifteen finalists will be chosen by a jury composed of the curator of contemporary art, the curator of photography art, the director of the Museum of Photography, and the director of the Studio Museum. The exhibition will be held in the new space of the Art Institute of Chicago and will be organized in collaboration with the artists and their families. The judges will consist of the curator of contemporary art, the curator of photography, the director of the Museum of Photography, and the artist.The selection committee will also decide on a final design for the pavilion, which will occupy a twenty-second floor space in the museum, by April 14. The pavilion will be divided into three sections: The Untitled, the Untitled: Contemporary Art, and the Untitled: Women. The Untitled section will feature works by female artists whose work has not yet been presented in an exhibition at the museum. The Untitled: Contemporary Art section will present work by women artists whose work has yet to be exhibited in an exhibition at the museum.The exhibition will be hosted at the Art Institute of Chicago until January 7, 2022.\n\n\nThe former headquarters of the New York City Department of Cultural", "The next Biennial should be held in late June or early July. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it will hold an exhibition of work by fifty-three artists from the San Francisco Bay Area, the San Francisco Bay Area Art Institute, and the California School of the Arts in early June. The exhibition, entitled “Away,” will run across three venues: the Bay Area Museum of Art and the Museum of Contemporary Art.The show will feature work by artists such as Karl Lagerfeldt, Don Saito, Alex Maurer, Peter Sellars, Carrie Mae Weems, and Michael Yee; will highlight selected exhibitions, projects, and performances and will focus on themes such as human rights, global migration, and art and art history. The exhibition will also include a silent auction.“The exhibition is a reflection of the Bay Area’s commitment to that of our artists, our region, and the region as a whole,” said MCA director Susana Faria. “In creating this exhibition, we are not only honoring the artists who have chosen to express themselves through these exhibition spaces, but we are also creating a platform for exhibition-goers to gain new", "The next Biennial should be held in 2021. The date has yet to be decided.\n\n\nThe Italian painter and sculptor Piet Mondrian has died at the age of eighty-nine.Born in Piedmont, Italy, in 1936, the son of a businessman and a homemaker, Mondrian studied under Marcel Breuer and Renate Renna before moving to Paris, where she met her companion Benoit. Together, they would go on to create political and popular works such as the Redenmeier Park, a 1970 sculpture by Mondrian and Benoit (the latter of whom died last year), which was relocated to the Fondazione Prada and is currently in the collection of the Pinacoteca dell Asti.The pair would collaborate again and again during their nearly thirty-year relationship, spanning from 1977 to 1988. The relationship would end in 1992, when Benoit left France to live in Rome. In Italy, Mondrian stayed in Paris to study under Graziano Cattelan and to draw. She would return to Rome in 1992, live there for the next decade, and return in 2017, when Benoit died.According to the New York Times, Benoit paid homage to Mondrian in a letter he", "The next Biennial should be announced in early September and will feature authors from Scandinavia and the United States. The exhibition will also invite the public to experience the exhibition as an inside-out performance with choreography, music, and dramatic installations in a performance format with a translation by the Danish artist Søren Kierkegaard.The Danish pavilion is the third international for the artist and his work is currently included in the series “The Moments of My Life,” curated by Anna-Karin Nevelsen at the Biennial in Copenhagen. The work is currently on display at the Copenhagen Art Museum. The second Biennial, “New Art from the Land,” curated by Hiromi Takeda at the Musée d’Orsay, was held in the same building in 2010.\n\n\nThe New York Museum of Modern Art (NYMoMA) is planning to move its next retrospective, “Into the Wild,” from September 11 to September 18, 2020. The exhibition is currently on view in the museum’s new location at 335 East Twenty-Third Street in Manhattan. The move also involves the reopening of its current exhibition space at 850 West Twenty-Third Street on September 8, 2020.", "The next Biennial should take place in 2021, and the next will be held in 2023. The art of the later works will be the subject of a special exhibition celebrating the fifteenth edition at the Skowhegan Museum of Art in Massachusetts in February 2022 and the seventeenth edition at the Museum of Modern Art in New York in March 2022. The Modern Art Museum Pittsburgh and the Museum of Contemporary Art Chicago have yet to announce their full programming plans for the 2030 and 2035 biennials.\n\n\nThe Museum of Modern Art (MoMA) in New York is working on several new initiatives to support the local arts and cultural community, including by giving $1 million to the Helen Frankenthaler Foundation, which helps facilitate artistic and cultural exchange between New York and surrounding communities; by launching a new initiative, the Art of the Moving Image, that will partner with local galleries to create public programming that will highlight the work of emerging and established artists; and by establishing a new $500,000 fund to support artist residencies across the city.The new fund will cover the costs of artist residencies, which are offered in an effort to give artists the opportunity to work remotely from May through June, and will also provide funding to help run the Helen Frankenthaler", "The next Biennial should take place in the autumn of next year. The third Biennial, which will be held in 2021, will take place in the spring of 2022.The announcement of the three 2020 designs came amid a wave of protests against the construction of new high-tech facilities in the city. A list of sixty demands issued by the artists outlines the issues that need to be addressed, including jobs, affordable housing, and climate justice. The biennial will be hosted by the Margate Art Centre in Margate, England, and is being funded by a $550,000 grant from the city of Margate. The artists are asking for the construction of 1,200 new social housing units, the scrapping of the construction of new factories and large scale projects, and the release of the social security numbers of the hundreds of thousands of people employed in the UK's industrial sector, which they believe is responsible for creating a huge deficit for the NHS. The demands were presented in a letter penned by Kate Crawford, the chair of the Artists’ Union, and Bobby Lee, the head of the Artists’ Union, to the city council in Margate, which is just outside of the city, and were drafted by the artists in order", "The next Biennial should be held in 2022. \n\n\n\n\n\n\nThe Gilbert & George Museum in New York has announced that it is planning to move the twenty-fourth edition of the Gilbert & George Sketch Competition, which was held in the museum’s former space on West Twenty-Third Street in October 2018, to the new William G. Armistead Building, which will be completed in the spring of 2021. The exhibition will also feature an additional work by two artists, a performance by a group, and a live performance.The move marks the first time the organization has relocated a major art event from one location to another since the institution opened in 1966. The move coincides with the reopening of Central Library, which was completed in partnership with the city of New York in October. The move also coincides with Artadia, a new initiative to support and build upon the productions and exhibitions of young and established artists.---The award-winning artist group Rael Al-Khelaifi has been chosen to represent Jordan at Artadia 2020. Al-Khelaifi’s work, which was selected for an exhibition at the Abu Dhabi Museum of Art in March, will be presented at the Jordan Art Biennial, which will be held in", "The next Biennial should be held at least twice a year in the third and fourth years, respectively. The first biennial, “Between the Worlds,” will be held at the same venue and will be led by Michael Moorcock. The second biennial, “The Power of Pictures,” will be held at a different venue and will be led by John Oster. The Third and Fourth Biennial will each be inaugurated with a new work by an artist whose practice we have yet to include in this year’s edition. The first Biennial will be held in May 2020 and will feature work by thirty-six artists, including Sara J. Maroney, Diana Al-Hadid, and Sara J. Abode, and will take up themes such as consciousness, light, the universe, and the concept of creation. The second biennial will be held in December 2021 and will feature work by twenty-nine artists, including Kazimir Kudakovsky, Ruth Ben-Hur, Juliette de la Hire, Hannah Wilke, Julie Yellin, Andrea Radwanska, and Vincent", "The next Biennial should be in February 2021. While the main themes of the upcoming edition will be Care, Responsibility, and Human Rights, the program will include a selection of works by artists who have had significant exhibitions in the past, such as Tilda Swinton’s The Emotion of the Body, 2009, or Jean-Michel Basquiat’s Tower of Babel.\n\n\nThe Museum of Modern Art (MoMA) in New York has released its list of seventy-six artists who will participate in the seventy-third edition of the Museum of Modern Art. Titled “Art in the Age of Resistance” and taking place in the Museum’s former home on West Twenty-Second Street from November 9–November 13, 2020, the exhibition will focus on “political and social movements that address issues of race, gender, colonialism, capitalism, and other hierarchies.”“The exhibition will also include works on African and African-American art and art history and will exhibit a retrospective exploring the history of African art and will launch a new digital program that will be free to the public from December 5–December 6, 2020.”The exhibition’s inaugural event, “September 11", "The next Biennial should focus on intergenerational communication, the history of art, and the history of the body. All of which is housed in a single building, in a place that has never been used for a major retrospective. In the next few months, we will organize public events, conduct research, and get the public to see the work of many artists, including the most famous of the show, Marie Seroussi, whose work is set in a stately, Romanesque courtyard in the city of Besançon, Tunis.”\n\n\nThe British artist Steven Scheuermann, whose space-age sculptures and paintings blend both visionary images and the mundane, has been awarded the Prix d’Art Moderne at the Palais de Tokyo in Paris. The first retrospective of his work to take place in French history, the exhibition will run from March 16 to March 19 in 2020. “I am thrilled to be a part of such a magnificent institution as the Palais de Tokyo, which has always considered the artist as a living thing,” said Scheuermann. “Through the installation of such a large and diverse collection that include works that are close to the heart, I hope to create a", "The next Biennial should take place in the city in 2020. \n\n\nThe French architect and collector Christian Neuer, who is known for his intensive research and experimentation in urbanism and design, has died at the age of eighty-one after a long illness. Neuer was born in the small town of Montreux, western France, in 1936. He studied at the École Polytechnique in Paris, and at the Institut de Métropole in Lyon, where he met his wife, Louise. Together they became a father-and-son duo, father and son, and eventually separated. In the 1960s, Neuer began incorporating live music, architecture, and materials in his public projects, and his fame grew with each. His work has been collected by the French Ministry of Culture, the Beaux-Arts Museum, the Museo de Arte Contemporáneo de Lyon, and the Museum of Modern Art.In 2007, the collection moved to Paris, where it will undergo a major renovation, and in 2009, the museum began a new exhibition “Antients,” which toured the collection from January to April, with the intent of presenting the work in a different context. In 2018,", "The next Biennial should be on January 22, 2020 and will be hosted by the Museo de Arte Contemporáneo in Madrid. Curator Miriam Bonsu has called the exhibition a “once-in-a-lifetime opportunity.” The inaugural edition was curated by artist and curator María Elena Celaya and will run concurrently with the museum’s five-week exhibition “Assemblies: Artists and Sectors in a Single Space” (April 21–June 21, 2020), marking the museum’s first stop in the country after the third world war. “These are extremely difficult years,” Celaya said. “At the same time, they are an opportunity, a response, a renewal, an attempt to create a more inclusive and equitable world.”She added: “In the past, it was easier to forget what it is to be human, to leave behind the self and its functions, and to focus on the next thing, the next moment, the next event. Today, it is even easier, particularly in society at large, to forget and to erase; to forget, to forget, to forget, to forget, to forget.", "The next Biennial should be held in 2021.\n\n\nArtists Omar Shihabani and Kij Johnson were appointed as directors of the newly launched Center for Art Cultural Research (CAR), a new initiative centered on the study of contemporary art. Both men hail from Saudi Arabia, where they have lived in Paris for the last decade and taught at the School of the Art Institute of Chicago in recent years.“The Center for Art Cultural Research will foster new modes of cultural exchange, experimentation and change through the interdisciplinary exploration of the history of art and art practice in general,” Shihabani and Johnson said in a joint statement. “Arts and culture are not only a source of inspiration and hope for many people, but also a lifeline for people without hope. The Center for Art Cultural Research will become an organizing tool for the spread of ideas and knowledge across the world to reach a new audience for art.”The inaugural exhibition, “Between the Sun and the Moon,” will feature forty works by thirty-six artists, including Carlos Arechiga, Arash Shamdar, Abdulsatim Farah, Faisal Hamdan, and Timur Kasser, and will open on September 7 at the J", "The next Biennial should be in 2021. The theme of this year’s section is “Movements of the Soul.” The institution will charge $28,000 per event, and will organize seventy-three live performances, including performances by artists such as Masahiro Ota, Koki Tanaka, and Lisa Toshida, as well as documentary videos by Sara Cwynar and Inés García.The biennial, titled The Last Days of the World, will run for two weeks and will feature performances, performances by artists, and performances by artists in a variety of mediums. The biennial is an extension of the body of work by Kippu Meny, whose work is housed in the collections of the Museum of Modern Art and the Metropolitan Museum of Art. The Metropolitan Museum of Art is planning to open its new Metropolitan Museum of Art in 2020. The institution is currently working on a new design for the new museum and is assessing the feasibility of opening in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has announced that it will reopen to the public on October 26, following a temporary closure due to the Covid-19 pandemic. The reopening,", "The next Biennial should be an open-ended experience that will include a series that reflects the various strands of our own lives and the many histories of our world. In the event of a crisis, a company museum will be able to surge online. In the event of a global outbreak, we will be able to send people to remote locations to be with friends, to have meals together, to shop together, to watch movies together, to read books together, to have discussions, to dance, to sing, to cook together, to go hiking together, to take food together, to go swimming together, to go skiing together, to go hiking together, to have a baby together, to have a picnic together, to go hiking together, to go climbing together, to go hiking together, to go hiking together, to have a baby together, to have a picnic together, to go hiking together, to go hiking together, to have a baby together, to have a picnic together, to go hiking together, to go hiking together, to go hiking together, to have a baby together, to have a picnic together, to go hiking together, to go hiking together, to go hiking together, to have a baby together, to have a picnic together, to go hiking together", "The next Biennial should be a step in the right direction. It should be a time for reflection on where we are as a culture and on what it means to be an artist and an activist. It should be a chance for us to come together as one, a chance to reimagine our future together. If we do, we will find that the climate of the planet is changing, and it will change for the better, and that the work of art and activism is central to our future success.”\n\n\nA group of artists and activists are demanding the release of Edward Kmett II, a US citizen in prison for war crimes and terrorism who was convicted of participating in the 2009 US invasion and occupation of Iraq, the detention and murder of thousands of Iraqis, and the illegal destruction of archaeological sites in the country.“We are deeply concerned that Kmett is still in prison and has been since his guilty verdict was returned in March 2019,” said Raheel Atiq, the executive director of the Arab American Society in New York. “We ask that he be set free on the basis of his freedom and not on the basis of political considerations.”Kmett, who was sentenced to twenty years in prison", "The next Biennial should take place in 2020, at the Paris-LaSuurienne, the Palais de Tokyo, and the Stedelijk Museum, and this year’s edition will include a retrospective of the artist’s work, Digitale, curated by the Danish curator Lars Ericsson, and Inteview, curated by the Austrian curator Steidl, in collaboration with artists such as Adrienne Atget, Alice Black, Claes Oldenburg, and Barbara Barozzi. The 2020 edition will run from March 10 to March 12. The 2020 edition will be inaugurated by a presentation of the work of the artist-in-residence, the Belgian artist Harjant Gill, who is currently on display at the Biennale of Sydney.  The biennial’s theme, “The Body and the Soul,” was chosen by a committee comprising Julie Dallenbach, director of the Dallenbach Museum of Art, New South Wales, and Elinor Cicutto, director of the Museo de Arte Contemporáneo, Italy. The inaugural exhibition will be in the exhibition space of the New Museum in", "The next Biennial should be held in the autumn of 2021.\n\n\nThe Italian government approved a $2.5 billion plan on Monday to help the country’s arts sector as it attempts to contain the coronavirus. The legislation, which aims to prevent the spread of Covid-19, which has been linked to coronavirus-related respiratory illnesses in at least thirty countries, including Italy, France, and the United States, and will be voted on by parliament in the autumn.The plan, which will undergo a parliamentary review, will not only provide financial support, but also include the development of new policies and a research infrastructure to support the cultural sector. The government will also create five million square feet of public space and will invest €2.5 billion into protecting the environment. The legislation also outlines the creation of a new agency to support the arts and creative industries in the country. The Ministry of Culture and of Arts will be tasked with creating a strategy for the arts, a cataloguing system for digital content, and the digitization of the collections and exhibitions.The plan was tabled after the country’s February 14 announcement that it would ban large gatherings of more than five hundred people as a way of reducing the number of cases. The", "The next Biennial should be held in 2021. On Friday, the museum held a special show of works by the artist Huajiro Noda. The show presented new works by Noda and highlights works from the artist’s previous exhibitions. In 2016, Noda was awarded the National Museum of Contemporary Art (MMCA) award for lifetime achievement.\n\n\nThe Haus der Kunst (HDK) in Berlin, which is housed in a former tin factory in a former nineteenth-century industrial zone, has received a $100,000 donation from Josef Struve. The donation was made by the German industrialist in recognition of his contributions to Berlin’s contemporary art.“The Haus der Kunst is one of the few remaining independent cultural organizations in the city, the only functioning cultural institution in the former East German state of Berlin, and a great success,” said Struve. “The purchase of its building and its archives by the W. M. Keck Foundation for the Arts, which is one of the major donors to the institution, is a tribute to Josef Struve and to the entire team at the Haus der Kunst.”The donation was made in honor of W. M.", "The next Biennial should be in March 2020. \n\n\nThe Museum of the City of New York (MOMO) has received a major donation of over one thousand works from the Museum of Modern Art (MoMA), which was founded in 1967, to date. The gift includes works by sixty-one artists from twenty-nine countries and territories, including Argentina, Brazil, Denmark, France, Germany, Italy, Mexico, and Peru.“The museum has been a community of artists since its inception, and we are proud to have contributed to their success with works by artists from all over the world,” said MOMO director and CEO Dana Danone. “This gift is the culmination of years of work by our artists to bring our exhibition program and our collection to life. We are thrilled to be able to present their work at MoMA in the form of an exhibition in the museum, and we express our gratitude to our donors for their generous support in creating this ambitious gift package.”The artists selected by the museum for the gift package are Cécile Barrette (France), Jean-Luc Barret (France), Olivier Bénétières (France), Andre", "The next Biennial should be held in Barcelona in September 2020. \n\n\nThe Toledo Museum of Art (TMA) in Ohio has been awarded an additional $200,000 in support of its $1.2 billion fundraising campaign. The gift was made during a special exhibition of the Toledo Museum of Art’s original works—which were on display for the first time in the museum’s history—on March 6. The Toledo Museum of Art, which is one of the largest arts institutions in Ohio, has received a total of $46 million from the Biennial Fund since its inception in 2017.In recognition of the outstanding leadership and vision of the museum, the Toledo Museum of Art received a $25,000 gift from the Toledo Partnership for Education Fund. The fund provides support for the Toledo Museum of Art’s program, and will allocate a portion of the funds for capital improvements. The partnership’s board president, Thomas G. Oehlen, said: “TMA’s commitment to education and engagement with the Toledo community and our region has been and continues to be an indelible mark in Toledo’s legacy. The Toledo Partnership for Education Fund is proud to support the Toledo Museum of Art and the Toledo", "The next Biennial should be held in 2021.”\n\n\nThe Huis Charles Huis Museum in Paris, which houses the collections of the Jean-Michel Basel-designed and Emile Péri and Maurice Berlant, has suspended its next edition, which was supposed to take place in December 2019. The announcement follows a series of setbacks for the institution, including the August 2019 cancellation of a major show on the history of photography, “Photographs in the Hall of the Master” (Scheduled for October 21–November 5), and the December 2019 postponement of a show on Matisse & Picasso.The highlight of the seventy-five-year history of the Huis Charles Huis, which also comprises three sections: Art History, Modern Art, and Contemporary Art, is the first part of the show, “The History of Photography” (July 19–July 21), which was to be held at the Huis Charles Huis from January 18 to January 21, 2020. The show was rescheduled for its 2022 edition, “The Future of Photography,” and will now take place at the Dessalines Gallery in Paris. The show’s curator, Anne‐Marie Del", "The next Biennial should be held sometime in the 2020s. The Gordons will continue to be active and to inspire others to do the same—by incorporating indigenous knowledge, arts, and cultures into their practice and by promoting the work of those who have not yet been recognized.\n\n\nThe Museum of Fine Arts (MFA) in Houston has received a gift of twenty-two works by Jean-Michel Basquiat in its collection. The museum announced that it had acquired the works, which were donated by a group led by the Montreal-born Basquiat’s grandson, Pierre, in 2018. The museum said that the gift was made in support of “the millions of artists and collectors who have contributed to the museum’s collection over the years.” Pierre and his wife, Marie-France, said that the collection is now now an “important asset to many artists and collectors, and a strong symbol of Jean-Michel’s vision and integrity.”Previously, the museum had used proceeds from Bonhams auction house in London to secure the works. The donation was made in recognition of the museum’s partnership with Bonhams, which began in 2015. The institution said that it plans", "The next Biennial should be held in 2020. The full list of curators is as follows:Gregory Berns (July-December 2020)Stefanie Bachman (January-March 2020)Marina Berra (March-July 2020)Bette Baumann (October-March 2020)Tania Bruguera (September-December 2020)Yelena Buryakov (October-April 2020)Adam Cameron (September-December 2020)Mary-Kate Curry (October-March 2020)Karen Bright (October-June 2020)Paul Davidson (October-March 2019)Hélio de la Perencia (October-March 2020)Sharon Edwards (October-March 2020)Sharon Eyles (October-May 2020)David Moberg (October-March 2019)Colin Fell (June-July 2020)David Gray (October-March 2020)Missy Higgins (October-March 2019)Conor Harrington (October-March 2019)Ricco Maugieri (October-March 2019)Christopher Leahy (October-March 2019)Scottish artist Paul Mally (October-March 2019)Benedict Anderson (August 2019)Louise Bourgeois (October-March 2019)John Blashill (", "The next Biennial should be announced soon. The full list of participating artists is as follows:Angel Dos Reis, New Mexico Colored Prints, 2017Theatres and Gallery AssociationsLLC TheaterLabyrinth Art Gallery, 2017TheaterLabyrinth Art Gallery, New York(Limited)LPA, New York(Limited)ALA, Los Angeles(Limited)ArtistsWho Live Together, 2016TheatreLabyrinth Art Gallery, New York(Limited)Alberto Parra, Los Angeles(Limited)BARCO, New York(Limited)BARBARA PROJECTS, 2019(Limited)BARBARA PROJECTS, 2019(Limited)BARBARA PROJECTS, 2019(Limited)BARBARA PROJECTS, 2019(Limited)BARBARA PROJECTS, 2019(Limited)BARBARA PROJECTS, 2019(Limited)BARBARA PROJECTS, 2019(Limited)BARBARA PROJECTS, 2019(Limited)BARBARA JOURNEY, 2019(Limited)BARBARA PROJECTS, 2019(Limited)BARBARA PROJECTS, 2019(Limited)BARBARA PROJECTS,", "The next Biennial should be held in 2021 and the first in 2022. The museum’s director, Park Chan-Kyong, said: “Once the Archipelago has a new collection, the museum will begin to thrive anew. The Archipelago will achieve its ambitious goal of circulating more than five thousand works by eighty artists in the shortest possible time. We are currently working on a new art program that will make this possible. We look forward to welcoming you to the museum.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has received a gift of more than one hundred photographs by Lewis Hine, a prolific American photographer whose work combines surrealism, urbanism, and political activism. The gift includes a number of photographs dating from the 1930s through the 1970s, including Reichstag, 1949; Workers, 1949; and the Los Angeles riots of 1968, taken in the San Fernando Valley.Born in New York City in 1933, Hine began his career as a landscape and photojournalist in the 1940s, when he was still in high school. He was a frequent contributor to the magazine Avant-Garde . He began his photographs for the 1970s by moving to Los Angeles, where he", "The next Biennial should be held in the autumn of 2020. \n\n\nThe Royal Academy of Arts (RA) in London has received a gift of fifty-six works from the African American art historian Yehudi Menuhin. Merchant of Venice, a forthcoming exhibition at the RA, will feature sixty-eight works by Menuhin, who is black, and will highlight the work of artists of African descent.“The gift of works from the RA is both a debt of gratitude and an affirmation of his vision and leadership,” Menuhin said in a statement. “I am honored to be the recipient of this extraordinary collection of works by a gifted and committed scholar.”The works, which date from the twentieth century to the twentieth century, were selected from a shortlist that included Hayao Miyazaki, Yinka Shonibare, and Naama Tsabar. Menuhin, who has taught at the RA since 2004, was nominated for the prize in a ceremony held on September 13, 2020. The biennial will include performances and installations by artists of African descent including Gerardo Alfaro, Gerald Black, and Kaunda Makhu, as well as a presentation of works by luminaries", "The next Biennial should take place in the summer of 2022. The venue will host the exhibition “On Moving Images” (2019), a joint project between the Museum of Modern Art and the Kunsthalle Basel; will also stage “The Perfect Embody: ‘After Art’ between the Paintings of Jean-Paul Sartre and Pierre-Paul Pucci” (2019); and is currently working on a new exhibition of work from the artist’s personal collection.\n\n\n\n\n\nThe École des Hautes Études (EHFX) in Paris, which was temporarily closed in March 2019 due to the Covid-19 pandemic, has announced that it will reopen in the spring. The event will mark the eighty-fourth edition of the fair, which will run from March 18 to March 22.Located at the Paris Saint-Germain and the St. Denis-le-Grand, the fair will also have a digital edition through the École Sans Frontières, which is planning to start a similar event online by the end of the year.The EHFX’s digital edition will feature 360-degree photographs by dozens of contemporary artists and will present the first public viewing", "The next Biennial should take place in the fall of 2020.\n\n\nAfter a number of small works, including the recent exhibition “Alice and Thomas,” in the Art Institute of Chicago, a public inquiry into the role of art in the development of the Chicago suburbs has been organized by the city of Chicago, the Art Institute of Chicago, and the artists. The event, which will feature work by forty-one artists, will confront the legacy of artist-designed neighborhoods and the legacy of artists who are working in the suburbs. The artists’ first exhibition is “The Markets in the Yards,” which was curated by the Chicago-based firm The Market Project. The exhibition will run until October 31. “This is an unprecedented moment for Chicago and the city,” said David Chernin, the city’s director of transportation and infrastructure. “We are grateful to the city’s residents, the architects, and the staff of the Greater Chicago Museum of Art and the artists who have contributed to this year’s exhibition. They have been essential to creating and sustaining the exhibition, which will now celebrate its thirty-sixth anniversary.” The exhibition will also introduce new and expanded", "The next Biennial should take place in the fall of 2020. The 2019 exhibition is scheduled to close on September 18, and the 2019 film Biennial of Women’s Art in London is currently on view.\n\n\nThe Museum of Fine Arts (MFA) in Oklahoma City, which was forced to move the exhibition “Art of Human Reproduction” due to safety concerns, has added two more works by its alumni to its collection. The institution also announced that it is expanding the number of works in its holdings to twenty-five in the first half of 2020.The works, which were acquired through the $500,000 MFA Foundation gift in 2017, were selected from a pool of twenty-five artists through a public competition held last November. The artist who received the most votes was Pete Grosse, a Kansas City native whose Transformer series was nominated for a Pulitzer. The prize jury voted in favor of the work, which is a reworking of the artist’s 1980s performance/composition The Body, which features a man as he transforms into a female “transformer.” The works are currently on display in the MFA’s new exhibition “Presentation,” which opened", "The next Biennial should be a great success—it is better to be a success in a time of ruin than in one of disorder and disorder.” The next edition of the Art Newspaper, held in the French capital in 1970, was canceled for undisclosed reasons. It was only in 1973 that the biennial was revived in Madrid, where it had been held since 1937.\n\n\nMarkus Schlieffenbach, the director of the Kunsthalle Basel and a longtime supporter of the Kunstverein, has been appointed the next chair of the United Kingdom’s Craft Council, the umbrella organization that oversees the annual event\u0097known as the Bonhams Museum of Art in London\u0097just days from its 75th anniversary this fall. In his new role, Schlieffenbach will serve as a platform for British artists to present their work at the prestigious event.Schlieffenbach, who first participated in the annual event in 1984, will assume his post in September 2019. He succeeds Simon Lee, who stepped down from the leadership role in March 2019, and is tasked with continuing the work of the agency’s board and ensuring the event continues to thrive and flourish in the years to come.“It’s", "The next Biennial should be held in 2020, with the opening of the exhibition “The Absence of Noise: Critical Studies on Art” curated by Günther Böhmer. The second exhibition, “Early Modern Art” curated by Antony Hudek will be held in 2021. The third exhibition, “Tobacco, Politics, and Art” will be held in 2022. \n\n\nOn Thursday, the United Kingdom released a long-awaited Brexit bill that will overhaul the country’s departure from the European Union. The legislation, which will be formally presented to Parliament by Prime Minister Boris Johnson at the end of March, will make significant provisions that will benefit businesses and the arts, and will also introduce new taxes and regulations that will benefit the working and middle classes.However, critics of the bill—including some three hundred academics, arts professionals, arts workers, and arts organizations who signed a letter published by the Association of Public and Commercial Art—say that the legislation is far too vague and that it does not define what it means for a small business, for example, to be able to leave the European Union but still be able to operate in the UK. The letter points to two subsections of the", "The next Biennial should be held in late June or early July and will take place in San Francisco. Artist-in-Residence: Michele BaczinkaWith his first solo exhibition in the United States at the Metropolitan Museum of Art in New York between August 1974 and December 1975, Baczinka became a pioneer of the neoliberal, market-based aesthetic. His work has recently been collected by the Museum of Fine Arts in Boston; the Museum of Modern Art; and the Museum of Modern Art in New York. Michael Kounro, New YorkKounro, who was previously known as Michael ŜKounro, \"Kunroism,\" at the time of his death, was a painter and sculptor well-known for his practice, which involves fabrications that are constructed within a web of overlapping fabrications, including woven structures such as the tessellated roof of the New Museum in New York. Kounro’s work has been collected by the Museum of Modern Art, the Museum of the City of New York, the Museum of Modern Art, the Museum of Modern Art, the Museum of Modern Art, the Museum of Modern Art, the Museum of Contemporary Art, the Museum of Contemporary Art, the Museum", "The next Biennial should be held in 2024.\n\n\nArt-world titan John Graham, who championed the new medium of film and who set up the industrial-technological complex that became the foundation of modern art, has died at age eighty-nine at his home in New York City. Born on December 4, 1943, in Wilmington, Delaware, Graham moved to New York at age nine with his family in search of a new and more affordable form of entertainment. He eventually settled in the Hudson Valley, where he met his future wife, Bess. Together they would grow the art world’s first institution, Graham’s eponymous venue, which would take shape in a converted barn.The couple’s first film project, a nineteen-channel video archive called the Family Video Gallery, debuted in an episode of Saturday Night Live in 1975. Graham went on to organize the first annual Short Film Festival, which featured short films by arts and cultural figures including Jack Nicholson, Rob Delaney, John Cage, and Jean Luc Godard, and was a founding member of the Film Institute. Graham’s continuing contributions to the film field include his first retrospective, “The Untouchables,” which debuted at the Museum of Modern Art", "The next Biennial should be held in late March or early April. The organizers told the Art Newspaper that the event will have an additional theme “passionate love,” and will be held in the city of Biennale Victoria, in the northern French city of Saint-Brie. The event will be organized as a collaborative venture between the museum and the French institution; the venue will house the works in a “shared legacy.”The exhibition will spend a month traveling around France and France’s colonies, the Congo, the Democratic Republic of Congo, and Senegal, and will feature the works of fifty artists, including Adam and Adamu Zulu, Laure, Herbert Lucian, and Eisa Jumbe, as well as artworks from France’s haute-couture sector, including the first project of the renowned French sculptor Jean-Luc Martinez, the first work of Jean-Marie Spaeth, and the first installation of Jean-Michel Basquiat.The exhibition will also present the French artist’s first solo exhibition in the United States. In September, the museum will stage the artist’s first show in the United Kingdom. The Biennial was established by the French", "The next Biennial should be held in 2021, and the date of the previous one will be preserved. The paintings will be included in a special exhibition “The Rise and Fall of Pablo Picasso,” which will be staged in the museum from March 5 to March 9, 2020, and will be restored by the end of the year. “A biennial is an important time to present the work of a great artist, and in this case that is Pablo Picasso,” said Artnet. The program is centered around the artist’s legendary portrait of the American Indian, Big and Little, which has been housed in the museum since 1955. The works of Picasso’s contemporary, João Varejão, and his contemporaries have been included in other biennials, including the 1964 and 1968 editions.The biennial will be hosted by the Museu de Arte de São Paulo (MASP), along with the Museu de Fleas, the Museu de Arte de São Paulo (MAPS) and the Museu de Arte de São Paulo (MASP). \n\n\nThe Metropolitan Museum of Art in New York has appointed Deborah Fischer as its next director. She succeeds Edward", "The next Biennial should be organized in 2021. “The fact that the work is here is a testimony to the beauty of the work and the power of the gift,” said curator Polly Stansfeld. “Henry is a master of his craft, and we are so fortunate to have him here in New York. The quality of his paintings is beyond reproach, and his ability to push the boundaries of sculpture and painting is unparalleled.”\n\n\nCases have been opened in the United States following the discovery of more than 2,000 cultural artifacts that were looted from the State Museum of Fine Arts (SMFA) in the Bronx following a fire that broke out on the museum’s roof in April 2019. The New York Times reports that the gallery-owned artworks were originally donated to the institution by the artist Hélio Pérez-Montes. However, the institution’s longtime owner, Jorge Martin, decided to sell them in 2017, when Hélio’s ashes were interred in the cemetery. The works, which include works by painters such as Agustín Castañeda, Robert Zapata, and Lévy Gorvy, were eventually removed from the museum in a ceremony", "The next Biennial should take place in New York in 2021. In Paris in 2021, and Berlin in 2022.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has announced that it is planning to divest from over $1 billion worth of assets under management, a move that will allow the museum to maintain more balance in its finances and avoid making major investments in the temporary exhibitions and programming.“We decided to hold off on making major investments in art over the last few years,” said Betty Barrows, chair of the board of trustees of the museum. “The new strategic plan lays out how we will manage our cash and assets in order to better optimize our investments for the long-term. The plan also outlines how we can generate more revenue from traveling exhibitions and events and provide more flexibility to our artists.”Barrows also outlined what she views as the best ways that MoCA can reduce its debt. “While we are committed to sustainable models of operation and creating new programs, we believe it is possible to have a more balanced approach,” she said. “We believe reducing our debt through a combination of dividends, sales, and retirements could be a more cost-effective way to achieve this.�", "The next Biennial should take place in the spring of 2020.\n\n\nThe German Federal Office of Culture (BfV) has announced that it is preparing to officially ask the state to pay $34 million to the heirs of the late artist and architect Johann Wolfgang von Goethe—who was instrumental in the development of the Nazi Party and adopted their surname. The sum will likely rise to $48 million once the family has received all of the legal administration costs related to the artworks—a financial request that may also be made once the family certifies that the estate is in good standing.The organization will decide on a reimbursable basis once a committee comprising Joschka, the former chief of the Bauhaus, and Alfred Neue Presse, chairman of the Meissner-Stiftung, has approved the request. If approved by the state, the family will be given thirty days to prepare an application for the reimbursement and will be given the option of requesting the funds be used for funeral expenses. If the request is denied, the estate will not be reimbursed.The Bauhaus, which was founded in Goethe’s hometown of Neukölln in 1935, was an umbrella organization", "The next Biennial should be ready by the middle of April and will run for ten weeks. The next will be three months later. The next will be for contemporary art, and the next will be for photography. The next will be an exploration of the relationship between art and the environment and will be open to the public from March 19 to March 21. The next will be an exhibition of work by the artist Stan Brakhage and will be staged at the Philbrook Gallery in Birmingham between March 16 and March 19. It will also be open to the public from March 16 to March 16 and will be free to the public. The next Biennial will be 'The Very Best of Art and the Environment.” The 2030 event, which will be held in Wales, will be one hundred percent digital and will host twenty-six artists. Among the artists chosen for the platform are Reid Hoffman, David H. Lawrence, David Rose, Victoria Miro, and Andy Warhol. The artist-run organization will also feature a selection of works by ninety-nine contemporary artists, including Altmann, Sara Passe (New York/London), Glauber Niemeyer, Andy Warhol (New York), and Ed Ruscha (", "The next Biennial should conclude with the opening of the exhibition “The Pale: Art and the Making of Modern Life” (2019), curated by Mark Bradford with the collaboration of the British National Gallery and the Institute of Contemporary Arts, London. The Biennial will also feature works by artists whose works are currently on view in London’s Tate galleries or at the Tate.The biennial will be hosted by the artistic director, Simon Rogers, at the Art Institute of Chicago, and will run until April 11. It will celebrate the 100th anniversary of the move to Chicago and will showcase several new works by artists who have been selected for the biennial. The biennial will also explore the legacy of American Modernism, with work by artists whose work had a major impact on contemporary art and which are no longer in use.\n\n\nAndrew Kreps Gallery, the New York contemporary art museum founded by John S. and James L. Knight in 1943, is suing the estate of the late American photographer and his wife in an attempt to recover some of the $325,000 the family gave to the institution. The family’s heirs claim that the institution sold the photographs by Kreps, who was known for capturing images of his wife and children, and", "The next Biennial should take place at the Blacktown Art Museum in Mumbai next year. The 2017 edition took place at the Blacktown Art Museum in Mumbai and focused on a group exhibition of works by artists from the Sirohii group, a collection comprising Sulkumar Maurya (2017), Sahia Masih (2017), Kehinde Dhar (2009), and Yuriyendra Pal (2018). \n\n\nThe British Museum in London, which has been closed since March 11 due to the Covid-19 pandemic and is currently closed for three months, will welcome visitors back to the institution for a second visit this week. On Wednesday, the museum tweeted that it plans to reopen to the public, but only if the Covid-19 lockdown is broken. If it remains closed through the end of May, the museum will be closed for six months.“We are fully aware of the challenges and uncertainties of reopening a museum in a fast-moving global health crisis, but we are determined to go forward with a robust programme of exhibitions, performances, educational programming, and public activities if the necessary safety measures are effectively in place,” director Hartwig Fischer said. “Our immediate priority", "The next Biennial should be held in 2021.  “It took a lot of courage on their part to leave their families and move to Montreal for a year, but they have done this to their children, and their successors,” said Maureen Provenzano, president of the Biennale de Montreal.The decision to move the exhibition space was made in an attempt to meet the demands of both the institution and the city of Montreal. In order to accommodate the demand for more permanent exhibition space, the Biennale de Montreal is planning to close its doors for a period of fifteen years. In order to reduce the risk of a structural collapse, the museum is also planning to move the exhibition hall to a different space in the city.“The museum is not going to move until it has recovered fully from the economic impact of the pandemic,” said Marc-Olivier Gauthier, the Biennale’s board of trustees president. “As soon as we see progress, we will make another decision.”The move has been controversial in Quebec. The province’s cultural sector is currently engaged in a campaign to have the museum moved from its current location in Saint-Denis, on the", "The next Biennial should be held in the autumn of next year and will span twenty-five years to offer an international platform for the work of the artist in an effort to provide an alternative model for future exhibitions. The exhibition will also coincide with the theme of the twenty-third Biennial, “Cultural History as Narrative. Art as Narrative.” ; Artforum.com reports that the twenty-third Biennial, “There is no such thing as art,” will go on view in the fall of 2020. \n\n\nThe University of California Berkeley and the Los Angeles County Museum of Art (LACMA) today announced they have entered into an agreement that will preserve the historic Los Angeles County Museum of Art (LACMA) through at least the end of 2020. Under the agreement, which was first reported by the Los Angeles Times, the two institutions will devote their full resources to restoring the landmark cultural institution, which has been closed since June 26, 2020, and will collaborate in a manner that maximizes the likelihood of its survival.“We’re thrilled to be working with LACMA to help them to restore and expand the museum’s iconic architecture and landscape,” said Mark Be", "The next Biennial should have an immediate decision process that will be accessible to the public, a budget that will respect the biennial’s timeline and budget, and a dedicated staff that will work collaboratively with the public. The theme for the 2020 edition is “The Force and Forcefulness” and the two-hour event will take place in the city’s Central Park. “The works presented at the 2019 Biennial are challenging to understand and describe, yet still manage to reveal,” said Lorenzo Raffas, director of the Museo de Artes Plásticas (MAS). “With the focus on the spiritual and political, the 2018 and 2018 was the largest exhibition that MAS has staged, and the new work will be the largest exhibition MAS has staged in over twenty years.”For the 2019 edition, the museum developed an immersive experience to accompany the exhibition, which was curated by Domenico Martini, and to showcase new works by ANDRZEJ Wajda. The center also added three new galleries: the Rijksmuseum Amsterdam, the Glimcher Museum Amsterdam, and the Helsinki Biennale. The event will be held in", "The next Biennial should take place in 2021 and will be staged at the São Paulo Centro de Artesola (SPAC) and the São Paulo State University’s Museum of Art.  In future years, the exhibition will take place across the city’s fourteen campuses, with the exhibition opening on the same day as the upcoming Copa America Centro de Artesola and Mexico City Triennials. The exhibition will also mark the city’s first retrospective of artist Wangechi Mutu, whose work is highly regarded internationally.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has announced that it is considering building two new homes for the collection of British colonialists Cecil Rhodes and Adolf Hitler, with the first proposed as a museum in the former slave quarters of York, and the latter as a museum in the former concentration camp in the German city of Sachsenhausen.A board of trustees chaired by Christie’s chairman Christopher Graham also chairs a commission formed by the museum to study the potential development of the collection in the hope that it may be included in a new $8 billion renovation of the museum—a plan that has been in the works for some time and is estimated to cost $", "The next Biennial should be held in the summer of 2020, and the first in the fall of 2021.  If all goes as planned, biennials will open in the spring of 2022. \n\n\nThe Museum of Contemporary Art (MoCA), London, and the Queens Museum, New York, announced today that they will collaborate on an exhibition, “Beyond a Second,” that will focus on the history of art and will be presented in 2021. The exhibition will feature work by twenty-six artists, including Dennis Muren, Alan Gordon, and Rujeko Hockley, among others from the Los Angeles–based conceptual collective Rosens, and will be curated by Paloma Niles, curator of the Los Angeles Biennial, and Kim Kwan.“We are thrilled that Helen and Kim Kwan are collaborating on such a powerful exhibition that will bring together a diverse group of artists who represent an incredibly diverse range of art histories and practices,” said Helen Klawe, chair of the board of trustees. “This exhibition will introduce an entirely new and fresh perspective on an inter-generational history that will be a source of immense inspiration for future curators and students. It will inspire and inform", "The next Biennial should be ready in the autumn. The 2012 edition, which was held at the Institute of Contemporary Arts, London, was staged in the Georgian town of Tavistock and included works by the likes of David Adjay, Frank Gehry, and Thomas Mihailo.\n\n\nSarah, the artist-run collective of which I served as a board member from 2004 to 2008, has been accused of fraud and breach of contract by a number of her fellow artists, who claim that her work was commissioned to them by another organization. “We’re talking about a work that was made by Sarah, commissioned by Sarah, and then sold to us by another organization,” Tiffany L. DeCamp, a cofounder of Sarah, told Artnet News. “I’ve been involved in Sarah for years and years, and know her personally and know she’s capable of amazing work.”However, in an attempt to distance herself from the group, the artist-run collective issued a statement on March 29 accusing the other members of engaging in “a blatant conflict of interest” by selling their work to the collection. “We feel deeply offended by the accusations against Sarah,” the statement", "The next Biennial should be held at the new museum in 2021, when the museum will be completely renovated and will be able to host two hundred exhibitions each year.\n\n\nThe Royal Academy of Arts (RA) in London has announced the appointment of Helen Leslie as its next director. Leslie will be responsible for supporting the RAA’s newly commissioned new series of Studies in Art and Architecture. She succeeds Jo Brand, who retired in March 2019 after twelve years at the helm of the museum.“We are thrilled to welcome Helen to the RA,” said RA board member Sonia MacGill. “With her vast experience and impressive understanding of the art history and architecture of the UK, Helen has the opportunity to continue to build on the legacy of the RA as one of the most important academic centres in the world.”A curator and researcher, Leslie focuses on how art history and architecture interact with the cultural and social history of the UK, examining how art has shaped social change in the UK, and how modern architecture relates to art history. In her new role, she will lead the RAA’s new series of lectures and seminars, which will take the form of a series of lectures delivered by RA curators, as well as work", "The next Biennial should take place in 2023.  The institute will also open a faculty lounge at the university in 2021.\n\n\n\n\n\n\nNew York City’s City Council approved a $5.13 billion budget for arts and cultural organizations in its fiscal year 2018 budget proposal, which was released on Tuesday. The $2.2 trillion budget represents a 10 percent increase from the fiscal year 2016 budget, which was passed by a vote of council members last month. The increase was made by $500 million, or 9 percent, from the $2.04 trillion the city spent last year.The $2.04 trillion was split into three categories: “General Fund;” “Local, Regional, and Special; and “Fiscal Year 2019.” The Local Fund will receive $1.25 billion; the Regional Fund will receive $0.75 billion; and the Fiscal Year 2019 will receive $1.75 billion. The Local Fiscal Year 2019 will be used to reduce the expenses of arts and cultural organizations through countless programs, such as the New York City Budget Emergency Response Fund, the New York City Arts & Cultural Impact Fund, and the New York", "The next Biennial should be held in 2022, and the year after that. The 2019 event, titled “The End of an Era,” was held at the Württembergischer Kunstverein (Württemberg Castle), Berlin. The traditional festival, which was held in the German capital’s Kreuzberg district, was canceled due to the coronavirus. The biennial was to have been held at the Kunsthalle Neue Rech, Neukölln, Berlin, and at the Artstadt in Frankfurt.The organizers of the biennial, Jörg Haideri of the University of Applied Arts in Leipzig and Wolfgang Best, have decided to postpone the event indefinitely. “In order to avoid any disruption to the work of the exhibition and to avoid the need for changes of venue and with the support of many members of the show’s staff, offices, and the curators, we have decided to postpone the show until the end of December at the earliest,” the organizers wrote in a statement on Instagram.The full list of participating artists is as follows: \n\nThe Hoa Ngai Gallery, New York, NY: Closed until further notice until further", "The next Biennial should take place at the Museum of London, alongside the exhibition “The Age of Television” in 2021. The central institution will host at least twelve films each year and “The Sitter,” a documentary about a group of artists and their struggle to survive in a housing estate in the London borough of Hackney, in 2021.The partnership between the two institutions also includes the ongoing development of the museum’s new museum of London garden, which will be inaugurated by an exhibition of work by forty British artists in 2020, and the museum’s new exhibition space, which will open in the summer of 2021. The new museum will be a joint project of the two institutions.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MCA) has received a $3 million donation from the Jerome and Edith Gaines Foundation in support of the opening of its new museum on the city’s North Beach. The $3 million gift comes after the foundation, which was founded by the couple in 1969, awarded the museum $2.5 million in 2017.The foundation partnered with MoCA’s parent organization, the city of Los Angeles, to renovate MCA’s current home", "The next Biennial should take place in the spring of 2025.\" The commissioning of a new exhibition, “Amerika” will begin in the spring of 2021. The works will be on view in a new exhibition, “Amerika,” at the Museum of Fine Arts, Boston, in the fall of 2021.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York announced today that it has launched an initiative to support the artists and creators who have made significant contributions to the museum’s collection. Under the direction of director Christopher Soghoian, the museum will collaborate with the artist-run collective the Make Room, whose current exhibition “Amerika,” will open on September 16, 2021, in a partnership with the Museum of Modern Art, where it will remain until the end of the year.The initiative, which has a budget of $7.5 million, will be led by Shimon Prokupek, who previously served as the executive director of the artist’s collective Circle. MoMA will collaborate with 40 local government agencies and nonprofits to develop a creative program that will complement the museum’s current exhibitions and operations, including the Modern Art Museum, the Metropolitan", "The next Biennial should be held at the theme park, which is located in the city of Ghent, Belgium. The exhibition will run from March 22 to March 30. The first edition, “The Caravan of the Blue Danube,” was staged at the Ghent Biennial in 2017. The next edition, “The Future of Landscapes,” will be staged at the NOS Biennial in the city of Antwerp in the summer of 2020. The Ghent Biennial is also organizing a second edition of the show, which will be held in the city of Ghent, in 2021.\n\n\nThe City of Atlanta is moving ahead with the construction of a $1 billion new museum and exhibition complex that will include galleries, educational programming, public spaces, and a hotel. The $600 million museum is part of a $1 trillion plan that aims to revitalize downtown as the epicenter of the city’s cultural life. The museum, part of Atlanta’s $9 billion Master Plan, will create approximately 1,200 jobs. The complex will also include room for the Master’s Collection, the Georgia Museum of Art’s permanent collection, and artist studios.The new museum will", "The next Biennial should focus on fostering a more holistic approach to the exhibition of the arts,” said Ann Demeulem, chair of the board of trustees. The theme of the 2021 edition is “Standing in the Light,” a statement by artist Nadezhda Savchenko that combines the story of her life and the art of the photograph. The artist, who rose to prominence in the 1980s through her work representing nationalities such as Lonnie Saduš, Nazaré Akunyili, and Daina Nasir, has been featured in several major international exhibitions, such as the 1988 Venice Biennale, the 2000 Group Show in New York, and the 2009 Biennial of the Arts in Istanbul. \n\n\nThe National Gallery in London announced today that it plans to invest over $150 million into its endowment in 2020. The capital institution said the overhaul is part of a “new, ambitious vision for the National Gallery,” which it said will amplify the museum’s existing work by modernizing and rebalancing 13 existing buildings and adding four new galleries and the arthouse.The change will also see the building renovated by a team led by sculptor Mahira El Me", "The next Biennial should focus on “aspects of the physical, cultural, and political experience of the twentieth century’s Pacific Rim. Applying a new scientific and technological perspective, the exhibition should explore the origins of modernity, the impact of the Pacific on world politics, and the time of the next century.”The full list of participating artists is as follows:Ariana ArquetteArtur Bautista João (Brazil)Arturo Brindisi (Brazil)Dario Celli (Brazil)Julia Cesarco (Brazil)Nina Cesarco (Brazil)Adriano Cesarco (Brazil)Alberto Cesarco (Brazil)Cristina Cesarco (Brazil)Oscar de Burga (Uruguay)Ricardo de Castro (Brazil)Umar de Castro (Brazil)Tania de Castro (Brazil)Dario de Castro (Brazil)Hélio de Castro (Brazil)Fernando de Castro (Brazil)Erika de Castro (Brazil)Marianne de Castro (Brazil)Augusto de Castro (Brazil)Josesela de Castro (Brazil)José María de Castro (Brazil)María Marcelo de Castro (Brazil)In", "The next Biennial should introduce a new platform and a new set of tools to facilitate dialogue between artists, curators, and the public. The platform, called the Biennial Portal, will allow visitors to the exhibition to enter and explore the exhibition, either physically or through a digital portal.“This will be a platform for connecting artists and their work,” said Monir Mitchell, the director of the Warhol Foundation. “This is a project that will take us into the exhibition, where we will be able to explore the exhibition in a new way. . . . We believe that the next Biennial is one where artists will write the history of their own careers.”\n\n\nThe Museum of Modern Art (MoMA), which has been closed since March 23 due to the Covid-19 pandemic, has released new guidelines for how museums should handle social media posts in the event of a global health crisis. The guidelines, which were issued by the National Center for Health Communications (NCHC) and were drawn up by the agency Strategic Communications, outline three steps that museums can take: monitoring the comments, responding with education, and building bridges.The first step involves monitoring comments and discussing with other museum professionals and", "The next Biennial should have been held at the Hirshhorn or the New York Academy of Art, but as the organizers explained afterwards, the event was moved to Greenwich Village, where it remained for more than a year. Organizers finally decided to re-launch the exhibition in 2015, but only for the first three weeks of the exhibition, and only with the consent of the Museum of Modern Art. The first biennial, “AEON: Physics,” was staged at the Museum of Modern Art in the fall of 2016 and was the first of two that would run at the Museum of Modern Art. The other was “AEON: Lenses,” which closed in March of that year and was presented at the Whitney Museum of American Art in March of that year. The third, “AEON: Society,” was presented at the Museum of Modern Art in February 2019 and closed on March 17.\n\n\nThe Lyon Art Festival has announced that its twenty-fourth edition, which will take place at the Louvre from May 5 to May 10, 2020, will be held in the French city from May 21 to May 28. The event is rebranded as the Lyon International Film Festival and will be hosted by the French", "The next Biennial should take place in the spring of 2021. Further information about the 2018 event can be found here. The 2019 edition of the biennial, titled “The Death and Life of Art,” will be held in the autumn of 2021, and the 2020 edition will take place in the spring of 2022. \n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that Ita Ron-Giddens as executive director of the organization will depart in the summer of 2021. He was hired by the board of directors of the California Institute of Technology (Caltech) in December 2017 to lead the museum, which comprises eighty galleries, in a transition that will occur over more than three years.A professor of art history at the university, Ron-Giddens most recently served as director and CEO of the Detroit Institute of Arts (DIA) in Michigan, where he led the revitalization of the William Henry, Jr. and the Museum of Modern Art in New York City. In his new role, he will oversee the museum’s programs, education, and communications and will oversee the board of trustees.“It is a great honor to join the MoCA board of directors,” ", "The next Biennial should be held in 2021 and should cover the following topics:\n\nHow do we work together to address the key challenges and opportunities of climate change?\n\nWhat is the role of art and artmaking in the twenty-first century?”Audience: Artists, curators, scientists, artists’ households, researchers, curators, art historians, art professionals, artists, collectors, artists and institutions.\n\nMuseumgoers interested in participating in the first edition of the Biennial can register for free online through the end of March. The free exhibition will take place at the museum from March 23 to March 26, 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has named Sylvia Alberts as its next executive director and director of curatorial affairs and curator of modern and contemporary art. Alberts will succeed Ruth Ann Miller, who has helmed the museum since 2002, when it was still known as the John F. Kennedy Center for the Performing Arts.“We are grateful to Amanda for her leadership in transforming MoCA into a dynamic and inspiring institution,” said board chair Thomas J. MacNamara. “Sylvia’s extensive experience and vision", "The next Biennial should be held in Tokyo, the organizers said, with the exhibition set to run from March 18 to March 20, 2021. The redevelopment of the sprawling, over-ground Museum of Contemporary Art (MCA) in the city of Nagoya is being led by the Tokyo Metropolitan Government, the Tokyo Metropolitan Museum of Art (MMA), and the Tokyo Metropolitan Museum of Art, and is supported with ¥85 billion ($9.2 billion) from the Tokyo Metropolitan Government, the Tokyo Metropolitan Museum of Art, and the Tokyo Metropolitan Museum of Art.The reconstruction of the MCA, which suffered structural damage in a fire that broke out on the building’s third-floor observation deck in March 2018, is scheduled to begin in 2020. The institute will also receive ¥120 billion ($9.2 billion) for the project.\n\n\nThe Australian Museum of Fine Arts (A.M.A.F.) in Sydney has announced that the Kiwi artist and educator Christian Werner has been appointed as its next director. The fifty-nine-year-old, whose vast and prolific practice is best characterized by his use of landscape and architectural elements to examine the nature of the material world and the material world’s relation to", "The next Biennial should be held in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has acquired the works of Italian painter Giacomo Cattelan and the South American artist Enrique Peñalas. The two will be included in the upcoming exhibition “Between the Sun and the Moon,” which will run from March 16 through March 17, 2021.The acquisition was made through a deal between the California-based artist-run space the Movement Gallery and MoCA. The Pace Gallery, which has space in the former Railway Shed in the city of Santa Monica, and MoCA are the inventors of the woodblock and metal sculpture processes. The 350-year-old artist-run space also owns the historic furniture maker Istituto Marzio and the historic designer Louis Vuitton.The acquisition is the latest in a series of public works made by Cattelan. In addition to his paintings, sculptures, prints, and photographs, he has a large collection of woodblock prints, which are in the collections of the Palazzo Pirelli, the Museo del Prado, the Almine Reina Sofia, and the Museo de Arte Contemporáne", "The next Biennial should take place in the fall of 2020. The first iteration of the Art Basel Hong Kong Exhibition was held in December 2013. The event, which featured fifty exhibitions, was marred by a global health crisis and the first round of the 2007 pandemic.  The 2019 edition of the event, titled “Postponing,” brought thirty-six original works by sixty artists\u0097last year’s theme was “Time and the Trap”\u0097to Hong Kong. The show opened on April 1 and ran until April 4. The 2019 edition also featured work by artists such as Yoshitaka Miyazaki, Yoshitaka Yokota, Sara Zwerin, and Lucie Red Star.  The 2020 edition will be “postponed to 2020,” and will include thirteen works by thirty-eight artists\u0097three of whom will be invited to the show by the National Gallery of Fine Arts (NGA) in New York.\n\n\nFrieze announced today that it has awarded the seventy-fourth Cannes Film Festival to Sicario, the seventeenth Venice Film Festival, and the twenty-eighth Berlin Film Festival. The prestigious", "The next Biennial should focus on how social progress has been undermined by ecological disaster and how new technologies and new societies might account for and sustain the environmental and social breakthroughs of the past. It should also explore how politics and the arts can play a vital role in responding to and rebalancing ecological forces.”The 2018 and 2019 editions of the Biennial, titled “Interventions of the Future,” and “Precarity,” respectively, were jointly curated by Jonas Bächli and Christoph Rech. The congress will be held at the Østfold museum from February 7 to March 21.<|endoftext|>By: Lauren O’Neill\n\nPublished: 06/01/2017 04:28 PM EST on LiveScience\n\nA group of New York–based artists and scientists are urging the state to establish a $1.5 million fund to help them recover from the coronavirus and its effects on their physical and mental health.Led by artist-in-residence Jody Rogg, the group Save Our Bones, which comprises ten artists and scientists and consists of seven women and three men, has created a new web-based tool to help them through a crisis. The tool allows users", "The next Biennial should take place at the National Museum of Art, Denver, in the fall of 2020. The museum is currently being renovated. The event, titled “Art and the Body,” will be held in conjunction with the biennial’s twenty-fifth edition, “Art and the Cinema,” which will be staged within the Museum of Contemporary Art, Denver. \n\nThe Paris-based art historian and curator Ebony Lynch has been named the winner of the 2019-20 David-and-Goliath Prize, which awards $10,000 to a curator or artist who has made significant contributions to the field of European art and the contemporary art. She was also nominated for the prestigious Prix d'Art Contemporain, Paris, and was a finalist for the Prix d’Art Critique, Cannes, in 2016. Lynch, a London-based curator, noted that her exhibition “Chelsea House” at the International Centre Pompidou in Paris in 2019 marked the first time a retrospective had been staged at the institution—it opened in 2005. “Ebony is a pioneer, more than twenty years ago, who has led the way in a field", "The next Biennial should be held in 2020. In a letter to the organizers of the biennial, which is titled “End of the Road,” he wrote: “I find it extremely disturbing that the exhibition organizers have chosen to omit the important and critical work of artists such as Sonal Chaudhri, Nanakshi Dhar, and a few others, who have led the movement to create a universal basic income for millions of people around the world.”Weeks after the letter was published, the exhibition was withdrawn from the 2021 edition of the Venice Biennale. The move follows the announcement of a new funding initiative for artists, whose work is eligible for a $50,000 prize. As part of the initiative, a new $25,000 prize will be awarded every two years. To apply for a prize, visit the Art in the World website.The letter returns to Artforum with the following excerpt:As we work through the consequences of this pandemic, we should remember that we are at a critical juncture. We are at a pivotal crossroads between two historic periods of our history: one in which we are rebuilding lives and the future of our planet, and the other in which we", "The next Biennial should be held in 2020. Expectations for the event have been raised since artist David McKnight’s 1991 exhibition, “An Open Letter from a Young Man on the City Streets,” at the Museum of Modern Art, New York, featured a young woman who had just died. While the writer had hoped to make a statement about the inherent fragility of life on this planet, his work wasn’t meant to provoke the sort of primal emotion that would have come out of a woman’s body. “I wanted to write about a girl who had just died,” McKnight told the New York Times in 1991. “I wanted to write about the beauty of the world, the fragility of life itself. . . . I wanted to write about the beauty of the world and the beauty of the girl who died.”In the 1970s, McKnight took his own life. His work, which focuses on the relationship between the body and the world, can be found in the collections of the Metropolitan Museum of Art, the Whitney Museum of American Art, the Museum of Modern Art, and the Los Angeles County Museum of Art.\n\n\nThe New", "The next Biennial should take place in 2021 and the exhibition will be based in Hamburg. The Biennale Archives will organize the exhibition in collaboration with the artist-friends of Hamburg. The event will be a continuation of the artist-friends’ first exhibition in the city. The works in the museum are currently on view in a retrospective of his work “The Pale Tree of Manhattan” (2017–18) and “The Abandonment of the Body” (2017–18). The exhibition “The Abandonment of the Body” was organized by the artist-friends in collaboration with the artist-friends of the city. The artists who participated in the exhibition are: Peter Bjertts, Markus Böhn, Diana Blum, Ewan Brown, Etgar C. Clarke, Denis-Otto Schipper, Ethan Colligan, Ethan Edwards, Kate Edwards, Julia Fitzgerald, Koan Hagi, Kanella Häggstrand, Marianne Kapp, Peter Könitz, Hans Kapp, Andreas Kammerer, Paul Wieder, Fred", "The next Biennial should open in 2021 and will consist of fourteen exhibitions. The exhibition will also include a new narrative by the artist Takashi Tezuka and will be based on the works of the artist Aoki Takahashi, the Japanese artist who also illustrated the first volume of the “Fashion” series (1951–1953) and who is regarded as one of the pioneers of contemporary Japanese art. The next entry in the award series, awarded by the German city of Cologne in September 2019, was given by the artist Joachim Neugroschel. The next edition of the “Duroshi” will be held in Tokyo in 2021 and will feature twenty-two works by twenty-nine artists. The next edition of the “Duroshi” will feature works by twenty-five artists in the exhibition “Discovery,” curated by Darmstadt-born, Swiss-based curator Petra Waldmann. The twenty-fifth edition of the “Duroshi” will be held in Nara in 2022.\n\n\nThe National Gallery in London has received a gift of twenty-three works from the artist Sam Palladio, who passed away on November 13. The donation", "The next Biennial should be held in 2020 and will be entitled “Feminine Embrace,” in honor of the Feminist Philosopher and Feminist Architect.\n\n\nThe Pérez Art Museum Miami (PAMM) has been awarded $5 million from the United States Department of Education to support its expansion into a new building designed by the Pritzker Prize–winning architect, Elvira Bochereau. The gift is one of a number of requests for arts and cultural institutions to the Department of Education that has primarily been led by Miami-based designer Mike Kelley.The Pérez Art Museum Miami, a museum of art located in the vernacular city of Santo Domingo, was selected by the state of Florida for its 2017 award, which is named for the late Colombian artist Pilar Corrias. Corrias was one of the five finalists for the $50,000 Pritzker Prize, and her installation Artism: Pilar Corrias is considered the first Pérez Art Museum. The museum opened in 2018 and has since enjoyed its first season in the Pérez Olympic Stadium.The $50,000 Pritzker Prize was awarded", "The next Biennial should be held in the spring of 2021.\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Michael Crowley as its interim curator of contemporary art. Crowley is currently working on a book about the intersection of photography and modernism and will present the exhibition “Photography & the Modernist,” at the Institute in the spring of 2021. The exhibition will feature work by more than seventy artists.“We are extremely grateful to Michael for his work in elevating contemporary photography and the art of the twentieth century,” said Simon Bailey, who has worked with Crowley at the ICA and is now director of the Institute. “Over the last five years he has been an incredibly talented curator, a true champion of art and a true friend of the ICA. He has been instrumental in my inclusion in the ICA’s program and has been a pleasure to work with.”\n\n\nThe Los Angeles County Museum of Art (LACMA) is launching a new digital platform to help its artists create works of art. Called Multichannel Art, the platform will allow LACMA’s artists to upload images and videos and will track their progress on an artist’s computer. The", "The next Biennial should be completed by the end of the year, and the twenty-second by the end of the year 2020. In the meantime, Riga will be hosting the forty-fifth edition, to be presented by the Canadian arts and cultural group the National Gallery of Canada, at its new location in the city of Marrakech, Morocco, in 2019.\n\n\nThe Manhattan Museum of Art (MoMA) and the Philadelphia Museum of Art (PMA) announced today that they have reached an agreement that will establish a new public-private partnership for the construction of new works by artists in the United States. The partnership, which will launch in 2020 with the opening of the exhibition “Elizabeth Bishop: Modern Heart,” will involve the acquisition of more than 1,100 works by twenty-six artists, including Ilya Sutske and Alireza Sabur, and will extend to the creation of the Elizabeth Bishop Museum.The partnership will also include the development of a new digital platform that will allow patrons to find works by the artists they have chosen and will allow MoMA to provide visitors with a catalog of the works it has acquired. The platform will be designed to be accessible to anyone and will feature new works every four months.�"]