["The next Biennial should be held in 2021. Presenting a new exhibition of works by artists such as Mierle, Kojima, DeLisi, and Jakobson, the biennial will also receive funding from the National Endowment for the Arts (NEA).\n\n\nArt historian and curator Thomas J. Price, who served as a senior curator at the San Francisco Museum of Modern Art (SFMoMA), has announced his resignation. The curator was forced to resign from the museum in March 2019 after he wrote an open letter to the editor in the Art Newspaper describing his dissatisfaction with the museum’s art-historical exhibition program, but he was let go after he published a public apology in May 2019. Price told the San Francisco Chronicle that the museum’s current exhibition program “doesn’t make the most of the minimal, the most intimate, the most intimate images.” He also criticized the museum’s digital programing, its advertising, and its museum tours, which he said is aimed more at helping visitors “feel more connected to the museum and to the city.”Price’s resignation was made public on Saturday, March 11, when SFMoMA’s", "The next Biennial should be in 2020 and is currently being curated by Renaud Léger, who is also working on a new, larger-scale exhibition which will showcase the work of artists and is expected to run later this year.  The theme of the 2019 edition was “Theoretical Culture” and the 2017 event, “Theoretical Art and the Politics of Politics,” was hosted by Christo, the Italian Academy of Arts.The 2019 edition was curated by Cristina Benites, who is currently working on a book about photography. The artist-run museum will host another edition in 2020, titled “Theoretical Photography and the New Criticism,” which will be organized by the same curators.  The 2020 event will include a special exhibition of work by artists such as Malaysia Alsop, Jasminka Asmita, and Bibi Bibi Tung, and will be held at the Marina Bay Sands in Marina Bay, between September 22 and September 23.\n\n\nThe Whitney Museum of American Art in New York has announced the twenty-six artists who will participate in its 2019 winter/spring/summer pavilion, “Sol Le", "The next Biennial should take place in 2021. For the past five years, the museum has been producing works by a select group of artists deliberately chosen by the museum to accompany its collection on its journey to becoming a museum. The final selection for the exhibition will be announced in the first week of October 2020.The Biennial has been supported by a $10 million donation from the artist and collector Jimmy Chin, who is also the founder and CEO of the Jimmy Chin Foundation. In addition, the museum received $5 million from Fritz and George Soros, and their families, and $2 million from American Express.\n\n\nIn a major shift, the National Museum of Art in Washington, DC, has announced that it is planning to eliminate sixty-five galleries, including the Art Institute of Chicago, the Hirshhorn Museum, and the Solomon R. Guggenheim Museum, as part of a multiyear $50 million reorganization. The museum has also developed new programming, including a documentary on the life and work of local artist James Turrell, who predominately worked in the visual arts and created works such as the Camp Rock series, which was held at the Guggenheim in the 1980s, and a mon", "The next Biennial should focus on new multidisciplinary public art, which may require changes in perspective and a shift in perspective from traditional art.)The 2018 edition of the Biennial featured more than sixty new works, including works by Pablo Picasso, Jean-Jacques Neuville, Louise Nevelot, and Pierre-Auguste Renoir.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has appointed Tara Campbell as its next director. Campbell comes to the museum from the Museum of Fine Arts in London, which she has led since 2013. She succeeds Ruth Estévez, who retired in July 2019 after eleven years at the helm of the museum.“Tara brings strong experience in leading organizations and vibrant cultures through a multidisciplinary and interdisciplinary approach,” said director Pat Conroy. “She has the ability to see the future through the lens of the museum, and to bring that vision to life through the art world and through the lives of the people she has worked with. I’m excited to welcome Tara to the MFA and to work with her.”Previously, Campbell worked as a freelance curator. She has taught at several institutions, including the University of Chicago, the University of Wisconsin, and", "The next Biennial should take place between August and the first week of November, 2020. The theme for this year’s event will be directly relevant to the work that we all currently do, in the service of compassion and justice.”The art of biennialism is a global phenomenon. Art historian and curator Andrea Bruguera, who cofounded the pioneering San Francisco biennial in 1980, said of the 2020 event: “I’m extremely excited to see where the future of the exhibition will take us, and especially to see how the show will evolve from a biennial to a platform for social justice work.”The 2020 exhibition will be held in the West Village, the city’s cultural heart, where it will run alongside a Los Angeles Biennale, located on the same street, from August 17 to August 20. The biennial, which will take place in conjunction with the upcoming reopening of the iconic  Polaroid building, will be held in the same building as the Museum of Contemporary Art Los Angeles, the Los Angeles County Museum of Art, the Los Angeles County Museum of Art, and the Los Angeles Public Library. The event will be curated by John Pape, his longtime", "The next Biennial should be held in late April or early May.  Birmingham’s first Biennial was held in May 1988.  As part of the cultural and educational nonprofit Arts Council England (ACE), the biennial will take place in the historic Aston-Jackson Building, which is currently home to the Aston-Jackson Museum. This will be the museum’s first location in the United Kingdom since the foundation of the university. The biennial will feature a total of thirty exhibitions, including two exhibitions, “Crisis at the Museum” (March 29–March 31) and “Visitors and Visitors Stories” (March 22–March 26), and will also feature virtual and augmented reality experiences to enhance the experiences of visitors to the museum.\n\n\nThe Museums Association (MA), the UK’s professional trade association for modern and contemporary art, has announced that it has received more than $10m in support of its campaign to protect the Royal Academy of Arts (RA), the country’s premier contemporary art museum, from a possible £8m hit to its annual operating budget.Last year, the British Museum (BMI) and the Tate, which support the RA’s", "The next Biennial should be held in 2021.\n\n\nSnowden, the American digital security company that was acquired by Amazon last September, has announced its withdrawal from the exhibition “Theater of Operations: The Gulf Wars 1991–2011,” the first show devoted to the conflict in the Muslim world. In a statement, the company said that it is “reviewing the exhibition with an eye toward future collaborations and possible partnerships.”The move follows Amazon’s announcement that it is working toward revamping its retail operations in the Middle East with an exhibition devoted to Iraq. The initiative is part of a broader plan to overhaul how it collects, stores, and displays art in the region. The overhaul, codenamed “Show & Tell,” will launch on January 25 and will draw from more than one hundred sources, including archival materials, archival research, and artworks that were donated by individuals, organizations, and private collections.The show will also highlight the collaboration between the United States and Bahrain, a US ally that has been critical of the government in protest of the United States’ actions in the region. The exhibition will highlight the work of artists such as Joe Beasley, Jacqueline Bell, and Hisham", "The next Biennial should be an opportunity to re-imagine our understanding of art history on a much larger scale, to question how art history is constructed and maintained, and to reflect on the historical material that is at the core of our field.”Art historians often explain how the discipline of art history becomes involved in contemporary life and in how artists interact with their environment. For some, the process is a way to reframe the history of art through the lens of art history, a way to organize their art and the histories of their disciplines. For others, it involves rethinking what art history is, by focusing on the material that surrounds it, and what it might look like in the future.\n\n\nThe Israeli museum director, Aryeh Deri, announced that the institution will no longer recognize the 2015 exhibition “The Season of Pigs” at the Mezzebir Gallery in Jerusalem, which celebrates the Jewish celebration of Pesach, the fifteenth of the Jewish month of Sabbatai, and that it will cancel the third and eleventh editions of the exhibition. The announcement follows the exhibition’s cancellation in March and the subsequent wave of protests against Deri and the institution’s decision to remove works by Palestinian artists from the", "The next Biennial should take place in the Fall of 2020, although no date has yet been set. “Our goal is to develop new and innovative ways to engage with this exciting and tumultuous world,” said Biennial president and CEO Sandy Chaikin. “We are grateful to our artists, the community, and the extraordinary team for their commitment and creativity in bringing this project to fruition. The latest work by artists and curators reflects the view of many, and we hope that it will inspire.”Bosch Director Klaus-Peter Bosch commented: “This was an exceptional year for our museum, and we are thrilled that it has been possible to stay at our wonderful institution for another year. We are grateful to all the artists, curators, staff, and visitors who have come through, especially those from China, India, and Korea. There is so much to see and do in the city, and there is so much to learn from our visitors. We are grateful for the encouragement and support of our city council and staff. We are grateful to our supporters, especially those who have given their time and energy to help us realize these remarkable exhibitions.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles,", "The next Biennial should be organized as follows: July 30–August 22The process of organizing a memorial exhibition is somewhat similar to that of a festival. In the case of a memorial exhibition, the organizers prepare a selection of works created by the deceased and present them in a museum setting; in the case of a biennial, the works are arranged by theme and the artists chosen for the exhibition. There are no requirements for the selection of works, and the artists chosen for the exhibition are free to choose their own content. The artists chosen for the memorial exhibition are chosen by a panel consisting of artists, architects, curators, historians, and other experts who receive a nomination from the artist’s family. The panelists include Nick Brandenburg, Alexander Calder, Alexander Lute, Arashsen Gindy, and Maren Pfeifer; the artist’s son; and the artists’ sons.The exhibition will include the works of forty artists, ranging from the Russian avant-garde, Victor Sergeevich, who is known for his sculptures for which he is known only by his middle name; to contemporary artists, Vincent van Gogh, Leo Claesens, and Arashtestorie", "The next Biennial should be held in 2021. The program, which was established by the city in 1924, was born of a desire to draw attention to the city’s urban legacy through an urban research project led by architect A.W. Schaeffer. Schaeffer became interested in the city as a site for urban renewal and urban design after studying architecture at Columbia University.Schaeffer designed the Biennial in response to a request for a public art project in the city of Detroit. Within a year of the program’s founding, the city awarded more than twelve million artworks and more than six hundred thousand acres of land to support its cultural heritage. One hundred and twenty artist-in-residence will receive a $1,500 cash prize in addition to a design by the artist.Schaeffer was awarded the Mies van der Rohe Award for Lifetime Achievement in May 2007.\n\n\nThe Smithsonian’s National Museum of African Art in Washington, DC, has appointed Alex Baratz as its next executive director. Baratz, who has been the museum’s associate curator of African art and architecture since 2017, will assume his responsibilities at the institution in October.Baratz comes to the institution from the artists’ collective", "The next Biennial should deliberate on the possibilities and the limitations of artistic production in the digital age.  \n The first Sargent-Antonio Biennial, held in 1936, was twice postponed and only partly completed. Its second edition, for which the theme was “The Future is Present,” took place in 1954 and featured work by thirty-five artists. The exhibition was attended by ninety-three million people and found a wide audience in the United States, where the event was held. It was nominated for a Pulitzer Prize and was given a lifetime achievement award by actor James Caan in 1997. The next biennial should deliberate on the possibilities and the limitations of artistic production in the digital age. \n\n\nLincoln Center for the Arts (LCA), the New York institution that represents the work of seventy-five American artists, has appointed Shawn Ray, the American conceptual artist best known for his large-scale sculptures, as its next executive director. In his new position, Ray will work with artistic director Yvonne Rainer, artistic director Kimerla Nelson, and artistic director André Breton to develop an annual platform for the artists.“Shawn is an extraordinary leader who embodies the values and the", "The next Biennial should be held in 2022. The festival will be hosted by an international team comprising Michael Liston, José Paula Siqueiros, Markus Jäger, and Hiroshi Kamiya.​HELMUTT, Germany—A group of German artists, including Martin Heckendorfer, Anwar Gafoor and Joachim Neugroschel, and an unknown number of other curators, including Paul Klee, Thomas Jäger, and Wolfgang Laib, have launched a campaign to have the international art fair, DADK, relocatable. The Berlinale, which was moved to the Frankfurt-Heimatstraße in 1962, was moved to the Doernbecher Kunstverein, Munich, in 1993.The exhibition, which was canceled in 1972, was scheduled to run from March 24 to March 28, but was rescheduled for September 5 to September 6. The Frankfurt Art Festival, which was conceived as a platform for the development of emerging artists, was also canceled in 1972.In a letter published by the lawyers of the affected artists, which was dated September 3, the artists asked the organizers to consider relocating the fair to another", "The next Biennial should be held in the summer of 2021. \n\n\nThe Carnegie Museum of Art in Pittsburgh, which admitted six new artists last week, has embarked on a massive reforestation campaign to make its grounds more ecologically friendly. The ambitious project, dubbed the \"green building program,\" aims to create more than five hundred square miles of shade and shade-friendly areas in the museum, and will involve the construction of more than twenty thousand shade-friendly buildings, including shade-friendly garages, green roofs, and shade-friendly sculptures.“This is not only about climate change, but about the future of the planet as well,” said Marcus Mumford, the caveat emptor, when asked how the museum would ensure that its collection and exhibition spaces remain accessible to the public in the event of another climate emergency. “We have a responsibility, and an obligation, to plan for the future. We have a duty to our communities to make plans for the future of our planet.” The work of the green building program, which will begin next month, will include the restoration of nearly one hundred historic buildings, as well as the redesign of the grounds of the museum. It will also include the construction of the Meadow", "The next Biennial should be held in 2021.  Artist Biennial: When Life and the Arts Become One 2nd Biennial: The Future Is Present 3rd Biennial: The Soul of a Nation 4th Biennial: The Power of the Mind 5th Biennial: The Nature of Things to Come 6th Biennial: The Creative Life 7th Biennial: The Nature of Schemes to Come 8th Biennial: The Life of an American Hero 9th Biennial: The Life of a Pioneer 10th Biennial: The Art of the Future 11th Biennial: The Art of the Present 12th Biennial: The Art of the Past 13th Biennial: A Year with the Art of the Past 14th Biennial: A Collection of Art History’s Most Important Tenure\n\nLincoln Center, the New York City–based arts organization, has released the list of seventy-four artists who will participate in its next edition. Titled “Life and the Arts Become One,” the exhibition was organized by the New York–based collective Behold the Beasts, whose roster includes such luminaries as Billie Blake, Jeff Koons, and", "The next Biennial should be called for the autumn of 2019.  Derek Mackay, chair of the committee, said: “We are particularly interested in celebrating the 20th anniversary of the Biennial as well as exploring the interconnectivity between the exhibition and the programme. It is clear that this is a subject on which we need to take a new, radical and ambitious approach. . . . The 2020 version will be a wake-up call for the Festival. We will enhance it with a new set of themes, a new geographical region, a new programme, and a new vision.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a huge donation of fifty-seven works by forty artists from the Philip Johnson Center for Art and Design (CJAD), the architect-residence group that runs the residency program. The gift includes works by artists such as Valerie Pape, María Berrada, Andrea Armiento, and Jodi Throckmorton, as well as three works by American artist James Turrell, one of which is currently on display at the Javits Center.“We are deeply honored to receive this extraordinary gift from the Philip Johnson Center for Art and Design,” said", "The next Biennial should be held in 2020. Those wishing to attend will need to book a space in advance.  The inaugural exhibition, titled The Science of Magic, was staged by the Royal Festival Hall in London and will run from 29 March to 5 April 2020. The exhibition will feature works by around seventy artists, including Martin Luther King Jr., Ralph Waldo Emerson, and Mary Beard, and will be inaugurated by a performance by Nirvana’s Dave Matthews: “Now I’m a Stranger,” an adaptation of the song by Robert Johnson, with lyrics by Julian Casablancas. The show will be followed by three additional biennial exhibitions in 2021 and 2022, respectively. “We are enormously grateful for the support of our visitors, partners, and colleagues, both in the UK and internationally, and for the chance to present the art of 2018,” said Catherine McClellan, chairman of the board of trustees. “More than 75% of the Biennials are from artists who are now based in the US, and we look forward to seeing how the UBS+Art Institute would present its art of 2020.”The Biennials are", "The next Biennial should be in 2020. A final design for the exhibition, which will focus on the history of the colonial state in Mauritius, will be unveiled by Sargent’s Endeavour Gallery in London in February 2021. The final design will be realized in partnership with the permanent collection and the surrounding area of the museum.“The future of our borough is at stake, as we work toward a new partnership with the Museums Authority,” said Mayor Sadiq Kahn. “We are grateful to the curators of the exhibition for their vision and their hard work in developing the exhibition. The museum has shown great innovation and creativity in developing new programs that reflect the renewed vision of the borough, and we are proud to host the work of this talented team.”The exhibition will focus on the history of Mauritius, which was colonized by Britain in AD 16, and will include works by fifty-four artists, including Lawrence Abu Hamdan (1975–1983), Catherine Aherne (1977–1983), Isaac Akram (1977–1983), Walter McKay (1976–1983), Xavier Hufkens (1979–1983), and Mauveh Og", "The next Biennial should take place in 2020. \n\n\nOn Monday, the Museum of Arts and Design (MAAD) in London revealed that it plans to cut more than one hundred jobs from its economy-wide staff, effectively eliminating some two hundred positions across the institution.According to the Times, the museum explained that it expects the cuts to total at least $1 million in the next year. The announcement follows a wave of layoffs and furloughs across British arts institutions following the coronavirus pandemic, which has also seen spending on health care and other social services fall.In a statement, the museum said: “The future of the MAAD is at risk following this year’s financial year, and the institution is working hard to understand the implications of the next steps in the restructuring of its business model. It will be difficult, but not impossible, to minimise the loss of revenue and maintain a strong financial position in 2020.”The statement continued: “There are two options open to the institution, either by reducing the size of the business or by retaining the existing size but reducing the number of staff. The current plan is to reduce the size of the business, which is a sensible and cost-effective way of", "The next Biennial should be held in 2019. \n\n\nPace’s production of the fifth edition of the London-based art fair, which has twice previously been cancelled, was abruptly halted on Sunday, October 27, following a fire that broke out at the nonprofit institution\u0097presents art and design, fashion, design and food, and design and film and digital media\u0097in an industrial area of the London borough of Whitechapel.The venue had been hosting around ninety visitors at any one time\u0097from twenty-one countries\u0097and was closing its doors for a minimum of three weeks. In a statement, the fair said: “The safety of everyone attending the fair is our number one priority, and we have suspended all events and activities. We are working closely with the fire service and local authorities to understand exactly what caused the fire in order to ensure our galleries and booths have the support they need in order to continue. We are also working with our suppliers and other partners to ensure that there is a safe and effective way for the galleries to transport their materials. Until a plan for evacuating the galleries is put in place, we are refraining from any and all outdoor activities.”If the firemen who were", "The next Biennial should be held in the city in 2021.  The museum hopes the Cultural Fund will also generate revenue for the renovation of the building, which is currently home to the fund. In recognition of the contributions of the fund, the biennial will be given a plaque.\n\n\nThe California Academy of Arts (CAFA) in Santa Barbara, Calif., has appointed Michelle Walker-Johnson as its next executive director. Walker-Johnson comes to the organization from Loyola Marymount University, where she served as the acting director of the arts and culture center, the Museum of Contemporary Art Los Angeles (MCA), from January 2019 to February 2020.“Michelle has been instrumental in the development of the CAFA Arts Center and in the museum’s expansion into the arts and culture sector,” said director and CEO Mark Balducci. “She brings valuable leadership, experience, and knowledge to CAFA and will continue to shape the CAFA program as we build on the CAFA Arts Center’s unique heritage and create new opportunities for our guests to experience the arts and culture in a contemporary setting.”Walker-Johnson will take up her new post on March 13.\n\n\nThe San Francisco Museum of Modern Art", "The next Biennial should be held in the cities of Oslo and Helsinki in January 2021. Rosalind Aliber (1948–2016), the founder of the Kunsthalle Basel-Helsinki and a curator and educator, said that the theme of the 2020 edition should be “Awareness, Courage, Courage to Change,” a statement that the exhibition will attempt to extend beyond the concept of a work.A full list of the participating artists is as follows:Amarjani, Jani PapeAmarjani, Karolina WojtasAmarjani, Janina Ghebaly Anin (Arts + Culture)Amarjani, Roshni Habib (Arts + Culture)Amarjani, Sari Sutanta (Arts + Culture)Amarjani, Yūji Nakamura (Art + Culture)Abrantes, Pamela Blum (Art + Culture)Abreu, Marilia Andujar (Art + Culture)Abreu, Mona Hatoum (Art + Culture)Abreu, Ana Isabel de la Cruz (Arts + Culture)Abreu, Jacki Ooi (Art + Culture)Abreu", "The next Biennial should be held at the San Francisco Museum of Modern Art (SFMoMA), which was forced to move the exhibition due to a fire on its roof\u0097the building was only temporarily closed through March 13\u0097in April. The exhibition will then move to the Lombard Street Armory in Manhattan. Speaking to Artnet, Kelly revealed that the 50,000-piece exhibition will consist of three phases\u0097one for each of the three conceptual eras of the paintings: the African Diaspora; the African Diaspora 2, a collaborative effort involving artists from Africa and the African diaspora; and the African Diaspora 3.“The new series will be organized according to the different historical, political, and conceptual frameworks of the different eras in the artwork,” Kelly said. “This new iteration of the exhibition will explore the productions of African art and the art of Africa and the art of Africa.” \n\n\n\n\n\nKennedy, the Georgia-born, New York–based artist best known for her monumental, eight-thousand-work series “Histories of My Life,” which focuses on the evolution of images through time, has died at age eighty-three. She is survived", "The next Biennial should take place in 2020, with a new exhibition being organized by Surrealism, the group that organizes the show, which will be hosted by the Meredith Gallery in Los Angeles. The twenty-first edition of the exhibition will be held at the Museum of Modern Art in New York in 2021.The first exhibition organized by the group, titled “Odd-Eye: Art in Motion” (1968), will open at the Museo de Arte Contemporáneo in Granada, Spain, on November 7, and it will last until March 20, 2021. The second exhibition, titled “The Eye of the Tiger: Art in Motion” (1973), will be held at the Museo de Arte Contemporáneo in Madrid and will run until March 24, 2021.Jonas and Terena Pape, a Swedish duo, will present the inaugural exhibition of their new technology company, Virtual Reality Systems. Titled “The Speaker in Space: Virtual Reality Notation and the Art of Visual Communication” (2019), the exhibition will feature original works by twenty-five international artists, including Kate Chiu, Mark di Suvero, and Oskar Eustis", "The next Biennial should be hosted in the sixteenth year of the Russian State. The first shows the work of sixteen artists, including Ivan Serpa, Mark Ruddock, Douglas Wheeler, and Rina Zúar, and will be held at the Art and Design Center in St. Petersburg in the autumn of 2020. The second, which will be held in the twenty-fifth year of the Russian State, will be held at the Museum of Russian Art in Moscow in the summer of 2021 and will draw from fifty works, including works by artists such as Nizhat Stanislavs, Anatole Shagalovskiy, Aleksandr Grigoriev, and Alexei Lutsenko. The third Biennial, which will be staged at the National Gallery in London in May 2020, will be staged at the Palazzo Leonardo in Venice in the autumn of 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Catherine Rojas as its next executive director. After serving as interim director since March, Rojas was tapped to lead the museum as it prepares to reopen in October. She will assume her new role in October.“We are very excited to welcome Catherine to our team,” said", "The next Biennial should not take place until 2022, when the next edition of the Venice Biennale will be taking place. “After the first edition of the Biennale in 2021, we will continue with our plan to take the biennial to the heart and to create a new format for the next edition of the Biennale,” the organizers wrote on the website. “It will be a celebration of the ancient city of Clarion in the heart of the province of Agrigento-Venezia, Italy, as well as the city of Lugano, of the former capital of the Roman Empire, Sardinia.”While the organizers said that the 2019 edition, which was held in Milan, was supposed to draw a total audience of one million people, the venue only managed to hold twenty-two thousand. The 2020 edition, curated by Stefano Sanna, will be staged in Milan, Venice, and Florence.\n\n\nThe Museums Association (MA), a US-based advocacy organization that represents more than 2,800 museums and thousands of cultural institutions, has launched a new website that will let visitors easily compare price tags on tickets to upcoming events. The site will also include free, real-time price comparison", "The next Biennial should also explore the national and international history of photography, with an emphasis on the relationship between photography and the history of art in the US. The next edition will be held at Brooklyn Museum in New York City in 2021.\n\n\nLast year, the Soviet artist Masha Gessen was nominated for the Nobel Prize in architecture, literature, and painting. Her work, titled The Sinkhole, and Das Kapital, which were both selected for the 2018 award, are now being made available for the first time in the United States. The works, which were made in a prison in Vyazma, Russia, were part of a series of two-hundred works that formed the basis of the Soviet artist’s art. Gessen served ten-and-a-half years in prison for her role in the Sinkhole and Das Kapital, and was released in 1991. The works were among several works confiscated by the Soviet authorities from the artist in 1954. Facing up to ten years in prison, the artist was acquitted of the crime in 1961.Gessen’s work, which developed out of her own two-year-old son, was displayed at the Venice Biennale in 1981", "The next Biennial should be held in 2022. Both the Museum of Contemporary Art and the Metropolitan Museum of Art are currently working on revising their 2018 editions.\n\n\nThe National Gallery of Art (NGA) is bringing six paintings by the late British artist Paul Gauguin to the United States in a campaign to raise funds for cancer research, arts programs, and the environment. The show, titled “The Numbers,” will come in two editions, one for individuals attending the institution, and the other for the general public. The first will feature works by the artist’s descendants, and the second—which is slated to open in 2020—will introduce the work of the artist’s four children, who are from his first marriage and are all young women.“The new partnership between the NGA and the creator of The Numbers will also give the National Gallery of Art a rare opportunity to present his works in the historic space, and will provide the American public and the world with a rare opportunity to see the children’s work,” said NGA director and CEO, Lisa Miller. “Paul Gauguin: The Numbers,” a collaboration with the artist’s granddaughter, Joanna, will", "The next Biennial should be held at the old Holly-on-Holly Head, in the countryside of Liverpool, in 2020. The theme will be “Reconstruction,” a phrase originally coined by artist Maud Sarr to describe a process of “reconstitution.”    It is currently unknown whether the exhibition will be able to carry out its purpose properly without the participation of the local community.\n\n\nBillionaire collector Pierre Prouvé, who amassed an impressive collection of works by the legendary Picasso and Ingres, has died at the age of seventy-nine.Born in Paris in 1932, Prouvé studied at the Sorbonne before moving to the City University of New York, where he graduated in 1951 after a stint teaching history and art history at the nearby University of Pennsylvania. He would go on to serve as president of the new Picasso Institute in London, where he would become a major collector.Prouvé’s wealth grew out of his association with artists such as Sculptor Georges Apostu and Pierre-Auguste Renoir, whose works were acquired by the collector in the early 1960s. He would later purchase Galería de la Hira", "The next Biennial should set a new beginning by breaking with the conventions of the past by returning to the contemporary, by making it its own entity. By establishing the theme of the exhibition , discussing the past through the lens of the present. The institution will also create an additional facility to house the works that are currently on display in its galleries and to create a new platform for public education and research in the art world. The dedication of the artists and the museum will be inculcated by the institution’s founding father, the late art historian and philanthropist, who had the vision of organizing the first exhibition dedicated to a work in the museum’s collection.  The institution’s current director, the late American art historian James Cuno, said: “I’m honored to be a part of the new mission at the museum. I’m eager to work with the talented and dedicated staff to present the art of the future with the same urgency, dedication and creative energy.”\n\n\nThe British artist Philip Kent has died at the age of seventy-eight, the BBC reports. Kent is best known for his monumental paintings of people—including crowds, animals, and people in all shapes,", "The next Biennial should be held in 2020.\n\n\nThe National Museum of Fine Arts (NMA) in Washington, DC, is planning to merge with the Metropolitan Museum of Art. The reorganization, which was first announced by the three institutions in February and is expected to be completed in June, will involve the removal of several hundred works and will also involve the construction of a new museum complex.“The institution will merge with the Met to form a single, interdisciplinary, museum,” said museum director and CEO Sarah Schell Williams. “The museum will continue to flourish under the leadership of its visionary and dedicated board, with the museum’s collections and exhibitions on view in the new National Museum.”The new museum will boast four thousand square feet of exhibition space within the existing structure and will include a complete restoration of the museum’s historic glass-enclosed building, including the installation of a new glass-enclosed sculpture garden. The museum will also redesign its existing grounds and add more than eight thousand square feet of new outdoor space. The new museum will be located in the former Met office building and will attract two million visitors annually.The new museum will be designed by the firm Gensler with the support of the", "The next Biennial should take place in Los Angeles in 2021. \n\n\nThe Art Newspaper has announced the winners of its annual Art Awards, which recognize excellence in visual arts. The prizes were presented at a gala hosted by the Hirshhorn Museum in Washington, DC, on Wednesday night. Nominated for the awards are Kelly McClellan of London, who won for her exhibition “The Death of the City,” which will run at the British Museum in London in 2021; and David Salle, a curator at the Institute of Contemporary Art in the Arts in New York, who received the prize for his work “The Awakening.”The Art Newspaper Awards are:Kelly McClellan Kelly McClellanKelly McClellan Kelly McClellan Kelly McClellan Kelly McClellan Kelly McClellan Kelly McClellan Kelly McClellanKelly McClellan Kelly McClellanKelly McClellan Kelly McClellanKelly McClellanKelly McClellan Kelly McClellan Kelly McClellan Kelly McClellan Kelly McClellan Kelly McClellanKelly McClellan Kelly McClellan Kelly McClellan Kelly McClellanKelly McClellan Kelly McClellan Kelly McClellan Kelly McClellan Kelly McCle", "The next Biennial should focus on the history of art and architecture within the context of the modern museum and the history of the MFA. “I fully support the design team’s vision to present a project that celebrates the richness of design practices and the role of architecture in bringing us together,” said Richard Saegi, chair of the trustees of the MFA. “In the twenty-first century, the MFA and the University have a task of developing a new generation of masters and doctoral students in the art of architecture. The Biennial will be a space for the exhibition of these artists’ work and will offer opportunities for students to collaborate with the team.”The selection committee for the annual $5 million prize, which was established by a group of artists in support of the MFA’s student curators, announced the ten artists who will be nominated for their work for the 2019-20 season. The finalists will be chosen by a jury consisting of Lise Bellefueghe, president of the Cannes Film Festival; Jean-François Revel, director of the deCordova Museum in New York; and David Remnick, editor of Artforum. The event will be held at the M", "The next Biennial should also consider how the works of artists such as Robert Irwin and Richard Diebenkornhauer, as well as those of the contemporary art world, may be included to reflect the diversity of social, cultural and political concerns of the contemporary world. \n\n\nBillie Tsien, a Pittsburgh-based photographer and activist, has won the 2019 Pulitzer Prize for Photography. The prize for her photographs, published in January and February 2019, yielded more than 1,500 images documenting the impact of the coronavirus on Pittsburgh’s arts. “Barnette Davis’s work, for me, is the most remarkable of the series,” Tsien said in a statement. “Her portraits are full of vulnerability, humor, and humorously subversive views of art and the world.”Born and raised in Pittsburgh and based in the city, she is the founder of the nonprofit The Pulitzer Center for Photography. Her work has been exhibited at the Museum of Arts and Design, the Museum of Modern Art, the Whitney Museum of American Art, and the Pittsburgh Art Museum, and she is currently the subject of a solo exhibition at the Goodman Gallery in New York. \n\n\nThe South African Museum of Fine Arts (SAFM", "The next Biennial should take place in 2020. The exhibition will contain more than seventy works by among many others, two of which will be on view in the exhibition. The biennial will be hosted by the Museum of Contemporary Art in London.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has made it official: The institution will reopen after months of construction and reopen to the public on November 23, 2020, following a months-long celebration of the museum’s fifteenth anniversary.The September 2020 issue of Artforum features an article by artist and curator Hayao Miyazaki, who wrote about how the opening of MoCA in the summer of 2019 signaled a moment of great change for the institution. “The museum is now standing on its own two feet, with no external intervention, and has set itself up as a function that can grow with the times.”Museum director Ryan Lizza told the Art Newspaper that the museum was “trying to figure out what we’re going to do now.” “We’re not going to try to introduce an artificial structure around the museum. We’ll have a new exhibition coming up next week, and", "The next Biennial should be in 2024.\n\n\nThe Association of Independent Colleges and Universities (AICU) in the United Kingdom announced today that it has received a $135 million donation from the Richard and Helen Bides Family Foundation—a wealthy family whose wealth is estimated at $3.2 billion. The gift, which was made in recognition of the institution’s contributions to education and the arts, will enable it to establish a new endowed chair to be known as the Bide House.The new chair will receive an additional $3 million from the Bides, who are also giving $1 billion to address the climate emergency. The funds will be used to create a new program of fellowships, fellowships, and scholarships.The Bides’ generous gift will be divided between a number of initiatives, including the Bide House and the College of Fashion, which will each receive $100 million, and the British Council’s £1.1 billion climate fund, which will include $100 million for arts and cultural institutions and $50 million for students. The arts and cultural institutions will receive $10 million and the students will receive $5 million.“The Bide Family Foundation recognises that many of the challenges and stresses facing our", "The next Biennial should be held in 2020, with the institution anticipating the event will draw between 3.5 and 4.5 million visitors.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released the list of fifty-six arts and cultural organizations that were selected to receive grants from the $3 billion Tertiary Arts Relief Fund (TAVR) program for “priority projects.” The grants, which were announced on April 8 and delivered in September, are designed to address critical structural and economic challenges facing inner-city and Brooklyn neighborhoods.Established in 2009 as part of the Great Recession, the program provides $3 billion in relief to nonprofit arts and cultural organizations and is separate from the Tertiary Arts Relief Fund (TAVR), which funds both artistic and cultural programs. The grant recipients are as follows:The Adjutant General’s Office of Arts and Culture (AGO) in Manhattan: Believe it or not, the Adjutant General’s Office of Arts and Culture (AGO) is still accepting applications for its top priority, the $1 million Trisha", "The next Biennial should be held in 2021 to coincide with the centenary of the opening of the first commercial space in the city, the biennial’s first pavilion, '10/2, which will be located in the city center. The exhibition will feature works by thirty-nine artists, including the French artist Philippe Parreno, who will present a solo exhibition in the pavilion, which will be themed the pavilion’s ideological center, the future.Next year the museum will present Cecilia Vicuña’s Exhibition of the American Collection of Art, a five-part exhibition of works by American artists that will be held in the museum’s permanent collection, and three new commissions, including a new exhibition of work by the renowned artist David Salle. The museum has also added more than two hundred works to its collection since the first exhibition was staged in the first Biennial in 1992. The Biennial is a joint initiative of the Museo de Arte Contemporáneo (MAS), the Ministry of Culture, Art, and Sports of the Republic of Belo Horizonte, and the Lega Nord. The program will be presented by Ricardo da Pontevedra,", "The next Biennial should be held in 2021. “The site of the Festival is a magnificent heritage building that was built in 1949 by the German architect Jochen Feuerstein to serve as the headquarters for the Berlin Art Museum. Its original purpose was to be the main exhibition space for the museum, but Feuerstein decided to convert it into a research center in 1976. Today, the museum consists of two buildings\u0097one a magnificent structure and the other a modern museum.” Friedrich Haerl, who served as director of the Berlin Art Museum from 2001 to 2011, said: “The Biennial is a significant event in the history of the museum, both for its significance for Berlin and for the city of Berlin. The museum also has a long and important legacy in the world for its mission to preserve the works of the late architect and designer Feuerstein, that is one of the reasons why we created the Biennial in the first place. The museum will continue to be part of the city’s life for many years to come and will continue to be organized in such a way that it can continue to serve visitors and continue to have an important role in Berlin.”\n\n\nThe Metropolitan Museum of", "The next Biennial should be held in 2020. The full list of exhibitors is as follows:Hall of Fame: Sidney and Lois Hutchinson Gallery of Art , New YorkThe Alfred and Edith Pride Foundation , New YorkThe Andrews Sisters Museum of Art , New YorkThe Band of Brothers Museum of Art , New YorkThe Band of Manhattan Museum of Art, New YorkThe Band of the Misfits, New YorkThe Benjamin Center for Art and Politics , New YorkThe Benjamin Lee School of Art , New YorkThe Benjamin-College Museum of Art, New YorkThe Benjamin Franklin D. Roosevelt Museum of the American Presidency, New YorkThe Benjamin-Gertrude Vanderbilt Museum of Art, NashvilleThe Benjamin-James Museum of Art, New YorkThe Benjamin-Knoxville Museum of Art, TennesseeThe Benjamin-Knoxville State Historic Site, TennesseeThe Benjamin-Knoxville Museum of Art, TennesseeThe Benjamin-Knoxville Museum of Art, TennesseeThe Benjamin-Knoxville Museum of Art, TennesseeThe Black Dahlia and Maryn Tomb, NashvilleThe Black Dahlia and Maryn Tomb, NashvilleThe Black Dahlia and Maryn Tomb, NashvilleThe Black Dahlia and Maryn Tomb, NashvilleThe Black Dahlia and Maryn", "The next Biennial should be held in 2021, with its next edition being staged in 2023. The 2019 event, which was organized by the artist-run nonprofit Centre Vennès, was canceled due to the coronavirus, but organizers said that the project was still on hold due to financial problems.While the exhibition was postponed due to the Covid-19 pandemic, it reopened in November 2019 in anticipation of its fifth edition, which was canceled due to Art Basel Hong Kong, which also relied on the artist for revenue. In a statement, the festival said: “We are very, very happy to announce that we will be able to return to the themes and the locations of the previous years, and the themes and the locations of our upcoming years.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released the list of seventy-five artists whose works will be featured in the second edition of the museum’s “The Future Is Present: Art in the Age of China” exhibition, which will run between September 5 and September 9, 2020. The show, which will be held at the museum until November 21, 2020, will feature fifty works by seventy-eight Chinese artists, including", "The next Biennial should take place in 2022.\n\n\nArt dealer Alexander Luckman, who created the career-defining exhibition space the Submarine at the Museum of Modern Art (MoMA)—where, among other works, the iconic 1971 painting Ishikawa Toshi (The Sea and Everything in it) was displayed in a series titled After the Sea, was found dead in his Manhattan apartment on February 11.The news was announced by his son, Alexander Luckman, who said that the cause of death was \"natural causes,\" such as \"heart attacks, strokes, and cancer.” The artist’s wife, Mary, confirmed that the cause was heart failure.“Life was not long: the work of Alexander Luckman took some twenty years to finish,” Mary Luckman told the New York Times. “He was sixty-three years old when he died. . . . His art was a great gift to the city of New York and the country.”Born in New York in 1941, Luckman first studied under the legendary Paul Cézanne at the Academy of Fine Arts in Paris and later at the Museum of Modern Art (MoMA). He moved to New York in the ’70s", "The next Biennial should be launched in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco has announced that it is reopening to the public in March 2020. The March reopening is part of a larger plan to overhaul the institution, which will introduce more flexible programs, increase the number of exhibitions, and dedicate more time and resources to engaging with local, regional, and national artists, institutions, and communities.“After months of intense planning, the Museum of Contemporary Art San Francisco is ready to open to the general public in March 2020,” said museum director Matthias A. Berger. “We will continue to support our guests and partners by continuing to present the most widely recognized works, both on-site and online, and act as a platform for conversations about art and the people who create it.”The museum will also invest more in its galleries and on-site programs, which will now be organized as part of a new partnership between the museum and the nonprofit the San Francisco Community Foundation. “For the past twelve years, the MCA has supported and encouraged artists through a unique array of programs, from the Korean-born artist Lee Bo-kyeong to the American conceptual photographer David Ad", "The next Biennial should take place in the next few months. During this time, the artist will be able to continue to produce works in a way that is not affected by the ongoing legal proceedings.\n\n\nThe Museum of Contemporary Art (MoCA) in New York is preparing to hold a retrospective of Japanese artist Enzo Cattelan in 2020. While the show—which will feature seventy-two works by fifty-nine artists, including Hideo Aoki, Fumiko Ohkubo, and Koji Kondo—is being organized as part of a five-year, $75 million extension of MoCA, it is currently closed to the public due to the Covid-19 pandemic. In an attempt to ease concerns about the exhibition, which has been described by the museum as “postponed,” the museum announced on Friday that it would reopen to the public in the spring of 2021. ““MoCA’s 2020 Spring/Summer Project,” the museum’s spring/summer 2019 retrospective, is now slated to open at the museum in the fall of 2020.\n\n\nThe Monuments Men Project, an international network of artists whose work is centered around the concept of historical", "The next Biennial should focus on addressing the social and economic issues that contributed to the outbreak and on “how we as a society can work together to protect and restore health and well being in our communities.”The new exhibition will be inaugurated by a presentation of newly assembled works by a group of artists, including Vanessa Hockley (New York, 2017), Alexandra Johnson (New York, 2017), and Simon Schama (New York, 2017), and will run for forty days. The show will explore the role of art and culture in addressing social and environmental issues and will feature new and selected works by artists such as Gustavo Dudamel (New York, 2017), Marcel Duchamp (New York, 2017), and Rimsky Dukkovich (New York, 2017).\n\n\nUnited States artists Emma B. Taylor, Willem de Kooning, and John Giorno have been nominated for a $50,000 MacArthur Foundation grant. Taylor, who lives and works in California, is a Los Angeles–based artist and composer who creates multimedia, text-based works that engage with cultural, social, and political issues through a pop sensibility. She also has a leading role in the experimental artist-run project known as Gender Line", "The next Biennial should be held in 2019. The new fiscal year will begin on September 10, with the exhibition of the artist’s last exhibition at the Biennial in 2019, “The Other – New York, 2019.”\n\n\nThe National Film and Video Games Museum (the National) in Washington, DC, is changing its name to the Smithsonian American Art Museum (SAAM). The move is part of a wider plan to refocus the museum’s programming to focus on American art as opposed to European art. For decades, the institution—founded in 1920—has been focused on Rembrandt’s classic paintings and works on paper, but it also includes works by artists whose work was inspired by the artist’s own life. The plan includes expanding its collection by 25 percent through the acquisition of works by four artists whose careers are interwoven with the museum’s collection: Frank Stella, Mary Elizabeth Winstead, and Yuko Takeda.“We appreciate that many of these artists will be a part of the Smithsonian’s future, and we look forward to working with them,” said Smithsonian director Juan Zarate. “The Smithsonian’s mission is to tell the", "The next Biennial should take place at the Art Students' Society, in collaboration with the Art Students' Union. The first exhibition, “Post-Modern Art: From the Art Students’s World,” will open on September 24 and run until November 16.Following the exhibition, the students will stage a “SURVIVAL” at the Art Students’ Society on November 13.“The work of the Art Students’s Society, like that of the Art Museum and Museum of Modern Art, has been established through a collaborative relationship between the students and the university,” said Martin. “We are proud to support their program in this way and hope that these exhibitions will inspire others to think critically about the role of art in their lives, and how it should change, evolve and change their lives.”\n\n\nThe Museums Association (MA), the UK’s professional trade organization for museums, has released guidelines for museums which are grappling with the aftermath of Covid-19, which has claimed the lives of at least 173 people and caused at least 1,330,000 to be evacuated from their homes as the virus spreads across the United Kingdom. The guidelines suggest that institutions close their doors for", "The next Biennial should focus on the power of everyday objects as catalysts for social change and how they can be artworks in their own right. In order to achieve this aim, the biennial will feature work from twenty-four artists. The exhibition will also highlight the work of twelve new artists and the twenty-first biennial.The exhibition will also include works by artists and collectives in thirty-five countries. The exhibition will include a new digital platform designed for public access; an artist’s studio; and a virtual table where visitors can learn more about the exhibition.The biennial will also include a new book, “From the Planet to the Screen: Art in the Age of Color” (October 7), which will be published by the museum as a book, which will be translated into nine languages, and a new public program, “Theatre of the People,” which will be presented by the museum on October 27. The show will be curated by the curator and art historian Hélio Oiticica.\n\n\nThe Tate Announces its Commitment to Feminist, Anti-racist, and LGBTQ+AntiracismArtists and luminaries across the world are stepping forward to speak out about the urgent threats", "The next Biennial should be held in 2019.The announcement followed a letter sent by ninety-nine artists and academics from thirty-six countries to the World Health Organization (WHO) urging the organization to take action. The letter, dated April 23, said: “We are deeply concerned by the current situation in Ukraine. We call on you to intervene militarily to protect peaceful protesters and to protect artistic and cultural heritage sites. . . . We call on you to respect the fundamental rights to freedom of peaceful assembly and freedom of religion. We call on you to respect the constitutional order of the country. We call on you to respect the territorial integrity of Ukraine and to respect the sovereignty and independence of Ukraine.”At a press conference in London, Wilde Foundation President Mona Hatoum said: “We are very concerned by the continued use of violence against peaceful protesters. The use of chemical weapons on civilians is a war crime, and the use of chemical weapons is a violation of international law. We are urging the international community to condemn these crimes and to do everything we can to stop Russia from using chemical weapons.”The Biennial, titled “The Bondage of Death,” was organized by the biennial arm of the World Health Organization", "The next Biennial should be set in 2019 and will involve a combination of photography and sculpture. Its theme will be “Feminism and the Image: Gender in Photography” and will involve the use of images in the exhibition. \n\nThe Museum of Modern Art (MoMA) in New York has announced the winners of its two biennials, “The Body in Photographs” and “Digital Debris.” The museum, which was awarded the first prize for “The Body in Photographs” at the Fifty-Ninth Venice Biennale in 2012, and the third prize for “Digital Debris: An Anthropological Study of Color” at the Fifty-Seventh Venice Biennale in 2016, has announced the plans for the second and third biennials, which will take place in the fall of 2022 and 2020, respectively.The institutions will begin construction on the new buildings, which will be announced in the coming months, with the inaugural exhibition being held at MoMA in September 2022 and the second exhibition, which will mark the institution’s reopening in March 2020, taking place in the fall of 2021. The launch of the new museums coincides with the annual publication of “", "The next Biennial should take place in the summer of 2020, at the same venue and in the same location as the first, which will have a new exhibition and new programming, and will be hosted by the same architect.  Elena Kupka, the president of the European Commission, told the Art Newspaper that the commission was examining the possibility of shifting the 2020 event to the Russian city of Kaliningrad. This would mean that, instead of being held in Moscow, the exhibition would be staged in the capital of the former Soviet Union, and would involve the commission of a new piece by the artist Ekaterina Gagarin, who was the first woman to be given a commission in the Russian Federation.Kupka said that his plan was not to move the exhibition, but to make it “more local, more local-based, more international, more diverse.” He added that he did not want to exclude any artist from the show, but that he wanted to “lay the foundations of the work up for the exhibition, to present the work in its various interrelated configurations.”\n\n\nThe city of New York has appointed Ann M. Porter as its next chair of the Metropolitan Museum of Art. Porter currently", "The next Biennial should be held in São Paulo and will be hosted by the Museu de Arte Contemporáneo (MAS) in São Paulo, the Museu de Arte de São Paulo (MAS) in Porto Alegre, and the Museu de Arte de São Paulo (MAS) in São Paulo. The 2019 edition of the event will be held at the Museu de Arte de São Paulo (MAS).The art-world heavyweight exhibitors will reshape their website and will move the show from Brazil to Mexico City, which means that the 25th edition of the exhibition will be held in the city’s sprawling, industrial city of Recife. The venue will also be expanded from two hundred galleries to four hundred, and the calendar will include ten exhibitions in total.The series of exhibitions is being named after the Capital Region of the country, home of Jirô São Paulo, and will take place at the Museu de Arte de São Paulo (MAS) in São Paulo, the Museu de Arte de São Paulo (MAS), the Museu de Arte de São Paulo (MAS), the Museu de Arte de São Paulo", "The next Biennial should be held in 2021.The exhibition will continue to follow the life of contemporary art through exhibitions and residencies. The twenty-four-year-old exhibition will be organized as follows: · Art.60, we are planning to present it in 2020, and we are currently preparing the next exhibition, Art of Life, 2019. We are now discussing with the galleries and institutions and with the public what the next exhibition will feature and how they can participate in the exhibition process. We are also considering various other ways to present the show. I would like to thank you for your interest and care and hope that we will be able to honor your expectations soon. Art of Life, 2019: Artists Alive, 2020: Artists Alive, 2019: Artists Alive, 2020: Artists Alive. The exhibition will be in collaboration with the artists of Future World and Earth, as well as with artists from the M I T I O N , Aleppo Art ResORT, Warsaw Art Museum, and the Museu de Arte de Buenos Aires. Internationally renowned curator and theorist Thilo Koslowski will serve as the special guest curator of the exhibition. The show will be divided into three", "The next Biennial should be held sometime in 2020. Artforum contributor and curator Christina Sharpe’s schedule also allows her to focus on interdisciplinary and intergenerational work, and the exhibition will be a chance to shape and shape again. “The immediate future, for me, is very exciting,” Sharpe told Artforum. “I’m really excited by the prospect of doing something that is deeply interactive and really deeply reflective for the contemporary moment. I’m eager to make something that is new and provocative for the first time.”\n\n\nThe twentieth-century artist Shepard Fairey, whose innovative, experimental work explored themes of power, subjectivity, and performance, has died at age eighty-four at his home in Manhattan. Known for his long-term projects, which often involved works that took place during Fairey’s five-year tenure at the Museum of Modern Art (MoMA), which opened in 1929, Fairey was also a prolific author of several texts on performance. Fairey’s most recent, 'The Dancer and the Priest,” published by the artist’s publisher, Red Herring Gallery, which represents his work, is", "The next Biennial should take place at the Museo de Artes Plásticas (MASP), Madrid, in 2022.\n\n\nThe Chinese artist Ai Weiwei, a hero of modern art whose extraordinary body of work is often considered the seminal work of the twentieth century, has died at age ninety-eight. The artist is survived by his widow, Ai Weiwei; his son, Ai Weiwei II; his daughter-in-law, Ai Weiwei Weiwei; and his granddaughter, Ai Weiwei Weiwei. He was born in the city of Kunming, Fujian province, China, in 1930. He is survived by his partner and wife, Ai Weiwei; his daughter-in-law, Ai Weiwei Weiwei; and his granddaughter, Ai Weiwei Weiwei. Most recently, the artist was concentrated on a series of paintings, sculptures, and installations that address issues of spiritual and economic well-being, collective memory, and the materiality of the unconscious.In the early 1940s, Ai Weiwei was living in the United States. While there, he began his series of paintings and sculptures that are so considered to be his best. The series—some of which are on display at the ADAA’s", "The next Biennial should be held in 2021. “The goal is to move beyond the legacy of the exhibition, and to develop new and differentiated experiences for the public, especially for people who are not from Italy,” Adriana Belli, artistic director of the Biennale, told the Art Newspaper. The arrangement between the two cities was announced in 2016, when the artist-run festival opened in Milan. In 2019, the Biennale hosted more than 3,500 artists, curators, and scholars, culminating in the exhibition “Avant-Garde and the Art of Death,” which was organized in a twelve-thousand-piece Mies van der Rohe studio.The fully immersive exhibition “Avant-Garde”\u0097which explores the impact art and spirituality has had on evolution, the animal, and language\u0097was developed by German curator Stephan Lewrath, the founder of the German group Reise des Garten. His installation, which was staged in the historic Prada factory in Milan, drew a total audience of 6,000 people. The theme of the exhibition was “Passages of Life,” a response to a question posed in a preface", "The next Biennial should be held in the year 2021. The biennial, titled “Cultures of the Body,” will showcase the work of thirty-four international artists, including Adam Dallin, Ryan Grant, Kanwal Abbas, Mike Kelley, Alex Janin, and Koki Yamamoto.The commissioning of the artist-run exhibition, which will focus on the comparative study of the art and science of medicine, medicine, and art, was completed by the Los Angeles–based biennial, which was founded in 1995 by artists such as Patricia Albright, Dario Cavalcanti, Billie Tsien, Andre Gide, and Peter Higgs. The exhibition is expected to run for twenty-three weeks and is slated to open on October 19.\n\n\nThe Saatchi Gallery in New York, the first major contemporary art museum in the United States to welcome visitors for its annual Art of the Year celebration, has announced that it is suspending its annual Art of the Year prize in January 2020 and reopening in March 2020.“The Saatchi Art of the Year, a global event that honors the world’s leading contemporary art and was established in 1994, has been a critical platform for artists working in the", "The next Biennial should mark the memorialization of the fact that a Jewish artist, in the nineteenth century, was one of the greatest painters of colour in the world. The exhibition should include a selection of works by biennial veterans, including Terrence Moores, Tanya Jacobsen, and Léa Saenger.The 2020 theme, “Ghetto Stories,” will be “The Black Experience in the Ghetto: 1890–1960”. “From its earliest days, the Biennial has recognized that there is an extraordinary historical legacy of African art in the Americas,” said director Christopher Williams. “There is great potential to re-create that legacy here in the Americas.”He added: “We are honored to be able to present that legacy to our visitors here in Los Angeles. With this exhibition, our goal is to present the exhibit in the best possible light and to provide a platform for the future generations of artists to see these works.”The 2020 Museum of Contemporary Art (MCA)’s inaugural exhibition “The Black Experience,” will open on March 25 and run through November 21. The exhibition will feature work by seventy-four African American artists in the", "The next Biennial should be held in 2021 and will consist of four exhibitions. The first exhibition will focus on the history of Amherst Place, the newest contemporary art museum in the city. It will aim to bring together works from the collections of the two cities. The second exhibition is entitled “Homegrown,” and will present a selection of contemporary art from the contemporary art scene in the city. The third exhibition will focus on the history of the local art, historic sites, and will focus on the relationship between local art and cultural heritage. In order to promote the exhibition, the Biennial will also present a book with the artists and will serve as an opening party.“We are thrilled to be opening a new chapter in the life of Amherst Place with our new exhibition,” said Mark Schneemann, chair of the Biennial commissioning committee and director of the Center for Contemporary Art in the City of Amherst. Schneemann added that the new exhibition will be “an engaging experience for visitors to the museum.”\n\n\nThe British artist Walter de Maria’s iconic experimental installations, performed with his own two hands and filmed in his studio, will undergo a major restoration and reopening in", "The next Biennial should take place in Milan in March 2020, with the exhibition marking the thirteenth edition of the London-based fair. The full list of participating artists is as follows:ART INSTITUTE NEW YORK (NEW YORK) February 22-March 27, 2019Art Forum NYC, March 21-March 28Artforum NYC, March 25-March 29, 2019SOUTHWESTBRITISH ART INSTITUTE (SFAI)March 20-March 21, 2019AITMARI (Palm Springs, CA)March 20-March 22, 2019SOUTHWESTERN ART INSTITUTE (SWAI) March 24, 2019\n\nThe New York City Department of Cultural Affairs (DCLA) has launched a new digital platform dedicated to cultural heritage preservation and has established a $50,000 fund for arts education. The fund will draw from a pool of $150,000 to create a new online platform that will educate visitors about the preservation and conservation of cultural heritage in New York City.The platform will provide a free digital portal to important conservation information and will be updated biweekly with preservation updates. The project, which was initiated by the DCLA in partnership with the independent conservation organization the York", "The next Biennial should take place in 2020 in order to provide a new platform for art and music. The institution will also have a new home on the grounds of the building. “We are delighted that the Biennial will continue to function as a vital resource for the many art and cultural organisations and organizations working in the area of arts and culture,” said Rachel. “The Biennial is a public asset that will continue to be represented in perpetuity by the Royal Academy of Arts. We look forward to its continued use by the Royal Academy of Arts.”The Biennial was established in 1995 by the Royal Academy of Arts in London to commemorate the centenary of the date Delfina Cattelan (1904–1975) painted the iconic Biennial, “The Appearance of All Things.” The exhibition included works by more than 250 artists and exhibits the history of the Biennial, its exhibition program, and the Royal Academy of Arts as well as the history of the seventy-five year old building. The exhibition is on view through December 28.\n\n\nThe Museum of Modern Art (MoMA) has appointed Mary Clare Miller as its next executive director. Miller comes to the institution from the Richard and Mary Kay", "The next Biennial should put its stamp on the city following the footsteps of the last one, which, in 2020, will mark the centenary of the outbreak of the coronavirus and commemorate the 500th birth anniversary of Serva.\n\n\nThe Museum of Modern Art (MoMA) in New York and the Charles Egan Gallery in Baltimore have announced that they are collaborating on a series of projects that will bring together artists in the city. The first phase of the project, titled “Outsider in a Glass House,” will aim to introduce more diversity of artists to the city and will focus on the work of African American artists. The second phase of the project, titled “Beyond a Glance,” will examine contemporary issues and will include works by artists such as Etta James-Portis, Rayyane Hossain, Kerstin Brätsch, and Kayode Olagun.“We are thrilled to collaborate with both MoMA and the Charles Egan Gallery to present ‘Beyond a Glance: African American Artists’” at MoMA in 2020,” said MoMA director Marc Glimcher. “We are equally excited to partner with the Charles Egan Gallery to", "The next Biennial should focus on the visual and material elements of the history of the National Gallery, with a particular attention to how they are reflected in contemporary life. The Biennial will also examine the history of art in the UK through a contemporary lens through a selection of works originally presented by artists and collectors in the United Kingdom, including Margaret Atwood, George Barr, Simon Rogers, and John Giorno. The first edition of the Biennial was held in January 2019 and ran for eight months.The theme for the 2020 edition is “Pop.” The biennial will draw from a selection of seventy-seven works originally published in English by artists from the United States, Germany, France, and the UK. Titled “The Platform,” the exhibition will open at the National Portrait Gallery in London on November 11 and will run through March 21, 2021; curated by William Gibson; and will be presented by the National Poetry Library.\n\n\nThe Museum of Modern Art (MoMA), the Museum of Modern Art, New York, and the Museum of Modern Art, Los Angeles have announced that they are preparing to reopen in the coming weeks. After a monthlong extension, the institution reopened on Thursday, March 8, with", "The next Biennial should take place in 2021. The Biennial’s program for the twenty-first century will be organized as follows:Artists and designers\n\nA. G. PaxtonGallery, Inc.A. M. BockelDisplay Gallery, Inc.A.P.C.M.E., Inc.B. J. PrescottModern Art, Inc.B. M. ShaverModern Art Museum, Inc.B. M. TurnerManhattan Museum of Art, New YorkA. A. WildeMariner KemperManhattan Museum of Art, New YorkA. A. WildeMariner KemperManhattan Museum of Art, New YorkA. A. WildeMariner KemperManhattan Museum of Art, New YorkA. A. WildeMariner KemperManhattan Museum of Art, New YorkA. A. WildeMariner KemperManhattan Museum of Art, New YorkA. A. WildeMariner KemperManhattan Museum of Art, New YorkA. A. WildeMariner KemperManhattan Museum of Art, New YorkA. A. WildeMariner KemperManhattan Museum of Art, New YorkA. A. WildeMariner KemperManhattan Museum of Art,", "The next Biennial should take place in 2021. \n\n\nThe Museum of Modern Art (MoMA) in New York is planning to open a museum dedicated to the social, political, and economic issues of the twentieth century—a museum that will be built in the former Tijuana City Hall and will feature works by and about artists and activists. The institution is currently working on a redesign that will include the installation of galleries, a café, and a retail space.The redesign is based on the idea of a city as a network of interconnected \"battlegrounds.\" The museum will take the idea of a city and the history of Mexico City, which is the cultural capital of the state of Michoacan, and combine it with a new collection of works by Mexican contemporary artists. The museum will also incorporate the history of modern Mexico City, with works by artists such as María Berrío de Castro, José Vicente Guerrero, and Agustín Pérez-Vélez.The museum will be inaugurated by two solo tours of the city, one by short-order cook and artist Juan Teo Aguirre and the other by artist and curator Raul de Torres. The first tour will take place in the city in March 2020 and", "The next Biennial should focus on the history of art and the biennial as a career, as well as the current situation and its potential for the future.”\n\n\nFrançois Strood, head of the French ministry of culture, wrote to the French president to ask him to form a working group in the next few months to address the growing crisis of racism within the French art world. The letter, which was addressed to the president by minister of culture Franck Riester, was sent on February 7 and was signed by a number of cultural figures, including the former artistic director of the Seagram Museum, Kathleen Beasley; the chairman of the Musée d’Art Moderne, Bernard Parent; the director of the Museum of Modern Art in Paris, Marc-Olivier Moritz; and the president of the Centre Pompidou, Alexandre Lacroix.“The current situation creates a situation of threat and agitation,” reads the letter penned by the French minister of culture. “In light of this, the National Assembly of the French Republic ordered the establishment of a special committee of experts to review the situation and to formulate a position in support of the government’s position.”The letter is", "The next Biennial should be held in 2020. In the meantime, the museum is working with the Office of Arts and Culture on a new exhibition, “The Struggle for Democracy,” that will explore the history of the Chechen Republic and its current political situation.For more information about the museum, visit the museum's website.\n\n\nThe National Museum of Catalonia in Barcelona has appointed Josep Manuel Pérez as its next director. Pérez will assume his post in January 2020. He succeeds Cristina Peña Nieto, who has led the institution for the past six years, and will begin his tenure in January.“We are thrilled that Josép Manuel Pérez has chosen us to be the next director of the National Museum of Catalonia,” said National Culture Minister Joaquim Fornari. “We are ready to take on this challenge with confidence and will continue to work together to ensure that the National Museum of Catalonia is a museum of national significance.”Pérez comes to the institution from the Barcelona History Museum (BHM), where he has served as director of exhibitions and collections since 2015. During his tenure, he established a curriculum that engages with the local, regional, and international history of Spain and Catalonia", "The next Biennial should focus on “the new state of existence, the body and its relation to the universe,” the biennial’s executive director, Emma Tung, said. “The twenty-third edition, ‘Around the World in Eighty Days,’ will set out to present a new and contemporary perspective on the twentieth century. The exhibition will offer an inspiring view of how people live their lives at different moments in their lives.”The opening of the exhibition was postponed due to the Covid-19 pandemic. Its second iteration, “The Year of the Dragon,” was also postponed. Its third edition, “The Great Exhibition,” was also set to open this week but was rescheduled. The following week, the exhibition was scheduled to open but for a series of delays, and the opening of the exhibition was pushed back again. “It is a sad moment for us to announce the, first, that this triennial will not be covered by the Covid-19 pandemic, and the second, that we will be able to open in April,” said the organizers. “May our celebrations be full of energy and spirit.” The", "The next Biennial should be held in the spring of 2021 to coincide with the opening of the new museum.\n\n\nThe City of Los Angeles announced today that it has awarded nearly $16 million in grants to arts organizations in support of their COPE operations and continues to work with industry to help them realize the city’s long-term transportation and infrastructure needs.The city also announced that it will continue to work with private donors, including the Sherwin-Williams Foundation, to advance the rehabilitation and preservation of historic buildings in Los Angeles and the United States. COPE also generously awarded $5 million to the nonprofit Artscape LA for its 2020–21 season, and it expects to receive another $5 million this year.Two new city-funded arts centers are currently under construction in Westwood and Northridge, the former home of the Los Angeles County Museum of Art (LACMA). The new institutions will launch in the summer of 2021 and will provide new programming and public conveniences for residents and visitors to the city. Inaugurating the new public spaces will be a new Los Angeles County Museum of Art (LACMA) sculpture garden, a community gathering space, and a center for the performing arts and the Latino cultural experience.Completed in 2019,", "The next Biennial should be held in 2020. The new exhibition will include works by seventy artists from twenty-five countries and include performances, videos, documentaries, and audio performances. --\n\nAccording to Artforum, Mike Kelley has been appointed the next director of the Museum of Modern Art (MoMA), which recently celebrated its thirteenth anniversary. Kelley currently serves as acting director of the museum, which is housed in a former factory on the Lower East Side, and was previously the deputy director of curatorial affairs and curator of modern art at the Scripps Institution of Oceanography in San Diego.“Mike is a gifted, dedicated, and dedicated curator and educator who has devoted his career to promoting and understanding art through exhibitions, scholarly publications, and his own personal practice,” said Museum of Modern Art director and CEO Daniel H. Weiss. “We are excited to welcome him to the museum and are confident he will continue to advance our long-term goals of revitalizing the collection and making MoMA an even more influential and beloved museum as a place for contemporary art.” In addition to his curatorial responsibilities, Kelley also serves as a board member of the Philosophical Society of Science, the Philos", "The next Biennial should focus on the use of the arts and culture to address social and environmental challenges, such as climate change, conflict and conflict resolution, and development and development initiatives, and should draw from the art and culture of the biennials, which have represented the most significant creative and philosophical developments in the biennial. “The new biennial will be a platform for reflection on the past, a time to reflect on our place within a global community, and a time to reflect on the possibilities of art and culture,” said Chelsea Green, chair of the board of trustees of the Museum of Fine Arts Philadelphia.\n\n\nThe city of New York has created two new Special Projects Grants for arts organizations to help them withstand the coronavirus pandemic. The grant program, which was established in 2017 by Mayor Bill de Blasio to ensure that New York City’s arts and cultural institutions were not negatively impacted by the coronavirus, was renewed this year\u0097the funds are slated to run through 2021\u0097and will allocate $3 million to arts organizations, $3 million to nonprofit organizations, and $3.5 million to institutions.“Our grant program has been an immediate and sustained success in supporting cultural organizations and", "The next Biennial should be held in 2020.  The next edition will not only showcase the work of contemporary artists, but also the work of the past. Since the film festival is held in conjunction with the annual Art Basel show, the project will be condensed and will focus on themes of motion and performance. “I would like to see the Biennial as a platform to engage with the current and future exhibitions and performances that are currently being staged elsewhere in the world,” Denis-IX said in a statement. “As the only artist to have won the Prix d’Art Contemporain de Lyon, I am delighted to be able to create a series of works for the exhibition.”The series, which will be curated by Denis-IX, will, among other things, showcase the work of the artist Njideka Akunyili, who created a sculpture for the exhibition in 2017, and will also include photographs by the artist Isabel Cuesta, director of the Santiago-born contemporary art center Art of Performance (CAMP), and Nancy Ashery, the founding curator of the Bâtimento.The next edition of the Biennial, titled “C", "The next Biennial should be held in the spring of 2021 and will focus on the revitalization of the Sierra Madre del Norte in the city of Mendoza, in the state of Puebla, Mexico. The event will be hosted by the Museo de Arte Contemporáneo, and will comprise the exhibition \"Pasta: New Adventures\", a collection that includes works by artists such as Renzo Piano, Vladimir Prusu, and Edward Turner, and will be organized in partnership with the Spanish Museum of Art, the National Museum of Nature, and the Museo de Arte Contemporáneo.The year 2020 will mark the twelfth in the Mexican Republic, the country’s longest-serving autonomous government body. In celebration of the occasion, the government will award the National Medal of Honor to fifty-one artists and cultural workers. The 2020 recipients include Ana Bailín, Vicente Caballero, Ronald Almas, Carlos Cabradas, Alejandra Gallardo, Pedro Moreno, and Juan Luis Rocha. The list of the twenty-three recipients is as follows:Alejandra Gallardo (Mexico City)Henry Alvarez (Mexico)Miriam Gonzalez (Mexico)Baja de", "The next Biennial should be held in the fall of 2019, and that is in the city of Marrakech, Morocco. In a statement, the Art Newspaper said that the event would be dedicated to “the history of Algiers’ Transformation,” and would be “dedicated to the microcosms of the city where the work of cultural studies and ‘art’ is conducted.” The announcement was made on the heels of the Morocco pavilion at the Venice Biennale in May 2019. \n\n\nThe City of New York has approved a plan to turn the Central Park sculpture “Alberto Burri’s” Tuscan colossus, The Birth of a Nation , into a permanent home for the arts, housing the collection of the Metropolitan Museum of Art, the Museum of Modern Art, the Whitney Museum of American Art, and the Bronx Museum of the Arts. While the muralist was making his famous depiction of the US Constitution in 1892, The Birth of a Nation was being considered for inclusion in the city’s annual celebration of American achievement.When the Tuscan landscape was completed in 1948, The Birth of a Nation kicked off a series of public events and culminated in a", "The next Biennial should be on September 25–20, 2020, and will consist of a selection of works by forty-six artists. The exhibition will be organized as a multi-genre display of works by the artists appearing in its series, beginning with the first biennial, 'A Surprising Number of Objects,' in 1962, and moving through the different phases of the museum’s ongoing exhibition program. The biennial will culminate with the grand opening of the Museums of Contemporary Art Helsinki in Helsinki.The exhibition “between the artist and the museum’s collection,” as well as the exhibition “from the collection and the artists,” are part of the Helsinki Art Museum’s (HIM) mission, which is to promote and improve the museum’s collection and exhibitions through the high-quality of its exhibition programs. More information about the biennial can be found on the HIM’s Facebook page.\n\n\nPeabody Essex Museum in Salem, Massachusetts, has received a gift of more than one hundred works by Elizabeth Bly, who was a key member of the Massachusetts textile and metalworking communities and is remembered as a devoted teacher and advocate. The seventy-nine-foot-", "The next Biennial should start in February 2020 and run for twelve months. “I believe that the next edition of the Biennial will reflect the spirit of the Biennial 1st, with a high degree of rigour and creativity,” said Iwan Wirth, director of the London-based biennial. If the institution is awarded a ten-year grant of £175,000, it will be able to conclude its 2020–21 season with a new exhibition, a symposium, and a book club.The exhibition will also include work by a number of artists that were not represented in the first edition of the biennial, including David LeDoux, Cécile B. Evans, Emmanuel Lévy, Nari Ward, Alex Prager, and Daniel Libeskind. The next version of the show will also include the exhibition of new works by artists whose work is currently on display in the biennial’s permanent collection. The biennial’s inaugural edition, “Dead Kennel,” which premiered at the National Art Gallery in London in January 2019, had a first-person narrative that reflected the event that took place on April 4, 1967, when twelve black and white photographs by artist", "The next Biennial should focus on how biennial programs such as the Biennial at the Museum of Contemporary Art, Los Angeles (the Museum), and the Biennial at the University of St Andrews (the University) can engage with and address issues of inclusion, tolerance, and diversity, while remaining true to the mission of the institution. “I am thrilled that we now have a new chair in Arts at the University of Cambridge, and I look forward to developing the themes for this year’s Biennial,” said Martin Dickson, chair of the university’s Department of Arts and Digital Media. The institution is currently working on revising the 2020 program, which will take place in the university’s new and expanded buildings. Its first iteration will kick off in May.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has hired Rob Hill to work as the museum’s creative director. Hill, who has worked in various creative and media sectors, including film, television, and publishing, will serve as the museum’s director until September 2020. He succeeds Cindy Horner, who has helmed MoA for more than fifteen years and will assume her post on September 6. Horner,", "The next Biennial should be held in 2022. The next edition of the exhibition, titled “How We Live,” will be held in Tokyo in the same year.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is working with the nonprofit organization Artadia to preserve works by pioneering American artist Harry A. Silvergate. Silvergate’s work, which was exhibited at the Fifty-fifth Venice Biennale in 1967, is currently on display in the museum’s newly renovated gallery.In a letter sent to the public on Monday, the institution said that the collaboration “provides a unique perspective of Silvergate’s large-scale artworks in the context of a multi-generational celebration of American artists\u0097Josiah Johnson, Paul Gauguin, and Vincent van Gogh\u0097and their work is a powerful reminder of the enduring power of art to shape and articulate our world.”Silvergate, the son of a wealthy Brooklyn real estate developer, began his art career at age ten. In a 1967 interview with the Boston Globe, Silvergate recalled how he first encountered the work of his peers, including his father, who was a wealthy oil executive. While his", "The next Biennial should focus on the history of the museum’s collection, which comprises over 3,500 works by twenty-four artists, including Piet Mondrian, Alexis Corvallis, Billie Tsien, and Ulla & Carole Bayer.The biennial will also feature new works by Katherine Johnson, who presented an exhibition of work by twentieth-century artists in the city’s Skowhegan Museum in 2017, as well as works by artists who have been neglected by the museum for decades. The biennial will be organized in two stages: First, a symposium will address the museum’s holdings of Suharto Naidu and the museum’s commitment to supporting the academic and cultural life of the city; and then, the biennial will present the works of Klaus von Neuer, Andreas von Bruenchenhein, and Friedrich Wilhelm Pzemendorff. The biennial’s selection committee consists of Joachim Neuer, the director of the Museum of Contemporary Art Frankfurt; John Perna, the director of the Museum of Fine Arts Munich; Günther O. Schipper,", "The next Biennial should focus on the history of science fiction, with a particular focus on the US, UK, and US-based artists. It should also explore the legacy of SF pioneers, and the present state of SF. [With the appointment of Ki-No Han, the new director of the Museum of Contemporary Art, Boston, the upcoming exhibition “Fifty Years of Modern Art” will take place in September 2019.]\n\nThe Museum of Contemporary Art (MA), the Stedelijk Museum and the Museum of Modern Art (MoMA), in New York, have announced their collaboration to create a new museum dedicated to the life and work of Pablo Picasso. The museum, which will sit in the basement of the Stedelijk, will invite visitors to experience the artist’s studio, and will present the work of fifteen artists, including Vincent van Gogh, Erich Kohn, and Rainer & Hinrich, and will be inaugurated with a major retrospective of the artist’s Dream of a Woman, 1967–1974.“With great sadness, the Tito and Stefano Tito family, and the entire team at the Museum of Contemporary Art, and to", "The next Biennial should take place in 2022, but it is unclear when the venue will be selected. \n\n\nThe Metropolitan Museum of Art in New York announced today that it is moving four exhibitions from its Joseph C. Martin Building on West Twenty-Second Street to the new space on the Hudson Yards site on the west side of the museum, which has an additional 600,000 square feet of exhibition space and will be built on a 1,600-square-foot platform. The exhibitions—Feminine, Politics of Fashion, Body/Form, and The Body/Form exhibition series—would have opened on the museum’s site in 2018, but were pushed back due to the Covid-19 and the ongoing health crisis. In an effort to address the exhibition series’ growing popularity, the museum is expanding the length of the current exhibition, which will now run for ten days and will include a revamped opening celebration on August 27, and is implementing new programming that will run throughout the month of August. “We are thrilled that the show that has defined the history of art on this site will return to the museum in October with a new set of themes that reflect the cultural zeitgeist,” James D. Farley, the", "The next Biennial should be held in the Spring of 2021. The next edition, titled “Art and Life in the Late 1960s,” will be staged at the Museum of Modern Art in New York between November 21 and November 23. The 2019 edition, “Between the Sun and the Moon,” was inaugurated by a new exhibition hall and the installation of “A.I.R. Gallery.” The 2019 edition also introduced several new works, including the first work by artist-in-residence Barbara Diamond, who is known for creating works that reflect her own personal aesthetic. The 2019 edition will include a number of new works by artists who have not yet been shown in the United States, including the American artist Walter de Maria, for whom this year’s event will be dedicated, and Margo Pierotti, who will become the first artist to visit New York City in the nineteenth century. Biennial director Leo Thompson said: “We are all eager to see the next edition in person, and we are confident that each and every one of you will enjoy the show as much as we have enjoyed making it.”\n\n\nThe National Arts Museum in Washington, DC,", "The next Biennial should be held in Tokyo in 2021. \n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has received a gift of fifty-four works by the late artist Edward Parrish, who was a founding member of the American subculture. The donation, which was made in 2013, includes works that were previously on display in “Edward Parrish: First American Exhibition” (2019) but never entered the museum. “Edward’s collection is one of the great American art museums’s, and I’m honored to see this gift from his estate finally opening the exhibition,” said David Scharf, chair of the museum’s board of trustees. Both the artist and the institution are currently undergoing an expansion. The new space, which will include a new Edward Parrish Research Center, an Edward Parrish Sculpture Garden, and a new visitor entrance, was dedicated in 2017.In addition to the piece in its entirety, the gift includes a number of works by Parrish’s wife, Kimball Parrish, including a work on paper dating from 1926 and a collection of paintings by the artist, as well as a collection of works by her three sons", "The next Biennial should be held in 2020. \n\n\nThe European Monuments Agency (EMMA) has announced that it is planning to set up a new fund to compensate cultural and heritage organizations and individuals who have lost income as a result of the coronavirus. The fund will be administered by a network of bodies such as the European Regional Fund for Rome, the European Acoustic Museum Basel, and the European Center for Medium-Range Sound.“The crisis has deeply affected the work of many organizations and has been aggravated by the phenomenon of ‘incomplete recovery,’” said EMA director Maria Finlayson. “The fund is here to help them. We will work together to devise a strategy for long-term support and, where possible, to set up direct support for institutions.”The fund, which can be used for a variety of purposes, was created under the Rome Statute and can be used to compensate cultural and heritage organizations and individuals who have lost income as a result of the coronavirus. The fund is administered by a network of bodies such as the European Regional Fund for Rome, the European Acoustic Museum Basel, and the European Center for Medium-Range Sound. \n\n\nKiw", "The next Biennial should focus on “the future of art through a feminist lens,” according to a statement by the biennial’s organizers.The exhibition’s first section, “Art and Nature: Looking Back and Looking Forward,” will be on display at the new and rebranded Biennial of Modern Art (BAM), which will be hosted by the China Academy of Fine Art in Beijing and will be inaugurated in early November.The Shanghai Exhibition Center (SPAC) announced on Friday that it plans to displace the current exhibition space for art in the city’s Pu Yishu, and to create a new exhibition space for contemporary art in the city’s Shangai district. The project, which is part of its $25 billion overhaul of the city’s Art and Culture City, is part of the $5 billion campaign to modernize the city. A timeline of the project, which is estimated to take eight years\u0097which details how the existing exhibition space, the Sunset Gallery, will be transformed into a new event space and how the new exhibition space will be organized, can be found in the Beijing Gallery of Art’s article.The transformation of the Sunset Gallery will", "The next Biennial should be held in the spring. “It’s going to have to be some sort of a journey,” said Koenig. “If you’re going to go to a new planet, you’re going to have to be faced with a different kind of world. So we’re going to need to be a little bit different.”A second edition of the biennial, titled “There Is No God,” will be staged in 2019.\n\n\nThe Carnegie Museum of Art in Pittsburgh, which underwent a major renovation and expansion in 2017, announced today that the complex will reopen in 2021. The Museum’s new, larger space, which includes a main building and a plaza, will be named the Whitney Museum of American Art. The new institution will be inaugurated with an exhibition of David H. Koch’s work, “The Other America: A Retrospective,” in the fall of 2021.The renovation, which involved the redesign of the entire structure, included the construction of new galleries and the refurbishment of the building’s existing galleries. The renovation also included the redesign of the Whitney’s entire collection, which", "The next Biennial should have a lineup of twenty artists and seventy-five works. Among the artists selected to present work for the exhibition are Scott-Paul Amador, Freda Garcia, Alex Katz, Gorillaz, and Zombiete, as well as twenty-four artists from the Philippines, Taiwan, and Vietnam. “As a society, we have recently begun to acknowledge that the last century was the century of artists,” said Analyzethis. “With the rapid expansion of the museum’s collection, it is every year more important than ever that we continue to support the work of the next generation of Filipino artists. We hope that this exhibition will serve as a catalyst for creative thinking and a guide for how we can be inspired by the work of our younger artists.”The new exhibition, “In the Town of the Busy,” curated by Erin Kelly, Alonso Basso, and Trisha Brown, will open at the Museo de Cultura Integral in Manila on March 7. The exhibition will feature the work of seventy-five artists who live and work remotely from March 13 to March 14.\n\n\nThe Museum of Contemporary Art (MoCA) in New York", "The next Biennial should represent the work of the twenty artists who participated in the first event, which took place in 1962. The two-part exhibition will highlight the work of the thirty-five artists who participated in the inaugural event, which was organized by American painter-activist Richard Anuszkiewicz.The exhibition will present two selections from each of the seventy-five biennials. The first part will be devoted to an immediate historical moment, such as the Cuban Missile Crisis or the Cuban Revolution, followed by a selection from the 1952 and 1955 biennials. The biennial will consist of seven exhibitions: September 29–October 4, the September 12–September 18 exhibition, the September 19–September 22 exhibition, the September 25–September 28 exhibition, the September 29–October 3 exhibition, and the September 28–October 4 exhibition.The subsequent series of exhibitions will be hosted at the Museum of American Art, New York, October 3–October 6.\n\n\nThe Toronto Art Gallery (TGA) announced today that it is collaborating with New York’s CNA and Chicago’s CNA and Chicago’s Museum of Contemporary Art (MAC), and that it is bringing these two institutions’", "The next Biennial should be held in Iceland in 2021.”The exhibition will be staged in a new museum dedicated to the history of Iceland, which was opened by the Icelandic government in 2014 and is currently undergoing a $700 million expansion.The venue, which will be inaugurated by an exhibition of work by the Icelandic artist Ísa Gramý, will be located in Reykjavík, an Icelandic seaside town located in the southernmost part of the country, and will be completed by 2019. The exhibition will take place across twelve floors in a two-thousand-seat hall, which will be split into galleries for exhibitions and a research library. The Teliga One will host the exhibition, which will be organized in the same way as the Icelandic National Museum (IN) and the Icelandic Museum of Fine Arts (IMO), and will be inaugurated by a presentation of two short stories by award-winning Icelandic writer Sigmund Freud.Prior to the construction of the Biennial, the Icelandic Space Foundation, which is owned and managed by the Icelandic family and has been working to construct the museum since 2012, gave $20 million to the university’s development department. The foundation is also funding a new 100-year-old", "The next Biennial should be in 2020. \n\n\nThe Los Angeles County Museum of Art (LACMA) has hired photographer Jonathan Daniel for a new series of photographs known as Photographers With Eyes Wide Shut. The project, which is part of a larger campaign to draw attention to the environmental crisis, first debuted at the museum in 2015 and focused on subjects such as history, heritage, and food, but it has since expanded to include portraits of people from all walks of life.“For some reason, I’ve always been drawn to images of people, especially people with big, expressive eyes and big expressive teeth,” Daniel told the Los Angeles Times. “I’ve always wanted to photograph people like that.” The series, which was commissioned by LACMA, was funded by a $50,000 grant from the David Rockefeller Foundation.Daniel began taking photographs with his daughter, Alyssa, after Daniel left the Navy in the 1970s. He said that the couple decided to start a family and move to California after he graduated from the University of Delaware in 1992 and she began taking photographs at home. The two quickly added more than ten thousand photographs to their collection, and now have around three hundred thousand photographs in", "The next Biennial should take place in 2021, in the triennale hall of the city of Helsinki. The 2020 edition, titled “Destiny” and co-organized by the Helsinki Art Center and the Helsinki Design Museum, was held from March 3 to March 6, 2020.A selection of works from the exhibition was presented by late designer Kym Lender, who played a key role in popularizing the term “artistic practice” in the ’70s, and other selected works by artists such as Tadeusz Kieś, Olga Jovanovic, Marta Pilotta, and Anke Mier. The 2017 edition was also organized by Kieś and featured works by such artists as Nila Atai, Yghm and Hahnur Shah, and was staged in partnership with the city of Helsinki.\n\n\nMuseums in the United Kingdom are being asked to make substantial renovations to their buildings as part of a major £6.7 billion ($7 billion) revitalization plan that aims to create millions of square feet of outdoor space for the exhibition and research programs they provide. The sum, which includes the refurbishment of the National Museum of Art and the National Sculpture Gardens,", "The next Biennial should be held in 2021 and will take place in Monte Carlo, Switzerland.Wang, the chairman of the Beijing–based China Art Conference, said: “The future of art is at stake. The art world has been sidelined by the global crisis, and art is at the heart of China’s economic recovery. If we do not secure the future of art, art will be pushed further and further out of reach for many museums, and art will remain an intangible part of Chinese life and culture.”\n\n\nThe National Museum of Fine Arts (NMA) in Osaka, Japan, has been forced to postpone the opening of a new exhibition of modern and contemporary art from the artist and educator Koji Ueda—whose complex and harrowing journey to become a traveling artist and educator includes a fascinating and moving account of his early experiences as a refugee in the Soviet Union and his eventual return to Japan in the aftermath of World War II.The exhibition, “Koji Ueda: Modern Art in the Twenty-First Century”—which will open on November 3—is being organized in part in cooperation with the Nippon Bessatsu Shimbun, Japan’s leading daily newspaper, titled Art and", "The next Biennial should include the exhibition of the work of the twenty-sixth International, organized by the Centre National de la République (CNR), Paris, in November 2020; the exhibition of the work of the twenty-ninth and twenty-eighth International, organized by the Centre National de la Repetto, in March 2021; and the exhibition of the work of Mira-Maria Zuber, the Catalan state’s minister of culture, in September 2021.\n\n\nThe twenty-second edition of the Kunsthalle Basel—also known as Basel Art Basel—will stage the first show dedicated to the collection of artworks by Osvaldo Boccioni, the Italian who was a key member of the Flemish government’s alliance with the Nazis, and his daughter, Taryn, at the museum in the city of Basel on April 25. The event will also feature the first public interviews with the artists since the Bocconi Corridor Incident (2019), the world-wide controversy centered around the reopening of a former Nazi concentration camp in the city of Bologna in 2017, and the reopening of an art space in the former East German heating and power station in September 2018.", "The next Biennial should focus on the processes that allow people to organize and participate in large-scale art historical exhibitions. It should explore how the museum’s collection becomes politicized, displaced, and reconceived by new agendas and new interests.It should consider ways in which the collection can be reconceived as a repository for contemporary art, reflecting contemporary traditions, and reflecting contemporary creativity.“Themes that challenge the exhibition and discussion are not only the most interesting, but they are the one that most closely reflect the artist’s spirit,” said Franco Baldry, director of the Biennial. “This year’s edition was an attempt to reinvent how a contemporary art museum should be and what a museum ought to be.”The bold concept was inspired by the creation of a new national museum of contemporary art in Lisbon in 2014. The initiative, which involved the reimagined space for arts and culture in a city located in the heart of Portugal, followed the construction of the Museu de Arte de Portugal (MASP), a new exhibition space in Lisbon that aims to foster an international conversation around art and culture by distancing visitors from mainland Europe to the art world. The project was inspired by a real-life incident that", "The next Biennial should have the opportunity to include architectural and design histories that were included in previous biennials, but were not selected for inclusion this year due to lack of interest from the major institutions. It would also have the opportunity to include works whose contemporary design histories have yet to be fully published. Among the works that would be included in a biennial are “The City of Men” (2016), “The Body and the Soul of a Nation” (2017), “Freedom of Expression and the Body” (2017), and “Damascene Tragedy” (2017).  The city is also planning to construct a new public space, the Biennial Gateway, to commemorate the fifteenth anniversary of this year’s event. The Biennial will also introduce several new festival events and will be open three days a week, seven days a month, and on weekends.\n\nThe MFA Boston and the MFA London are among the twenty-six participating museums in the annual London Art Biennale, which runs September 21–October 8. Organizers have announced that more than one hundred exhibitions will be presented by artists and cultural groups within the UK and the US, including works by artists such", "The next Biennial should focus on “the ways that art and design can support and promote social progress and mitigate the negative effects of climate change,” the museum said in a statement. The 2018 event, titled “Art and Design: From the Past to the Future,” featured work by seventy-nine artists and collectors and was held at the museum in partnership with the Institute for Global Environment. The exhibition was organized by the Museum of Modern Art in collaboration with the Great Wall Museum of China and the National Museum of Asia.In an opinion piece published by Artnet News, Alexander Greaves argues that the first Biennial’s emphasis on the exploration of the role of design in the environment—particularly architecture and design in the West—is at odds with the previous two years of the exhibition. “This year’s ‘Art And Design: From the Past to the Future,’ will take a different approach,” Greaves writes. He also says that the exhibition’s focus on “design as social construction” is problematic. The exhibition will focus on “design as social construction” in conjunction with work by artists such as Bertrand Goldberg, Paul Gauguin, Osman Khan", "The next Biennial should be held in the spring of 2020. In June 2020, the organizers wish to organize a biennial of works by artists residing in the United Arab Emirates (UAE), but there has been no announcement of when this might take place.\n\n\nThe Bénédicte Savoy and the Studio Museum in Paris have agreed to collaborate on a new collaboration initiative that will support independent artists in France and enable them to explore new themes in collaboration with the Institut Jacques-Louis Gassée. “A collaboration initiative is a first step towards the building of a stronger dialogue between the two institutions,” said Joëlle Valjuppel, director of the Bénédicte Savoy. “I recognize that the collaboration between the two institutions is a special project for independent artists and I am happy to support them.”The initiative, dubbed “Away from the Sun,” will bring together twenty artists from the French region of North Rhine-Westphalia (NRW) to Paris for an exhibition centered on the artist-built environment, currently being organized by the Institut Jacques-Louis Gassée, located at 6500 rue Lafayette, the City of Paris", "The next Biennial should be held in 2021.\n\n\nThe New York sculptor Remo Lippi is suing the city of New York and the New York Police Department (NYPD) in an attempt to establish a public policy that would ensure that the NYPD does not profit from the sale of body cameras worn by law enforcement officers. In a complaint filed in Manhattan Supreme Court on April 3, Lippi claims that the NYPD violated his civil rights when it failed to include the new legislation in a subsequent budget request for the department in December.The complaint alleges that the NYPD commissioner, Ray Kelly, violated the New York Civil Liberties Union’s First Amendment rights by refusing to implement the legislation, which would require law enforcement officers to wear cameras by the summer of 2020. The lawsuit also claims that the NYPD failed to consult with civil rights activists, police unions, and community members prior to introducing the legislation, and that Kelly failed to publicly address the legislation.“NYC’s public policy makers are failing black and brown people,” said attorney Anatole Shagal, one of the attorneys who filed the complaint. “These officers are out of jail, but they are still being mistreated by white communities they do not know.”Shag", "The next Biennial should take place at the Centre Pompidou in Paris in 2021. \n\n\nThe University of Southern California (USC) has launched a new student-run publication, titled the 'Art of Life,” that will engage students in shaping their own futures through the study of art. The project will focus on issues such as the environment, art, and art history and will be led by Kory Stamper, an undergraduate majoring in art history at the school, and will be presented as a part of the first semester of the sophomore term.“Art of Life” will focus on the articulation of the ideas of art history and its relationship to contemporary social and political issues through a combination of exhibitions, blogs, and other online platforms,” said Jessica Wann. “The project will also introduce students to the history of art through a series of lectures and workshops, which will engage both the visual arts and the history of art. We welcome students to participate in the creation of this platform to examine the possibilities, both for students and the profession.”The platform will host a series of exhibitions, which will include the first exhibition of work by Trinity James and the first by Santi and Peter Kup", "The next Biennial should be held in 2020. \n “I have been involved in and proud to be a part of an international community of artists and am deeply intrigued by the radical possibilities of the new technologies enabling an immersive, virtual, and relational world—a world in which art, technology, and the spiritualities of the world converge and interact,” said Ondaatje. “Our future is bright: there are so many exciting directions for art and technology that we simply cannot avoid. I am confident that we can continue to push forward art and technology to its limits and raise the state of the art in art and technology by further developing the Digital Art Center, collaborating with the private sector, and partnering with nonprofits.”\n\n\nThe National Geographic Society, which is currently embroiled in a string of controversies involving allegations of sexual harassment and wrongful termination, is suing former researcher Ashley Feinberg, who served as a research assistant at the institution, in an attempt to secure her own employment. According to the New York Times, the complaint, filed on October 12, claims that Feinberg was asked to perform sexual acts on her for the purposes of research and that she was fired after she declined to participate.“We are convinced that, at", "The next Biennial should take place in 2020. The theme for the biennial should be “This Is My City: Portraits in the City,” reports Artnews. The biennial will be hosted by the Museum of Fine Arts, Boston, the Museum of Fine Arts Los Angeles, the Museum of Modern Art, New York, and the Museum of Modern Art, New York. The artists chosen for the exhibition will be announced soon.\n\n\nBrittany Halperin, the Chicago native who created and popularized the goofy, often pornographic, and often absurdist sculpture Odd-Eyes, which features a naked woman amid a psychedelic backdrop, has died at age seventy-eight. According to the Chicago Tribune, the artist, whose works explore the photographic medium, was known for her trippy, photorealistic sculptures, which are often used as everyday objects, but often grapple with questions of identity and objectification.Born in Chicago in 1932, Halperin moved to the suburbs of the city to study painting at the University of Chicago, where she studied with Joan Mitchell. The pair married in 1949 but divorced in 1953. In 1954, she moved to Los Angeles, where she continued to paint and draw, and founded Odd", "The next Biennial should soon have a new chair and new director, and the classical biennial’s future is at risk after the French government withdrew its backing for the exhibition, which was set to run from March 5 to March 8. The decision is a serious setback for the twenty-six-year-old exhibition, which was already suspended due to the coronavirus. The event was supposed to take place in the capital of the Greater Paris region, and would have presented twenty exhibitions, including two showpieces by the American artist Michael Shay, who died in 2007 at the age of fifty-eight, and three solo shows by British artist Peter Sellars, whose work was to have been included in the 2017 edition of the exhibition.Organizers decided to cancel the event in March after a number of complaints, including from the United Kingdom, Ireland, and France. The emergency repair work for the damage done by the virus was scheduled to be completed by September, but delay was blamed for the subsequent cancellations.“Istanbul was the epicenter of the global crisis,” said Saif al-Hashemi, the French minister of culture and international cooperation, in a statement. “The city has been re-configured by", "The next Biennial should focus on how the museum’s collection and exhibition program can engage diverse audiences and shape thinking about, and conservation of, art history. The themes of the twenty-fifth and twenty-sixth biennials should follow the themes of the previous three years, and the fifty-seventh and fifty-ninth biennials should reflect the themes of the previous two years.”The Biennial of Modern Art, which is currently on view in the Netherlands from January 9 to January 11, 2020, will be held in the Museum of Art at the University of Amsterdam. The next edition of the Biennial will take place in the city of Salzburg from January 14 to January 16, 2020. “We are thrilled to unveil our new exhibition space in Salzburg,” said Kunstmuseum Salzburg. “We have been working hard to make sure that the new space, the Aarhus Contemporary Art Centre, embodies the best of modern and contemporary art in the country, and while we are not yet ready to open, we hope that the exhibition space will be able to continue to be a rich and important platform in the years to come.” The venue will be inaugurated with a", "The next Biennial should take place in 2020, and the last one in 2024. A new exhibition of work by the artists whose works are on view at the Biennial will be announced in the coming months. For the Museum of Contemporary Art, the biennial will be a culmination of sixteen years of organizing an exhibition “within the frame of an ambitious exhibition that brings together work by local, international, and contemporary artists and is ambitious in its vision of what an exhibition can look and feel like.”\n\n\nThe Schuylkill Museum of Art in West Palm Beach, Florida, has appointed Rebecca Riddick as its next executive director. She succeeds Christiane Guadagnoli, who has served as the museum’s board president and chief curator since 2015, and will assume her responsibilities on May 5.Riddick’s first major role will be to build on the work of the museum’s new leadership, which has been led by Guadagnoli since 2016. She will also have the authority to hire and fire the museum’s directors, including Guadagnoli’s successor, Abigail and Patrick Terenzio.Guadagnoli has overseen the museum’s transformation from a private", "The next Biennial should take place at the Art Museum of Texas in San Antonio, which will be inaugurated by a biennial of works by Larry Achiampong before the museum closes in 2022. The show will also feature works by one hundred artists from the San Antonio metropolitan area.\n\n\nA group of artists and collectors are suing the Metropolitan Museum of Art in New York over its decision to remove a major work by Pablo Picasso from its collection in an attempt to force the museum to compensate them for lost profits from the days when the renowned Picasso was assigned to the museum. “This is a classic case of excessive intervention by a single institution into an artist’s work, and it shows that the museum’s policy of excluding work of this sort is not limited to the Picasso collection, but is extended to the entire field of art history,” said attorney Daniel H. Weiss, who represents the plaintiffs. “This case addresses a fundamental question concerning the right to restitution and the history of art.”According to the New York Times, the museum confirmed that it employed a legal team to analyze an artwork—which the institution claimed was removed on “troubling” grounds—but explained that the analysis was not", "The next Biennial should take place in the spring of 2022 and will comprise of four exhibitions: The Transfiguration of Dada: The Transfiguration of Dada (dada diaries), a presentation of works by the artist Maria Steiner, in the first part of the exhibition, which will run for twelve months; A Real Life Story: Dada in Cinema, the first exhibition of works by the German filmmaker Klaus Biesenbach, in the second part of the show, which will open at the Arsenale in Zurich.\n\nAlthough many galleries and museum groups have recently blamed the global health crisis on the actions of individual tourists, the French Ministry of Culture declared last week that the number of deaths during the coronavirus pandemic is actually far higher. The ministry estimates that as many as twenty-seven people have died in France from the virus and estimates the number of infected in the country at one hundred and twenty-five. In the United States, the number of cases has reached twenty-nine. Although the number of cases in the country has declined since the first case in the United States was confirmed on December 6, the coronavirus has spread to other countries, including Mexico, Canada, Korea, Thailand, China, India", "The next Biennial should be in 2021. \nABOUT BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERSCHLUSSEN—THE BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN BERLIN", "The next Biennial should focus on “the practice of art, creativity, and work in relation to and in relation to contemporary life,” said Andrej Pejic, the biannual’s artistic director and curator (and one of the six artists whose works will be included in the exhibition.) Pejic added that the exhibition “will be about the continuing and intensifying of the work of the year.”\n\n\nPrototype and digital artist works by James Turrell at the Museum of Modern Art (MoMA), in New York, have been restored by the artist’s team to the original condition in which they were created. The work, which was created in the late 1990s and was exhibited at the Museum of Modern Art in 2006, was headed toward the fifth iteration of the show, “The Future Is Present,” when it was stolen by an unknown assailant.The work, which was on display in “The Future is Present,” was on display in “The Future Is Present” “James Turrell: The Future Is Present” (2005–2006)“The Future Is Present” is currently on view in the exhibition “James Turrell: The", "The next Biennial should be held in 2020. \n\nArtur’s first move was to move the exhibition’s existing contemporary art event from Hong Kong to Berlin. The exhibition was scheduled to kick off in March 2020. However, the exhibition was forced to move to May 2020 because of the coronavirus. The Berlin Art Museum (BAM) was also forced to cancel a public gathering of twenty-six artists in June. In addition, the BAM Museum of Contemporary Art and the Bode Galleries in the Netherlands canceled a series of exhibitions of work by artists from the collection that was scheduled for November and December 2020.All of the above events occurred as the coronavirus began to spread in China. An outbreak of the virus in China has not yet been reported in the United States. However, the virus has caused deaths in Hong Kong and people in China to travel to the United States to be treated for symptoms. As of Thursday, November 4, there are more than 5,500 cases of the coronavirus in the United States and one death.\n\n\nThe Pérez Art Museum Miami (PAMM) has received a gift from an anonymous donor. Named after the Pérez family, the one-", "The next Biennial should be held at the Museo de Arte Contemporáneo, in Lisbon, next year. The next edition of the Art Biennial, which will take place at the Hotel Alexandra in London in 2021, is also currently on track to be completed this month. One hundred and thirty-five artworks, including twelve works on paper, will be presented by forty artists, including João Lanzano, Alessandro Moro, Patricia Arquette, Tereza, and Eliza Doolittle. The exhibition will run from September 24 to October 23. An open call for proposals is expected to be held in September 2020.\n\n\nThe National Gallery of Scotland has announced that it plans to merge with the Scottish National Museum. The Scottish government approved the merger in March, and the National Museum Scotland voted to accept the government’s decision on April 1. The two institutions were already close to completing their construction in April, and construction began in earnest in June.“The National Gallery of Scotland is one of the most important cultural institutions in the United Kingdom and is proud to become part of the National Museum of Scotland, a National Museum of Scotland that will celebrate and inform the amazing stories of Scotland and the", "The next Biennial should be held in the newly reconfigured Gallery of Modern Art in London in November 2021. \n\nThe Bienal Alcocer in Barcelona, which celebrates the legacy of the Poívar family, has announced that it will hold a biennial in the city in March 2022. Artforum has learned that the twenty-third edition of the event, entitled “Puerto del Primero,” will take place at the Bienal Alcocer between March 11 and March 13. The theme will be “vacuum, turbulence, and decay” and will be curated by María Berrío, the artistic director of the Los Angeles–based nonprofit Bienal alcártes, which supports artists who live, work, and work autonomously in Barcelona.The biennial will be organized in three phases. Phase one will raise funds for the artists and nonprofit and phase two will prepare the installation of the works. The work of the two-week event will be compiled by Berrío and a group of artists, including Gustavo Dudamel, Ricardo León, and Marta Pena, each of whom will be asked to bring eight works that they have created together. The closing", "The next Biennial should have a theme that reflects the richness of the collection, such as the collection’s history as a space that is both densely populated and deeply immersed in the cultural life of our city. It should also have a mission that creates a dialogue with the community, a reflection of our values and our vision for the exhibition.”Last year’s thirty-fourth edition, “Beyond Borders,” focusing on the collection’s ongoing transformation, was presented by the Museum of Contemporary Art Los Angeles. In a statement about the upcoming exhibition, the museum said: “The theme of this year’s exhibition is ‘New Worlds,’ and the collection’s history as a space that welcomes and organizes contemporary life. We are excited about this year’s collection, its exhibition, and upcoming programming, and about the next twenty years of collaboration with our audiences.”\n\n\nThe Danish artist Christian Hof, whose work explores the boundaries of the natural and the natural landscape, has died at eighty years old. The Danish Ministry of Culture confirmed that Hof’s death was confirmed by a cause of death. “The Danish Ministry of Culture confirms the death of the artist Christopher Hof, who", "The next Biennial should take place at the Seelbach-Brandenburg in Frankfurt on September 11–September 15. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has announced its plans to create an endowment for the preservation and study of the museum’s collection of late-century postwar art. The gift will be made in memory of Pamela Hassan, who was a Curator at MoCA and helped shape its collection, and will be organized as part of the institution’s “20s Project.”The gift will be made in honor of the museum’s acquisition of four works by the Italian architect Dario Castiglione, a curator at the Museum of Modern Art and a friend of Pamela Hassan, in 2015. The works, which were donated by the Italian artist Antonio Cipolletta, and two of the works were on display in the exhibition “Diana & Pamela: Modern Art and the Body” (2015–16).The other works, which were purchased by the culto della gamba in Piedmont, Italy, are Cannupi, 1990, the Italian artist Marco Mannelli, who designed a version of the gamba’s own", "The next Biennial should be in 2021 and will cost $90,000. The first Biennial in 2018, which opened in March, was held in March of that year. “Our goal is to create a platform that will foster a more interdisciplinary, global, and inclusive notion of art—increasingly, in the digital age, art is seen not as content but as tools,” said Amada Cruz, the director of the exhibition. “In the coming years, the Biennial will celebrate the creativity and vitality of Latinx and Latinx artists, as well as address these issues and more in the upcoming exhibition program.”The Biennial is an extension of the Los Angeles County Museum of Art (LACMA). The institution launched a new space in the city just outside of downtown Los Angeles in 2016 to serve the local community, and it currently has an exhibition of work by fifty artists and activists, including José Antonio Barba, João Alberto Ferreira, Clara Lin, Edith Heath, Charles Ray, and Robert Irwin. The program also introduced the Los Angeles native Adam Lanza, a self-taught painter, into the city’s art world. Lanza's work, which includes recreations of childhood", "The next Biennial should take place in 2021, although it is possible that the first exhibition will be staged in 2022.The building’s new curator, Anna Maria Dallý, will be tasked with helping the artist to reinterpret the exhibition’s original vision. “I’m sure that we will achieve this goal, because we have a lot of work ahead of us,” the curator told the Art Newspaper. The twenty-eighth edition of the Biennale will be held at the Museo de Arte Contemporáneo São Paulo, Brazil, in 2021.\n\n\nThe Hong Kong Art Museum (HKMA) has received a gift of ninety-two works from the collection of British art collector Richard Black. The museum received the works from the Midland man, who passed away in London on December 25, 2015, after a long and celebrated and distinguished career. “Richard Black was a true visionary, a visionary individual and a brilliant collector,” said director Shelly Bond. “His devotion to art and curating over the years has been unequaled. His incredible collection has been a source of inspiration for generations of curators and scholars, and he was an inspiration to countless", "The next Biennial should be held in 2020.\n\n\n\n\n\nThe sixth edition of the New Orleans triennial has announced that it will now take place in 2021. The event will be hosted at the Louisiana Purchase Historic Site in East New Orleans, Louisiana, and will be organized in conjunction with the National Ballet Theater. After a hiatus of twelve years, the New Orleans Biennial will return to New York in 2020. In 2020, it will also begin exhibiting work by new and established artists. The 2019 event, titled “New Orleans: Twenty Years of Ballet,” was staged by the nonprofit United States Ballet in collaboration with the New York and New York City Ballet.The New Orleans triennial will set the stage for a 2020 iteration at the Louisiana Purchase, which is currently undergoing a $1.5 billion expansion. The renovation includes the addition of nine new buildings, including a theater, a performance space, and a public courtyard. The redesigned theater will also boast a new 400,000-square-foot auditorium and will boast a lower ceiling with a rooftop garden.“I was excited to share with my fellow directors and artists at the New Orleans Biennial that we are now poised to begin the next chapter in", "The next Biennial should discuss the history of dance, with particular attention paid to the history of United States dance and the history of dance in general. The program should also consider the uses of the biennial by exploring the possibility of carrying out a new work by the artist Carrie Mae Weems to commemorate the first Biennial in the United States, as well as the role of the biennial in moving the nation closer to the Arts and Humanities. The next exhibition should examine the significance of dance in contemporary life, emphasizing the role of dance in the cultural conversation\u0097whether as a vehicle for social justice, or an instrument of propaganda. The final exhibition should reflect the Artistic and Philosophical activities of Dr. Francis King, who founded the Menconi Institute for Dance and the Manconi Memorial Foundation at Yale in 1932 and who had the most influential impact on the arts. The 2019 Biennial, titled Zero, one of the most important films of all time, was released on December 21, 2019. Its five-hour runtime, which incorporated the work of forty artists, was augmented by animation, puppetry, and remixes of classic works by the Whitney and the Metropolitan Museum of Art. The 2019 exhibition “The Arts and", "The next Biennial should be held at the end of the year, when the biennial will have finished its annual programme of presentations of works by artists who were not invited. The next Art Basel Hong Kong Expo, which will take place in late 2019, should take place in early 2020.The 2020 edition of the Sydney Biennial, which will be hosted by the Sydney Opera House, will not be held until the second half of 2020, according to organisers. “We are looking forward to welcoming you back to the exhibition, and to working with you to make the 2020 Sydney Biennial even better for its audience,” said Victoria Beckham, president of the Sydney Biennial. The full list of the 2020 Sydney Art Biennials is as follows:1. Art Basel Hong Kong Expo2. Art In Motion Hong Kong3. Art In Motion Stockholm4. Art in Motion Paris5. Art in Motion Shanghai6. Art In Motion Tokyo7. Art in Motion Hong Kong8. Art Offices, Art Basel, and Art Natura, Hong Kong9. Art Offices, Art Natura, Hong Kong10. Art Offices, Art Basel, and", "The next Biennial should take place in 2020. If all goes according to plan, the first exhibition will open in 2021, and, as per the Decanters’ mission to \"encourage self-exploration, enhance consciousness, and bring about social change,\" the museum will organize a second exhibition in 2021.The Decanters are currently accepting donations of works and materials for the exhibition. The museum has set up a special fund of $10,000 to help raise the funds. \n\n\nThe annual Art Basel Hong Kong fair, which has been canceled since March due to the ongoing pro-democracy protests, will return to the region next month. The event will now be held March 23–March 27. “Hong Kong is experiencing an extraordinary period of political and cultural development,” said art director Jannis Kounellis. “At the same time, we are reflecting on the challenges that lie ahead. Bringing together an international team to tackle these challenges in great detail, with an emphasis on the future, is a task that is impossible to do without.”The Hong Kong pavilion will be curated by Christophe Banat, head of the exhibition space ArtCenter, and will be led by curator ", "The next Biennial should be held in the spring of 2020.  The US Congress is currently considering a $1.3 trillion aid package for the US’s healthcare system, which would cover overall conditions, and is expected to pass by the summer. The legislation is expected to be passed by the end of August. The bill currently awaits President Donald Trump’s signature, and has been referred to Congress twice since it was first introduced in 2015.\n\n\nThe Japanese architect Yoichi Masuda, whose sculptural and conceptual practice embodied a self-described “new kind of architecture,” died at the age of ninety-one on March 31. The artist’s work, which was influenced by the work of his peers but also drew from a wide range of subjects, often incorporated materials that were neither new nor exotic. Masuda’s sculptures are often framed within the context of the collective practices of postwar and contemporary architectural design, and often confront the limitations of the human body.Commenting on his work, Masuda said: “The landscape of the Pacific Ocean is the main theme of the work, but it is also a great comfort to be able to live in this landscape. The work has the", "The next Biennial should focus on “intersection of art and politics, culture and religion, and the physical and spiritual,” said Anita Ibrahim, executive director of the Art Institute of Chicago. “This is the moment. In a world of constant disruption and disruption, we are in the midst of it.”The event will be on view during Art Basel Chicago this week, from March 22 to March 26, and will feature work by seventy-five artists. Among the works that will be on view are work by Michel Houellebecq, Kiki Smith, Frank Gehry, David Salle, Margaret Mitchell, and Léa Seydoux. The 2018 edition, “Art and Politics,” featured works by Gérard Klimt, Pablo Picasso, and Robert Mapplethorpe.\n\n\nA new survey of the seventy-eight artists depicted in the New York City art scene by the Museum of Modern Art (MoMA) has found that eighty-four percent of the artists featured in the exhibition “Are We There Yet?” were female. The survey, titled “Are We There Yet? Women Artists in the Metropolitan Museum of Art” and conducted by artist-critic", "The next Biennial should take place in 2021. The biennial will be led by Fernanda Gomes, who was previously the director of the Museu de Arte de Seville and the Museu de Arte de Barcelona, respectively; Kudo Takeda, who was previously the director of the Wadsworth Atheneum Museum of Art in Hartford, Connecticut; and Monica Otero, the curator of modern and contemporary art at the Pantheon in Paris.\n\n\nThe Contemporary Art Museum Houston (CAMH) has launched an online exhibition on the work of three of Houston’s most important photographers: Willem de Kooning, Sam Gillies, and Robert Irwin. In addition to presenting works by the three men in the exhibition “Pyrrhic Victory: The Power of Photography in the Modern Era” (2019), the show will present a new photography project by Koons titled “An Existential Journey.”The show will feature the work of the trio in its entirety, as well as a number of other works by the artists and will provide an introduction to photography and their medium, and will also serve as a platform for the three to collaborate with other contemporary artists and local Houston artists.The exhibit is", "The next Biennial should be in 2021, and the next one will be in 2023. \n\n\nNew York’s Metropolitan Museum of Art (MoMA) has received a $1.1 million donation from the Charles and Lucille King Family Foundation. It comes a few days after the institution received a $750,000 check from the Kastner family, which also owns the Boeing and the Ramada, as well as the Chicago-based arts incubator the Works. The funds will help fund the organization’s construction of a new David Rock, Jr. Institute for the Arts, which will be completed in the fall of 2022. “Metropolitan Museum of Art is a living institution and our plans for the next twelve months reflect that. We will continue to support our artists and our staff, and we will continue to act as a model for change by working with philanthropic institutions to build on the foundation we began over forty years ago. We are grateful for the support of the Kastner family and the Works and the Kings, and we look forward to supporting them in the coming months as we construct the next Works,” said Michael Govan, director and CEO of the foundation.Boeing and", "The next Biennial should be in October 2020. \n\n\nSTEVENS & WILLIS has appointed Lori McClelland as its next general manager. McClelland comes to the firm from the New York office of the law firm Diller Scofidio + Renfro. Previously, she was a partner at the law firm of Willard & Wilkins and worked as an attorney at the firm of Greenhulme LLP.“For nearly twenty years, Lori has been a leader in the field of contemporary art, having organized and led groundbreaking exhibitions, including the first-ever solo shows of work by David H. Koch and Adrienne Rich, as well as the innovative and groundbreaking retrospective of Paul Gauguin,” said Craig Evans. “Her achievements speak to her ability to lead through innovation and create compelling experiences, both for the audience and the client.”McClelland comes to Wells Fargo from the New York law firm of White Plains, New York, where she began working in the art and design industries in 1997 before moving to Austin, Texas, in 2001. During her tenure, McClelland worked with several of the city’s leading artists including Kanye West, Nari Ward, and", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has been named the recipient of a $3 million grant from the Richard and Helen DeVos Foundation. The organization will provide $2 million for “Cultural Evolution: How Art and Design Shape Our World” and the $1 million for a special exhibition dedicated to the work of American painter and sculptor Einar & Jan Skovgaard, which was organized by the Skovgaard Museum of Art in Oslo, Norway, and will be on view in the fall of 2020. “Cultural Evolution” is an exhibition organized by the Skovgaard Museum of Art in Oslo, Norway, and will feature works by five artists, including Jacob Heim, Tomi Østbye, Kjeldraal & Müller, and Luca Panza, and will aim to present the full range of American cultural heritage from 1966 to 2020. The twenty-first Biennial will be held at the Smithsonian American Art Museum in Washington, DC, in June of 2022. \n\n\nThe National Gallery in London announced today that it will begin welcoming visitors again in 2021 following a major refurbishment and expansion project, which will include", "The next Biennial should focus on the experiences and contributions of local, regional, and international artists (and their work within the city), as well as the people and places in the city who have shaped its history. “The future of Sydney’s art is at stake,” said Mayor Graham Quirk. “We will work with our international partners to ensure that the future of the biennial is one that reflects the diversity of the city and reflects the diversity of the city’s artists.”\n\n\nThe Australian Council of the Arts (ACAA) has launched a new online platform, Cinéma, that will allow visitors to explore and purchase works by emerging and established Australian artists.Cinéma will be guided by an artist-in-residence, artist-in-residence (AIR) Marcia Burns, who will curate the platform and provide daily curated exhibitions of works on display. The program is designed to help Australia’s burgeoning and established artists.“We are incredibly proud to support the Aircleave community, and our artists, through this new platform and the exhibition program that will be built around it,” said GCI chairman and CEO Steve Giddens.", "The next Biennial should be in 2021. The initial list of curators will be announced in December. Since Prime Minister Boris Johnson announced the 2021 theme, his Department for Culture, Media and Sport (Darmouth and London) has been working on a new plan to the Arts Council.According to the New Statesman, the new plan is as follows: In celebration of the twentieth birthday of the Biennial, and in the interest of providing an update to the theme, a new five-year biennial will be formed following the 2020 edition on the theme The Future We Can Create. The biennial will include an exhibition of work by forty-nine artists. Among the artists selected for the biennial are Yelena Shishkevich, Lithva Kuznetsov, Sara-Lynn Vaismanova, A. H. Nielsen, Nina Partha, Olvina Sotirov, and J. S. Syms. The 2020 exhibition, which was curated by Anna Atkins, featured work by sixteen of the thirty-eight artists selected for the 2019 edition. The museum also revealed that the new exhibition will feature work by a total of sixty-four artists. While the fifty-", "The next Biennial should take place in 2020.\n\n\nHong Kong-born artist Naima J. Akram, whose Australian-inflected sculptures explore notions of memory and memory space, has died at the age of eighty-two. Known for her energetic, participatory sculptures, which conjure images of memory loss and the trauma of war, Akram often employs vivid figures that are either absent or animated by memory. The work of Akram, whose work can be found in the collections of the City Gallery of New South Wales, the National Gallery of Australia, the Royal College of Art in Melbourne, and the Museum of Contemporary Art, Sydney, is currently on display in the Australian pavilion at the Fifty-Ninth Venice Biennale.Born in Canberra in 1936, Akram emigrated to Sydney with her husband, the artist, producer, and businessman Ronny and their son Nick. “In those early years, we were fortunate to have had an extensive family in Australia,” Akram said in a 2017 interview with the Art Newspaper. “We met a very supportive Australian family, and I remember as a young artist looking up to the sky with pride, knowing that we were the first people to see the very first images of the"]