["The next Biennial should be in the Spring of 2021. The exhibition, which will take up the theme of the current socio-political climate and the ways in which art can address and challenge it, will be housed in the large public space of the Museu de Arte de São Paulo (MASP). The exhibition will encompass works by thirty artists and will run from February 8 to February 10, 2021. The exhibition will be held in the museum’s Centre Pernambuco, between the Avenida do Povo and the Pilar Diocese, and will be curated by José Manuel de Castro, the president of MASP.The next edition of the Biennial will take place in the town of Córdoba, in the province of Mato, in the central state of Minas Gerais, Brazil, from March 19 to March 21, 2021. The event will also include the opening of a new exhibition dedicated to the Argentinean artist Nina del Val, who is credited with originating the term Avicennaism, and will be highlighted by an online version of the show, with the biennial’s theme of social justice and social justice activism.Commenting on", "The next Biennial should be announced shortly. \n\n\nWangechi Mutu, the president of the African National Congress (ANC), and Jean-Michel Aide, the chairman of the CARICOM group, have jointly submitted a proposal to the World Health Organization (WHO) for the African continent to be placed under an emergency global health emergency plan. The document, which is expected to be released on Friday, outlines the steps that the countries of Africa, South America, and Central and South Asia must take to improve their collective environmental and social conditions for the six million South Africans who are currently displaced by the ongoing conflict between the government forces of President Jacob Zuma and the Blacktown People’s Alliance (BPA), an anti-apartheid group.The proposal states that the BPA must be banned from the African continent; the BPA must be excluded from any form of international peace and peace-building activities; and the BPA must be prevented from engaging in acts of violence or terrorism against civilians.The document also calls for the immediate and unconditional release of political prisoners, and for the immediate and unconditional release of all political prisoners and other persons arbitrarily detained or arbitrarily convicted. The BPA is seeking the immediate lifting of a nationwide lockdown imposed after", "The next Biennial should be held at the National Gallery, in London, this fall. If all goes to plan, the museum will reopen to the public in March 2020. With the Biennial, the London-based artist-run nonprofit group Artists’ Corner will create a new platform for the exhibition of work by Black artists. According to the Art Newspaper, the new platform will feature special exhibitions by artists from the African diaspora as well as newly emerging artists from sub-Saharan Africa. Artists’ Corner will also work with the Black Lives Matter (BLM) and Black Arts Council to develop a digital platform that will organize and present artworks by Black artists. The platform will also be available for free to all visitors on the site of the National Gallery. Each month, the artist-run group will present three artworks from a group of thirty-five artists, including Nkosso Ndzube, Kameel Ali, and Amadou Diallo.\n\n\nThe Taelana Museum of Art in Jamaica has named Carolyn Bonner the next director of its annual taelana show, which launched on September 30 and runs through November 22. In her new role, Bonner will oversee the development of", "The next Biennial should be inaugurated by the exhibition “The Ethics of Painting,” which will take up the theme of the exhibition “The Performance of Art,” in 2020. It will follow a series of lectures by the artist and philosopher Judith Butler, who wrote the book Art and Art Politics and is a MacArthur Fellow, and will take place at the Institut d’Art Moderne in Paris in March 2021. This year’s Biennial will include the first time Butler will present a lecture in person, and the first time the artist will have the opportunity to paint a piece for the exhibition.After touring the installation and its exhibition space in the exhibition, the museum will present “The Artist’s House” in the exhibition “Art in the Life of Manuscripts” in May. A retrospective of her work is scheduled for later this year, and “The Artist’s House: Particle V,” which she began working on in 1968, is on view at the Museum of Contemporary Art in Miami Beach in August 2019.\n\n\nThe museum has appointed Eileen Myles as its next executive director. She succeeds Caroline Woodman, who departed in March 2019 to lead the", "The next Biennial should be held at the nearest of the participating cities, to be held in the most recent year.”\n\n\nThe Pulitzer Prize–winning artist Alice Aycock has been appointed a global ambassador for Southeast Asia, the Middle East, and Africa. As the first Asian artist to be chosen to represent the United States, she will be leading a delegation of fifty artists which will travel to New York in May to participate in “The Americas First: Southeast Asia” (TAFA) at the Javits Center.The 2020 awardees, who hail from twenty-six countries, are: Alice Aycock for Southeast Asia’s Religious Landscape; Pablo Reyes for Native American Art and Architecture; Yoshitomo Hasegawa for the Religions of the Philippines; Jia Mia Bagchi for the Indonesian Landscape; Yoshitomo Ōmura for the Art of Japanese Art; Jaune Seo-Hyeong for the Art of Korean Art; Alberto Ceccaretti for the Art of Chinese Art; Xiaoliang Cao for the Art of Chinese Architecture; Junie Chen for the Art of Chinese Architecture and Design; Jae H", "The next Biennial should be held in 2019. \n\n\nChinatié (New York: New Museum) has announced that it will cancel the upcoming exhibition “The Metamorphosis,” which opened on December 21, in protest of the museum’s admission policies. The twenty-third edition of the event, which was originally scheduled to run from May 6 to May 8, was supposed to take place at the Manhasset Museum in New York City, but was postponed because of the Covid-19 pandemic. “We’re not going to let this happen again,” organizer Bruce Haislop told the Art Newspaper. “We’ve made our position very clear throughout the run of the show: that we will not pay to participate in the exhibition. We will not pay for tickets. We’ve been very clear about this: we will not participate in the exhibition if its admission fees are forfeited.”Chinatié director Micah Kolb wrote on Facebook that the institution was “moving in the right direction,” but that the “next steps, if any, will not be easy and will require the cooperation of a great many institutions.”", "The next Biennial should focus on the history of the art, as well as the contemporary and historical concerns of art and culture, and its relevance to the contemporary issues of our time.”Markus Wirth, who was appointed director of the Brussels-based museum in April, has also been named general director of the Brussels-based institution, which has been a permanent fixture in the capital of Belgium since 1964.\n\n\nFor the first time since its inception, the Italian museum triennial of modern art has been curated in partnership with a third country—Italy’s Lazio Region in the western part of the country. Curated by Fabio Cicutto, the inaugural edition of the Flags of Italy, which will run from March 16 to April 22, 2019, was completed last month and was presented by the Italian government.The Milan-based nonprofit, which was founded in 1997 to promote culture in the city, partnered with the Lazio Region, which includes Turin, to organize the exhibition. The project was inspired by the town’s three leading art museums, the Museo del Piemonte, the Museo del Stampa, and the Museo delle Papesse. Commenting on the collaboration, Fabio Cicut", "The next Biennial should be announced by the end of the month.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (LACMA), closed indefinitely on Tuesday, May 9, following a monthlong closure due to Covid-19. According to the Los Angeles Times, the institution suspended all programming following the pandemic, including its annual Hawaii Film Festival, the Los Angeles Art Book Fair, and the Los Angeles Museum of Art (LACMA), which is currently undergoing a major expansion.While the institution confirmed only that it is currently closed as it works to stabilize the health of its staff, an email sent to attendees of the LA Art Book Fair by the fair’s organizers reads: “We are actively monitoring the Covid-19 situation and will continue to provide assistance as necessary. We hope this information helps you and will continue to do our part to help keep the Pacific West Fair, LA Art Book Fair, and other events in the region going strong.”While the closure has been blamed on the coronavirus—the virus was first identified in December—the virus has only been found in the United States as a result of the novel coronavirus, CVCV, which was first reported in China on", "The next Biennial should include an exploration of the role of women and gender in art in the twentieth and twenty-first centuries, as well as a reflection on the history of the exhibition from the perspective of a contemporary artist. The World Art Congress will then launch an online residency, whose inaugural edition will be held at the Marrakech Institute in France in December.The London-based artist, who won a $10,000 prize last year for her first solo exhibition at the museum after its closure to the public in April 2019, told the Art Newspaper that the decision to stage the event was a way for the museum to prepare for the possibility of reopening, and described the possibility as “definitely possible.” The museum has yet to confirm or deny the possibility.\n\n\nThe National Gallery in London announced today that Elisabeth White, a British curator and author, collector, and educator, has been appointed to its board of trustees, which comprises British Prime Minister Boris Johnson and British Culture Secretary Sadiq Kahn. White is the sixth person to serve on the board, which was created to protect the gallery’s historic mission and ensure its continued operations following its closure in March 2019.“Elisabeth White has built a distinctive and", "The next Biennial should be held in 2020, and hopefully in the first phase of the new exhibition, which will consist of twenty solo presentations of works in the first half of 2020, with the exhibition opening on July 22. The next exhibition will be held at the Biennale of New York in December 2020. The collection will then move to the Museum of Modern Art in New York in the fall of 2021. The new exhibition will include work by fourteen artists, including Bibi Lam, Tatjana Isa, Cindy Sherman, Hannah Wilke, Andrea Barr, Herbert de Kooning, and Paul Gauguin. Originally titled “New Forms of Light,” the exhibition reached the museum in 2002 with a special exhibition entitled “1970s Art: From Gable to Shepard,” which also featured works by Paul Gauguin and Hiroshi Sakai. The move would prove a departure for the museum, which was already preparing to open in 2020 and was reconfigured by the museum in 2013.\n\n\nThe National Gallery of Scotland announced today that it will hold a second edition of the National Gallery of Modern Art in Edinburgh, which will take place in 2022.", "The next Biennial should be in May 2022, but the organisers say that any decision regarding the date is between the Council and the artists.The 28 artists nominated, who comprise the entirety of the research team, will compete in the exhibition . . . “The idea of an exhibition that traces back the history of each individual artist is very important to me,” Art historian and curator Laura Mulvey told the Art Newspaper. “I think this is a very good example of how museums can exert some of their own power, as the subjects of exhibitions, through something that is their own.”The show will be organized as part of the City of London’s Centenary celebrations. In the meantime, the Tate and the Royal Academy of Arts are planning to stage a series of exhibitions on the life and work of the great British artist.\n\n\nThe Metropolitan Museum of Art in New York has hired artist and educator Sianne Anagnos as its new assistant curator of fantasy and myth. She will be based in the department of fantasy and myth in conjunction with the curator of modernism, Eric Fischl, and will be responsible for advocating for exhibitions and publications in the field.“We are delighted to welcome Sianne to the Met", "The next Biennial should be held at an accessible venue, such as the Museum of Contemporary Art, Miami Beach (MCA), and will outline the ways in which people are connecting with the artworks in their surroundings this year.\n\n\nThe Cajun Museum of Fine Arts in Nashville, Tennessee, is planning to open a new community center dedicated to the Cajun heritage in the city. Designed by the Cajuns themselves, the new museum will be a collaborative endeavor between the institution, the local community, and the local government. The project will be funded with funds from the Cajun Nation.“The Cajuns have always been a part of the city and region,” said director and CEO Brian Kirk. “We are thrilled that they’ve chosen to partner with the Cajuns for this incredible project.” Ileana Latimer, the Cajun Nation’s vice president of external affairs, added: “This project is an example of the Cajun Nation’s continued commitment to supporting cultural institutions that reflect the diversity of our communities. It is an example of the Cajun Nation’s continuing vision for the region in embracing new technologies and new ways of expressing our culture", "The next Biennial should visit New Orleans and its history, and should aim to clarify the importance of this pivotal American city in the development of the artist’s career. The theme of the event should be “Independence Day,”” as in “It Wasn’t a Day,” and the biennial should feature an immediate response from the American people. The biennial will be divided into two parts: the exhibition “Art of Freedom” (March 14–March 21, 2020) and “World Art” (March 21–March 28, 2020).The art-world fairs will take place in New York and Zurich. For the first part, the fair will present forty-nine curators from the United States, Canada, China, the United Kingdom, Germany, and France. For the second part, the fair will present twenty-five works by major international artists. In a press release, the organizers said that the first part “will focus on the art-world’s ongoing experiences and the second on the future of art.” Both the Fifth Venice Biennale and the Venice Architecture Biennale announced their plans to cancel their pavilions in March", "The next Biennial should take place at the Stedelijk Museum in Amsterdam in 2021, with the announcement of a new title, Biennale 2020, in 2021. \n\n\nSergei Loshak, director of the Museum of Modern Art (MoMA) in New York, announced today that the institution will no longer honor the late philanthropist Edward Colston, a partner of the firm Teiger Foundation, following a controversy over a painting by the late Russian avant-garde artist Andre Biennale. After the museum withdrew a work related to the controversy, which was titled “Embedded in the Natural,” from the exhibition “Art and Revolution” in March 2019, it faced backlash over its decision. The show was silent about the controversy for the next two years.In a statement on June 25, the museum said: “Edward Colston was a passionate supporter of MoMA, and we were honored to receive his generous gifts. However, we take the situation in the best possible way. We have reviewed our editorial policies and procedures, and while we respect the decision of MoMA and the board of trustees, we believe that the museum has made the right decision.”\n\n\nThe Center for Art and", "The next Biennial should be held in the spring of 2020.\n\nGrand Rapids Design Center director Dennis Higginson thanked the state, local, and national government for providing $3 million in funding. He also called for an end to the state-funded Matthew Baranski and David Bond exhibition, which he said is \"a great example of what a design museum can be—a truly international, nonprofit entity that is expert at how to engage with the community.”Higginson plans to keep the Biennial moving forward, with the goal of hosting a second edition in 2021, with a new theme, and expects to raise the remaining funds by the end of March. The Biennial is now accepting gifts for the event.\n\n\nThe Italian NGO Artforum has received a donation of $1.5 million from the Kish Foundation. The funds will be used to expand a program that was launched in 2000 as part of the Conceptual 6 initiative, which aims to increase the visibility of emerging Italian artists in the United States, Italy, and Germany. The initiative, which launched in 2007, saw Kish partner with artists and institutions in the cities of Venice, Turin, and Genoa to help them gain international exposure. Kish also announced", "The next Biennial should focus on the history of the museum’s collection, its collection-building initiatives, and its development of a new performance and performance installation series.\n\n\nArtsadia Foundation has announced its partnership with the Seattle Children’s Museum (SCCM) to create the first-ever free outdoor art exhibition in the Seattle area. The initiative will create a unique educational experience for Seattle students, ages seven to twelve, who will visit a selection of works from the museum’s collection for free.The new program is called “Groundwork: The Seattle Children’s Museum,” and will run from September 13 to September 15. Visitors will have the opportunity to purchase works from the collection for $20, which includes unrestricted use and resale. The pieces will be on display in the museum’s new five-story, fully restored building, which will be called the Linder Building, for thirty days.“Groundwork is an opportunity to connect with the collections, to see how the collection is organized and to interact with the collection in a meaningful way,” said Sharon Mather, chair of the board of trustees. “We are excited to work with the Seattle Children’s Museum to", "The next Biennial should open in 2022. \n French artist Marcin Tudelaume, a co-winner of the Prix d'Art Contemporain (2015) and the Prix d'Art Modern (2016),, recently received a compendium of his work that was curated by Guillaume Moscovici, director of the Studio Museum in New York. Titled Marcin Tudelaume, The Giant, follows a group of twenty-six artists who were inspired by Tudelaume’s sculptures based on their own experiences and on themes such as the natural environment and the anthropological. The work, which will be presented at the Museum of Modern Art in New York in May 2020, is part of a series that will highlight the work of young French artists and will be curated by Jean-Michel Revol, curator of the upcoming Venice Biennale, and will be brought to life by Marcin Tudelaume.“I’ve been following Tudelaume and his work for a while, and I’m so happy to have this opportunity to present it in my lifetime,” said Tudelaume. Tudelaume’s career began in the 1970s as", "The next Biennial should take place in September 2022.\n\n\n\n\n\nFrieze announced today that it is welcoming the public back to its Los Angeles headquarters for its fourth annual Frieze Los Angeles Open, which runs from September 15 to September 18. The biennial will run concurrently with Frieze New York, which will also debut this fall.The contemporary art fair is also introducing a new monthly membership service, the Frieze Artist Summit, which will host artists from around the world. The event will now be organized as a series of conversations taking place across the globe. The inaugural theme, \"Acts of Art,\" will be performed by artist Seth Koenig, which will open with a series of performance demonstrations. The theme of the second half, titled “Acts of Love,” will be performed by artist Rineke Dijkstra, who will present a series of drawings and installations inspired by the life and death of artist Kin-Man Chan. The inaugural edition of the annual Frieze Los Angeles Open will be held September 3–9.The festival will be hosted by the Los Angeles County Museum of Art (LACMA), which will receive approximately $6 million from the county’s $1.5 billion Complete Streets Fund. The", "The next Biennial should be held in 2021.\n\n\nThe SculptureCenter in New York has announced that the twenty-fifth edition of the Sculpture in a Day exhibition, which was canceled due to Covid-19, will now return in 2022. Scheduled for November 2021 to March 2022, the event will draw an additional 90,000 visitors, and will take up the themes of “The Future of Life” and “Artistic Experience,” and is being organized by the SculptureCenter in partnership with the Metropolitan Museum of Art and the Brooklyn Museum.“We are thrilled to be able to present the full range of the Sculpture in a Day series in 2022,” said David Sirota, director of the SculptureCenter. “This exhibition will continue to show the work of the many talented artists represented in the exhibition, which is supported both by the museum and the artist, as well as their worldwide communities. We are grateful to the Met and the artists who made this year’s exhibition possible, and to the many museums and institutions that are joining the Artists’ Alliance, a consortium of more than 150 arts organizations working to advance the creative, social, and political agendas of", "The next Biennial should include an analysis of the concept of “epistemology” as well as an exploration of the role of art in changing our conceptualization of the universe.Adrienne Huet, director of the Adrienne Bouverne-Bouwmeester center for contemporary art at the Institute of Contemporary Arts in Paris, told the Art Newspaper: “The next Biennial will be an important step in the transformation of the contemporary modernist. It will be an occasion to reflect on the continuity and the fragmentation of contemporary art, and to be reminded that, despite all the achievements, there is still much to do.”\n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to increase the size of its collection by 23 percent, opening a new building designed by French architect Bénédicte Savoy, to 1,750 square feet. The addition will allow the museum to more closely reflect the city’s growing population, and will allow the museum to develop a new exhibition dedicated to early twentieth-century American art, the “American Dream: From Norman Rockwell to Art in the City,” which will likely be hosted by the new building in 2020.In a statement", "The next Biennial should focus on the role of the artist in shaping the narratives of China’s contemporary art, and should include a selection of artworks that deal with contemporary themes such as climate change.The full list of participating galleries, artists, and curators can be found here. Meanwhile, the seventy-fifth edition of the Venice Biennale, staged at the Venice Architecture Biennale in Venice in 2019, is currently running in a few weeks.  The full list of participating galleries can be found here. \n\n\n\n\n\nAlexander Calder, whose distinctive and sweeping conceptualism often faced the oppositions of both theoretical and practical, has died at age eighty-eight at his home in Los Angeles. Since his death, Calder has been a central cultural force in the United States. His work explores the concept of space, the self, and the relationship between the viewer and the work.Born in Chicago in 1932, Calder learned to appreciate painting and sculpture from the late Chicagoan André Achenbach. 'He has a deep and movingly human perspective,” wrote Mike Kelley in a 2017 Artforum review. In 1957, Calder traveled to Italy with his wife, the artist and feminist Louise and began his five-decade", "The next Biennial should focus on the history of the exhibition, its development and the exhibition, and the programmes that will be presented in the coming years. It should also reflect the times and the environment of the Pacific Standard Time,” said Paulino. The project will be guided by the theme “The Future Is Present,” which will unfold throughout the year. The show will feature work by fifty artists, including Benjamin Haig, David Kordansky, Olu Oguibe, and Alexei Kokoral, as well as contemporary and classic art from the Pacific Rim. The full list of participating artists is as follows:Michael Douglas (New Zealand) - Cloth and PaperAnne Myles (New Zealand) - Pillars and Pleasure: The Pacific Century (New Zealand) - The Future Is Present, Part 1 (Netherlands) - The Future Is Present, Part 2 (Netherlands) - In Translation: The Pacific Century (New Zealand) (2018)Bénédicte Savoy (France) - The Future Is Present, Part 1 (2018)Benedict Langsford (United Kingdom) - The Future Is Present, Part", "The next Biennial should be in 2021, and the first will be in 2024.  The exhibition is sponsored by the Kansarnoi Foundation and the Kanswar Art Museum, and is curated by Arash Enderval.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Bruce Minto as its next executive director. Minto, who has served as executive director since 2016, succeeds David McAllister, who has served as the museum’s interim executive director since June 2019, and will assume his responsibilities in January 2021. “Bruce Minto’s appointment as MFA’s next executive director reflects a profound commitment to curating and exhibiting artistic work by artists of all kinds,” said director Matthew Teitelbaum. “As a curator and arts administrator, he brings an unparalleled set of skills, insight, and experience to this role. We are confident he will continue the high level of innovation, creativity, and dynamism that have characterized MFA’s history while we continue to grow and thrive as a diverse and exciting museum.” The new position was created by the board of trustees of the Bruce Minto Foundation (BMC), which aims to", "The next Biennial should be held on Saturday, May 24. The event will feature five works by forty-three artists with a selection of their work on view. The first exhibition will feature work by thirty-six artists who are part of the International Foundation for Biennial Studies (IFBS), an international collective of which the artist-run biennial was a part. The second will focus on the visual arts. The third will include biennial themes in addition to the usual works. The fourth biennial will be designed by the artist-run biennial in collaboration with the artist-run exhibition space One Grand Straté, which originally housed the exhibition space Cinéma Contemporary. If the event is successful, the artists will be able to showcase the work of their professional projects and their individual artists.The event coincides with the opening of the exhibition “Intermedia,” curated by the artist-run biennial and curated by the festival. In a statement, the biennial said: “The exhibition will bring together thirty-six work pieces by forty artists, spanning centuries, in a diverse and stimulating array, from a variety of backgrounds, in an attempt to address the themes of the exhibition and the exhibition. The twenty-third edition", "The next Biennial should be on May 18–May 20, 2020. \n\n\nThe Chinese artist Zhang Yaxuan has resigned from the position of deputy director of the National Museum of Fine Arts (NMA). He had been responsible for organizing the museum’s first exhibition in 2019 and had previously served as director of the Beijing Art Museum for a decade. Zhang was appointed deputy director of the NMA in February 2020 and held his position for two months before he was asked to resign from the post in February 2021.“The National Museum of Fine Arts has taken an important step forward in improving the museum’s image and prestige with a new exhibition series, an exhibition of works that was organized in a way that adheres to the vision of Zhang Yaxuan,” Zhang told the Art Newspaper. “This series was created with the intention of integrating contemporary art from China, North and South, with pieces from other countries and regions and integrating these pieces into the museum’s collection. I am excited to see how this will appeal to the public and artists.”Prior to joining the NMA, Zhang worked as an independent curator and worked as a curator-at-large. He curated the first exhibition for the group exhibition program", "The next Biennial should be held in 2020. \n The biennial will focus on the life of artist François-Xavier Huyghe, who died in 1940. The exhibition will also feature works by sixty-five new artists, including Brit Mandel, Jean-Michel Basquiat, James Turrell, Claudia Cattelan, Martin Pascual, and Andrea Dwork, and will be held at the Museum of Fine Arts, Boston.\n\n\nThe Seattle Art Museum (SAM) is preparing to unveil a new program of programming dedicated to the life and art of Pacific Northwest artists, artists of color, and activists. Titled “Pacific Northwest Art,” and set to open in 2020, the first phase of the museum’s new “Pacific Northwest Legacy,” will focus on selected works from the museum’s holdings and will feature selections from the collection, the archival record, and other historical materials.The program will also examine the key contributions of Pacific Northwest artists to the preservation of their legacy through commissioned projects such as the installation of the work “Vitamin” by Ann Radcliffe in the Gallery of Modern Art in Seattle in 2019,", "The next Biennial should take place in March 2021, at an undisclosed location in Germany. The event will be inaugurated by a series of artist presentations, followed by a discussion group and a Q&A.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Gillian McNamee as its next director. The new position is part of a larger plan to overhaul the institution, including the expansion of the museum’s footprint and the reopening of its original home in the former Santa Monica Pier, \u0097which was completed in 1977 and reopened in 2001.“We are thrilled to welcome Gillian McNamee to the museum,” said Robert F. Kennedy, chair of the board of trustees. “Her extensive experience in contemporary art and institutional design, as well as her commitment to helping curators and the museum achieve greater mobility and accessibility, will ensure that MoCA remains a vital center for the world’s most valuable collections.”McNamee previously served as chief curator of modern and contemporary art at the Los Angeles County Museum of Art, as deputy director for collections and exhibitions at the Metropolitan Museum of Art, and as the director of the Experimental Collection at the Museum of Contemporary Art, Los Angeles", "The next Biennial should be held in 2020.\n\n\nArt Basel announced today that it is bringing three new exhibitions to Miami Beach in 2021. Headlined by artist-in-residence Kiki Smith, the first show, titled Minimal, will highlight Smith’s installations in which she uses only materials such as paint, cardboard, paper, and fabric. The second show, “Toward an Art-Ethic in the New Millennium,” will showcase Smith’s work in its entirety and will be held at the Art Museum Miami. The third exhibition, titled “\"The House is Not for Sale,” will take up the themes of the exhibition and be held at the Museum of Miami Beach.“I am honored to be able to share this newfound story with my fellow artists here in Miami Beach,” said Smith. “The House is not for sale, is a project of a lifetime, and I am very much looking forward to sharing it with my fellow artists. This is my story and this is what I want to tell, so I hope they enjoy seeing it as much as I did making it.”Smith will also receive a solo exhibition at the Museum of Art at the", "The next Biennial should be held on the island of St. Marks in 2021.  Belgian artist Njideka Akunyili has been selected as the winner. Akunyili, a Turkish-born, New York–based artist, created a work titled The Ten Rules of Utopia with fellow artists in 2015, for which the fifty-four-year-old Akram Altınd, an Iranian-born, New York–based artist, sculptor, and educator, and Anwar Saeed, a Pakistani artist, created a companion work titled On the Wings of the Dragon, which will be staged by the Düsseldorf-based artist Hanna Adel. Akunyili will receive a prize for his collaborative efforts at the artist-in-residence at Gallery Lenbach in Berlin on July 24. The most recent winner of the prize, a Danish artist who is currently based in the United States, was Claude Monet, who was awarded a lifetime achievement award for his work The Dimension of Light and Light, co-created with Jean-Michel Basquiat. The Biennial Prize was established in 1993 by the artists Joost Smits and Peter Magh", "The next Biennial should take place in 2020 and will have a budget of $110 million. This year’s event will also feature the first artist-designed museum in the US, the first ever standing-room only museum devoted entirely to art, and the exhibition of the museum’s first collection of works by women artists.The exhibition “Feminist Experience” will open at the museum on November 19 and run through March 21. Its fourth and final year will feature forty exhibitions organized by fourteen artists and will include the live installation of the show “Tina Turner: The Castle of the Oceans” on March 26. The exhibition, which will run 120 feet² and be organized as a series of interlinked installations, will include works by twelve artists and will be inaugurated by a work by the French artist Marcel Prouvé.The 2020 event will mark the centenary of the founding of the biennial. The theme of the exhibition is “Do We Live in a Beauty Spot?” The biennial will also celebrate the centenary of the Australian-born artist Christo, a pioneer of the modernist movement, and will be inaugurated by the work of the Tunisian artist Maha Nabi, the", "The next Biennial should take place in 2021, with a final edition to follow in 2022. If the museum is forced to cancel the exhibition, the event’s organizers would still have a legal case, as the works would still remain on view. However, the move would likely only serve to increase the pressure on the museum to push ahead with the exhibition, which is currently on display in the museum. “We are considering various options,” the dates of the show have been said to be flexible and the number of participants could be reduced or increased. Tres Espinos, the museum’s director, said: “We will have to carefully consider the impact on the exhibition of the reopening of a closed museum in the autumn.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to open its first digital exhibition dedicated to contemporary art in 2020. The digital platform will be called the MoCA Next. The institution is also planning to launch an online version of the same exhibition, which will be open to the public once the exhibit is closed for a twenty-six-week run.“Our goal is to present the most contemporary art from the MoCA collection online as quickly and as precisely", "The next Biennial should be held in 2022, said Peter Schaar, the museum’s director and CEO. “There is no better time to reevaluate the reach and impact of Biennial 1 in the city of Basel, Switzerland, than now.” The institution has also received a gift of eighty-two works, including a painting by Claude Monet, a sculpture by Giacomo Becchetti, and twenty-six pieces by artists such as Eugène Atget, Paul Klee, Amy Sherald, and Louise Nevelson.In honor of the occasion, the museum also unveiled a new twenty-second-century edition of its annual Art Basel fair, which will take place in the autumn of 2022. The exhibition will feature works by twenty-four artists, including Antony Gormley, Paul Gauguin, Ed Moses, Andre Haken, Grace Cui, and Zoya Alaykum.\n\n\nThe Smithsonian’s National Museum of African Art in Washington, DC, has received a gift of seventy-five works. Located in the museum’s collection, the pieces include paintings, drawings, photographs, sculptures, prints, and ephemera dating back to the early nineteenth", "The next Biennial should take place in 2021. The 2019 and 2020 events were supported by the Te deumalen Foundation, which has received funding from the Te deumalen family since 1932. The foundation, which houses the archives of the Te deumalen family, was founded by brothers Ming and Tan Tse-Shan, and director Joko Tudjman. Artforum will continue to follow this story as it develops.The biennial, titled “The Future Is Present,” will feature work by sixty-eight artists. Titled “Anglo-American and Anglo-Celtic,” the exhibition will take up themes of the past and future and will feature a retrospective of the work of forty-three artists, including Andy Wipe, Phoebe Alberts, Rachmanin Chaudhuri, and Rinta Galla, as well as a talk with historian Sally Rideout about the International Art Museum (IAM) in New Delhi. The full list of participating artists is as follows:Agnieszka and Janusz Klimczyk, PolandArtistsSocially Neutral, United KingdomArtistsArtistsMikhail and Lalita, India and", "The next Biennial should be held at the O2 Arena in London in the summer of 2021. The brilliant design of the exhibition, which was created by the Department of Exhibitions and the Department of Design at Tate Modern, was awarded the Prize for Design in 2018. The competition committee chairman, David Patten, said: “The award of the Prize for Design is a proud recognition of the years of work and creative collaboration between the two institutions. The exhibition represents an ideal opportunity for Tate to reflect on the past, present and future of form.”\n\n\nAs the city of Philadelphia works to contain the spread of Covid-19, which has already caused the deaths of at least 150 people in the United States, the United Kingdom, and Canada, there has been renewed focus on the relationship between artists and the Philadelphia Museum of Art (PMA).PMA director and CEO Noel Reid said the museum has worked hard to address the concerns of staff and visitors about the future of the Philadelphia Museum of Art (PMA) and its collection. He added that the museum currently has about $8 million remaining in its $50 million capital campaign and has $2 billion in annual operating funds.He also said that the museum is preparing to begin construction of a", "The next Biennial should have a fully reconstructed exhibition. So many important works, such as the works of the artist’s father and grandfather, as well as the works of the artists of the nineteenth century, will be on display in the exhibition. The exhibition will also feature an expanded collection of the works of artists such as Keats, Goya, and Van Eyck, as well as new exhibitions by the artists of the twentieth century, including a new exhibition of the works of John Lasseter, the artist and director of the Los Angeles County Museum of Art, and a new exhibition of the works of the artist Vijay Iyer. The new location of the biennial will be in Central Park, with the new pavilion to open in the park in 2021. Esther Pereira, the executive director of the Biennale de Triennale, told the Art Newspaper: “We have conceived a new museum in Central Park to be closer to the heart of Los Angeles and to participate in the city’s extraordinary history. The Museum of Contemporary Art is committed to supporting the work of the biennale in creating a unique platform for contemporary art.”\n\n\nThe Metropolitan Museum of Art in New York has appointed Julie Ste", "The next Biennial should be held at the University of Maryland, College Park, in 2021. The Museum of the American Experience, in the city, will hold its first exhibition dedicated to the Autobiennial at the Museum of Modern Art, New York, in 2021. The museum will also be renovating the existing building, which dates from 1906, and is working on the restoration of the campus.“The museum’s goal is to present the Autobiennial as a living entity that is able to reflect the museum’s history and be a continuous experience for visitors, and we are confident that this will be achieved with the help of our talented and dedicated team,” said Blake. “The Museum of the American Experience will continue to support the Autobiennial through these exhibitions, events, and collaborations, and will continue to grow as an institution in the years to come.”\n\n\nMore than 200 artists, designers, writers, and other cultural experts and academics have signed an open letter condemning New York City’s decision to shutter the Solomon R. Guggenheim Museum, which has been closed since March 25 because of the pandemic, in protest of the closure of other cultural institutions. “We are writing to", "The next Biennial should take place in February 2021 and will be hosted by the Amis du Vin near Paris. The event will include online exhibitions and public programs, among other activities, and will be hosted by the Paris-based production company OTA.\n\n\n\"The creation of an internationally recognized museum dedicated to the art of Morocco is a milestone for the country and Morocco’s contemporary art. The institution will be dedicated to the art of Morocco, the birthplace of the great Moroccan Renaissance master, Abdelmalek Al-Saoudi, and will be located on the site of the former Moroccan embassy in Washington, DC. It will also feature a museum-like collection that will be open to the public and will be organized in a manner consistent with the country’s national vision for the museum.”Saudi Arabian Prince Alwaleed bin Talal has appointed Fahd Al-Qasimi as the new deputy director of the Museums and Collections of Saudi Arabia. Al-Qasimi, who has served in the role of deputy director since March 2019, succeeds Abdullah bin Farsi, who has been involved in the development of the country’s collections since the 1990s. He succeeds Nima Nabavi, who was named director", "The next Biennial should take place in 2021, and the first in 2021. While the biennial will be shorter than the previous two, the number of artists participating will be higher, and the theme will be “Art and Life: From Manuscripts to the Future.” \n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco has released the schedule for its May 2020 edition, “Art and Disorder.” Museum director Matthias Gebbers said that the new exhibition will explore “the paradoxes and falsities of perception.” The show will focus on “disorder,” the “psychotic condition in which there is an intentional disruption of the internal life of an individual, a group, an institution, or a world.” The exhibition will feature new works by thirty-three artists, including John Akomfrah (The Dreamer and the Stranger), Tanya Bonakdar (The Book of Life), and Sue McLaren (The Call of the Sea).“The show will be divided into three parts: ‘Warm,’ ‘Cool,’ and ‘Sensual,”” Gebbers said. The first part will", "The next Biennial should be held in the spring of 2022. The next Art Basel Asia will be held in the fall of 2022. The next Art Dubai will be held in the spring of 2022. The next Art Dubai will be held in the spring of 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles will implement a $500,000 emergency fund to assist the local arts and cultural sector following the Covid-19 pandemic. The fund will come from a special fund established by the city of Los Angeles in 2016. It was created to offset the financial losses and administrative burden caused by the coronavirus.“At a time when our city is facing unprecedented challenges and facing slowing economic growth, we are committed to working with local and regional arts institutions to support their operations and support critical public services,” said Mayor Eric Garcetti. “This fund will allow us to do that work while allowing MoCA to continue to thrive as a world-class arts destination.”The fund is also being made possible through an emergency aid package that was passed by the City Council in 2017. The legislation—which provided $1 billion in emergency aid—set up a special fund that will be used to offset the financial losses and", "The next Biennial should focus on the �decades of work that has been done by the scientific community to understand and address the global threats to our health and well-being and how we can better address them.”\n\n\nMichael Collins, a professor of art history at New York University, is suing the New York Museum of Modern Art (NYMO) over its decision to remove a bust of Winston Churchill that he says portrays the late Churchill as a racist, misogynist, and imperialist. The piece, titled Churchill in a White Coat and the Black Tie, was part of a series of four works that were part of the institution’s campaign to promote Churchill as a staunch defender of the civil rights and anti-war movements. Last April, the museum removed the bust because it was considered a “counterproductive reminder of the past.”Narrated by historian and screenwriter Angela Rye, the piece tells the story of a young black man named Arthur Chafee (played by Matthew McConaughey) who immigrated to the United States from South Africa in 1948. Originally from London, Chafee moved to Harlem to attend the University of Michigan, where his father designed the school’s first dormitory for black students. Since Ch", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MCA) in New York has announced its representation of the New York–based artist, radical feminist, and activist Zuzana Pindell. The artist will present her first solo exhibition at the institution in 2020. Pindell, born and raised in San Francisco, has spent much of her career creating works concerned with women’s rights. Working through the Reconstructionist movement, Pindell developed the work The Vagina Monologues, 1979–1981. She went on to create works such as the black-and-white gender-neutral ones for the museum’s permanent collection. “The Vagina Monologues are a feminist statement about the nature of the vagina, the self, and the body,” Pindell said. “It is a statement about what it means to be a woman. The work is full of references to history, culture, history of theory and history of feminism, and the cultural and political struggles of women.”Born in San Francisco in 1939, Pindell moved to New York in 1967 to complete her course in the art of resistance at Columbia University. She eventually enrolled at the Museum", "The next Biennial should be organized as follows: February 2–February 4, 2020, at the Institute of Contemporary Art, New York, and March 1–March 3, 2020, at the Museum of Modern Art, New York. The 2020 exhibition will be curated by Rebecca Watson, artist, curator, and teacher; John Mark, artistic director of the Institute for Contemporary Art; and artist-in-residence, Jane Panza. The 2020 exhibition will receive a total budget of $163,800. The 2020 exhibition will be held at the Museum of Modern Art in New York. The 2020 exhibition will also have a direct connection to the Biennials, as it will inaugurate its–and the institution’s--new campus.\n\n\nThe Institute of Contemporary Art (ICA) in New York has released the list of twenty-five galleries and museum partners who have participated in the inaugural installment of the ICA New York, which is currently underway. The event will take place at New York’s Javits Center from March 18 to March 20 and will be hosted by the ICA.Among the galleries that will be represented at the fair are Gallery Giga, Galerie Lelong, Galerie Lelong II, Galerie L", "The next Biennial should be held in 2021, according to the organizers, and will be hosted at the architect-planned site of the old Galería de Granada, in the capital of the state of Andalusia. The museum will also host two other workshops on the history of art.“The present exhibition is a continuation of the service rendered by the museum to the cultural and historic heritage of Spain,” Antonia Catellan, board chair of the Biennial and chair of the Spanish National Museum, said in a statement. “The exhibition ‘Enda’s History of Art . . . will allow visitors to find the latest research and comment on the themes explored in this exhibition in order to understand the relevance of the exhibition for our time, and will offer an opportunity for reflection and reflection.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is expanding the scope of its collaboration with the artist-run nonprofit this year by launching a new $500,000 fund that will engage with specific themes and projects by artists in the United States. Under the new initiative, the institution will donate $500,000 to two nonprofit organizations, the artist-run Space in the Sky and the", "The next Biennial should take place in the spring of 2021. The 2019 edition featured work by forty-three artists including Luke Fine, William Gibson, Yoshiko Hasegawa, and Kiki Smith, and ran from to on September 1, 2019. The 2020 edition will be held at the Museo de Arte Contemporáneo in Madrid, with work by artists from Canada, Mexico, and Peru.“Together we have created an exciting selection of works to celebrate the biennial’s 120th anniversary, and we hope that you will join us in celebrating the next chapter,” said Carlos Marin, president of the biennial. The 2020 edition of the Biennial will feature works by artists who have participated in or contributed to the biennial in the past, including Cristina Barba, Géronna, Mieszko Nistor, and Nari Ward, and will include a narrative in which the participants examine their experiences within the context of their futures. “The exhibition will be a multidisciplinary show of the work of artists in the exhibition, which will showcase the work of a select few,” the organizers said. The institution is currently working on a redesign. The", "The next Biennial should be staged in 2020, but the current schedule has it scheduled for 2022. The first edition of the Biennial, titled Culture in Disruption, was held in January 2017 and was hosted by the Museum of Modern Art in New York, curated by Jeffrey K. Smith. The next edition, titled This is Not a Test, was held in March 2018 and was hosted by the Broad & Western in New York, curated by Laurie Anderson and scored by David Kynacki. The exhibition was presented at the Biennial 100th Anniversary Celebration in March 2019.\n\n\nReports of the coronavirus have been greatly exaggerated, and the incidence is likely to be contained within a few years, according to the British Medical Association (BMA). Commenting on the latest figures, the BMA said: “These are the latest figures from the latest figures from the latest analysis of the latest available data from the World Health Organisation. If the BMA is to be believed, the UK is not going to be infected by the coronavirus by the end of 2020. Once again, the BMA is underestimating the number of cases we are likely to be able to keep under control and the risk that this", "The next Biennial should have been the first, and have been the most important, but for the circumstances which have now arisen. If we had been able to produce the first exhibition of work in our new country at the right moment, in the right place and at the right time, we would have been able to do it. But unfortunately the government ordered us to postpone it, and we are now working on producing the exhibition at a later date.”\n\n\nThe National Gallery in London has unveiled a new series of paintings and sculptures that examine the relationship between art and politics. Titled “Parallel Worlds,” the exhibition will be on view until February 30, 2020 and will feature work by a wide range of artists, including Andy Warhol, Rayyane Gassati, Henri Rousseau, and Ai Weiwei, as well as an exhibition commemorating the centenary of the British Petroleum disaster in the Gulf of Mexico. “The National Gallery is dedicated to the study of all things art and this exhibition is a good example in how to think about art in a political context,” said director Nicholas Cullinan. “Through this exhibition, we hope to make the case that art can be a tool for change and to", "The next Biennial should take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it is planning to move the third and final season of the critically acclaimed, fifty-year-old, seventy-three-hour-long series “The Frame,” currently on view in its entirety, to online viewing rooms in order to “enhance MoCA’s relationship with its audience and make it easier for them to experience the show online.”The move follows a major year for MoCA, which saw the launch of the new digital platform 365Art, which the institution says provides an unprecedented set of digital tools for visitors to “View & Buy” and “Paint Now” and is designed to “interact with the work of impacting and influential contemporary artists.”Commenting on the digital experience, MoCA director and CEO Marcia Cooke told Artnet: “This is a historic moment, and we are deeply proud to have served as a platform for artists in our mission to present the most extraordinary exhibitions and work delivered by the most distinguished artists of our time. Our new digital platform will allow MoCA to better serve our audiences and more effectively serve the community", "The next Biennial should be in 2022.  Previously the theme of the exhibition was “The Future We Want.” The three-day event is free to the public and will run from March 19 to March 21.The exhibition will include works by forty artists, including Lesley-Anne Caselotte, Yao Ming, Diana Fu, Natalie Johnson, and Tina Lafond.  “We have always maintained that the forthcoming Biennial will be a forum for the artists to present their work,” said Sammarco. “The new format of an exhibition-long, three-day event, thus consolidating the exhibition, will allow the artists to present their work as well as to have their works presented by the organizers in collaboration with the artists.”\n\n\nThe National Gallery in London has awarded £38,500 to twenty-nine artists for their exhibitions at the institution in the next five years, including Arts in Motion (2018), which was organized and curated by Rosanne Somerville; Seeing Stars (2019), curated by Sarah Lotfyre; and The Sight and Sound of Things (2019), which was staged by Keiichiro Hira", "The next Biennial should take place in 2020.We are currently working with the foundation to secure a new venue for the fifth edition of the Biennial, which will be held at the Polis St, in London from March 19 to March 21, 2020. The exhibition’s inaugural New York and London editions were cancelled owing to the Covid-19 virus pandemic.\n\n\nThe Institute of Contemporary Arts (ICA) in London has announced that American artist Lulu Almina will present its first solo exhibition in twelve years in February 2021, and will be followed by a symposium. The show will feature work by forty-two artists and will be curated by Shafiq Mahmood, curator of contemporary art at the Museum of Modern Art, New York.“The exhibition will celebrate the legacy of American artists, exploring the relationship between art and technology, art and the body, art and the mind, art and the soul, art and the senses, and art and the body, and will also encompass new and exciting visual arts, new breeding ground for the concept of art, and art in the digital age,” said Maurizio Cattelan, chairman of the ICA.Almina was born and raised in New", "The next Biennial should be announced soon. The 2019 edition will take place at the new museum’s exhibitions and collection spaces. Sponsored by the Bechtel Group, the event was established to commemorate the exhibit and exhibition “The Contemporary Art of the Contemporary Period” (2019) and “The Art of the Modern State” (2019). Its inaugural event, which also featured the exhibition “Nude with a View: Art from the Bikini,” was held in 2016. The biennial will focus on the French avant-garde as well as on the German Third Reich and the Italian autobahns during World War II. The biennial will premiere a collection of works by thirty-six contemporary French artists in the fall of 2020. Click here for the full list of artists and their biennials. \n\n\nThe Los Angeles County Museum of Art (LACMA) has launched a new digital initiative called LACMA NOW. Launched by executive director Anu Narayana and LA’s Arts + Artists coalition, LACMA NOW will provide an online platform where LACMA museum visitors will be able to view and purchase works by artists currently on display in its", "The next Biennial should be the first in the country to take place in the city’s landmarked, six-thousand-year-old Fort Augustus, the oldest surviving military installation in the United States. Comprising work by thirty-six artists, including Nina Chan and Anish Kapoor, the exhibition will highlight the extraordinary stories and artistic achievements of the exhibition’s featured artists, as well as the history of the exhibition from the perspective of a new generation of visitors.Commenting on the upcoming triennial, Steve Guggenheim, curator and chair of the museum’s board of trustees said: “This is a moment of great change and change is an exhilarating thing. The Young Vic’s new location and its new mission is built around a compelling artist-driven project. Our artists are engaged in stories not only about the museum’s history, but also about the exhibition and about the future. We hope that these stories will inspire and delight audiences of all ages, and will make them feel like they have a seat at the table.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it is planning to close its doors indefinitely as part of a restructuring that will overhaul its", "The next Biennial should be held in 2021. The next will be held in the city in 2021. The next will be staged at the Tartu Madangra, an ancient Madangra temple in the northern city of Bundang, in the city of Sanya, in the city of Sanya\nThe 第三国明菜方素文社南海路 (Bakchimai Kunstai) in Seoul, South Korea, cancelled its upcoming edition, which was scheduled for March 26–March 29, citing the financial difficulties caused by the coronavirus. However, the 2019 edition, titled “Bakchimai Kunstai: 2020’s New Year,” was still scheduled for March 28–March 31. The event was slated to stretch from March 25–March 28.Following the cancellation of the March 28 edition, Bakchimai Kunstai’s organizers said that they are working with the South Korean government to help clear the halls of the institution and are preparing a new edition, which will be held in the autumn.  The forty-three-year-old B", "The next Biennial should be a reflection of our present, but we need to be able to look to the future.”  Ellen Brown, the president and CEO of the Metropolitan Museum of Art, said: “The Museum is committed to being an international destination that honors the rich and influential lives that have shaped the region. It is a challenge to create a venue that will be both transformative and accessible to our visitors. Our plan for the 2020 edition reflects this ambition in creating a venue that is both timeless and contemporary.”Since its inception, the Biennial has presented work by fifty-three contemporary and established artists, including Alex T, Beatriz de la Barba, Javier González, and Chica L, among others, who will compete for the $10,000 Grand Prize. The 2019 iteration of the event, which opened in 2015, featured work by twenty-seven artists.\n\n\nThe Tate’s board of trustees has awarded Jacob’s Pillow and Alexander Gray a total of £1.5 million to facilitate the museum’s relaunch, as the institution prepares to welcome visitors again across its new seven-thousand-seat venue in London’s West", "The next Biennial should take place in 2021. The twenty-ninth will be curated by Masayoshi Sadao and will be hosted by the Tokyo-based nonprofit Art in the City Center (AICC).\n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to eliminate more than two hundred arts and cultural institutions from its collection, detailing in a report published on Wednesday how it is restructuring its holdings in an attempt to reduce its debt and maximize the return on investments.The restructuring, which began in 2018, involves the removal of more than 1,600 antiquities and collectibles from its collection and will involve the consolidation of more than three hundred arts and cultural institutions, including the Boston Garden, the First Congregational Church in New Bedford, the Metropolitan Museum of Art, and the Museum of Fine Arts in Boston.“The changes we are making will help us achieve a more diverse array of exhibitions, an improved understanding of the relationship between artists and collectors, and the preservation of the collections that have shaped our cultural heritage for a long time,” said Elizabeth Newton, the museum’s executive director.The restructuring, which is part of a strategic overhaul of its holdings, began in the summer of 2018 with the launch of", "The next Biennial should bring together Polish and international artists for an exhibition that will be organized as a collective project, with the cooperation of the local and international community. All the rest is history. With the support of the Polish Ministry of Culture, the Department of Culture and Sport, and the Council of Europe, we will continue to support the project and we will present our view at a future meeting. The author of the Biennial programme was the Polish artist Joanna Bocherek, who was awarded the Museum of Modern Art (AMKA) in Warsaw in 2016. \n\nThe Museum of Contemporary Art (MoCA), Chicago, has announced that it will close its doors permanently to the public in January 2021, after which it will begin the process of mothballing its various exhibition spaces, beginning with the art collections, which will transition over to its archive, in March 2022. The museum’s collections (the most prominent of which are the collection of the late American designer Frank Lloyd Wright) and the archives (the most important of which are the workbooks of the late Italian architect Celentano Marzio) will remain open for a limited time, but will not be accessible to the public. “The future", "The next Biennial should take place in 2020. Alberto Iannone, director of the Museo de Arte Contemporáneo Nacional (MAS), Brazil: I have been following this project for some time and was very happy to see that the first edition was held at Oaxaca in 2002. The next edition will be held in the capital of the state of Minas Gerais, in the country’s northeast. \n\n\nAmerican artist Lucille Ball, whose rich and often comical work explored themes of race, sexuality, and class, has died at age ninety-three.Born Lucille Katz in Brooklyn in 1942, Ball grew up in the segregated South, attending predominantly white, predominantly Catholic schools in predominantly black Frederick Douglass High in Frederick, Maryland. In the 1960s, she went on to study in New York, where a friend gave her a videotape recorder to use as a sexual aid. Ball also experimented with painting and sculpture and began drawing in high school. She returned to the arts in the 1980s, when her husband died of cancer, and began working with her husband’s sons and their friends, a group whose members included artists such as Allen Klein and Ann-Marie Wilson", "The next Biennial should take place in 2020. Due to the coronavirus pandemic, the first event to be held in the new building will be “Dark Side of the Moon”—a retrospective of the artist’s latest exhibition. The Biennial will be inaugurated by a performance by the artist at the Museum of Modern Art (MoMA); the show will then return to Tate Britain for a second season, which will run from March 13–March 15. The curators of this show have previously said that they were “struggling to understand how a museum that prides itself on being an international platform for the study of art and design could be so emblematic of the cultural and social elite’s aesthetic tastes.”After visiting the exhibition space, Valentino Rossi, a curator at the Museum of Modern Art, told the Art Newspaper: “It is a really diverse show in terms of subjects. We can see the work of the artists in the museum, but we also have to consider the professional, the institutional, the structural foundations of the institution. It is a very difficult apparatus to operate. We would like to think that the next edition of the Biennial will provide an invitation to the French", "The next Biennial should be in 2020.\n\n\nThe Jerusalem Philharmonic, which was forced to cancel two previous editions of its annual presentation of the work of contemporary artists in February due to concerns over the coronavirus, has once again postponed the event to June 30. The decision was made in light of a new ruling by the Israeli Supreme Court that states that there is currently no legal basis for the government to provide financial support to organizations that perform religious functions in Israel.“The court has now declared that performing religious functions is an essential part of one’s public state,” said Bezalel Smotrich, the litigation director of the Center for Religious Expression and Democracy (CERA), a New York–based nonprofit that represents cultural workers in Israel. “This is a huge victory for the cultural workers, and it is also a huge victory for the artists. They are now able to perform their vital roles in the communities and the state, for which they are truly dedicated.”In a statement, the Jerusalem Philharmonic said that it will inspect its facilities and “take a decision in the coming days.” It added that the postponement of the exhibition, which will be presented by the Jerusalem-born,", "The next Biennial should take place in the fall of 2021. The theme of the upcoming edition of the festival is “Individuality.”\n\n\nThe University of Cambridge has received a £1.3 million grant from the National Lottery Heritage Fund to help with the restoration of the former site of the University of Cambridge’s famous Cambridge Gardens.The £1.3 million grant also allows the University to change the name of the institution, “Cambridge Gardens,” which has played an important role in the history of the university, and renew its contract with the London-based firm Grafton Landscape and Design (GLAD) to oversee the gardens. The new name will be Cambridge Modern Gardens, and the gardens will be restored by GLAD to their current, contemporary appearance.“Cambridge Modern Gardens will be a destination for students, students visiting from all over the world, and will provide an exciting new home for the Cambridge University Festival,” said Arthur Laski, chair of the trustees of the National Lottery Heritage Fund. The grant also funds the restoration of the ruins of the Baker Street building, which was the site of two of the UK’s largest public gatherings, the Cambridge Union and the", "The next Biennial should open up in 2020 and will run from February 26–March 7.  The fifty-seventh edition of the exhibition will be staged at the Museum of Modern Art in a four-building, 1,500-square-foot compound on the campus of the Massachusetts Institute of Technology (MIT) in Cambridge. The museum has yet to make a decision about whether it will take over the museum or lease it out to an interested third party. The new tenant is likely to occupy at least two of the seven floors of the former building. “The new partners have been selected to provide a truly global platform for the Biennial and to deliver a compelling exhibit that is both ambitious and ambitious,” said Thomas Fleming, chair of the Arthur M. Sackler Research Center in New York. “Together they bring a wealth of experience, knowledge, and knowledge to play with, and to realize the dream of creating a new museum on our campus.”The real estate company State Street Global Advisors has been granted a ten-year lease on the Museum of Modern Art’s current premises. It will work with the institution to redesign the space and redesign its existing exhibitions, which were completed in 2018, in order to increase", "The next Biennial should be held in the capital city of the Netherlands in 2021, with the possibility of expansions to other cities in the country. The Brussels-based firm New York’s Diller Scofidio + Renfro and New York’s Jonathan Lewis, who has helped organize the Venice Biennale for the past ten years, have proposed that the events be held either in the city or in the suburbs of the capital. The New York Assembly approved a resolution in support of these plans yesterday, and Mayor Bill de Blasio announced that he will push for the event to move to the city in the spring of 2020. “I’m hopeful that we can work together to ensure the next edition of the Venice Biennale is a true reflection of the life and spirit of the city of Venice,” de Blasio said.\n\n\nThe Israel Museum of History (IMO) in Jerusalem is preparing to welcome visitors back to the institution next week following a temporary closure due to a possible second wave of Covid-19 cases in the country.According to the Times of Israel, the institution informed the Ministry of Health that it expects to cope with the coronavirus outbreak by the end of the month, but that it", "The next Biennial should be held in 2022 and will be an attempt to create a new model for the event. The exhibition will be hosted at the Ministry of Culture and the Ministry of Culture and Science, and will be curated by the director of the museum. It will feature work by twenty‐three artists, including Sibel Edmonds, Yoko Ono, and David Salle.Chairman of the commission Sibel Edmonds said: “We are honored to be able to support this important project by the Museum of Contemporary Art and the Ministry of Culture, which will culminate years of work by a select group of artists, many of whom had previously been forgotten, and who will be the first to experience the exhibition. We hope it will also prove to be an important milestone for independent contemporary art and the exhibition.”\n\n\nArt historian and curator Altman Mather has been named director of the Museum of Contemporary Art (MoCA) in Los Angeles. Mather will be responsible for guiding the museum through its next phase, “the Next Level,” an initiative that will showcase work by twenty‐two artists and will culminate in a reopening of the museum on April 1.Mather was selected by an ‎eminent", "The next Biennial should include a selection of selected works by artists and other organizations that have been relocated or have recently entered the Biennial Collection. \n\n\nThe DeCordova Museum of Art in New York has appointed Amanda Golden, who has served as the museum’s associate curator of photography since 2013, as its next director. Golden will be responsible for overseeing the development and execution of the museum’s programming and the academic programs in its art department and will take the helm from Leslie Nevelson, who will retire after a decade at the helm of the school of American art in December.“The DeCordova Museum of Art is an important cultural community center and is poised to be an international model for how a museum can be an important cultural gathering space for its surrounding communities,” said Golden. “With its long-standing history providing a path to cultural recognition and international acclaim, the museum has long been recognized as one of the leading institutions in the art world. It has successfully integrated contemporary art with traditional museum practice to create a uniquely American institution. I’m excited to work with the staff and the board to ensure the museum continues to thrive as a vibrant and educational destination for visiting artists and the community.”", "The next Biennial should be held in 2021. \n\n\nThe Rothschild Collection in London announced today that it is planning to open a new center dedicated to the art of the Early Moderns. The new center, which will be located in an old textile factory in the city of Bethnal Green, will be modeled after the former Molesworth Gallery in Lincolnshire, where the collection resides. The center will be divided into galleries and workshop spaces, with the main exhibition space located in the former textile factory.The center’s inaugural exhibition will be a retrospective of contemporary art made in London in the early nineteenth century, with a focus on the period between 1860 and 1870. The exhibition will be organized as follows: “The Early Moderns” will open on February 24 at the London School of Economics (LSE) and will run until March 26. The long-term project will include a book series, a museum, and an exhibition space.“The Early Moderns” is curated by Moya S and Rory Mulligan, and will include a selection of work that represents an array of styles, from early nineteenth-century abstractions to more recent creations by artists such as Ed Moses, Charles Mapplethorpe", "The next Biennial should be held in 2020 and will be supported by the Foundation for Contemporary Arts in London. The museum will include world premieres of works by more than forty artists such as Vincent van Gogh, William Kentridge, Edward Weston, and Karen Kilmnik, among others. The exhibition will also include the biennial’s first monographic project, “The Sculpture of the Image.”The exhibition is organized by the biennial’s team in collaboration with British cultural director Maria Balshaw. The show will take place in two ways: first, as part of the biennial, in the International Center for Contemporary Art (ICCA), in the city of Manchester; and second, as part of the Windsor Gallery, in the English countryside.\n\n\nThe Israeli Museum of Fine Arts (IMFA) in Jerusalem has received a $100,000 donation from the Simon Wiesenthal Center, which supports cultural initiatives that address the issues of Israel and the Jewish people. The donation was made by Steven Jacobs, director of the Wiesenthal Center; John B. Shea, board chair; and the Wiesenthal Family Foundation, which represents the Simon Wiesenthal Center; among other organizations.The gift, which will", "The next Biennial should take place in the summer of 2020, and should be in collaboration with the organizations and institutions of the city. The biennial’s inaugural exhibition “Rethinking Astrophysics” will be staged in the summer of 2021. “We’re eager to continue our collaborations with the city to support both the cultural and the local community,” said Benedict Blum, Director of the Kunsthalle Basel.\n\n\nThe Sundance Film Festival announced today that it will no longer award the $20,000 Sundance Prize to a Swedish director. According to the New York Times, the announcement was made on the event’s Facebook page, which said that the award was “overwhelmingly financed by a single person, Åke Manne.” The decision came after the festival board voted to unseat Manne, the founder of a consulting company that helps film studios and businesses set up and run their own production facilities, on March 13. “Manne was brazen in his conduct,” Sundance board chair Andrew Depla told the New York Times. “We were not given a choice but to act. It was a no-", "The next Biennial should be held in 2020, and the full list of participating artists can be found here.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it plans to open a new, $30 million arts and culture center in the city, which was recently the epicenter of the Covid-19 outbreak in the United States. The new museum, which will be located in the former home of the former Warner Brothers Pictures building, will be named for the Kaufman family, who created the experimental experimental, experimental, and experimental-music museum Thee. The center will be named after the late artist's father, Kaufman, and will be housed in an updated 35,000-square-foot building that was purchased by MoCA in 2016 for $55 million.The new museum will also have a theater, a digital platform for community engagement, and a café. The museum will host additional programming including a layout exhibition of works by the Kaufman family in 2020, and a retrospective of the artist’s work in 2021.The announcement follows a four-year investigation into the family’s artistic legacy led by the Los Angeles County Museum of Art (LACMA), which will reopen next month. The investigation found that the artist", "The next Biennial should be held in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that the institution will make its first major restoration project of artist Frank Gehry’s design for the building, which opened to the public in 1970 and remains a landmark in the city. The $50 million effort will restore the space’s facade, ceiling, walls, floors, and roof, as well as its roof terrace and roof deck, which are constructed of steel and concrete. The work will also include the installation of a new video gallery, a new café, and a new state gallery.The renovation, which will be overseen by architect Donatella Bocchieri, will highlight the work of recent and emerging artists, including Miro Breuer, Yuji Noguchi, and Arie Lundvall, and will introduce new works by contemporary and pre-Sidney Gertrude Stein and Robert Irwin.Coinciding with the restoration is the reopening of MoMA’s newly extended East Coast exhibition space. The new exhibition, “30 Years of Art”—a selection of work by forty-five artists, including Mariinka Hamburger, Robert Irwin, and Györ", "The next Biennial should be held in the fall of 2020. The 2019 edition, which was kicked off by the Columbian Biennial in New York, was canceled at the last minute due to construction. It will be reopening in the spring of 2021.If the previous dates are met, the 2020 edition will open on January 11, 2020 and will run for twelve weeks, from January 21 to January 26. The event will be hosted by the Museum of Contemporary Art Denver and will be co-chaired by two-time Grand Prize winner and Pulitzer Prize–winning curator Josephine Miles. The exhibition will feature more than 350 works by twenty-eight artists, including Rachel Whiteread, Ed Moses, Fanny O. Lewis, Joyce Carol Oates, and Michael Powell, and will be officially inaugurated by the artist Alice Aycock.“It is such a beautiful thing that is of such great importance to the museum, especially in this era of the Great Recession, when so many of our art museums are struggling to stay open and keep their doors open,” said Stephen Schoonmaker, director of the museum. “This year’s exhibition will feature work by a select group of artists whose work we believe are essential in order to understand", "The next Biennial should take place in 2020. “The exhibition of MARY KAINE’s work is a classic example of an artistically inspired exhibition,” said artist Claude Karay. “The next iteration of our inaugural MARY KAINE exhibition will be more comprehensive and emotionally resonant, more informed by a deep understanding of the human experience, and more ambitious.”\n\n\nThe Museum of Modern Art (MoMA) in New York has released the first wave of curatorial appointments for its next edition, “The Surround,” which will open on April 3 and run through April 25. The biennial is being organized in collaboration with director Klaus Biesenbach and artistic director Jodi Throckmorton and will focus on “visual art, the medium of painting, and sculpture,” through a retrospective of the work of forty artists.Among the curators slated to appear are Dominique Anselm, Kunsthal Larshaus, Janette La Barra, Jacquesmarie Picquart, and Swinburne, and the works to be displayed will be selected from a roster that includes Gertrude and John Adler, Stella Lagnado, Richard Learoyd", "The next Biennial should take place in Seoul in 2022.  1½\n 2    3  4  5  6  7  8  9\n\n\nThe eleventh edition of the Venice Biennale will welcome forty new works by forty artists, including Giacomo Navonari, Anastasia Varejão, Andrea Catellani, João Renata Lopes, and Vincent van Gogh. The Venice Architecture Biennial will take place in the city of Venice from February 22 to March 28. The exhibition will also introduce a new concept of a 'city of artists' and will introduce a new kind of juried exhibition, called a juried residency, with the aim of encouraging international exchange and artistic collaboration.The 'City of Artists: A Symposium Toward an International View,” which is being organized by artist-run residency-center Lillebouquet, will be hosted at the Palazzo di Rivoli in Venice from March 16 to March 17. The institution has also agreed to organize a series of events, including a reception in October, an exhibition in November, and a symposium in March 2022. The Venice Architecture Biennial", "The next Biennial should be held in 2022, and the next will be held in 2023.  The next exhibition, titled Art and Time, will be on paper in 2021, and the next will be titled Birds and Time. The next exhibition, titled Unite and Rejoice, is on paper in 2020. The next exhibition, titled The Present, will be held in 2021 and the next will be titled The Future. The next exhibition, entitled The Present, will be on paper in 2019. The next one, titled Art and History, will be on paper in 2020. The next exhibition, titled The Present, will be on paper in 2019. Art and History, will be on paper in 2020. The next show will be on paper in 2021. The next quarterly exhibition, the biennial biennial, will be staged once again, and the last show, which will be held in 2022, will be on paper in 2020. The next show, which will be staged twice, will be on paper in 2021.“We are delighted to announce that with the support of our generous donors, we are at the stage where we can start moving forward with the exciting", "The next Biennial should take place in the spring of 2021. The ten artists who were selected for the exhibition were: Gao Zhai, Chen Ren, Baba Khandaker, Zhang Zhen, Zhang Xiaocheng, Renano Zhen, Xi Bingqian, Hanan Chen, and Li Jie.Inaugurating the exhibition is a series of talks and tours that will examine the themes of the exhibition and the way that artists direct their own experiences. The first part of the series, “The Art of Movement,” will run from March 25–March 29. The second part, “The Art of Composition,” will run from March 30–March 31. \n\n\nThe Solomon R. Guggenheim Museum (SGM) in New York has welcomed Benjamin Sissako to its curatorial team. Sissako, who currently serves as an assistant professor in the department of art history at the University of Pennsylvania, has helmed the museum since it opened in 1989. During his tenure at the institution, Sissako has organized numerous exhibitions, including “MID-SIZED: AUSTRALIA 40 YEARS” (2014), “REALISM”", "The next Biennial should take place in the spring of 2021. While there are no plans to move forward with the show, the organizers said that the show will be staged in a manner that does not compromise the exhibition’s programming.\n\n\nThe Metropolitan Museum of Art (Museum) in New York has released a new set of guidelines for how museums should respond to protests over its expansion. The guidelines, which were written by the cultural advocacy organization the Museum Working Group, were released on March 20, the day the Museum opened to the public following a $3 billion expansion project, and outline how institutions will address controversial renovations.According to the guidelines, “metropolitan museums are not neutral or neutral places,” and that “[Museums’] are not places to be erased or transformed.” They also cite the work of the museum’s strategic planning team, which assembled the document as part of a larger plan to prepare for the construction of an expanded museum, as an example of how a museum could usefully be used as a platform for political action.The document outlines several issues—including the role of museums in local communities, their institutional relationships with residents, and the types of protests that can be considered—such as", "The next Biennial should be held in 2020. Hirshhorn Museum director H. Scott Maxwell recently said that the upcoming edition will bring \"a more responsive, contemporary, and impactful\" display of the art. The institution has been working on revamping its contemporary art collection since 2014, when it broke ground on a new, larger venue. The overhaul involved the construction of a new 300-seat auditorium as well as the addition of a new contemporary art-making lab.\n\n\nThe Solomon R. Guggenheim Museum in New York is preparing to open a new space in the city’s Central Park for the art museum. The reimagined space will be designed by architect Robert Johnson, also known for his conceptual and industrial design work, in partnership with the Guggenheim’s board of trustees. The new institution will be constructed in the gated community of Sand Hill, a project of the New York–based firm Saks Architects.“Central Park is a living, breathing, vibrant, and inspiring cultural center,” said Guggenheim board chair Larry Guggenheim III. “The new event space will be an extension of the Guggenheim’s reputation as a destination for", "The next Biennial should be held in 2021 and the first in 2022. \n\n\nThe National Gallery of Art in Washington, DC, is planning to shutter its doors permanently in April 2020 and re-open in March 2021. The development comes amid a drastic restructuring of the museum, which will reorganize its collection, structure, and staff in order to become more like a museum with a few hundred employees rather than a major contemporary art museum.The announcement follows a decades-long campaign by the museum, led by architect Michael Gilmore, which involved the construction of its new home, a 3,600-square-foot facility in the Potomac River, and the relocation of the museum’s permanent collection. The renovation, which began in 2016, included the opening of a new branch of the museum, the Contemporary Arts Museum, outside of the old National Gallery of Art in 2016 and the refurbishment of the gallery. “We will continue to experiment with new materials, ways of organizing exhibitions, and ways of presenting works together,” museum director Nicholas Cullinan told the Washington Post. “It is going to be a challenging year. It is going to be a very challenging year for the institution.”\n\n\nThe Los Angeles County", "The next Biennial should be held in the year 2020; the current year equivalent should be cancelled and a new year should be decided by a majority vote.”\n\n\nThe Museum of Modern Art (MoMA) in New York has launched an online survey inviting public input on its plans for the future of the institution. The online survey, which will gather data from approximately 1,500 participants, will compile a report on the MoMA’s future that will then be presented to the public for their suggestions.“As we work to redesign our campus and reimagine the future of the museum, we are constantly inspired by the ideas, visions, and experiences of our guests, alumni, and friends,” said museum director Matthew Teitelbaum in a statement. “MoMA is committed to the future of the museum and its mission, and we look forward to receiving your suggestions and giving you a chance to shape the museum’s future through your suggestions.”The online survey will provide visitors with a tool that will allow them to provide MoMA with feedback on how it should be redesigning its campus. The survey will collect data from multiple sources including online comments, viewer comments, and letters to the museum from guests, alumni, and", "The next Biennial should take place in the spring of 2019. “This exhibition is an extension of the work of an amazing group of artists and designers who have been influential in shaping Biennial in Toronto, and whose work will be presented in this exhibition’s Thirty-Second Biennial,” said city council president Joe Ciminelli. “We are grateful to the Mississauga community for their continued support and confidence in the future of the City’s Arts and Culture.”\n\n\nMichael Rosenfeld, a New York–based curator and cofounder of the interactive museum space the New Media Lab, has announced that he will leave the institution to head the Brooklyn-based nonprofit MakeSpace, which advocates for greater access to cultural production. The arts space will be helmed by Jane Panetta, who has helmed the museum since 1988, and will launch in 2019.“We are thrilled to have Michael join our team,” said Mark Shatz, the museum’s current director. “His history and training in the arts, as well as his knowledge of and passion for culture, makes him the ideal person to help MakeSpace achieve its mission of supporting artists and bringing cultural production to underserved communities in Brooklyn", "The next Biennial should take place in the city of Montreux, Switzerland, in 2021. As the future of Art Basel and the Rhizome is in serious danger, a group of international activists are demanding a rethink of the major art fairs in the world. In a letter dated June 4, the NGO Art Basel Initiative (ABI) and the other signatories of the letter are calling for an end to the future editions of Art Basel Hong Kong and Art Basel Taipei. The arts organizations fear that the upcoming editions of the fairs will not only be compromised but will actually be cut short due to the ongoing global pandemic.“This is not a trivial matter, but one that demands urgent attention,” reads the letter, which is addressed to international director Klaus Biesenbach, Markus von Mohne, Mikko Kunsthal, and Michael Löwenberg. “In addition to the physical and intellectual health of our participants, we expect a significant boost in sales and participation if the fairs are cancelled and a strong return of artworks.”The letter explains that an absence of events at a fair is not an absence of artworks and that the �", "The next Biennial should take place in 2022, the year of the upcoming exhibition. In April 2020, Victoria and Albert Museum director Christopher Le Brun said: “The question of the next Biennial is an important one for the museum. We will consider all options to ensure the future of the art exhibition and the Art London brand.”Since the exhibition space’s closure last year, the Biennial has faced a number of challenges. In May, the museum dumped two of its partners, the Metropolitan Museum of Art and the Tate, and announced it was planning to wind down its London outpost. Its final exhibition, “Uncle Humphrey and Friends,” was also scrapped. Its London outpost, which staged eight shows a year, was forced to move to Stratford-on-Avon. Earlier this month, Artnews reported that the new owners of the Tate, the National Arts Council and Tate management, will not be reimbursed for the cost of removing the last work from the institution, a performance by the New York City Ballet.The move followed a months-long investigation by the national art conservation agency, the Art Fund, which determined no work was suitable for exhibition at the museum, which it determined was worth", "The next Biennial should take place at the American Folk Art Museum in New York City in 2022. \n\n\nThe Metropolitan Museum of Art in New York has announced that it is introducing a public-private partnership model to improve access to its collections. Called Project Connect, the initiative will partner with communities to draw attention to the museum’s collection through art and will commission local artists to go on site to collect works.The partnership model’s first public engagement was during the museum’s reopening in June of 2019, when it opened a new section of its collection devoted to the African diaspora. The section, entitled African American History, featured art from seventy-five artists, including the Dinka-American artist Ebony Ozeki, the African American artist Wangechi Mutu, and the Haitian-born, Puerto Rican artist Doral Álvarez Barrios.“Connecting the museum is not only about connecting a museum with an audience but also about connecting a museum with a community of artists and about connecting a museum with its history and with our own collective memories and our own collective stories,” said artistic director Nicholas Roach. “This new initiative will engage directly with the people", "The next Biennial should be held at MIDWESTAXINA’s headquarters in the capital city of Addis Ababa from February 24 to March 27, 2020. The 2020 event will be held at Midsopina’s location, which is located in a former coal mine in the heart of the city of Kinshasa, in the capital city of Kinshasa. In an interview with Artnews, Midsopina said: “We will present the biennial in March. It will be a wonderful event. The event will be a blend of art and science, and will be inspired by the rivers, the landscape, and the people of Kinshasa. I enjoy working with the local people of Kinshasa and am encouraged to see their vibrant ways, which is a major reason why I am so committed to the city.” According to Artnews, Midsopina’s fellow curators, Alison and James Palmer, and Jill Sikora, who will curate the 2020 event, met the local artist Cheryl Oliva, the founder of the installation and performance space Prospect, at the venue in February. The", "The next Biennial should take place at the Biennial, which is located in the City of San Francisco, in 2020.  A description of the upcoming event can be found here: https://www.facebook.com/events/105965477892871/\n\n\nThe National Endowment for the Arts (NEA) announced that it will award $4.3 million in grants to thirty-three arts and cultural organizations, five of which are located within the greater Pittsburgh region. The awards will help fund programming and operations in the Pittsburgh metropolitan area for the 2020–20 season. The organizations selected for the grants are: Bluegrass Revival, Cincinnati Art Museum, Pennsylvania Academy of the Fine Arts, The Progressive Arts, The Shaping Tree Farm in Cleveland, Ohio, and the Shaker Arts Center in Shaker Heights, Pennsylvania. “The National Endowment for the Arts (NEA) is proud to support the Pittsburgh arts and cultural economy,” said Kenneth Neal, director and CEO of the NEA. “The grants are an important step in the organization’s ongoing commitment to help support the Arts in America and to ensure that the Pittsburgh region continues to thrive. We", "The next Biennial should also mark the 70th anniversary of the publication of the first issue of the monthly magazine, which was founded by Stan Winston. Winston spent two years creating the magazine, which was published by the apartment complex where the artist lived and worked.The theme of the 2020 edition will be “The Future Is Now” and will be “Inspired by the Past.” The inaugural exhibition will be “Ninety-Nine Views of the Past,” featuring works by twenty-four artists selected from a pool of sixty. The initial exhibition will also feature a number of new works by artists working in the contemporary art field. “The biennial will be a reflection of the artist’s lives and a celebration of their work and the impact they have on society,” said Antonia Brisebois, director of the Biennial de Ville, which is organized through the innovative space Studio Museum in Paris.George Lucas, who founded LucasArts, the company that owns LucasFilm and LucasArts and helps fund the biennial, said: “I’m very excited to see how this year will turn out. It’s a great honor to be able to celebrate the first year", "The next Biennial should be held in 2021 and will be hosted by the Museo de Arte Contemporáneo, Madrid, and will focus on the role of art in the lives of Indigenous communities in the country.\n\n\nThe London–based artist, activist, and educator Tomáás work on the Left Bank, a series of photographs that juxtaposes abstract prints and video installations, has been designated a UNESCO World Heritage Site by the United Nations. The foundation of the international campaign was created in 2007 following the artist’s plea for the leadership of the Spanish government and the National Museum of the History of Art in Madrid to take action to preserve the work.In February 2013, the museum reopened to the public after months of construction, and the work, a reconstruction of the Battle of the Somme, was exhibited in the exhibition “Battle of the Somme: Art and Politics in the Great War” (2013) alongside paintings by Annie Besant and Mier Oliva, as well as works by Pablo Picasso, Renzo Piano, and Arsht Nesvorn. The show, which also included works by Algerian artist Tamsul Miah, a pioneer of modernism and an influential", "The next Biennial should be staged in the autumn of 2019. The theme, “The Table,” will be based on a novel written by artist and biennial founder Hetain Malhotra, a Pakistani author of contemporary fiction, poetry, and nonfiction, and is slated to run from September 11 to September 13, 2021.\n\n\nSix hundred and forty-two artists from twenty-six countries are asking the Arts Council (AC) to reschedule the 2020 edition of the Edinburgh International Festival to September 22. The artists, including Malawian-born, Queer, Keremluk, Nez Perce, and Tasneem, have come together in a letter from Italy, where they are urging the organization to give the artists a reason to return to the United Kingdom next September—a decision that would coincide with the European Union-wide campaign to clamp down on the consumption of alcohol and other substances of abuse.The artists are demanding that the organization reconsider its decision due to the Uprising in North Africa, a massive anti-corruption movement focused on the Middle East that has taken the lives of more than 6,700 people since it began in March. The United Kingdom has seen its worst outbreak of the virus outside of", "The next Biennial should include a concept‐based presentation of the work of the artist‐in-residence, Kiki Smith, as well as a program of research.\n\nBiennial organizers also announced that they are working with the UCT School of Design to create a new residency program that will extend the residency program beyond the current eight-month cycle. The new residency arrangement will be modeled after the Dinos’ micro‐artistic practice of the artist-in-residence. In a statement, the team said: “We are excited to see how this new arrangement will integrate the art and design disciplines, providing long-term support to the artist’s work and career.”\n\n\nThe Metropolitan Museum of Art (MoA) has partnered with the Wolfsonian in New York to present the work of one of the most celebrated African American artists of the twentieth century, including Grandal Banes (1940–1992), Warren Mitchell (1948–2000), and Rayyane Brown (1948–2001). The collaboration brings together the work of the artist‐in-residence, Casey James Cahn, in the exhibition “The Wolfsonian at the Met.”“The Wolfsonian at the Met.", "The next Biennial should take place in 2021 and the first in 2020. Of course, there are also the thorny issues of financing and the development of a programme that has been beset with delays, overruns, and a lack of co-ordination.  However, the UK’s involvement in the war on terrorism and the resurgence of rebellion in the Middle East are crucial issues for the British state to address and a new exhibition dedicated to the history of the Biennial is expected to open in London in the autumn of 2022. If the fate of the Biennial is to be secured, at least one hundred artists will be invited to participate in the first edition which is being organised by the London-based, Newart-backed organization Big Issue Art and will run from March 5 to March 8, 2020. “The future of our cities and nations is at stake,” said Jeremy Deller, director and chief curator of the London-based biennial, Big Issue Art. “We will be working closely with government and the creative industries to ensure we have the technical and financial support to use contemporary art to push back against the radical ideas of the far-right. We will also continue to push for an open and tolerant", "The next Biennial should begin this Saturday, March 6, 2020, at the Brooklyn Museum, which is currently closed since March 14. The exhibition will be inaugurated by a presentation of three new works, marking the twenty-third edition of the Biennial.“The Biennial is an international platform for the production and exhibition of new art, with themes that engage with current events and challenges,” said curator and president of the Biennial, Paul Mpagi Sepuya, in a statement. “The work of the show’s inaugural group, ‘Mariner Kemper, is a true contemporary exploration of the relationship between artist and audience. It is a celebration of the ways in which artist and audience can work together to explore different ideas and different ideas combine with other artworks, their own creations and the works of others.”Kemper, a Nigerian-born, Brooklyn-based artist whose work incorporates African, African American, and Afro-Caribbean traditions, has been featured in numerous exhibitions across the United States and South Africa. In 2015, he was chosen to represent Africa at the Fifty-Eighth Venice Biennale. In 2018, he was selected to represent the United States at the Fifty-E", "The next Biennial should take place in the spring of 2021, with a theme of mensuration\u0097“Intersection of art and politics, art and political struggle, art and art.”The first exhibition to open at the museum is “What is Biennality?” curated by Ruth Mansfield and commissioned by Francis Alÿs. It is slated to open in the spring of 2021 and will be on view until February 23, 2021.The other Biennals are “Avant-Garde Theater: The Story of Art in the Eighteenth Century” (2019), “Art and Politics in the Nineteenth Century” (2019), and “Objects and Human Beings: Modernism and the Birth of Western Art” (2019).Each biennial will be inaugurated by a selection of works by each of the four finalists, including Avant-Garde’s Jean-Luc Rieu, the work of fellow protestants Jacques-Louis Jeu, and the work of sculptor Frank Gehry. The competition itself will take place in the spring of 2020.One hundred and twenty-seven artists will receive a cash prize of $50,000. The artists selected for the", "The next Biennial should take place in 2020. “I have been involved in the production of exhibitions for twenty-five years, so I am very comfortable with the challenge of producing one in twenty-two years,” said Mzulewicz. “The Biennial will be a celebration of life and the creative process, and will include various exhibitions and performances, as well as other programming that will be inspired by the themes of the exhibition.”Rest in peace, Milla.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is planning to begin welcoming visitors back to its Los Angeles outpost after a major $200 million renovation and expansion project, which is slated to be completed in 2021. The overhaul will include the relocation of the museum’s permanent collection to a new home in a building adjacent to the museum on West Sixth Street, the relocation of the institution’s outdoor programming, and the construction of a visitor entrance on the third floor of the complex.“After a thorough review of the Museum of Modern Art’s new location, we have decided to re-open the Museum of Modern Art—as an institution dedicated to the art of the twenty-first century—in Los", "The next Biennial should take place in the fall of 2020 at the Art Institute of Chicago. The theme of the event is “Performances and Structure” and the exhibition will present twenty-two works by local and international artists. \n\n\nThe National Gallery of Art in Washington, DC, has appointed Anne-Marie Cole as the new deputy director of the institution. Cole, who has served in the position since August 2019, will assume her responsibilities on January 10, 2021.“We are thrilled to welcome Anne-Marie to the staff and the National Gallery of Art,” said David Mullen, the museum’s director and chief curator. “Her expertise and passion for art and the National Gallery of Art will make her the perfect fit for the role of deputy director.”Cole’s new responsibilities were outlined in an internal memo sent to the museum by director and CEO Matthew Teitelbaum on June 14, 2019. “Anne-Marie’s appointment will help us continue to present a work-life balance in which we have the opportunity to explore new ways to support and present work. We are confident that she will continue to deliver on the vision of the National Gallery of Art as a national leader in", "The next Biennial should take place in Honolulu in 2022.\n\n\n\n\n\nThe Museum of Modern Art (MoMA) in New York has received a $3 million donation from the Alfred P. Sloan Foundation. Founded in 1989 by philanthropists Calvin and Nancy Sloan, the foundation is a division of the family of Alfred P. Sloan, the late founder of the insurance company AIG. The gift comes with a $1 million contribution from the Alfred P. Sloan Foundation for the Visual Arts. The foundation is also collaborating with the Estate of Alfred P. Sloan to launch a new online education platform, the Alfred P. Sloan Seminar on Art and Art History, which will be hosted by the Alfred P. Sloan Foundation in June 2019. The eight-month-long event will focus on the history of art through programming that will be inspired by the Sloan–Kahn Collection, and will invite visitors to view the collection and to learn about the foundation. The first edition of the Seminar was held in February 2019.\n\n\nThe Museum of Modern Art (MoMA) in New York has added two new artists to its curatorial staff: Ryan McNamara, an African American artist who works in painting and sculpture, and Alex Katz, an American painter who", "The next Biennial should take place in 2030, with a final exhibition scheduled for 2021. The reopening of the Biennial, which has been called a “monumental achievement,” will mark the first time the pavilion will be open to the public since 1975.\n\n\nThe Metropolitan Museum of Art (MoMA), which began removing artworks by contemporary artists from its collection in January 2019, has filed a lawsuit against the Los Angeles County Board of Supervisors, accusing them of breaching the city’s contract with the institution by amending the institution’s longtime lease agreement with the Tudor Revival-era building in Mid-City. The lawsuit, which was filed on Wednesday, claims that the changes, which were made in June and were intended to “enhance the museum’s urban setting and landscape,” are void because they violate the “purchases and the lease agreement.”The lawsuit also claims that the board is attempting to “straddle the museum’s property line,” and that the alterations violate the contract between the museum and the tenants. The lawsuit seeks compensatory and punitive damages. The renovations, which were made possible by a $8 million expansion", "The next Biennial should take place in New York City (2019). The third and final cycle of the museum will be held in 2020. The museum will open in 2021. The institution previously staged two triennials, 2016 and 2019.  HELEN HARVEY: The Life of Other People Monogatari Series 2018The work, which explores the relationship between memory, memory, and fiction, is currently on display in the exhibition “Memory and Memory: The Life of Other People” at the National Museum of Norway. The show will be hosted by Helene Huffman, curator of modern and contemporary art at the National Museum of American Art of Art, in partnership with the Royal Academy of Arts. “The Life of Other People” is a reconstruction of the final fifteen years of American photographer Helen Harrison’s life. This effort was borne out of a conflict between the artist and the museum, which was forced to close to the general public in 2011. In the book, Harrison describes her search for images of her late husband, William, who died in 2008, and their son, William Jr., whom she adopted when he was three. The work, which includes images of their lives, their works", "The next Biennial should focus on the concept of the painter’s work as a tool for social change. It also should include the museum’s relationship with the Peter Paul Rubens Foundation, the Metropolitan Museum of Art, and the Whitney Museum of American Art.\n\n\nThe Metropolitan Museum of Art in New York has announced that it is opening a new center dedicated to works of American art that will draw from the collections of four of its largest institutions: the Metropolitan Museum of Art, the Museum of Modern Art, the Smithsonian American Art Museum, and the Contemporary Art Museum Houston. It will be inaugurated by a solo exhibition of works by the American artist Jane Russell.The center’s inaugural exhibition, “Jane Russell: American Art,” will include twelve works by Russell that were presented in the museum’s “Dissolving House” exhibition last fall. The event screened the work of the artist for the first time at the museum in November, with an opening reception followed by a public art installation in December. The centerpiece of the new biennial will be a new work by Russell that will be unveiled in January.“All of the pieces here are from our collection, and each of these works represents an important moment in", "The next Biennial should be on the history of the camp in 2020 and the future of the exhibition should be decided by the community. We are open for dialogue and are listening to the concerns of our community and others. We are committed to finding common solutions and solutions that reflect the diversity of our city.”The future of the exhibition was also discussed during a meeting between City Hall and the Federation Internationale de Art et de Lettres (FIA), held on March 28. Bernard Cazenov, the president of the International Federation of Fine Arts (FI), said: “After a careful analysis of the possible changes that will be required for the exhibition, the upcoming FIMB will not be able to carry out the necessary repairs without the additional funds from the City. Because of this, the City will have to decide whether to keep the exhibition in the main building or move it to another space, either on site or in a third-party facility.”\n\n\nIn order to protect the ongoing work of artist-run nonprofit art centers nationwide, the Association of Art Museum Directors (AAMD) announced on Wednesday that it will temporarily suspend the collection of works by artists such as Edward Hopper, Saru C-L Chang, and Edward", "The next Biennial should be a celebration of our eight years of collaboration with the Dublin Museum of Art as well as the years of excellence and innovation that this relationship has brought to our projects. ”\n\nBillionaire real estate developer Donald Trump has purchased the historic estate of the former site of the iconic Bishopsgate Opera House and is preparing to turn it into a massive luxury hotel and conference center.Dubai’s Ritz-Carlton is also working with the government to invest millions of dollars into the area, which has a long-standing capacity for cultural and public events. Inaugurating the venue is the building of a new museum, and it will house the international exhibition “The Art of Painting” alongside the Royal Opera House in London.Dubai’s Al Wefa Art District—a public space adjacent to the Opera House—is also expanding into a luxury shopping and dining center, and the city’s Grand Mosque is planning to add a museum to its existing complex. The Al Umayyad Mosque, where the museum will be built, is currently under construction.Dubai’s Grand Mosque. Photo: Al Umayyad Mosque, Al Umayyad Mosque, and Al Kh", "The next Biennial should be held in 2020. \n\n\nThe city of New York has ordered the removal of over two hundred works by twenty-four artists, including Doina, Ellsworth Kelly, and the late Israeli designer Tzvi Ra. The works were removed from public view in Central Park on Monday, April 16, after a group of activists persuaded park rangers to lead the way with a pick-up truck that resembled the iconic Ford pick-up.The activists, known as the \"pulley system,\" were protesting the removal of Thomas Paine Jr.'s American Ghetto, a modern-day version of the 1930s American Ghetto, in Central Park. They said that the Ghetto, which is located in an area known as the 'Census Park,' created a harsher environment for African Americans and other marginalized communities.Activists also claimed that the park’s public sculpture “Atlas”—a monument commemorating the Holocaust that has drawn more than one million visitors since it was installed in 1995—was a thinly veiled attempt by the city to erase the legacy of slavery. The statue commemorates the seventy-two thousand people who were murdered by the Nazi regime in the Nazi-occupied territories of Poland and the", "The next Biennial should take place in 2021. Commenting on the upcoming event, the committee said: “The ongoing crisis in the world we live in, which has seen unprecedented upheavals in the last few years, has brought into sharper focus the urgent and interlinked needs of our world. We are now faced with the task of rethinking our lives and our world, of creating greater harmony between the physical and the spiritual worlds, of building bridges across cultures and between peoples. We have also come to the conclusion that the future of our species and of the planet would be much better served if the biennial was held in the same city where it all began.” \n\n\nThe Pérez Art Museum Miami (PAMM) has appointed Evan Williams as its next director and CEO. Williams joins the institution from the Florida International University (FIU) in Miami Beach, which he has led since 2013. During his tenure at the university, he organized the institution’s first major fundraising campaign and helped PAMM raise nearly $1 million, which was used to launch the Pérez Center for Contemporary Art and the Pérez Art Museum Miami. “I’m excited to be working with Evan Williams, a visionary", "The next Biennial should be held sometime in the spring of 2020. “With the ongoing efforts of the festival to engage with contemporary issues in art, culture, and society, the future of Art Basel is very much alive,” said Tom Scott, chairman of the board of trustees. “We look forward to seeing how the exhibition and our new partnership unfold and to collaborating with the creative community, artists and curators, and with you. We are enthusiastic about the exhibition’s first-ever US exhibition at the Museum of Modern Art, which will be held in the fall of 2020. We believe that this exhibition will draw new and more advanced audiences to the exhibition, and it will strengthen Biennials’ reputation.” \n\n\nItalian artist and designer Enrico Dori, a pioneer of the Italian post-modernist tradition, has died at the age of seventy-three. In his own words, his work is “indispensable for our times.” Dori was one of the first artists to use the word “postmodern” to describe the dominant political and artistic view in Italy in the early 1990s, and in the same way that Giacomo Cattelan and Stef", "The next Biennial should be in Tokyo in June 2020. The twenty-third Biennial will be held in Berlin in November 2021. The twenty-eighth Biennial will be staged in Tokyo in March 2022. The twenty-ninth will be staged in the United Kingdom in February 2022. The twenty-ninth, which will be held in March 2022, will premiere in June 2020.The twenty-eighth will have a $500,000 prize, with one year of support from the Alexander von Humboldt Foundation. The twenty-ninth will be staged in the city of Württemberg in April 2021.The thirty-ninth Biennial will be held in St. Petersburg from April 25 to April 29, 2021. The thirty-ninth will be on view in the Russian capital from April 30 to April 29, 2021. The thirty-ninth will be staged by the Museum of Contemporary Art St. Petersburg and will take place in a new exhibition space designed by the Russian architect Alexander Lutsenko. The thirty-ninth will be staged in the Moscow Olympia from April 29 to April 30, 2021. The exhibition will be multi-media, featuring works by forty-five artists, including F", "The next Biennial should be held in 2020, with the exhibition to be held at the museum in 2021.  The theme of the biennial is “Toward a Moral Theory of Art,” and the twenty-first edition of the biennial will be held in 2022. In 2020, the biennial will close to the public, with the exhibition continuing to be held behind closed doors. The exhibition will be on view on November 4.\n\n\nThe Museum of Fine Arts (MFA) in Boston has named Rebecca Stein as its next director. Stein comes to the MFA from the Massachusetts Museum of Contemporary Art (MMCA), where she has served as deputy director and chief curator since January 2019. Previously, she was the deputy director of curatorial affairs at the Berklee College of Music and the London-based curatorial research organization Goldsmiths.“Rebecca’s accomplishments and passion for art and the MFA make her the perfect candidate to lead the MFA’s cultural wing throughout the 2020s,” said museum director Daniel H. Weiss. “Her work has made her a strong choice for this important role in the MFA’s mission to present and present art in such a meaningful and", "The next Biennial should take place in 2021. The 2019 edition, which featured works by ten artists, was canceled after it was announced that the 2020 edition would be held in 2022. \n\n\nThe Museum of Fine Arts (MFA) in Boston is expanding its curatorial team, bringing on two new members to freshen up its exhibition-viewing and public programming. The museum is also hiring a new director of curatorial affairs. The newly appointed deputy director of curatorial affairs is Christopher Procter, who has previously served as the director of exhibitions at the Whitney Museum of American Art, and who has also helmed the exhibition program at the Modern Art Museum in New York from 2011 to 2016. “I’ve been a fan of David K. Germain’s work since I was a kid; he’s one of my heroes,” said Peter Alt, chair and cofounder of the museum. “The MFA has been very instrumental in understanding the importance of art in the city of Boston, and of how art can shape and shape our lives and our communities. We are truly honored to have David join our team and to introduce him to our visitors and the wider world.”In his", "The next Biennial should take place in the next twelve months. The next Art Basel Hong Kong should be held in the first quarter of 2020. The upcoming Art Dubai should be held in the second quarter of 2020. In April 2021, the Art Dubai will open in the fourth quarter of 2020. The 2020 edition of Art Dubai will be curated by Alexander Pope and curated by Asma al-Khadra, and the event will open at the Dubai Art Museum (DAM) in the first week of April. The event will run for twelve weeks and will feature twenty-five artists, twenty-two works by twenty-four artists, and twenty-two works by artists who represent Egypt, Ethiopia, Iran, Mexico, Nigeria, and Senegal. The 2019 edition of Art Dubai, “Away From the Urals” (HAU) at the Stedelijk Museum Amsterdam, was canceled due to the coronavirus, and the 2019 edition of Art Dubai, “Away from the Urals” (BMO) at the Museum of Modern Art in New York, which was scheduled for May, was also canceled. The 2020 edition of Art Dubai will be held at the Doha Art and Design Museum, and will be", "The next Biennial should be in 2019. \n\n\nThe Museum of Contemporary Art (MoCA), the Museum of Modern Art (MoMA), and the Whitney Museum of American Art in New York have announced their participation in the ongoing campaign to raise funds for victims of the Covid-19 pandemic. For months, activists, academics, and lawmakers have called for museums to divest from their private companies, and for city and state governments to step up to help cover the cost of “unpaid sick leave,” which some workers are seeking will be made optional. The campaigns have been led by the Service Employees (SEIU), which has been organizing for months to influence public officials, including Mayor Bill de Blasio and Governor Andrew Cuomo, who have declared states of emergency due to the coronavirus.The campaigns, which began as a grassroots effort by workers organizing at small arts institutions in the city, have since spread to include all six of the city’s boroughs, including Manhattan, Brooklyn, Manhattan East, and Queens, and are supported with $5 billion in emergency aid grants from the US Conference of Mayors and $250 million from federal healthcare reform funds. By virtue of their inclusion in the campaign, these five institutions are eligible", "The next Biennial should open in 2020 to mark the 40th anniversary of the Tokyo Metropolitan Museum of Art, and will also showcase selected works from the new exhibition series, which is curated by Masato Kato and curated by Kunihiko Kawamura. The exhibition will include works by artists including Manfred Kohn, Laura Owens, and Helen Frankenthaler.The theme of the 2021 edition of the Biennale is “The Concept of Life,” and will focus on “the critical role of art in addressing the concept of life. The biennial will be inspired by the themes of life and the environment: the sacred, the physical, and the material.” The commission was made by Tokyo Triennale director Toshi Yoshioka and architect Takashi Takeda, who serves as director of the Shizuoka Museum of Art.\n\n\nArt conservationists in Cambodia have launched a campaign to hold multinational companies accountable for their business dealings with the country’s former president, Thein Racha, and his inner circle after a series of violent clashes between Racha’s security forces and protesters swept through the capital on April 24, prompting international condemnation.According to the South China Morning Post, the campaign is led by the Cambodia", "The next Biennial should take place in 2021 and will be hosted by the Smithsonian’s National Museum of Art. The 2019 exhibition was also curated by Joao Rocha, who will return to the curatorial chair, and will be presented by the Los Angeles–based artist and curator Hélio Oiticica.The biennial will explore how Saul Williams’s surrealistic paintings and sculptures, which are based on his experiences as a slave in the Southern United States, have been adapted to live in cities and to the arts. Williams’s work will be presented in sculpture by Oiticica.“After a career that spans modernism, abstraction, and speculative poetry, Hélio Oiticica has become a pioneer in the field of contemporary art,” said National Geographic’s director, Chris Mills. “In his recent exhibition ‘New Sculpture’ at the Museum of Fine Arts in Washington, D.C., Oiticica makes for an unforgettable example for us as artists, sculptors, critics, and curators. He is an artist who we look up to and admire, and whose art speaks volumes about what it means to be a modern artist.”Born in", "The next Biennial should be held in February 2020. The Biennial will then be able to present an exhibition of work by artists, in order to draw the attention of the public to the exhibition programs of the surrounding art museums and to the works of the artists in the exhibition. The biennial will not have the same format as the previous one, but will continue to be a platform for the exchange of works of art. The first Biennials were held in Paris in the spring of 1988 and in the autumn of 1988 in the towns of Lyon and Saint-Tropez.  The next one will be held in May/June 2020 and will be organized on a similar basis.\n\n\n\n\n\n\n\nDavid McAllister, a British artist and winner of the Prix de l'Art et d'Hiver in the United States in 1998, has died at age eighty-four. His art is comprised of more than three thousand photographs, prints, drawings, sculptures, and collages. These works were acquired through his association with Piet Mondrian, a British American’s art dealer who is best known for his collaboration with Cooper-Hewitt; by the New York–based collector Peter Engdahl, an influential", "The next Biennial should be held in 2021, the inaugural year of our new five-year plan, and will be organized in collaboration with local and international artists and institutions.The biennial will include the exhibition of a new work by artist Tommi Peić, curated by the Tommi Peić Foundation, and will organize the artist’s first exhibition in the United States. The festival will also examine the experiences of museum professionals, as well as the work of contemporary artists in collaboration with the Miller Foundation, the Ethnopast Gallery in New York, and the David Burton Museum in Akron. The museum will partner with the Museum of Contemporary Art, Philadelphia, and the Metropolitan Museum of Art, New York, to bring the project to life.\n\n\nJavier Téllez, the Mexican-born, New York–based artist who has been in the works for two decades, has died at age seventy-four.Born in Mexico City in 1931, Téllez arrived in New York City in the 1940s from San Ysidro, a city of the same name in northern Sinaloa state, where he grew up. The artist then moved to New York, where he enrolled in the City College of Art", "The next Biennial should be held in 2021.\n\nThe National Museum of Greek and Roman Art in Athens has received a $10 million gift from the late Greek philanthropist George Kalogeras. The gift was made by his son, George Kalogeras II, to the institution in honor of their father's legacy. Kalogeras passed away in 2001 at the age of eighty-nine after a long battle with cancer. The gift includes $8.5 million in loans, which are to be repaid in installments, and includes $3.5 million for the construction of a new building to house the collection.George Kalogeras was an American American businessman, philanthropist, and collector who was an integral member of the Greek-American community in America. He sold early works by some of the most important artists of his generation, including George Barozzi, Gyorgy Aleksandrov, and Pindar Meneghetti, and helped establish the Pindar Museum of Art in Parma, Italy, which opened in 1972. In addition, he amassed a collection of thousands of works by lesser-known contemporary artists and established a successful gallery. George Kalogeras is survived by his son, George Kalogeras", "The next Biennial should be held in 2022. The theme will be “The Body.” Pilar Corrias, director of the National Museum of Modern Art in Barcelona, said: “I feel really good about the future of the Biennial. The development of the Biennial is very important for the future of Barcelona and the city of Barcelona as a whole. The new project will give people an opportunity to see the museums in a new way and will give the community a chance to see the collections in new ways.”\n\n\nThe Nineteenth Venice Biennale has announced that it will not be held in late October or early November next year. Instead of reverting to the theme of the past months of the art world’s yearly exhibition, the exhibition will focus on examining the contemporary art of the twenty-first century.The exhibition will take place at the Venice Architecture Biennale, which is currently undergoing a renovation, in Venice, Italy. The redevelopment—which is expected to take up to two hundred thousand square feet of the museum, including the galleries, the studios, and the exhibition floor—is intended to make the building, which has been vacant since 2015, more accessible to the public.The renovation project, named the", "The next Biennial should take place in September 2021.  The panelists for this year’s show are: Dr. Zaki Yilmaz, an Israeli curator and educator; Dr. Yana Gershon, a curator and educator in Tel Aviv; and Rina A. Hirschhorn, a curator and educator from Los Angeles, California. The 2019 edition of the show was curated by Dr. Omer El-Khoury. The 2019 exhibition included work by forty-eight artists, including Omar Barlow, Sara Ben-Meir, Sarah Hurwitz, Yelena Grazhdanskaja, Lina Hatfield, Sara Lemper, Nina Liebman, and Michael Martino. “I am really excited by the response to the show so far,” El-Khoury told the Art Newspaper. “The exhibition is an important step in reflecting on the Arab-Israeli conflict in a way that makes sense for the seventy-three years of its existence.” The exhibition is also aimed at raising awareness of the challenges that many Palestinians face in the Occupied Territories and is organized in", "The next Biennial should take place in the spring of 2021. The inaugural exhibition, “Seth Godin: A Retrospective,” will showcase six works by the artist. His first show in the United States was in Los Angeles in 2007.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of sixty rare prints made by artist Augustus Saint-Gaudens. The works will go on view at the Saint-Gaudens Museum of Art in January 2021. The gift includes a set of Saint-Gaudens’s first three works, The Death of Man and the Death of Man’s Environment, 1928, and The Death of Man and His Environment, 1934.“We are thrilled that the Saint-Gaudens Museum will continue to represent the artist’s work by bringing these works to light in the Museum of Fine Arts,” said museum director Rachel Bove. The works, which were produced in a series with his wife, Jean-Paul Verhulst, will be on display in the Saint-Gaudens’s recently completed expansion project, the Saint-Gaudens Museum of Art.“Inaugur", "The next Biennial should take place in 2022, and the next in 2022, and the next in 2022. The exhibition will be organized according to the artist’s will.  The event will also be tailored to highlight the current state of Hong Kong, focusing specifically on the Hong Kong pavilion, which will be a collaboration between the Hong Kong Museum of Art and the Hong Kong Contemporary Art Museum, and will be co-organized by the Hong Kong Arts Council and the Hong Kong Asian Art Museum. \n\n\nThe Museum of Modern Art (MoMA) in New York has launched a new platform dedicated to the work of the late British illustrator Richard Linklater. Called the Richard Linklater Center for Contemporary Art, the initiative aims to draw attention to issues of contemporary art and the role of artists in the contemporary era. The center will host exhibitions and residencies dedicated to Linklater’s work as well as a digital arts library, Richard Linklater: Connections, which will be on view until April 26.  “Linklater created a distinctive and influential art form that has endured to influence contemporary art and our world in ways he couldn’t have dreamed of,” said Richard Levy,", "The next Biennial should be held in 2020 and will consist of twenty four artists, seven filmmakers, and one historian. The theme will be “The Changing Face of Art.” The first exhibition organized under the new guidelines will be “The Art of ‘bioart.’”\n\n\nThe Museum of Contemporary Art (MoCA) in New York and the 11,000-work Seattle Art Museum have partnered to create a new public gathering space for contemporary art. The new space, which will be called the Contemporary, will be located in the former site of the old Pacific Electric Museum (PEP), which is currently being renovated and expanded by the Seattle-based architecture and design firm Whitechapel Gallery.Joining the museum in the incubation phase of the renovation project are the Seattle-based artist-run nonprofit Contemporary Arts, the nonprofit arts incubator and fundraising group the Fund for Contemporary Arts, and the nonprofit arts-in-district The Artist's Project, which will host a series of public performances and residencies.“The partnership between MoCA and Seattle’s Contemporary Arts is a natural extension of the Museum’s art and design philanthropy program,” said David Kordansky, president", "The next Biennial should take place in 2020, and the next will be held in 2021. The next iteration of the Detroit Art Museum will be held in 2022, and the next installment will be held in 2024.  I have been a fan of the museum for over twenty years now. I first visited it in the summer of 1987, when it was still a small, city-funded institution, and was a member of the first conference devoted to the museum, held at the museum in 1994. In 2004, I was awarded the National Museum of American Art’s prestigious David C. Driskell Award for Excellence in Art. The museum has also won several notable accolades over the years. In 2009, it was awarded the National Medal of Arts, the coveted accolade bestowed by President Barack Obama in recognition of its contributions to advancing the art of our time. In 2012, it was awarded the National Medal of Arts for its contributions to American Art. In 2017, it was chosen as the winner of the National Medal of Arts, the prestigious honor bestowed by President George W. Bush. In 2018, it was awarded the Medal of Honor. In the 2020s, the museum underwent major renovations as part of a $500 million expansion and renovation", "The next Biennial should take place in 2020. Below is a chart of the twenty-five years of the UCF Biennial, which is not an official count but a compilation of years given by the institution.  As of the date of this article: Current events: 2019: Best Picture: Cindy Sherman’s The Cat in the Hat, 2018: Best Director: Claudia Castelli’s The Double, 2017: Best Actress: Mary Lynn Rajskub’s Metamorphose, 2014: Best Actor: Michael Douglas, 2014: Best Actress: Olga Linkova, 2013: Best Supporting Actor: Odin’s Son Philip Garrels’s Between the Sun and the Moon, 2012: Best Supporting Actress: Maggie Gyllenhaal’s The Iron Lady, 2011: Best Director: Hector Araña’s Espacio di l'Arte: The Power of Art, 2010:  Artistic Collaboration: Marc-Olivier Bardet’s The Story of a Model, ", "The next Biennial should be in 2021. The first was in 1996. The second was in 2005. The third was in 2005. The fourth was in 2013, and the fifth was in 2017. The festival has been listed on the BMA website as \"on hold\" since March 3. The exhibition will commence on May 16 and run through September 27.  For the entire biennial, the BMA will offer free admission, with the exception of the Hong Kong pavilion, which will be free to the public through September 22.  The British pavilion will be open to the public from September 21 to September 27. The Hong Kong pavilion will be open on September 22. The Shanghai pavilion will be open to the public from September 21 to September 22. The Vienna pavilion will be open to the public from September 22 to September 27. The Geneva pavilion will be open to the public from September 21 to September 28.  The New York pavilion will be open to the public from September 21 to September 27. The Reggio Emilia pavilion will be open to the public from September 22 to September 28. The Wangan pavilion will be", "The next Biennial should start in October and will be hosted by the museum. The show will feature work by sixty-three artists and will feature works by thirty-nine artists. This year’s theme should be “The Body and the Body Media.” The full list of artists participating in the show is as follows: Alberto Burri (Italy)Arte Povera (Italy)Michaelangelo Antonioni (Italy)Robert Rauschenberg (Austria)Cécile Blondel (France)Patrice Favre (France)Dario Brindisi (Italy)Dario Cattelan (Italy)Dario Cui-à-llo (Italy)Dario Giunta (Italy)Dario Gristo (Italy)Dario Igualdi (Italy)Dario Lanata (Italy)Dario Lisi (Italy)Dario èsogna (Italy)Dario Popera (Italy)Dario Poytoni (Italy)Dario Rosso (Italy)Dario Scarolo (Italy)Dario Tavella (Italy)Dario Veccarlo (Italy)Dario Witte (Italy)Dario Zingarelli", "The next Biennial should be held in 2022, said the festival’s artistic director Stefan Frankel. The organisers are already planning to expand the fair to include a revised section on photography, a section devoted to film, and a section on the fashion industry. However, their plans have been put in doubt after the German federal interior minister, Joachim Gauck, announced on Tuesday that certain federal state museums (Bundesarchiv, the Ludwig Museum, and the National Museum Carlow) were not eligible to host the twenty-sixth edition of the fair. A committee chaired by Gauck decided to suspend the event indefinitely, and the state government’s interior minister, Heiko Maas, declared that the decision was “legal and binding.”While the government claimed that there was no legal reason why the museums would not be able to take part in the event, Berlin’s Federal Criminal Office (BKA), the Federal Office of Culture, and the BKA’s Legal Office are currently working together on an appeal for the state’s museums to participate. The appeal pits the museums against each other, with the BKA arguing that the BKA has already granted the state a total of €623", "The next Biennial should focus on synthesizing the multidisciplinary approach of the festival to present a new story of our planet, with a view to shaping the future through a vision of our place on the digital and biological landscape. ”The opening of the current event will take place on September 1, 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed David Breslin as its new associate curator of modern and contemporary art. Breslin comes to the MFA from the American Folk Art Museum where, since 2015, he has worked as a curatorial assistant. He succeeds Christine Lamy, who stepped down from the position in July, and will begin his position in November.“David is a distinguished scholar, a scholar of twentieth-century art and modernism, and a dedicated teacher,” says Elizabeth Clark, the museum’s director and CEO. “As he moves into this new role, David has demonstrated an ability to bring together multiple disciplines and approaches in a way that is both rich and innovative.”Breslin previously worked at the Museum of Modern Art (MoMA) in New York and at the Metropolitan Museum of Art in New York; the Museum of Contemporary Art (MoCA", "The next Biennial should be held in the spring of 2021. “This year’s event will be an international celebration of some of the most important new works of art,” said Alexander Lubell, executive director of the Art Fund. “We hope that the exhibition will be the catalyst for a new dialogue between the region and the rest of the world.” .\n\n\nThe Pérez Art Museum Miami (PAMM) has released the 2018–19 schedule of exhibitions and special projects that will feature works by seventy-nine artists and collectives from fifty cities across the globe, including Abu Dhabi, Paris, London, New York, and Seoul. The 2020–20s edition of the Pérez Art Museum Miami (PAMM20), which will be held in the same building as the museum, will inaugurate with “Santiago Cortés” (Santiago Cortés Contemporary Art, 2020) and “Sonia Castellani” (Sonia Castellani Contemporary Art, 2019) and will conclude with “Feminine” (2018). The project will celebrate the fifteenth anniversary of the museum, which opened in 2006 and has more than eight thousand works by fifty artists", "The next Biennial should be in 2020.”\n\n\nThe Miami Beach Museum of Art (MBMA) has received a gift of more than 1,000 photographs by American photographer Frank Gehry, which were recently donated to the institution by his son, Ben, who was recently diagnosed with stage 4 pancreatic cancer. The gift includes works by thirty-six artists, including Robert Irwin, Frank Polman, Charles Ray, and Frank Gehry’s daughter and her husband, Thomas Gehry, and includes a selection from the Gehrys’s collection that was created for the exhibition “Frank Gehry & the Streets,” which was staged at the museum during its inaugural season in 2011.“Our collection is truly an American treasure,” said David H. Peña, MBMA’s senior curator and director of exhibitions. “Thanks to the Gehrys’ generosity, MBMA has added a number of works that will further this vision and future generations of artists. We are thrilled that the Gehrys family will be able to share this work with the public.”While Thomas Gehry was diagnosed with the cancer in 2000, his family had long hoped that the cancer would resolve itself over time. In 2009,", "The next Biennial should be held at the Academy of Fine Arts, Tokyo, in October 2020. The exhibition will be curated by Adam Kiskely’s group.\n\n\nThe Pérez Art Museum in Madrid has been gifted a major works of art by the Dutch master Joost Oosterhuis. The museum received the works, which were donated by the author in memory of his son, Michael, who passed away from the devastating birth defect Belexar-Congenitalis, in May 2019.The gift of the two works, which were created by the artist during his Weltkulturen, or cultural revival, in the 1980s, was made through the generosity of his daughter, Ven. It was also proud to say that the museum has always been open to the public and always had a collection of contemporary art, including works of Belexar-Congenitalis, an exhibition of his early 1950s work, and the artist’s first exhibition at the Pérez Art Museum.According to the New York Times, the Pérez Art Museum was founded in 1976 and has a collection of more than 3,500 works. Its holdings include The Intersection of Visuality", "The next Biennial should focus on the role of art in challenging the power structures that perpetuate racial, economic, and environmental inequalities and create the conditions for the spread of epidemics such as HIV/AIDS. Other items on the agenda are the creation of an emergency fund for the arts and the expansion of the social justice campaign in the form of direct grants to specific communities. The next edition of the Biennial will be held at the Noguchi-Parsonsnoye in Warsaw in November 2021.\n\n\nArt and Sexuality at the Venice Biennale has announced that it will not include a final work by the Italian artist Ursula von Rydingsvard in its 2021 edition, opting instead to suspend the exhibition entirely. The decision follows the controversy surrounding the exhibition, which drew criticism for excluding works by non-artistic groups such as Cà el d́bovio and Marcela Meneguzzo, and was sparked by a question posed by activist Chiara Masotti, who wanted to know why the exclusion of works by gay and bisexual artists would be offensive.The exhibition’s organizers cited the artist’s 'excessive and hurtling self-reflection,”” which they said was a", "The next Biennial should take place in 2021. The second, in 2022, will focus on “artistic exchanges that encounter the fields of philosophy, art and architecture,” and the third will be a “post-artistic narrative.”The exhibition will be organized in three phases: 1. The exhibition will open in the window of the Shriners’s Science, Technology, and Society (STS) building in downtown New York on November 18, 2019. The exhibition will last for three days and will run through December 5, 2020. 2. The building will host the Biennial “Post-Art®,” a series of talks that will feature work by artists that have experienced or are currently experiencing the exhibition, and will be closed to the public for a period of fifteen days from December 14 to December 21, 2020. 3. The Biennial’s first section, “Artistic Excavations,” will be held from December 16 to December 23, 2020. The second section, “Artistic Experiments,” will be held from December 23 to December 27, 2020. “Post-Art: Art and Design” will be led by Joël", "The next Biennial should be held in 2022.\n\n\nFrench artist Rémi Île Moin, a well-known advocate of modernism and a pioneer of the contemporary, has died at the age of eighty-eight at his home in Paris. The winner of the Prix d'études d'art contemporain (in 1978 and 1984) and the Prix d'études du monde (in 1981 and 1986) in 1976 and the 1971 and 1976 Prix de l'Amiti-Cochereaux (in 1973 and 1976), the artist has been called the father of French modernism.Born in Jean-Baptiste-de-Laye, Paris, in 1932, the son of a socialist Jewish father and a Protestant mother, Île joined the Communist Party at age sixteen and served as a member of the Youth League until he was eighteen. After graduating from the Parisian Polytechnique, he studied with Pierre Bourdin at the Sorbonne in Paris, where he eventually studied under Pierre Merleau-Ponty at the Bibliothèque Nationale in Paris, and eventually became a pupil of Courbet and Graf von Aachen. After moving to Geneva and studying with Jean-Luc Godard"]