["The next Biennial should begin with a tour of the grounds, and should include an exhibition of works by the biennial’s artists. To add to the theme of the exhibition, the next edition of the exhibition will focus on the history of the exhibition, and will also incorporate a reading of the biennial’s founding text.  The exhibition will be organized as follows: The Penguin Biennial MADE IN LONDON will present the first show at the new venue, MADE IN LONDON, on November 24. From October 27 to November 28, the floor of the new building will be covered with sculptures by more than forty artists.The inaugural exhibition features work by forty-five artists, including Gino Nanni, Eileen and Michael Maizels, David Sirota, Lee Lehr, Mark Halperin, Montague Meehan, and Stéphane Mera, and will run through March 22. The exhibition’s two-hundred- and-sixty-ninth iteration of the show will be on February 25. For the past few years, the museum has been working on a renovation of its mid-19th-century building. The project, which is part of", "The next Biennial should be held at the Alexander Graham Hull House, London, in 2020. In an update for The Guardian, Julia Hart wrote about the upcoming show: “It is a triumph of modernism to have given way to a new and interesting kind of art, in the very space of a century. Art historian Nick Hornby has called it ‘a dramatic return to our past.”  In an update for Artforum, Alexa Cooper-Hogg wrote about the upcoming exhibition at the New Art Museum: “Closed until March 19, the sixth edition of the Museum of Contemporary Art Shanghai will return in March 2021, when it will be closed for a minimum of three months. The first exhibition will be ‘Reclaiming the Imagination: Art and the Walls’ in April, followed by ‘Live Art: New Yorker’ in November, and the last one will be ‘What is Modern?” in March. The 2020 dates for the next edition have yet to be announced.\n\n\nThe British artist, designer, conceptualist, and educator David Hockney—a prolific photographer who was among the first to incorporate photography into his", "The next Biennial should be held in 2020.”The Bjork Foundation, which is based in Oslo and is a philanthropic organization that supports the research and conservation of contemporary art, recently received $2.6 million from the Bjork Foundation for the Arts and the Bjork Foundation for the Humanities for a new series of exhibitions, “Avant Garde,” which will open at the Bjork Foundation in 2021.The Bjork Foundation was founded in 1988 by the Swedish architect Gunnar and Marian Bjork, the founders of the home décor company Folde. The foundation will receive $2.6 million from the Bjork Foundation for the Arts and the Bjork Foundation in 2021.\n\n\nAs the number of people infected with the coronavirus continues to dwindle and the number of cases in the United States increase, museums and other public spaces across the country are revamping their exhibition-viewing experiences in an attempt to curb the virus’s spread. While many are working to prevent people from going to and from the spaces, others are encouraging visitors to stay home and prepare for lengthy lines. As the coronavirus continues to spread, more and more institutions are implementing measures to restrict public gatherings and to test for the", "The next Biennial should be held at least six months from now.”Arts critic Gottfried Riescher, who curated the exhibition “Music and the Body,” in Lerma, Germany, said: “The exhibition was born of a long-standing desire to collaborate with other countries in a way that had not been possible since its inception. At the same time, the exhibition became an extension of the artist’s life. It is this act that made the exhibition so special and valuable to me. One of the reasons I wanted to return to Belgium was that it was the only country I could return to. The 2015 event is the culmination of my five years' experience in the field.”\n\n\nThe National Museum of the African Diaspora (MoAD) in Washington, DC, is launching an initiative to bring together twelve African American artists from across the country to form a new quarterly magazine. Titled The African Contemporary, the eight-issue biennial will feature work by thirty-seven artists and will feature photography, video, sculpture, performance, installation, installation, printmaking, painting, and photography in the United States.“In a time when it is increasingly difficult for museums to promote and engage with", "The next Biennial should introduce a new level of scholarship, deepen the public sense of the Italian West, and present a new vision of the psyche.\n\n\nThe Museo de Arte Contemporani (MASC) in Madrid, the National Museum of Contemporary Art in Florence, and the Museo de Arte de Madrid (MASM) in Madrid have announced that they are collaborating to create a new museum dedicated to the cultural heritage of East-Central Europe. The Art Newspaper reports that the three institutions will jointly develop a master plan to revitalize the region’s archipelagos. The plan’s first phase would consist of the reopening of the three institutions—which were closed for more than a decade due to the pandemic—with the strategy being to create a new museum dedicated to the collections of the three institutions within a decade.“We’re trying to develop a new museum, not a new program,” said Markus Knost, director of the State Museum of the Arts in Madrid and an emeritus professor of the art of art at the University of Gothenburg. “The goal is that in ten years the three organizations will be recognized as a single museum. The two", "The next Biennial should be held in 2022, when the museum will celebrate its thirtieth anniversary, and several years from now, when the museum will commemorate its centenary.\n\nBickey Gallery is an independent arts space located in the historic district of Grafton, London, and the Chelsea neighborhood of London. Founded in 2011 by the award-winning artist Siân Cohen, the center provides a variety of studio and performance spaces to support a broad range of artistic projects. The artist-run space was the site of the first exhibition of work by the artist-run project known as the Grafton Art School, which began in 2006, and has hosted previous editions of the Biennial.“The Biennial is such an important milestone in the artist’s twenty-year history as a curator,” said cofounder Siân Cohen. “It is beyond belief that a museum can produce art of this quality, and yet build it up to such a high standard. We are committed to taking great risks and moving the exhibition in ways that prove we are spending time and energy to develop the exhibition, to develop the project, and to develop the artist. We believe in what we are doing and are in a position to", "The next Biennial should take place in 2020 and the inaugural edition in 2021. While the dates of the next event are yet to be decided, the venue will be decided by a jury comprising Nielsen, the Riga-based biennial’s artistic director, Katja Neesham; Hildur Bjarnadæk, director of the Institute of Contemporary Art in Oslo; and Oliver Haus, director of Frieze. The 2019 edition, which premiered at the Riga Museum of Fine Arts, was canceled last week after the pandemic.\n\n\nThe Palace Museum in Riyadh, Saudi Arabia, has announced that it will reopen in the coming weeks—after a temporary closure due to the coronavirus pandemic ended in February—and in March, following a temporary suspension in March and April. The institution will also begin a phased reopening in April.According to the Art Newspaper, the Palace Museum was given a $6.8 million loan from the Saudi Arabian government in February, which will allow the institution to continue operating, but it will not be able to keep the museum open through May 22. The loan will allow the Saudi Arabian government to secure the financial backing for the construction of its new AlUla Institute for Islamic", "The next Biennial should be a series of exhibitions that mixes original and staged works that include new research, new staging, new materials, and new performances. The second biennial, “The Future Is Not the Present,” will be staged in October.The 2019 edition of the festival will be held in the Tohoku region of Japan, and will feature new works by thirty-three artists. The Japanese government has allocated $1.2 billion for the 2020 edition of the event, and Kyoto has pledged $600 million. \n\n\nThe Museum of Modern Art (MoMA) in New York has announced its representation of the artist-based nonprofit organization P.A.I.N. (Prescription Addiction Intervention Now), which has served as a platform for artists fighting against the opioid epidemic by giving them medication to treat their symptoms. The organization will present its inaugural exhibition “Methics in Public Places: Drug Policy in America” at the museum in October.P.A.I.N. is one of a number of organizations that have staged demonstrations at MoMA in recent months, including the New Art Place and the New Museum, in New York, where an artist-in-residence, Rachael", "The next Biennial should include a discussion of the exploration of the possibility of a new kind of social planet. A future society capable of the creation of a new identity for our planet.”The exhibition, “Art and the Evolution of Human Life” will be at the Musée d’Art Contemporain (MCA) in Paris until March 15 and at the Musée National d’Art Contemporain (MCA) in Paris until March 16.\n\n\nThe German city of Hannover announced on Wednesday that it plans to build a new museum, artworks, and exhibition space to house the collection of the late collector Otto Frank, whose works are currently on display in the museum. The construction of the museum will be financed by the Hannover-based nonprofit organization the Frank Gehry-designed nonprofit group the Fachbau—the organization will handle the finances of the project until the end of the construction phase in 2022.“The Fachbau is thrilled by the project and the work of the museum with the project of Otto Frank,” Fachbau director Adrian Wünsch, the widow of the collector, said in a statement. “It is a new chapter in the family", "The next Biennial should be held in Tokyo in 2021. The inaugural edition of the Shanghai Biennale, held in February 2019, was marred by a major power outage and marked the first time the festival had been held in the capital. The second edition, which took place in January 2021, was cancelled owing to the coronavirus. The date of the 2020 event has yet to be announced.\n\n\nThe Dusseldorf-based art center Kunsthalle Dusseldorf (CuratorDusseldorf), which has locations in the city of Dusseldorf, the state of North Rhine-Westphalia, and Hamburg, has been granted a $16 million loan from the state of Hesse. The sum was established by German state minister of culture Monika Grütters in recognition of the institution’s contributions to cultural life in the state.“The loan will help the CuratorDusseldorf to make its proposed expansion into a new historic site in the city of Dusseldorf a reality,” Grütters said. “The future of this space is at the forefront of my discussion with the city of Dusseldorf and the city", "The next Biennial should be held in the Park of the Past, Satayama, Tokyo, in 2021. The next exhibition should take place in the Park of the Future, Kokubo, Tokyo, in 2023. The next exhibition should be held in the Park of the Future, Kokubo, Tokyo, in 2022. The next exhibition should be held in the Park of the Future, Kokubo, Tokyo, in 2020. The next exhibition should be held in the Park of the Past, Suzuki, Tokyo, in 2020. The next exhibition should be held in the Park of the Past, Suzuki, Tokyo, in 2021. SUNDAY (MIDNIGHT, TUESDAY, THURSDAY, FRIDAY, SATURDAY, SUNDAY) The artist-run nonprofit National Poetry Slam (NPST) in New York is moving to a new location, as is its online publication. Sources familiar with the announcement say the arts space will shutter to promote a reopening of the National Museum of Fine Arts in Washington, DC, in March. The museum is currently closed until March 14, following a $50 million expansion.", "The next Biennial should be held at the museum in 2020, but it might not be long before we hear more about its future. Before long, the museum will open its new, larger, more contemporary building, the new Museum of Contemporary Art (MoCA), Los Angeles, in 2020.The museum, which was founded in 1976 by the eponymous architects, was awarded the $50,000 Ericsson Prize, which recognizes a country’s architectural contribution to the art of architecture. The invitation was presented to the architect by the Ericsson Foundation, which is an arm of the Swedish Swedish company IKEA. The foundation is one of a number of organizations that are involved in the collection and preservation of art in Sweden. The other recipients of the prize are Klaus Stark, Tarja Haag, Nils Stærk, Håvard Stærk, and Ray Banerjee.The next iteration of the prize will be hosted by the Swedish state’s Ministry of Culture in Stockholm in 2022, and will be organized as follows: “The Art of Life and Death: Adapting Architecture to Life and Death,” will be hosted at the Swedish State Museum of Fine Arts (SvF) in", "The next Biennial should focus on forging new links between the Frieze and the National Portrait Gallery, the London-based arts organization. President Sir David Shawcross, who announced the initiative in March, said: “This is a moment of great change and change is not kind to the past. Art and politics are no longer left to their own devices but must engage and co-operate with the people and events of tomorrow. We need them to forge new connections and new mutual support networks.” The theme this year is “Structure and Interpretation: Contemporary Theory,” and the exhibition will focus on the rise and fall of historical ideas. The 2019 iteration of the Biennial will be hosted at the Museo Nacional Centro de Artes Plásticas in Madrid from March 5 to March 6. Candidates of the upcoming exhibition include two works by Marcel Proust, a documentary about his wife, Anne-Marie, and the artist-activist Elia Barba, as well as two works by Sergio Leone and a selection from the American artist and cultural activist Robert Irwin.Eyamatullahi, the new institution, will be situated on the third floor of the National Gallery in London and will host", "The next Biennial should be held in 2021, the end of the twenty-fourth century. “I think the next one will be a true reflection of what the art historians have been saying for more than sixty years,” said Urs Fischer, chair of the museum’s board of trustees. The museum has had ongoing discussions about the possibility of staging a second exhibition dedicated to the work of Mali’s most famous living artist, Mpagi Sepuya and his wife, Lululeph. In December 2017, Lululeph and Mali’s director, Nima A. Deoband, launched an open call for proposals for the exhibition. The next edition of the Biennial will debut in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Houston is pushing back the opening of its new $750 million expansion, which will bring hundreds of new works by fifty-three artists to the museum, by a year. The August opening was originally scheduled for 2020, and MFA president Catherine O’Neill confirmed the postponement today.“We made the decision to not open as a result of concerns around the pandemic,” O’Neill said.", "The next Biennial should be held in 2019. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of 80 artworks from the collection of David and Lucille Ball.The gift includes works by artists such as Louise Bourgeois, Tugboat and Tango, and Diana and David Johnson, and a selection of works by John Nash, including the American Townships and City Foundations.The major donation was made by David and Lucille Ball to the museum in February 2019, the month the couple died. The MacDowell Colony was named after David, who created the home in 1964 as a permanent work-study for black students in New England. The institution also hosted several ball-bending competitions, including the first and the last, in 1993 and 2001, and also demonstrated the first ball-bending contest in the United States, in 1999.The gift has raised the question of whether the museum could use more of the Ball family’s collection. The museum has been working with the MacDowell Colony since 2013 to purchase 20 of the works, and will begin the process this month. David Ball died in 1999, and the estate has maintained that his will still be with the museum. The MacDowell Colony has responded", "The next Biennial should be a celebration of living together in a multicultural and global country. Its work will be curated by the artist Anna-Kaisa Seppä, who is based in Tokyo and Honolulu. Inaugurating the exhibition will be a series of over fifty photographs by the artist including “Greater China: From Ancient Times To Present Day” (2015), which is from a special exhibition at the Museum of Modern Art (MoMA) in New York; “Myths of Modern Art” (2018), which is from the exhibition “Rendering Chinese Art” at the Contemporary Art Museum St. Petersburg in Russia; and “Daoism and the Contemporary Arts” (2018), which is from ‘Art and Politics in China’s Central Wei Province.The first show of work by the artist in this new exhibition, titled “The Birth of a Nation” (2019), is a collaboration with artist-researcher Anna-Sophie Cheung, who is based in Seoul. The exhibition will open at the National Gallery in Beijing and will go on view on August 24.\n\n\nThe Dutch government approved the first retrospective of a work by artist Daniel Van Inwagen,", "The next Biennial should take place in 2020 and will be hosted at the Museum of Contemporary Art St. Louis. The 2020 theme is 'The Joy of Painting: From the Age of the Fixation to that of the Prescription.” The biennial will be supported by the City of St. Louis and the St. Louis Art Institute (SLAS). The selection committee comprises Roberta Smith, executive director of SLAS; Claire Taggart, director of the Museum of Contemporary Art Chicago; and Jesse Tafoya, director of the J. Paul Getty Museum. The running of the 2020 biennial will begin in 2020 and will run until March 22, 2021.\n\n\nThe Carnegie Museum of Art in Pittsburgh has announced that Angela Frank will return to the institution as director in December 2020. Frank previously served as the chief curator at the Brooklyn Museum and the Museum of Modern Art. She has also worked as the curator of works at the Cooper-Hewitt, Carnegie Mellon, and the Metropolitan Museum of Art, and in the gallery program at numerous institutions, including the Metropolitan Museum of Art, the Whitney Museum of American Art, the Los Angeles County Museum of Art, and the Metropolitan Opera House.“We", "The next Biennial should take place in 2022. The third event is scheduled for 2024. The fourth is currently being organized in Zurich and will be held in an open-air museum. The fifth is currently being staged in New Delhi, but the organizers are working on creating a space in the capital for the exhibition. The seventh will be held at the Kunsthalle Basel in 2019 and will be entitled “The Craft of Trades.” The exhibition will include works by twenty-six artists, including Annemarie Zegher, Kartik Giri, David H. Kim, and Anish Kapoor.\n\n\n\n\n\nHistory of Modern Art will reopen in New York this weekend following a $250 million renovation, and on Friday, March 8, it will welcome fifty-six artists, including Anne Imhof, Rosalind Nash, Tanya Bonakdar, Nari Ward, Gerhard Richter, and Frederic Leibovici. In celebration of the reopening, the museum will host a number of special exhibitions, including “Fashion and Design in the Modern World” (Thursday, March 7–Saturday, March 10), “Art and the Modern: From the Modern World to", "The next Biennial should be held in 2021.\n\n\nThe Galleria Bicocca in Milan, Italy, has announced that it is launching a new initiative to help support local artistic producers with financial assistance. According to the Art Newspaper, the project will help produce and showcase works by thirty-nine artists in New York and New Jersey. Five hundred euros will be offered to up-and-coming artists who are working in the NYC region and will be given to them as a grant.The project, which will aim to produce a creative catalyst for local creative organizations, will include a series of exhibitions, residencies, and workshops. It will also include a public art campaign, a series of lectures, and a book.The artists chosen for the project are:Alberto Barba, Brigitte Bagnoni, Valentina Catellani, María Berrada, Lázaro Cattelan, João Pires, Claudio Cipollino, João Piero Pereira, and Paolo Ribas. The theme of the forthcoming exhibition is “The Wild and the Innocent: The Story of Art and Humanism” and is titled “Apostolic Exercises” and will run", "The next Biennial should be held in the spring of 2020. The construction site for the museum is located in the city of Algiers’s Algiers Town Center. The exhibition will be located on the ground floor of an industrial complex called Laïdia, which is currently being renovated by the Bechdel Group, and will be inaugurated by a presentation of the first group photographs by artist John Akomfrah.This year’s edition of the exhibition will be curated by John Akomfrah, chair of the artistic director’s committee, and Ottis Mernissi, who will work with the artist to develop the theme of the exhibition and will be assisted by Fatemeh Kanaan, the director of modern art at the Bechdel Group, and Michael Oxtoby, whose works may be included in the exhibition. For more information, or to register, please visit: www.bechdelgallery.com \n\n\nIn an attempt to settle scores between the French and British governments, the French Ministry of Culture has adopted a resolution condemning the British Museum’s loan of a painting by Max Beckmann to the British Museum in London in an attempt to placate the", "The next Biennial should take place at the Museum of the Moving Image in New York City in November 2022.  The entire cycle will be housed in the Museum of Modern Art, and will be open to the public in 2020. The exhibition will continue in the form of a series of films and will be presented by curator and artist Li-Qiang Wang. Wang will open the exhibition on December 9. “Silence is for Silence,” as the title of the show, was originally written, was the theme of the first show, which took place in Beijing in December 2019. In a statement, the museum said that the decision to remove the work was made in light of the recent European Parliament elections and the upcoming parliamentary elections in May. “The exhibition ‘Silence is for Silence’ was selected by the jury based on the exhibition’s merit, its uniqueness as a work of art and the work’s substantial contribution to the exhibition’s theme. The exhibition was selected as an example of a work that embodies the breadth, creativity and originality of the exhibition,” the museum said. Commenting on the exhibition, Wang said: “The exhibition ‘Silence is", "The next Biennial should be held in the spring of 2020. The venue will be in the same building as the new Museum of Modern Art. The department of arts and design, which is slated to relocate to the nearby Science Museum, will have a major expansion planned. The Biennial will be inaugurated by a retrospective of the work of Jean-Michel Basquiat at the new museum in December. The biennial’s first theme, “Art and Transference,” was originally announced as “meaningful mutual exchange.” The works of the show will be on display in “The Transfiguration of Times,” a new exhibition. The opening of the show was postponed because of the Covid-19 pandemic.\n\n\nThe Four Seasons Hotel & Spa in West Palm Beach, Florida, has announced that Joan Ben Roach has been hired as its new executive director. She will take the helm of the organization from Emily LeCompte, who is currently the executive director of the Palm Springs Art Museum, on September 27.“We are thrilled to welcome Joan to the Four Seasons,” said Lisa LaBouvier, the executive and artistic director of the Four Seasons", "The next Biennial should be in 2020, and the 2020 edition will consist of an open-access exhibition, “Suspended Life: From the Sixties to the Arab Spring” (2019), which will include works by artists such as Rineke Dijkstra, Ola Bruguera, David Goldblatt, and Jamie Cunliffe. “The programme will be presented as a monument to nineteen years of collaboration between Yossi and the Darmstadt Art Museum, and as a reminder of the museum’s commitment to the city of Yossi’s collection of contemporary art,” said Darmstadt city councilor Markus Lück. \n\n\nThe Julliet-Karlsbad Museum of the History of Photography in Germany is planning to turn fifteen acres of land in the city of Karlsbad into a twenty-one-acre museum dedicated to the development of new photographic materials. The project, which will be led by architect and urban designer Bandak Sargent, is part of a larger campaign to expand photography’s artistic and academic potential around the world.“The curatorial team at the Karlsbad Museum of Art has been working in", "The next Biennial should focus on the development of new opportunities and the ways in which contemporary art can be found in the present moment and be a vehicle for the spread of the idea of community and of social justice.”\n\n\nThe Hirshhorn Museum, Boston, has hired Julie DeGroot as its new associate curator of modern and contemporary art. In her new role, which is funded by the Hirshhorn, DeGroot will work closely with curator Lavinia Clark, whose six-year, $60 million renovation of the institution is slated to open in the spring of 2021. The Hirshhorn also announced that its existing assistant curators of modern and contemporary art, Christina Lindendorff and Katia Mosconi, will be promoted to curating department chairs.“Julie is an excellent fit for the Hirshhorn’s contemporary art and has the ability to bring diverse and engaging perspectives to bear on art in the current moment,” said director Robert Shire. “She has a deep and respected history in the museum of contemporary art and has developed and applied new research and methods to advance our understanding of the museum’s collection and exhibitions. Her forthcoming book, ‘Seeing Past: Art and Modernity in", "The next Biennial should be held in 2022.\n\n\nThe Royal Academy of Arts (RA) in London announced today that it is planning to shutter its Palazzo Schennardo in 2020 and to transition its art collection to a new museum. Presented by Stedelijk Museum, the ambitious redesign—which will include the building of a new exhibition space and the addition of twenty new galleries—will be implemented over six years.“The Royal Academy of Arts is building a new magnificent exhibition space at the Palazzo Schennardo, and we are working hard to prepare it for its groundbreaking transformation into an innovative and global art museum,” said the academy’s director, Hamish Hamilton. “The new museum will offer new exhibitions, and will increasingly draw audiences from all over the world. We are actively working with our local communities to ensure that we have the right terrain for the newly commissioned projects.”Hamilton also announced that the institution’s current exhibition schedule, which is distributed over three phases, has been revised to take advantage of the new museum. The first phase, “A Guide to Modern Life,” will come first—the second phase, “The Age of the Photograph,”", "The next Biennial should be held in 2022, and the first year of the new Art Rossie. Tacita Andrews, director of the Royal Academy of Arts, London, said: “When we think of the contemporary and of how interconnected and interdependent art is, we think of these things as separate and apart. But they are connected. The difference between them is like the difference between two mountains. So I am hopeful that the next Biennial will move us closer to the unity of art and architecture and will highlight the creative possibilities of this bond between man and nature.”\n\n\nThe Arts Council England (ACE), the UK’s leading arts organization representing more than 1,500 British arts and cultural institutions, has announced that it is putting the final stages of its next round of grants through the London-based arts fund the Art Fund to the artist-run nonprofit the Save Our Barbican, which is planning to open in February 2020. The organization will also begin giving out the cash in March, and is putting out a grant for ‎the arts and culture sector in November 2020.The deadline for ACE’s 2019 grant cycle was March 15, and the organization expects to deliver the grants full-time through June 30. ACE has", "The next Biennial should open in 2020. “This is a challenging time to be a curator, to be involved in an exhibition, to be part of an ongoing project, and to open a new chapter,” said director Michel Ghebaly. “In order to make the best use of our time, we must preserve the biennial as a single entity, and continue to present it in the spirit of openness and collaboration.”\n\n\nThe Polish Ministry of Culture has released guidelines for the installation of a statue of General Janusz Kwasniewski in Warsaw. The biennial, titled “Best of Enemies,” will examine how the legendary Polish commander knew and fought alongside Karl Haushofer and Franz Josef Kamm, and will reveal the identity of the new figurehead in the spring of 2021.The work was selected from several finalists, including those from Poland and the United Kingdom, and was submitted by a group of artists led by Wolfgang and Monica Csik, as well as Antonin & Svetlana Jarosławska, and Szymon Hochuck, among others. The exhibition will take place at the National Museum in Warsaw and will run until March", "The next Biennial should launch in 2020. The exhibition will follow the theme “Sustainability and the Body: Beauty in a Distracted World.” The theme of the forthcoming exhibition will be “Beauty and the Body” – a reference to the exhibition “Sustainability and the Body: Beauty in a Distracted World” (2019–20, Beijing Gallery Art Museum), which opened on the Museum of Contemporary Art Beijing.\n\n\nThe High Museum of Art in Shanghai has been awarded an additional $10.5 million to facilitate the relocation of the Chinese art of the twentieth century, including artists like Zhao Yilun and Hu Jie, whose works are currently on display in a new exhibition titled “China during the Cultural Revolution” (2019–20, Shanghai Art Museum). The sum is enough to advance the work of three scholars, Xu Xinhua, Yilei Wang, and Xuelong Yu, from the “This Is Not a Dream: The Origins of Modern Chinese Art” exhibition at the Shanghai Art Museum to the 2019 Beijing Art Market.The third exhibition, which focuses on the history of Chinese art from the early nineteenth century to the current day, is titled “China During the Cultural", "The next Biennial should be held in 2020. The first will take place in 2022.\n\n\nThe Fennel Art Museum London (FAM) has launched a new digital platform, Founded by David Cameron’s Great Britain, to help artists and campaigners to understand the impact of Britain’s departure from the European Union (EU). Citing the impact of the Brexit vote on their work, the exhibition “What is the Art of Brexit?,” which will run at the Fennel Art Museum from March 22 to March 28, 2019, has raised more than $30 million for the museum.The project will provide an online platform that will debut in 2021, when the museum will reopen for its regular programming. It will also introduce a new section for “quants,” which will be curated by Jonathan Teitelbaum, “the brain behind the K20 collective,” and will launch a new exhibition specifically for “artists and activists.”According to the Fennel Art Museum, the decision to open the new platform was made in partnership with Caroline Norbury, a curator and writer, artist and activist, and director of the anti-capitalist space the Threshold: “It", "The next Biennial should have been held in the year of our Lord 2019, and should have included artists and members of the public from thirteen different countries in the world. Instead, the exhibition was postponed until 2020, with no further plans for the collection.Rather than attending the twenty-second Biennial in 2022, the Collection will instead move to an exhibition space in London’s Barbican Centre, the world-renowned venue for contemporary art. Inaugurating the opening of the new exhibition is a new exhibition dedicated to Douglas Hofstadter’s work, “Heine, aether, and dæmonic.” The show will be on view until April 24.The move initially seemed like a logical step for the collection, which has recently been undergoing a significant revamp. The collection’s website now features a new selection of works by French modernist Guy and Fleur Delacroix, as well as works by Dutch and Austrian sculptors J. M. van der Weyden and Ulrich Reitkens, as well as pieces by Piet Mondrian, Kunsthal Aarhus, and Peter Paul Rubens. The collection also announced plans to open an exhibition space in the museum in the fall of 2020", "The next Biennial should take place in the autumn of 2021 and will host twenty-four artists. In addition to the exhibition, the biennial will include a symposium and other activities, which will be organized in cooperation with the public and the local communities of the city. The biennial will also include a project-based exhibition, which will be inaugurated by a selection of works that were created in collaboration with city-wide contemporary art projects in cooperation with the city’s cultural and heritage institutions.“The Biennale of New York is a model of sustainability for how we create and deliver public experiences in cities across the US,” said Elizabeth René Aubaut and Daniel H. Weiss, the organizers. “We have been inspired by the tremendous response to our inaugural Biennial, and have been inspired by the Cities for the Arts annual awardees, including Rachel Chiu and Diego Rivera. The City of New York’s awardees are positioned to be a model for how cities can work collaboratively and sustainably in the future.”The 2018-19 biennial received·s $4 million grant from the $2.5 trillion CARES Act, which was passed on May 24, 2018. The act directed $2", "The next Biennial should be held in 2021. The festival will take place at the Købenen Park in Copenhagen.\n\n\nThe National Museum of Art in Washington, DC, has appointed Jennifer Curran as its next director. Curran comes to the institution from the Museum of Fine Arts, Houston, where she has served as the deputy director for the last two years. She succeeds Susan W. J. and Deborah L. Jenks, who retired following a decade at the helm of the institution in March 2019.“Jennifer brings a wealth of experience and understanding to the museum as a global leader in the collection, presentation, and research of art history and contemporary art,” said museum director Christopher Bedford. “She will add valuable perspectives, knowledge, and skills to the museum’s already outstanding collection, research, and educational programs. We are excited to welcome her to the National.”Prior to joining the museum in 2010, Curran worked as a curatorial assistant at the Whitney Museum of American Art, where she worked on exhibitions and collections for the Whitney Biennial, “Art in the Age of Black Power” (2012), “Theater of Operations: Civilian Military Partners in Iraq” (2012), and", "The next Biennial should take place in the spring of 2021.The exhibition will be curated by Rachel Stewart, director of the Art Institute of Chicago; eta-sophie Harris, curator of the Biennial of Modern Art; and Kenneth Miller, curator of the Bicentennial of Art.The full list of participating artists is as follows: The Venice Biennial of Contemporary Art: Art and the Future of Life, Beirut (Baghdad)Cécile Bienpame, Mexico (New York)Léa Adams, Canada (New York)Léa Bennett, Canada (New York)漫産秋漫産秋英雄病街, China (New York)Liu Bingzhang, China (New York)Karen Brown, Canada (New York)Liu Chen, Yelwelyn China (New York)Dina Chiu, New York)Laura DeCecco, New York)Lucas Edwards, New York)Linda Erskine, New York)Linn Elliott, New York)Linn Elliott, ,New York)Jorge Englund", "The next Biennial should focus on “long-term collective practice,” according to the organizers. “In order to become a critical and harmonious presence throughout the city, it is imperative to develop new forms of ‘social practice,’ which can serve as a model for how collective acts of art can be produced and disseminated. This is the subject of the exhibition ‘All in a Day’s Eye: Art and Technology” (2019–20), curated by Tokyo-based artist Masao Nakayama, who will work with the artist-in-residence, Kunihiko Ogawa, to discover the art of computer animation. The exhibition will also feature work by sixty-seven international artists, including three from Japan, China, and Korea.The biennial will also showcase the work of eighty artists from twenty countries, including Iceland, Austria, and Russia. The list of artists chosen for the show will be announced in the coming months. The festival will take place in the exhibition space Tachikawa Prefecture in Nagoya City from February 28 to March 4, 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Catherine DeGirolamo as its new chief curator of", "The next Biennial should also take place in the spring of 2022, and will be held at the Museo de Artes Plásticas, the capital of the Andean people, and will begin with a collaborative performance by a group of twenty-seven artists and will run through March.In an attempt to mitigate the environmental threat from the construction and excavation of the museum, the Colombian government is allowing the country’s government-owned companies, Frente de Arte de Mediárica (FAE), and Cartagena-based company Olevy, to construct the museum in an attempt to save valuable archaeological sites. However, archaeologists have since accused Olevy of illegally removing material from the site in an attempt to make the site more attractive to tourism. The incident has also led to an international outcry over the destruction of cultural heritage sites in the country.In a statement, the Ministry of Culture said: “The next Biennial will be a continuation of the theme of the previous years, of the people’s presence in places, of the human being in nature. It will consider the new possibilities of the museum for artists and visitors, as well as for the artists themselves.”\n\n\nThe Los Angeles County Museum of", "The next Biennial should focus on topics that were discussed in the first experience, such as the exhibition of the works of these artists. It should also include a re-creation of the exhibition, which will be hosted at the Museum of Modern Art, Los Angeles, in 2020, in order to reflect a new reality, one in which artists are now able to freely create works of art in the museum.”\n\nThe Metropolitan Museum of Art (the museum) in New York has appointed Elin Østbye as its new independent curator of photography and film. Østbye will be responsible for helping the museum transition to digital technology and with it to the notion of art as a media phenomenon.“This is an unprecedented moment in the history of photography and film,” said museum director Daniel H. Weiss. “We are moving from the museum’s current position of being a museum that produces an extraordinarily vast body of work through a finite number of unique exhibitions and collections to one that produces work that is accessible to the public and is produced for the public.”Østbye joins the Met after serving as an assistant curator at the Museum of Modern Art in New York and as a curator at the Grand Rapids Museum of Art", "The next Biennial should be public-focused and engage with local communities, with a view to comprehending and improving their current predicaments. The Board of Directors of the Biennial should be empowered to appoint the managing director, beneficiaries, and the first artists-in-residence, or other senior officials.The trimming of the Biennial will be on the back of a projected $25 million drop in revenue during the pandemic. The cuts will affect all categories of artists-in-residence; those on temporary visas; and those residing in the UK. The cuts will be made across the board, with cuts to the Visas, Refugees, and Asylum (VAC), the Overseas Territories, and European Communities.“The change will be felt across the board,” Daniel Mitchell, the director and CEO of London’s Tate, said in a statement. “From the first moment the biennial is open, we will be working with London galleries and artists to understand the impact of the pandemic and to connect with audiences across the UK. This will include the adoption of a range of strategies for working with audiences such as making them feel more connected by connecting with them through programming and exhibitions and encouraging the sharing of projects and", "The next Biennial should be held in 2020. The 2019 edition, which took place in Punta de Oro, Brazil, was canceled because of Covid-19. The event was supposed to coincide with Art Basel Miami Beach.\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed John Edward Nolen as its next executive director. Nolen will be responsible for developing an agenda for the institution and for serving as its voice in the Los Angeles City Council. He succeeds Sharon Begley, who retired last month after ten years at the helm of the museum.Previous LACMA board chair Alan Siegelman, who has been actively involved in the institution since 2005, will continue to moderate the museum through the end of May.\n\n\nThe 2017 edition of Art Basel Hong Kong kicked off on Wednesday, March 9, and ran through March 12. The fair was held in the theme Contemporary Art: From China to Hong Kong. “It’s a big theme and we’ve always stressed the importance of collaboration and bringing together the best of contemporary art,” said Frank Gehry, president of the firm, who curated the fair with his brother, Hans, of Gehry & Partners. “It was", "The next Biennial should be in 2021, the same year the exhibition will be in its sixty-fifth edition and the opening of the museum will coincide with the opening of the museum’s new exhibition, “The Black Ephemeral: Art and Ritual in the Contemporary African Diaspora.”\n\n\nThe Contemporary Art Museum Houston (CAMH) has appointed Kate Decker as its next executive director. Decker joins the museum from the Metropolitan Museum of Art, where she has served as director of public engagement since 2015. She succeeds David McAllister, who has served as director of the museum for nearly twenty years and will take up the post in January 2021.“Kate’s approach to working with artists and communities has always been to involve them in the design of the institution,” McAllister said in a statement. “Her appointment has been a tremendous honor and I’m proud to work with her to advance the museum’s mission and to continue to inspire young talent through the museum’s exhibition program.”Prior to joining CAMH in 2016, Decker was a curator at the Museum of Modern Art; a curator at the Museum of Contemporary Art, Los Angeles; and an assistant curator at the", "The next Biennial should take place in Tokyo in 2020. The Tokyo Art Museum, which has had a permanent presence in the capital City since 1931, is currently renovating its campus, which is currently being expanded, and will be inaugurated in the spring of 2021.  新場海系科社, established in 1997 as a home for the works of the Chinese avant-garde, has announced it will postpone its 2020 edition to late autumn. The museum will instead focus on its collection of Chinese art, which comprises more than 1,500 works and will hold its first exhibition of art from the '50s and '60s in 2021.The appointment of Ning Mou, a former director of Shanghai’s Shanghai Art Museum, as its new director follows an announcement in February that the institution would move into a new building in the city. “We are delighted to have Ning join us in Beijing, and to launch the first exhibition of Chinese art in Shanghai,” said Claire Zugazinski, chair of the board of trustees. “Ning is a strong leader of the biennial and will help us achieve the ideal conditions for a successful exhibition in 2020.", "The next Biennial should focus on reconstruction and the construction of a public space within the city, not a museum, in a way that will be consciously participatory, as in the previous biennial, '100 Years of Havana' (2015–16), and the upcoming Shenzhen Biennale, which will be held at the same venue next year. It should also embrace aspects of the Cuban diaspora that are unique to Miami, including the history of the islanders. The budget for the first festival has not yet been disclosed.\n\n\nA jury in New York determined that the Savoy-Dock Museum of Art in London was unfairly targeted by Louis Vuitton over a new fragrance made by the French luxury goods giant. The jury found that the museum failed to properly warn the public about the potential health risks of the controversial chemical used in the powerful fragrance, which was invented by a company called Arne Sauvage.It found that both the museum and the company failed to address the risks posed by the chemical before it was banned by the French government in 2022. “The jury saw that Arne Sauvage had marketed a product that was not only risky but also lacking in safety measures,” Lucie Anagnos, a lawyer for", "The next Biennial should be announced by the end of the year, but no date has yet been set for its reopening.  The museum was closed for a week following a major earthquake and tsunami in Kobe, Japan, on March 11, and reopened on March 12. \n\n\nThe city of St. Louis, Missouri, has received a $250,000 donation from artist Ana Mendieta, whose powerful, sculptural works embody the spirit of the American South. The gift, made by the Mosholu artist to the city of St. Louis, was made in recognition of her dedication to the city and to her decades of work, which has been featured in numerous exhibitions across the country.“Ana’s works underscore the power and beauty of the American South, celebrating artists who were/are still making important contributions to the public good,” said Mayor Claire Lukas. “Her art has been featured in numerous exhibitions across the country, and her works are regularly featured in the Cities and Collections section of the Palais de Tokyo.”The artists are regularly featured in the city’s art museums, where she’s worked since 1987. Her earliest solo exhibitions, at the Birmingham Museum of Art in", "The next Biennial should begin soon, with a selection of works by contemporary artists, artists in the public collection, and artists whose work has recently been exhibited. The pavilion will be inaugurated with an exhibition of work by Mura Masou at the Tokyo Art Museum in December.\n\n\nThe Bucharest Biennale, which was canceled due to the ongoing political crisis in the Romanian state, has postponed its second edition, which was scheduled for March 21–March 23, 2020. The event was scheduled to coincide with the opening of the Romanian pavilion at the Venice Biennale in April.In a statement, the headquarters of Bucharest’s FIM Group said: “The FIM Bucharest is pleased with the outcome of the first edition, which was a collective effort of the entire staff and the participating artists. The new architecture, the performances, the installations, and the design of the pavilion are all exceptional and we are confident that the contemporary Bessi Museum will enhance the event in such a way that we can realize the full potential of the venue.”The upcoming edition of the Biennale will feature work by . . .\n\nThe Saudi Arabian prince behind the controversial $11.9 billion AlUla project,", "The next Biennial should be held in 2022.\n\n\nThe Canadian Museum of Fine Arts (CMFA) in Toronto announced today that it will begin welcoming visitors back to the institution from January 9 to February 3, 2020. The reopening of the museum coincides with the opening of the new Hôtel de Commerce in Ottawa, the third exhibition in the \"Centrepiece Series: Debussy, etc…\" series, and the triennial of Canadian design.The CMFA will now be able to welcome visitors back by leveraging the university’s new 400,000-square-foot, biennial-scale building, which opened on January 28 and is scheduled to run through March 22. “Centrepieces” are a series of exhibitions, concerts, and other events centered around the life and work of one of Canada’s greatest composers, Pierre-Auguste Renoir, and are organized under the theme “Love at First Sight.” The museum is planning to build the new facility to house more than two hundred works by Renoir’s contemporaries, including Albert Camus, Pierre-Auguste Labaine, Pierre-Auguste-Marie Curie, and Georges Seurat.\n\n\nThe Museum of Modern Art (", "The next Biennial should be a statewide event, rather than a one-day presentation, and will be held at the Millennium Art Museum in New York in 2021.  Since the museum has yet to decide whether to invite its namesake, Pennsylvania, to the event, the decisions regarding which of the six other states to hold the event are currently being decided by the state. In a statement, Pennsylvania governor Tom Corbett said: “We are determined to continue to innovate and grow in ways that respect the public’s privacy and safety. . . . We have seen the positive effects of the exhibition at the museum with respect to improving health and reducing hospitalizations. I welcome any feedback and encourage any of you to speak with a Pennsylvanian about the possibilities and the challenges of an exhibition at the Museum of Art.”\n\n\nThe Solomon R. Guggenheim Museum in New York has announced its design for the 2023 edition of the Whitney Biennial , which will be held in New York City in 2021. The $75 million institution will now be led by architect Jane Panetta, the design director of the Whitney Museum of American Art in New York, and will begin the design process by interviewing architectural and landscape architects and", "The next Biennial should explore the experiences of migrant workers in the Italian city of Genoa. Organizers say that the festival’s next edition will focus on the best ways to support artists, while still presenting a show of works by artists from around the world.\n\n\nThe Pérez Artes—an independent organization based on the outskirts of Los Angeles that promotes Spanish modernism, with a year-round program that attracts up to twenty thousand visitors each year—will miss the 2020 edition due to the Covid-19 pandemic. The organizers have announced that the event will be rescheduled for 2021, but no exact date has been set.“We are aware that the Covid-19 pandemic has put an end to our 2019 season, and we are actively considering reopening with a new artistic vision, more focused on the art of the future,” said Mark Beasley, cofounder and artistic director of the independent nonprofit. “Despite our best efforts to balance the biennial’s commitments to art and to the communities we represent, we are unable to carry out the necessary repairs and reconfigurations of the museum. We are also acutely aware that the art of the future will change many aspects of contemporary life.�", "The next Biennial should be held in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Sarah Schroth as its new associate curator of modern and contemporary art. She will assume her responsibilities on January 18, 2020. Schroth comes to the MFA from the Hirshhorn Museum and Sculpture Garden, where she has led the collection for twenty-seven years. She previously served as an associate curator at the Museum of Modern Art, where she worked on the exhibition program for the second and third editions of the International. She will assume her responsibilities on January 19, 2020.“Sarah is an accomplished curator who has been instrumental in creating new ways of presenting contemporary art and has the ability to bring extraordinary curators to their homes and communities,” said museum president Elizabeth G. Patchett. “Her ability to integrate art and pop and bring them together in new ways is a treasured legacy of the Hirshhorn and the MFA. We are excited to see how she will use her expertise to expand the MFA’s mission and strengthen the curatorial team.”Schroth comes to the MFA from the Dallas Contemporary, where she has worked since 2012, and has been affiliated with", "The next Biennial should take place in 2020, the same year the second edition of the show will hold its twenty-fifth edition. “I think it is important for us to start with the intention of creating a new platform that will be free of commercial interference,” said Hanna Ros-Biczel, chair of the exhibition’s board. “Since the exhibition is a unique exhibition, we had to keep the best of the exhibition as is. The main attraction is that the works are the only works in the collection, and that they are organized in a way that is free of any commercial content. That is not possible with a museum show.”The partnership between the museum and the German government comes at a critical time for the show as it works to salvage its finances and balance sheets. In March, the German government cut the annual stipends of the executives of several art museums, including the Museums Fischer and Beinecke-Bau, and announced that it would forgive $8 billion in 2017, the latest year for which data is currently available. The move was part of a larger plan to reduce the state’s debt by $6 billion over the next three years. Meanwhile, the museum�", "The next Biennial should include an exhibition of work by the Paris- and New York-based artists Patrice Baucourt and Philippe Bidin. The show will also include a lecture by the curator Anna Laudel, who will lead a survey of Richard Avedon’s work that will take place at the Museum of Modern Art, New York.“We are thrilled by the prospect of developing new and exciting work by these artists at a time when our galleries are experiencing unprecedented growth,” said Amanda Levin, the president of the McKinstry-Stevens organization, which has represented the artists since they were first awarded MacArthur Fellowships in 1994. The McKinstry-Stevens organization has previously awarded fifty-six fellowships to artists and writers in the past ten years, and this year’s biennial will mark the first time that more than one artist will be selected for the Fifty-eighth Biennial.“The McKinstry-Stevens program, over the course of a decade, has made possible the work of so many critically acclaimed, first-rate, and previously overlooked artists,” said Levin. “In addition to supporting the art of these artists, the McKinstry-Stevens", "The next Biennial should take place in the summer of 2022.  The next will be held in the spring of 2023.  The third was originally scheduled for 2020, but was pulled due to financial issues. The fourth is currently being held in the summer of 2022, and will be held sometime between August and October. The fifth will be held between August and October 2021. The sixth will be held in the autumn of 2023. The seventh will be held within the next eighteen months.The eighth will take place between January and March 2021. The ninth will be held no later than March 21, 2021. The tenth will be held in the autumn of 2021. The eleventh will be held by December 20, 2021. The thirteenth will be held in the at least two-and-a-half-week period between January 7 and February 11, 2022. The thirteenth will be a retrospective of the exhibition “The Power of Pictures” which was originally staged at the National Gallery of Art in Washington, DC, in May 2017. The exhibition was relocated to the National Museum of Modern Art in London, and later that month, it inaugurated a new series of exhibitions. ", "The next Biennial should take place in the city in 2020. The exhibition will be hosted by the institution and the London-based artist Andy Bell, and will be organized to commemorate the centenary of the outbreak of World War One.The exhibition will also include the first oral history of the outbreak to be told exclusively by the artist. The narrative, titled The Battle of Britain, will chronicle the interventions of bioweapons in the conflict and will be directed by David Mitchell, who will narrate the whole thing, from the creation of the first bioweapons laboratory in the UK (the Avon) to the outbreak of the epidemic.“The Battle of Britain: The Art of Non-Violence is a critically acclaimed account of an important moment in the history of biotechnology. Its themes and visual vocabulary are timeless and deeply resonant, both in their historical context and in the contemporary issues of violence and war,” said Alexander H. Forsyth, chair of the fiftieth anniversary celebrations at the Biennial. “The Exhibition will also draw from the artist’s extensive body of work. To address critical themes of violence and the body, this exhibition will address themes of memory, the body and the body.", "The next Biennial should launch in late summer, with the exhibition marking the tenth anniversary of the organization. The organizers said that the venue would also invite the public to experience the exhibition for the first time. The program will be curated by Salahuddin Mulk, the director of the Kabul Cultural Center, the Afghan representative of the Grand Mosque. Dawn says: The first week of June will be a time of celebration and renewal. We hope that this exhibition will continue to become a platform for engaging diverse audiences in exploring and reflecting on the themes of the exhibition. With luck and a bit of luck, the Biennial will bring together a number of the most promising artists from Afghanistan and will prove that art can be a bridge to a more inclusive, interconnected world.  Inaugurating the exhibition is an exhibition titled Art for Peace, which will feature work by ninety artists from Afghanistan and the surrounding region. The artists included in the exhibition are Ansari Rasey, Bashir Rassoul, Ali Rassoul, Bibi Bakhtiar, Faridkhani Lathram, Raneem Farsi, Lora Baloch, Nima Al-Marayati, Mike Lash, Muttal Mohammed Zahir,", "The next Biennial should be a major milestone. It should represent the first time that the museum has ever hosted an exhibition of prehistoric art. It should also bring together some of the most important and celebrated artists in the country. The trustees of the museum have called for the exhibition to take place in the local community.\n\n\nThe European Space Museum Rotterdam in the Netherlands has received a gift of thirty-seven prehistoric artworks from the Greek island of Mykonos. The works, dating back to the late Cretaceous period, were discovered in a high-altitude area of the island in 2017. The museum, which, until now, had not previously possessed the works, was informed of the find when it was conducting research in an attempt to understand the origins of the art.Poseidon Portraits, 2003, by the Greek artist Panagiotakos, was discovered by Titus Kapharos, director of the Maritime Museum, in the waters of the European island of Santorini. Kapharos, who works in a studio in Athens, traveled to Mykonos several times throughout his career, collecting the works before they left the island. The museum received the works in 2017 and has been working to confirm their authenticity for", "The next Biennial should be held in 2021 and will be organized as follows: One half of the project is being supported by the National Science Foundation (NSF), the other half by the Rockefeller Foundation. “The exhibition will explore the foundational stories of the new sciences and the history of ideas, a tradition that celebrates the diverse ways in which humans have shaped the world,” said Elizabeth Clark, executive director, National Science Foundation.  The exhibition will also highlight the contributions made by women to the revolution of science and technology, and will include a selection of works by artists whose work engages with issues of gender and feminism. The museum will be inaugurated with a special exhibition of the work of a group including Anna Atkins, Zina Saro-Wiwa, and Julie Dash.The biennial also announced that it was collaborating with the International Association for the Study of the Contemporary Art (SACAM), which would be housed in a new research center at the NSF, to present the exhibition “There Is a Way: A Feminist View of Art,” which will open in the fall of 2020. This will be the first time the exhibition will be hosted by the museum.\n\n\nThe Metropolitan Museum of Art in New York has named", "The next Biennial should take place in 2020 and will include a retrospective of the work of a selection of artists in the contemporary art scene. The Biennial will be hosted by the Museen Triennale Berlin and the Centre for Contemporary Art in Munich. * * * * * * \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is revamping its collection plans in anticipation of a potential repeat of the coronavirus pandemic. Its board of trustees announced on Tuesday that it will shift the focus of the institution from a retrospective to a permanent collection, and that the museum will invest more in its collection through a program of exhibitions, educational initiatives, and the collection and exhibition program, known as a curatorial triennial.In a statement, the museum said: “The curatorial triennial is created with a particular focus on the work of the discerning artist-teacher, the discerning curator, and the discerning curator’s role. We will be further developing this opportunity as we work toward the museum’s 2020 goal, which is to host an annual exhibition of twenty artists.”The announcement follows a year where the museum embarked on a $1.5 million renovation and expansion project, which it described", "The next Biennial should be on April 25–April 28, 2021. Thank you for reading, and I hope you continue to enjoy these works as much as we have enjoyed making them. All my love and light,\nJeffrey Gibson is a Los Angeles–based artist and writer whose transmedia works are interwoven with archival materials from the artist’s archives in the Southwestern United States and Mexico, and whose work explores narratives about migration, loss, and memory. His work has been exhibited at the Los Angeles County Museum of Art, the Metropolitan Museum of Art, the Museo de Cultura de Los Angeles, and the Los Angeles County Museum of Art; he is currently a finalist for the Venice Biennale in 2019.Gibson is particularly interested in the political and social conditions that shape the meaning of memory and a history of migration. His work, which is designed to reflect a contemporary narrative about the artist’s experiences, is centered on the artist’s interaction with his mother, who immigrated from Mexico to the United States in the 1940s. The artist learns about her mother’s work through the artist’s own journey, and thus the artist’s own own experience.", "The next Biennial should take place in 2022.”\n\n\nArt Gallery of Ontario (AGO) has announced that it is suspending the 2019-20 season, which was originally scheduled to run from March 23 to March 30, 2020. The museum originally announced the cancellation of the exhibition Art of the Party: Aileen Koenig & the Art of the Party in October 2019. “We are deeply saddened by the news that Aileen Koenig will not be returning to the Art Gallery of Ontario,” director Maxime Berger said in a statement. “Her exceptional public and private work is a joy to see and a tribute to the noble art of presenting. We are confident that this event will bring renewed vitality and energy to the gallery, and a new level of intimacy and intimacy to our audiences.”The signing of the letter by the artists is part of a campaign launched by the Art Gallery of Ontario to draw attention to the climate crisis. The campaign was inspired by the work of Anish Kapoor, who, in an act of defiance, sketched out a temporarily suspended artwork, Hotel California’s The Night Room, in the lobby", "The next Biennial should focus on redeveloping the museum’s collection, which is currently housed in an old dairy building in the city. The renovation program is estimated to cost between $10 million and $15 million.  Scholl (1930–1998) was among the first architects of the Biennial, which was established in 1983. In addition to the exhibition and research center, the museum hosts a number of programs, including “Avant-Garde in the Studio: ‘Unity’s Evolution” (2017); “Telling Stories: ‘Making Faces’ at the Art Gallery of Ontario’s new location,” 2016; and “Annie Hall: ‘The Artist’s Studio” (2015).Scholl was awarded the Biennial’s Lifetime Achievement Award in 2017.\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced that it is planning to close its doors for a period of eight weeks after it hosts two exhibitions, “The Art of the Party: Art and Politics in Contemporary China” (2019) and “The Art of the Party: Art and Politics in Contemporary Korea” (2019", "The next Biennial should be held in 2021. While the venue for the event has yet to be decided, Artforum reports that the theme will be “instrumental,” “intermittent,” and “subjective,” and will be curated by Amy S. Meyer, a curator and senior curator at the Museum of Fine Arts, Boston, and Peter T. Smith, a director of the Contemporary Arts Center, Los Angeles.Founded in 1987 by archaeologist and art historian David C. Driskell, the exhibition was originally organized under the banner of the New Art of the Americas exhibition series, but the name of the exhibition was changed to the “Biennial of American Art” in honor of the centenary of the American Civil War. The series has since been combined with the “Art of the Century” exhibition, which was organized under the umbrella of the Museum of Modern Art in New York, and the “American Art of the Century” exhibition, which was organized under the direction of artist-in-residence Marcia Davis. The biennial will be held at the Museum of American Art in Los Angeles throughout the next two years.\n\n\nAfter the European city-state of", "The next Biennial should take place in December 2020. The artist-run exhibition will be curated by Jens Bacher and will feature works by thirty-five of the selected entries. \n\n\nThe Christie’s American Art Market in New York has announced the thirty-five artists who will be featured in its redesigned Fifth Avenue location. In an attempt to present more opportunities for contemporary art, the fair will present new exhibitions, including a solo exhibition by Massachusetts Institute of Technology (MIT) artist Rachel Chiu. The new space will also boast a collection of work by twenty-five new artists, including fourteen new artists from the United Kingdom, Egypt, and China, and four new artists from Mexico City.“During our reopening in May we will continue to introduce new artists and collections, and continue to present the most important contemporary art from around the world,” said Tim Marlborough, director of the New York market. “The future of the Fifth Avenue market and the fair lies in the hands of the New Yorkers who decide their own futures. We are committed to working with you and the art world community to make it an even more compelling and exciting destination.”The artists selected for the fair are as follows:Artsawel", "The next Biennial should take place in the city, the fourth will take place in the suburbs. While the first two, the 2016 and the 2017 editions, were held in the city, the 2019 edition was moved to the suburbs to avoid impacting on the official creative calendar. The city of San Francisco planned to hold the exhibition for only twenty-four hours before shutting it down on March 5, citing bad weather. The move prompted a backlash from some cultural figures and activists, who called the move an attack on free speech. According to the San Francisco Chronicle, the event’s next iteration will be held in the Bayview–Highlands, a wealthy enclave of mostly wealthy upper-middle-class African Americans in the Mission District of San Francisco.Safariland Center, the nonprofit that runs the exhibition, has announced that it is currently facing a lawsuit from the estate of a man who was one of the eight people who died as a result of the coronavirus. The estate is claiming that the exhibition was closed to the public for twenty-four hours because of a labor dispute. The lawsuit, which was filed last week, claims that the exhibition was “misled by management and not attended by the intent of the exhibition and the exhibition", "The next Biennial should be held in 2021 and will be hosted at the Museo de Cultura Bienal in Madrid. The seventy-fourth edition will take place in 2020 and will be hosted by the museum in the summer of 2021.The principle sponsor of the Biennial is the Spanish Ministry of Culture. Through its Arts and Culture Fund, the Ministry will receive $62 million for the duration of the project.The project will be funded through the Madrid-born architect and cultural historian Victor Salchetti, who is known for his architecture projects in the city of Granada, occupied by Spain during the country's civil war (1892–1934). Salchetti is a member of the Spanish Association of Architectural Historians (Aahgútica), which was formed to defend the independence of the Catalan region’s art and culture, and was awarded the 2013 Iglesias y Cultura National: Barcelona, the prestigious award for a Spanish architect.\n\n\nThe Museum of Modern Art (MoMA) in New York is going to get a major makeover. The institution is planning to upgrade its existing collection of 19th-century American painting, drawing, photography, and sculpture to include works by American artists, and will unveil", "The next Biennial should be held in 2021.\n\n\nThe Berlin Art Museum (BAM) announced today that the museum will open a new digital viewing room on the theme “Worlds in Motion” in a future edition of “Artforum. Design, Design, Design: From Prehistory to the Present,” which will be held in the museum’s former auditorium. The exhibition is named after the current director of the museum, Monika Bader.BAM’s new digital platform will enable future exhibitions, a virtual public gallery, and a new digital art encyclopedia, which will be organized in collaboration with the museum’s visual arts department. The digital encyclopedia will be created by the BAM’s curatorial staff and will be based on the museum’s existing collection of over 2,500 works that is currently online. In addition, the website will feature the works of the curator of contemporary design and artist Oskar Eustis, and will be updated on a daily basis, with exhibitions and special projects that have been staged by a diverse group of artists, including Jörg Eustis, Laura Owens, Olaus von Oswald, Judith Luckenbach, and Mona Hatoum", "The next Biennial should be held in 2021 and the date should be changed from 2021 to 2024. The 2019 edition of the exhibition was held in Hong Kong from November 5 to November 8 and highlighted the work of eighty artists from twenty-six countries. The exhibition drew some twenty-five thousand visitors. The Beijing show, which marked its twentieth anniversary this year, had a venue in the historic Old City, but the Beijing Art Museum “made no mention of a new exhibition,” the Beijing Art Museum said in a statement. The museum did, however, say that it plans to create new and revitalized galleries in the city. The concept of an exhibition space to be hosted at the museum was first introduced by director Liang Yu in an article published in the January 29, 2019 issue of Artforum. Liang wrote: “In our current decentralized way of life, we have become accustomed to the notion of the museum as a place where the artist can come to understand and appreciate the work he or she has bought. In a digital age, when the museum itself is becoming ever more connected to the Internet, it would be a big loss if the art of the museum were to go unrepresented.”The Beijing art", "The next Biennial should focus on the relationship between art and the social and political experience of south Asian Americans, and should include the production of a retrospective of the work of a contemporary artist and a biennial of folk art. It will also include the commission of a new book on the history and the practice of folk art. Icahn said: “My goal in organizing this is to create an environment where our audiences can come together and have a real sense of belonging. I hope that this new venue will inspire others to be inspired and to pursue the same goals as I have pursued for thirty-five years.”\n\n\nThe contemporary art museum Miriam and Ira D. Wallach in New York announced today that they have appointed John A. Pérez as its new director. He succeeds David Ferguson, who retired in December 2019 after eleven years at the helm of the Museum of Modern Art (MoMA), and will assume his post on January 1, 2021.“Pérez’s career has been distinguished by a deep commitment to the public good, a sustained attention to the ideas and people of the South, and a distancing policy that not only respects the institution’s historic mission but also advances a robust", "The next Biennial should focus on building on the recent history of the exhibition and its exhibition, “The Secret Life of the Human Skin” (2019), which opened at the museum in March 2019.“Every year we strive to present the best possible exhibitions, to reestablish the Biennial as an internationally recognized institution, and to inspire the audience with our new explorations of the human condition,” said Nonggak.\n\n\nRendering of “The Secret Life of the Human Skin” (2019). Courtesy of the artist.  \n      \n\n\n\n\nCynthia Bechdel, the American painter and sculptor best known for her striking, geometric motifs such as her surrealist collages and sculptures, which often address social issues and cultural institutions, has died at age eighty-two at her home in the artist’s hometown of Los Angeles.Born Cynthia Elizabeth Hedley in 1950 in New York City, Hedley studied under Frank Stella at the University of Michigan and later at the University of California, Los Angeles (UCLA). She became a graduate student at the University of Rochester in 1964 and moved to Los Angeles in the ensuing year. In 1967, Hedley moved to", "The next Biennial should be held in 2021, according to the Mana Contemporary, Atlanta (AC), and is speculated to be in the works for some time. While the planned event has been in the works for months, the decision was first made in March 2019, according to the Art Newspaper. After a public meeting at the Georgia Museum of Art, which is adjacent to the Biennial, organizers announced that the exhibition would move to the Georgia Museum of Art in November 2021. While the Georgia Museum of Art is currently closed until at least December 7 due to the Covid-19 pandemic, the institution said it would reopen in mid-March.The Georgia Museum of Art’s director of special programs, Alana Robinson, said: “Last year, we decided to pause the theme of the 2019 exhibition to focus on the legacy of radical feminist artists. In launching the upcoming exhibition, we have been inspired by the work of the late artist and activist Jennie Douglas Harnwell and her radical feminist feminist feminist art. We are especially excited by the work of the late artist and activist Donna Haraway, whose work exhibits the ravages of Radical Feminist theory, and whose controversial and influential feminist art will help us re-imagine the future.", "The next Biennial should take place in Tokyo in the fall of 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Chicago has announced that it is planning to reopen its doors to the public on December 21 following a massive $110 million expansion. The overhaul of the institution, which was completed in 2017 and featured the installation of a new 600-plus-seat theater and a new public area designed by landscape and architectural studio DeSoto + Partners, will benefit the city of Chicago and the surrounding surrounding area. The expansion also added a new Public Art, the National Museum of American Art, and the Art Institute of Chicago.“The expansion and reimagining of the Contemporary is a reflection of the city and region’s evolving needs and interests,” said MoCA director and CEO John Lasseter. “The Future of Art is Everywhere!”The renovation of the Contemporary was part of a $50 million campaign launched by the city of Chicago in 2018 to expand access to and enhance the Museum of Contemporary Art, which is a public-private partnership between the city and the private nonprofit organization the University of Chicago. The campaign included the launch of the CityLab, a collaboration between the city and the University of Chicago, and", "The next Biennial should take place in 2022. The new theme will focus on the history of contemporary art through an interdisciplinary, not-for-profit approach. The Milan-based, art historian-turned-philosopher Anna-Sophie Cattelan, who is developing the new exhibition, will curate the opening of the exhibition.The first exhibition, “History of Contemporary Art” (2018–19), opened at the Palazzo Prada in Milan in March. In the exhibition “Nirvana” (2019), the artist-activist Hilarie Burton presents an exhibition of works by forty-eight female artists, including Edith Heath, Rachel Nazareth, and Anna Atkins, and included the work of seventy-one other artists. The Biennial will also include a number of performances, including a collaboration between the artist and the artist-activist Rineke Dijkstra; an installation by the artist and the German artist Erich Kiefer; and a performance by Austrian composer Rudolf Zechtemberg. In addition, a special exhibition titled “The Future Is Present: Exhibitions in the Contemporary Life of Frank Gehry” will feature works that are currently on display", "The next Biennial should be held in 2020.\n\n\nThe Institute of Contemporary Arts (ICA) in New York has appointed Hannah Brown as its next director and CEO. In her new position, Brown will lead a critical and interdisciplinary research and curatorial project that will integrate the art and culture of the ICA in a way that is both organic and informed by social movements and local communities.“The ICA is committed to supporting the ICA’s international network of artists and curators by connecting them to the ICA Collections and by supporting their academic, institutional, and travel programs,” said ICA president Christopher Woolf. “I’m very excited to work with Hannah’s team to build on the ICA’s recent expansion into the arts and culture landscape, and to grow the ICA’s role in art and culture in the city.”Brown joined the ICA in 2016 as part of a much-needed overhaul that restored the ICA’s iconic brick building and restored the building’s original landscaping and architectural aesthetic. The renovation also overhauled the space in order to make it more inviting and accessible. The renovation added a theater and a café and added new galleries,", "The next Biennial should be held in the spring of 2022.\n\n\nThe Washington, DC–based nonprofit the Arts Alliance (WAVE), which represents more than 150 organizations, has launched a transition in the way it directs its annual awards in an effort to reduce waste and maximise returns on investment. The new policy, which will take effect during the 2020 biennial season, will prioritize a return to community-based fundraising.The new guidelines, which were drafted by director Zachary Crockett, will involve the organization in identifying the specific needs of its awardees and will determine how best to help them. The organization will also prioritize the collection of works on loan to it and how much it will pay for them. The next edition of the Washington, DC–based award will be held between October 28 and November 1.“The 2020 biennial will feature an unprecedented number of works and will showcase the most ambitious exhibitions of contemporary art,” said Mark Furstenberg, the president and CEO of the Washington, DC–based organization. “The 2017 biennial exhibited the most ambitious exhibitions of the decade and was a tremendous success. The 2020 version will present the most ambitious exhibitions of our lifetime with ten and twenty works from artists who have been", "The next Biennial should be held at the Berkeley Art Museum in California, the Museum of California Art, and the Museum of California Design. The 2019 edition of the event will open in Los Angeles on November 28.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles and the Los Angeles County Museum of Art (LACMA) have launched an online petition that calls for the removal of Tate Modern’s controversial David Bond­–designed building,’s facade, and roof, and the renovation of its courtyard.The petition, which has been signed by more than 1,500 people, states that the Square Theater building, which was completed in 1985 and consists of eleven theaters and a restaurant, is “one of the most egregious examples of the degradation of the Third World.” It continues: “The Square is Exhibit A in the ongoing cycle of dehumanization and dispossession, displacement and dispossession, deprivation and exploitation, deprivation and oppression.”It also says that the Square’s facade, which prevents the building’s interior—a former tobacco factory—from reaching the ground, is exposed 'hundreds of feet of rainforest’s peatlands, and erodes into an abandoned warehouse", "The next Biennial should take place sometime in 2020, with a new edition to be staged at the Stedelijk Museum in Amsterdam in 2021. The first edition, The Walker Art Center: The Painter’s Journey, was staged by the Washington, DC–based nonprofit Art in America in 1979.\n\n\nThe National Museum of American Art in Washington, DC, has announced that it is planning to merge with the Smithsonian Institution. The move will involve the dismantling of the current National Museum of American Art (NMAA), which has been in existence since 1973 and was headed by Cynthia Nixon, and the construction of a new museum that will take up the elements of the current building and create a new gallery in the National Mall in Washington, DC.According to the Washington Post, the proposal for the new museum was made in conjunction with the 2016 inauguration celebrations, which will involve the installation of the country’s first permanent sculpture garden, a 50,000-piece collection of nineteenth-century American art, and the reopening of the Smithsonian’s main building in 2021. The announcement follows the inauguration of a new president, Donald Trump, who has yet to nominate a replacement for Nixon, who will surely be the next director of the Smithsonian.", "The next Biennial should take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has revealed that it is planning to close its doors indefinitely due to escalating Covid-19-related health concerns. The institution received more than 1,300 Covid-19-related patient referrals and has made the unprecedented decision to suspend all new programming and begin the long-term rehabilitation of its iconic building.Culture writer and curator Glenn Talbot, who has been a curatorial assistant at the museum for more than a year, informed staff on Monday that he is stepping down in February 2020 to pursue new creative work. “Covid-19 has made clear that we have a lot of work to do to make the MCA a destination that truly embodies the best of California,” Talbot told the Art Newspaper. “Over the next six months, I intend to plan a new course for the museum that will give the museum the dignity and the prestige it deserves.”The MCA’s director, Mike Nichols, stated in a statement: “Covid-19 has made clear that we have a lot of work to do to make the MCA a destination that truly embodies the best of California", "The next Biennial should be in the spring of 2021. Juliette de Bont, director of the Biennial de Lyon, said: “We are working hard to ensure that the event will continue to thrive in the contemporary and be a source of inspiration for those who wish to experience art from a contemporary perspective.”\n\n\nThe Metropolitan Museum of Art in New York has hired Jenny Wilson as its new senior curator. Wilson comes to the museum from the Museum of Contemporary Art (MoCA), where she has served as a curator since 2016, and will be responsible for retaining the museum’s rich artistic legacy while providing support for the museum’s expansion and administration.“Jenny Wilson is a stunning curator who has demonstrated a remarkable ability to bring diverse and often difficult materials together and make them into compelling works of art,” said Christopher Campbell, the museum’s director and chief curator. “With her new role, she will play an important role in advancing the Met’s vision of a museum that wants to be a world-class cultural institution and that helps to make New York City a vibrant city for visitors to the Met.”Wilson, who is slated to begin her tenure in June, will be", "The next Biennial should be held in the city of New Delhi in 2021, and the exhibition should also include works by and about women artists, forming the first international group show dedicated to the subject.  The organisers have stated that they are working with the Indian government to ensure the fair’s participation in the 2019 edition, which was cancelled due to the Covid-19 crisis. “The next edition will be a celebration of living women artists,” said Rupak Arora, chair of the exhibition’s board, and Pattabhi Jamman, the president of the fair. \n\n\nAssemblyman Joe Barton, a Republican representative from Texas who represents parts of the Dallas-Fort Worth corridor, announced on Monday that he will introduce legislation that would prevent the sale or rental of images from the World War II-era American Southwest. The Texas Tribune reports that the legislation would also require that the federal government preserve 150 artworks that have recently entered the public domain for research and preservation. “The Texas Land Heritage Preservation Act will prevent the sale or rental of works that have entered the public domain in Texas,” said Barton. “This legislation will also ensure that these works are preserved in perpet", "The next Biennial should be held in 2021.The themes of this year’s event include the boundary of art and “culture” and the role of art and science in bringing about social change. The first Biennial was held in Stockholm in 2009 and covered a wide array of contemporary art and science, from sculpture and photography to philosophy and architecture and design.The first Prize for Art and Science was awarded in 2007 by the National Geographic Society, which was founded in 1974 by John and Charles Darwin. In 2007, the National Geographic Children’s Discovery Prize was awarded for “Art & Science” and in 2009, the Academy of Arts and Sciences in London awarded the British artist Nils Stærk for his first workshop. The prize was established to provide a platform for artists whose work engages with current issues and challenges, such as climate change and social justice.\n\n\nThe Museum of Chinese in America (MCA), which recently presented the first Museum of Chinese in America: A Chinese Perspective, has added two more exhibitions to its 2020 calendar: “Rencontres Amigos” and “Nanjing” (2019). “MCA will continue to present both new", "The next Biennial should be held in the spring of 2020. \n\n\nThe Museum of the City of New York (MoCA) has welcomed Maureen Finkelpearl, the founding director of the experimental art center Center for Contemporary Art (CAPAC), to its board of trustees. Finkelpearl will serve as vice chairman of the organization until the end of the year. Previously, she served as general manager of the Brooklyn Museum and worked as senior curator at the Museum of Modern Art in New York.“Maureen brings a wealth of experience and knowledge to our board, having helmed the Museum for nearly four decades, including a ten-year stint as vice chairman,” said board chair Kiki Wolfson. “She has deep curatorial and scholarly knowledge of contemporary art, as well as a proven track record of developing and delivering transformative programs. Maureen will be instrumental in fostering a strong culture at MoCA, which has been badly impacted by the pandemic and is currently undergoing a major renovation, and will help ensure the museum’s long-term financial sustainability.”Finkelpearl has been involved in the arts since she graduated from Columbia University in 1988 and has served on the boards of the Brooklyn Museum, the", "The next Biennial should begin in 2021. The pro-democracy protests have been ongoing since June, when President Joko Widodo, who has been in power since 2005, decreed he was no longer able to work with the opposition-led National People's Congress, which is controlled by the opposition.The protests have been violent, with some 345 deaths counted, and have resulted in several deaths. On Monday, February 14, the National People's Congress voted to suspend the opposition-led coalition government and hold a new election. The move led to widespread demonstrations across the country, and protests that are still underway.On Tuesday, the country’s chief prosecutor, Joko Widodo, was suspended from his post for undisclosed reasons. Widodo has since been replaced by a new legislative body, the Supreme Court of the Federation of the Philippines, which is expected to take up the prosecution’s case this month. While the general election is supposed to take place on May 9, the date on which an impeachment proceeding was supposed to begin is now unknown. \n\n\nThe Museum of Fine Arts (MFA) in Atlanta has received a gift of forty-six works by seventeen artists from the collection of Donald Day-Lewis, Jr", "The next Biennial should be held in the first quarter of 2020. Thru June 17, the museum will be closed until at least July 8.\n\n\nThe Institute of Contemporary Arts (ICA) in New York has appointed Tanya Bichova as the first director of its new flagship institution, the International Center for Art and Culture (ICAC), which will be inaugurated on September 8. Bichova comes to the ICA from the Sharon Center for Arts and the Arts, where she has served as the director of exhibitions for the last two years. “I've been a curator and educator for nineteen years,” said Bichova. “I’ve opened and transformed museums across the US and Europe.” Over that time, she has helped organize numerous exhibitions, including “Sophie Kruger: Beyond the Frame” (2019), “Planetary Resources: From Wilderness to Superpower” (2015), and “The Awakening of Joseph and the New World Viewed Through the Paintings of William Rosenblum” (2013). Bichova also serves as the founder of the International Center for Art and Culture (ICA), a nonprofit organization whose exhibitions focus on art from the ID", "The next Biennial should take place at the [Academy] of Fine Arts in Beijing in 2022. \n When the first edition of the Shanghai Biennale, curated by the same group of curators that launched the inaugural event in 1988, opened in 2006, the Chinese government had already taken a hard line in suppressing radical art. In 2013, the authorities ran a massive crackdown on anti-corruption protests, arresting hundreds of people for  picking up trash, and for their separation from the 'Party. Since the fall of President Xi Jinping, however, China’s cultural institutions have continued to thrive. This year’s edition, curated by Tom, Selva, and Nancy Pan, boasted a number of new collaborations between artists and the government, including a large-scale installation by Lina Zhang and a joint project featuring artists from Beijing, Shanghai, and Nanjing. The next edition of the Shanghai Triennale will be staged in the city’s Hangzhou district from March 20 to March 22, 2022. “China’s cultural institutions have been adapting to the current challenges by rethinking how to engage with the country’s diverse communities,” Zhang, the organizer", "The next Biennial should take place in Moscow in the autumn of 2020, and the biennial will include a selection of work by contemporary and experimental artists. The exhibition will also consider the possibility of a retrospective of the work of a single artist. \n\n\nThe Foundation for Contemporary Art (FCA) in New York City announced today that the eight-year long exhibition “TLC: Lens on the Floor” will return to the Hudson Yards site for the 2020 edition. The fair will be held at Rockefeller Center from September 11 to September 13, 2020. The first show, curated by William Kentridge, will present the first solo exhibitions of work by the veteran artist Paul Gauguin at the New Museum in New York City in January 2021.The fair will also feature a selection of works by younger artists, which will be curated by New York–based artist and designer Adam Pendleton. The exhibition will be inaugurated by an exhibition of art created by Arne Glimcher at the Barozzi Arts Center in Venice in October 2019, and will conclude with a lecture by the Danish artist Sveinunga Rådellæ, who will represent Denmark at the upcoming Copenhagen Art Biennale in December 2020.“We", "The next Biennial should be held in 2021.\n\n\nThe museum’s new president, Johanna Parzinger, announced today that the institution will reopen in the city of Basel in June 2020. The move is being made amid the coronavirus outbreak, which has enveloped the entire globe and has killed more than 7,000 people.The decision to reopen was made while the museum is closed as a result of the coronavirus. During the pandemic, the museum had struggled to come to terms with the sudden influx of visitors from China, Indonesia, Nepal, and other countries affected by the virus. In an attempt to keep the number of visitors manageable, the flea market was temporarily closed in March and the art fairs from March 19 to March 21 were postponed.The new lease of the museum, a former cattle station, was made possible when the Chinese government gave the museum a concession in December 2019. The renewal of the lease is expected to save the museum some $5 million over the next three years.\n\n\nMore than 1,900 artists and collectives have signed a statement of solidarity with the Chinese-Hungarian dissident artist András O. Grím, who was arrested last month after he attempted to", "The next Biennial should have a particular focus on the work of artists whose practice is currently in the process of shifting from one medium to another, to be staged at different locations and at different times. The biennial should therefore be something that is a hybrid of two or more distinct times. The first half of the biennial should be about artists in their immediate aftermath, including the present, and the second half should be about artists in their long-term continuance. The biennial will also have an online component to present further contemporary art at the biennial, in collaboration with the artists who live and work in the biennial city. “In the twenty-first century, the biennial is constantly gesturing towards the future,” said Mamadou Saie, the director of the Tunis Museum, who added that the proposal for the biennial was made in order to “prune away the gaps in our knowledge and to re-create within the contemporary environment an art biennial of the twenty-first century.”The current edition of the biennial, which was launched by Tunisian and international artists at the request of the government of President Beji Caid Essebsi in 2015, will run for eighteen", "The next Biennial should be set in the year 2022. This is a special time for artists and small galleries, and will be an opportunity to create a new kind of exhibition. We will conduct the exhibition with a new perspective, adapting to present a different world, bringing together artists from different parts of the world through projects such as the Boucherie in Paris, the Paris Museum of Modern Art, and the Musée Catalotte. We also aim to develop a new series of exhibitions focusing on the history of contemporary art and the art of the time. Our theme for the biennial will be “The Future Is Present.” The selection of the artists for the exhibition will be based on the inaugural biennial’s recommendation and will be inspired by the course of events that unfolded throughout the year and the biennial’s exhibition. The contemporary art biennial’s theme will be “Presentation, Presentation, Presentation,” and the exhibition will focus on the artist as a medium of war, death, and mediating power. The exhibition will be hosted by the Württembergischer Kunstverein Stuttgart, and will comprise seventy works, including paintings, drawings, sculptures,", "The next Biennial should be held sometime in late April, with the exhibition opening to the public in early May. This event should showcase “new and emerging artists,” according to Artnet.  MATTELSTEIN ART\n\nThe Chicago-based artist Mattelstein, of the Chicago polka, has announced that he is putting down his studio to become a full-time artist-in-residence at the Museum of Contemporary Art (MoCA), where he will spend the next six months. “I’ve been fortunate enough to work with and teach at a museum for almost seven years now, and I’m incredibly excited about this new chapter with MoCA,” Mattelstein said in a statement. “This is a defining moment in my artistic career, and I’m delighted to be working with the artists who have shaped my career.”  After he returns to his studio, Mattelstein will organize a series of exhibitions, residencies, and solo shows at his own institution that will culminate in a Memorial Day celebration. The artist-in-residence will serve as an extension of the museum’s curatorial team and will work collaboratively with", "The next Biennial should be in 2021. In a letter penned by Marin Alsop, chair of the board of trustees of the Contemporary Art Museum Houston, the institution said: “We are proud that our facilities and our team will be ready for the next exhibition. We are confident that the next exhibition will focus on the work of a select group of women artists, and will be a celebration of Houston’s history and the legacy of Biennial 1. We hope that the museum will continue to be a landmark in the city’s cultural landscape.” While this exhibition is only one of many planned for Houston, the city’s Arts Council hopes to hold another exhibition in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to open a new outpost in the city’s Haight-Ashbury neighborhood, the latest in a series of new cultural destinations planned for the area. The $130 million venture, which will incorporate a retail, residential, and exhibition space, will draw visitors from throughout the city.“We are thrilled to be opening in this vibrant neighborhood,” Mark Soltan, the director of the Contemporary Art Museum, said in a statement. “With a new", "The next Biennial should be held in the coming months, when the Art Newspaper will be closed, and the list of invited artists will be finalized. The exhibition will then come to an end with the exhibition of the work of the next group of thirty-six artists that were invited by the Prince Regent and other senior political and cultural figures.  On the occasion of the thirteenth Biennial of the BAME, which will take place in Bristol in May 2021, the Palace Arts Foundation (PAF) said:   The PaF Biennial will be an exciting event for visitors to London and will introduce new and exciting works from around the world. Klaus-Peter Beck, chairman of the German Federation for the Arts, said: “It is a project that will enable us to re-write the history of art and help us to understand how art should work.” \n\n\nThe Carnegie Museum of Art in Pittsburgh has appointed Sharon Rutter as its next director. Rutter joins the museum from the American Folk Art Museum, where she has served as deputy director since 2009. She succeeds Carolyn John, who has served as director of communicative institutions at the museum since 2013, and will take up the post in July.“", "The next Biennial should be held in 2020, with the option of staging the event in 2021. The 2020 edition of the exhibition will take place in the art museum, which occupies a former cotton mill in the city of Gilbert, Arizona, and will be on display in the institution’s 300,000-square-foot exhibition hall. The 2021 edition will be on view in the museum’s galleries, which will be relocated to an adjacent building, and will be on view from November 10 to November 21, 2021.Art Basel, which is currently closed until March 15 because of Covid-19, said that, in line with a global strategy announced last April, it is moving its business operations and exhibition spaces offshore, and will focus on supporting its existing brands. “The future of the business and of the exhibition is shifting rapidly, and we are closely monitoring the evolving situation with a view to determining the appropriate next steps,” said John Di Saint, the design and development director of Art Basel.Di Saint said that the company expects to continue to invest in its brands overseas, but that it will “focus our efforts and energy on our largest and most diverse markets,” focusing on the United States first, and later", "The next Biennial should take place in the spring of 2021. The first event was held in 1988 in San Francisco and has been held annually since. The exhibition was sponsored by the Rockefeller Foundation, the National Endowment for the Arts, and the Mike Kelley Foundation.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has commissioned the work of Liz Ronke to create a new work for its new home, the Museum of Art, and is currently working on a catalogue with the artist. The commission, which was made in collaboration with Randy Lee Gallery, comprises a sculpture called ʜThe Butterfly from Beyond the Sun.”The work, which was created in response to a question posed by former director Bruce Nauman in the film American Graffiti, was created at the intersection of two different philosophical perspectives on the sun. The artist, who was inspired by the sun as a symbol of hope and the earth as a form of embryonic life, began the piece by flipping the sun on its side. The sculpture is divided into twelve sections that unfold in real time and is scheduled to open to the public in 2022.In a statement, the institution said: “Terry and John were very engaged in the work’s conception and construction, and we", "The next Biennial should be held in the spring of 2021. In addition to the museum, there will be a new exhibition dedicated to the Oligarchic State. The two-hundred-year anniversary will also coincide with the national day of Catalonia, September 23.“The new exhibition will present Catalonia’s social and cultural heritage in a new way, not only by presenting the best works of Catalan artists, but also by presenting the pre-eminence of the Catalan state in the region,” Alberto Murillo, director of the Catalan Museum of Culture, told the Art Newspaper. The exhibition will also feature the most important works of the Biennial, including the works of the artists who participated in the Exhibition Cataloniana in 1968, which was staged by John Galliano, Stefano Rodríguez, and Agustín Pérez; the works of artists who are currently represented in the collection, like Marta Corrias and Alex de los Reyes; and the new works by the Catalan indigenous artists Hélio Pascual, Elisa Parra, and Pilar Rocha.The new exhibition will also include works by the Catalonian artists Múlène Braz and Juan María Azar,", "The next Biennial should be made in September 2020 and will invite new artists and groups to engage with the theme \"Creativity and Change: From the Art of Pilar Correa to the Art of Arturo Beltran and Beyond\".The commercial gallery will organize exhibitions of work by contemporary artists and will present a series of projects with the theme \"Pilar Correa: Avant-Garde and Contemporary Art\". The artist’s studio will be located in the city of Medellín, which is located in the central region of the country, near the capital, and will offer a private exhibition space in the exhibition hall. The first exhibition, “Pilar Correa: Avant-Garde and Contemporary Art” will open on September 23 next year at the Biennial of the Avant-Garde in the city of Medellín and will be followed by “Pilar Correa: Avant-Garde in Spain” in March 2021.The Los Angeles County Museum of Art (LACMA) has announced that it will host the forty-seventh edition of the Los Angeles Biennial, LABI, in February 2020. Los Angeles is currently home to some twenty-six talented artists and writers", "The next Biennial should be held in 2021. The festival, which was founded by artistic director and cofounder of the International Center for the Arts, Simon Lüpertz, and his wife, Angelika, will be held at the Art Institute of Chicago and will be attended by 1,600 guests from twenty-seven countries, including Canada, France, Germany, the United Kingdom, and the United States. Inaugurating the exhibition will be a presentation of the work of three artists, including South Korean Kwon Sang-kyo and the German artist Franz Kästler, who were selected for the inaugural exhibition.The Biennial, initially conceived as a series of original works, was reworked in 1999 to incorporate an introduction by the late American photographer Bruce Nauman\u0097later known as the Father of Modern Photography\u0097as part of the exhibition “Lucian Freud: A Retrospective.” In 2013, the exhibition was awarded the prestigious Royal Institute of British Architects (RIBA) Prize for Architecture.Inaugurating the exhibition are two works by the Italian artist Giampietro Cattelan\u0097a series of geometric geometric geometricoid sculptures, each made of paper with a different material\u0097as well as “", "The next Biennial should take place in a city with a location in the United States that is at least fifty miles from the Pacific Ocean, and should consider the cultural and historical significance of the area. We encourage all biennials to consider the impact their approach would have on their cities and consider the impact that their institutions would have on the local community. We believe that a new Biennial is the best way forward to redefine what a New York City institution can be and to reimagine how an institution can be a transformative platform for the arts. It is our hope that this year’s Biennial, which we have been tremendously proud to design and create, will lead the way to and establish a new model for New York art.”Over the years, the Biennials have supported the city’s arts through projects such as the construction of the Museum of the City of New York; a twenty-mile extension of the Hudson Yards development project; and the renovation of the Public Theater. The new location for the exhibition will be the new Museum of Art, which will be inaugurated by the first show of work by artist Rebecca Gordon, “Spiral in Space” (2019). \n\n\nThe Pérez", "The next Biennial should take place in 2021. \n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it will no longer award $6 billion to the City and County of New York in fiscal year 2021, citing the state's economic downturn. Instead, the DCLA will allocate $350 million to fund arts and cultural institutions in the city, including the Brooklyn Museum and the Bronx Museum of the Arts.Under its new budget for fiscal year 2022, the city is planning to spend $343 million on arts and cultural institutions, including the Metropolitan Museum of Art and the American Museum of Natural History. The plan also includes $108 million for transportation, utilities, and public safety, including the salaries of city employees and the expenses of museum officials.“The state’s economic recovery has been slow, but it has been well received by the cultural community and proved to be a boon to the arts,” said Mayor Bill de Blasio, who was reelected in November. “The city’s cultural institutions have been essential to our city’s success in a number of ways: providing vital access to the city for many of our residents, creating a global community of", "The next Biennial should focus on “The Decadence of Democracy: From the Fallacy of the Scientific to the Modern Era,” which is slated to open in the United States in March 2020. Previous exhibitions have shown work by artists such as Damien Hirst, Hoa Nguyen, Alex Katz, and Peter Dreher.The theme of the next edition will be “Covert Action: The Chinese Revolution, 1919-1948” and will feature photographs by artists such as Liu Shiliang, Liu Xiaodong, and Liu Yilun. The 2020 Biennial will be organized as part of the institution’s “Twilight” series, which has presented artists and collectives in the past. The series, which is curated by Tenzin Thuadulla and is scheduled to run through December 2020, includes Liu Xiaodong, Ning Shiyee, and Yi Zheng.\n\n\nThe Museums Association (MA), the British organization representing the more than 2,500 museums in the United Kingdom, has published a new set of guidelines on how museums should engage with the digital age. Founded by the Association of Museums and their Directors, the document outlines how museums should share", "The next Biennial should include the founding of an artists' residency program in addition to offering support for the creation of a language of culture.  The museum should work toward creating an endowment that will enable it to be dedicated to the collection and display of the work of the future.  The museum should consider creating a space for the collection of the nineteenth-century artist M. A. Hutton.  Smith also expressed his hope that the museum would soon be able to host William Kentridge’s monumental exhibition “Museum of Modern Art” in its entirety. The great nineteenth-century American painter and sculptor is currently housed at the National Gallery of Art in Washington, DC.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of fifteen works by the late Japanese artist and architect Tadao Ando, including two works by the architect’s protégé Takashi Kawamura, in the form of a gift that was arranged by the MFA in collaboration with the FHFA in August 2018. The twenty-six-inch-by-eight-inch ceramic works, which were completed in 1984 and 1991, respectively, were donated by his widow, Chiara Ando", "The next Biennial should be held in the spring of 2020. \n\n\nThe Museum of Contemporary Art (MCA), Los Angeles (LA) and the Los Angeles County Museum of Art (LACMA) have decided to cancel the next edition of the LA Biennial, which will be held in the spring of 2021.“LA Biennial is a unique institution,” said Mark Bradbury, director and CEO of MCA and LACMA. “We’re committed to continuing to present the best shows in Los Angeles, and this will continue to be a priority as we continue to expand the program across the city. With the all-new structure and the upcoming opening of the new museum on the campus of the University of Southern California, it will undoubtedly be a compelling platform for future programs.” With the cancellation of the biennial, the LA County Museum of Art will move its 2020 exhibition schedule forward by three months. The institution is currently slated to kick off its inaugural season on March 25 and close to the end of March.The LAXART and LAXART2000 festivals, which are scheduled for April and May, respectively, will be held in the spring of 2022. Both events will be open to the public", "The next Biennial should be held in the fall of 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has issued a moratorium on new exhibition designs and renovations, and has pledged to spend $250 million to address labor, environmental and worker issues across its five-thousand-piece collection.In a memorandum of understanding (MoU) dated April 5, MoCA president Michael Govan wrote: “In the interest of the employees, our board of directors, and our staff, and in cooperation with the membership, we have decided to postpone the opening and reopening of our new exhibition spaces, and to work towards finding a new venue that will provide the greatest amount of contemporary art for the city of Los Angeles.” MoCA’s previous moratorium, enacted in March 2019, was set to run through the end of March 2020. MoCA’s current exhibition spaces, which are located in the former home of the Universal Pictures building at 928 Wilshire Boulevard, will remain closed through at least April 10.The announcement followed a wave of labor strikes and protests at major cultural institutions across the United States in April. Among the activists who took to the streets in protest of contract negotiations at major museums were artist Ashley Broadway,", "The next Biennial should be on the theme of “The Future Is Present.” The fifteenth will be on “Art, Politics, and Human Nature” and will continue the theme through March 2019.The 2020 edition will be organized as follows: Opening Reception: Theater of Operations (Oùpont)Theater of Operations (Oùpont)February 23–March 7Theater of Operations (Oùpont)March 14–March 21 Theater of Operations (Oùpont)March 29–March 31 Opening Reception: John Jay College of Criminal Justice (J. Paul Getty)Until the War on Terror (O’Donnell School of Art)March 15–March 22 Opening Reception: John Jay College of Criminal Justice (J. Paul Getty)March 22–March 25 Opening Reception: John Jay College of Criminal Justice (J. Paul Getty)March 28–March 31 Opening Reception: John Jay College of Criminal Justice (J. Paul Getty)April 5–April 7 Opening Reception: John Jay College of Criminal Justice (J. Paul Getty)April 7–April 11 Opening Reception: ", "The next Biennial should be held in the coming years.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Lindsay Abrams as its next director. Abrams will assume her post in February 2020.“We are delighted to welcome Lindsay into the vast and growing MoCA family,” said Jean-Luc Fermat, chair of the board of trustees and president of the Metropolitan Museum of Art in New York. “We believe that Lindsay’s expertise, enthusiasm, and drive will enable us to bring our unique vision together to explore the future of art in the United States and internationally.”Alongside her responsibilities at MoCA, Abrams serves as a professor of art history at the University of Kansas. She is also the author of The Art of Painting: From Dickens to Mondrian (New York: St. Martin’s Press, 2015) and is collaborating with the Painter’s Group on its next publication.Commenting on her appointment, Abrams said: “I’ve been privileged to serve as the director of a museum I’m passionate about for nearly four years and am grateful for the many years of work I’ve done to advance the museum’s vision. I’", "The next Biennial should focus on how art and design can be used to address social, political, and economic injustice. The 2020 theme, “Building Bridges,” is about how art can serve as a catalyst for social change. The event will also feature presentations by artists such as David Hockney, Christo, and Naomi Harris. The 2020 theme is “Art and Design: How it can Shape and Change Our World.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Stephanie Ahearn as its new deputy director for collections and exhibitions. Ahearn comes to the institution from the Getty, where she has served as a deputy curator since 2011. She succeeds Stephanie Schubert, who retired in July 2019 after eleven years at the helm of the museum.“Stephanie brings exceptional curatorial and scholarly skills, an excellent record of curating and scholarship, and critical and creative thinking,” said Mark Lubell, the museum’s director and chief curator. “She has been instrumental in growing the museum’s collection and exhibition program, and has developed new and critically acclaimed art exhibitions, including the ‘Polaroid Effect” (2019) and", "The next Biennial should be held in 2022. The new venue for the exhibition should be decided by the New Delhi Biennial Coordination Committee sometime in May, with the restoration of the original exhibition space. \n\n\nThe University of Cambridge has appointed Nicholas Constell as its new deputy director for academic affairs. He succeeds Martha Kearney, who has served as the chief executive of the university for more than five years, and will begin his tenure in May.“We are grateful to the University for nominating Nicholas for his extraordinary achievements as deputy director of undergraduate and graduate life,” said Elizabeth Ann Macgregor, chair of the board of trustees. “His proven track record as a scholar, advocate, and supporter of the art of the humanities, along with his knowledge of how the arts can enhance scholarship and the best interests of students and faculty, make him the ideal person to lead the future direction of the University.”Constell was appointed in 2016 by East Anglia council president Susan Coyne, who had recently retired from the boards of the Tate and the Association of British Architects. He came to the university from the University and Arts London, where he had served as director of the school of architecture for five years, and was promoted to director in", "The next Biennial should be a celebration of our existence as an independent and interdependent community, in a world of infinite connectivity and communication.”\n\n\nIn a move that will affect the lives of millions, the title of the seventy-fifth edition of the Hero New York Biennial has been changed from “Hero of the Century” to “Hero of the Century” and the seventy-sixth edition will be titled “The Future Is Present.” The move was made amid rumors of a possible reorganization of the biennial, which will celebrate its thirtieth anniversary this fall.In a statement, the city said: “The newly added words ‘future is present’ will allow the city to further reflect on the themes of the preceding two decades and will serve as a powerful statement for the history of New York City. We look forward to presenting a new narrative for the annual event.”\n\n\nThe Bechdel Test, a seminal feminist feminist feminist arts test developed by feminist theorists Betty Friedan and Gloria Steinem and first presented by Steinem and Friedan at their famous Bechdel Lectures in 1968, has passed away at age eighty-eight. The test is considered by many feminists to be", "The next Biennial should take place at the Museum of Contemporary Art Los Angeles (MCA LA) in December 2021. The 2020 exhibition will offer an alternative view of the “60s at a time, on a day-by-day basis,” said museum director Andrew De Niro. “The next Biennial will be, as Andrew and I have said, a responsive, accessible, and thoughtful show, akin to a museum in a way. It’s an amalgamation of the best of the past and the best of the future, and is designed to be an extension of the life of Los Angeles.”\n\n\nWith the announcement that the new Museum of Contemporary Art (MCA) in Osaka will become the latest Japanese institution to welcome visitors to the capital city, the Japanese government announced that it plans to raise ¥10.2 billion ($11.6 million) for the construction of a new museum that will be completed by 2022. In addition to the ¥100 billion ($106 million) the government expects to raise through a series of PPACA auctions, it is planning to open the new museum in 2020.While the new museum will be built in the old Museum of Contemporary Art (MCA), which was completed in 1936 and", "The next Biennial should take place in 2022 and will include twelve artists, including Yaya Faraj, Hoor Al Qasimi, and Grant Green, with a presentation of work in conjunction with the show. The show, titled “Formation: From the Line to the Turn,” will run from January 20 to January 22, 2022 and will be presented by curator and curator-in-residence, Hamza Walker, and curator Saad Hariri.“The work that gets presented during the Biennial is always new and is a response to the current moment,” Hariri said. “I’m fully aware of the power of art as the vehicle for social change, and how important art is for the artistic process in both its physical and conceptual manifestations.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of three works by artist Mark di Suvero\u0097one work is a new work on paper, another is a new sculpture. According to curator Hannah Ruiz, the museum received the works from artist Mark di Suvero, who passed away on December 13, 2017, at the age of eighty-six. The work by di Su", "The next Biennial should take place in 2020, and the first in 2021. The museum will organize a lecture series for students and a virtual exhibition for the public.The new museum will be inaugurated with a piece by Hélène Atget, a French artist who is best known for her works of contemporary nature, from the early 1960s, and will be inaugurated by a virtual reality experience, “Invisibilia,” created by Richard Avedon and displayed in an open-air theater. Avedon will also present the first exhibition dedicated to Ernst Lubitsch, a German painter who lived and worked in Hamburg and Zurich through the years 1962–1965.“Lubitsch is regarded as one of the most important and influential artists of the twentieth century,” said Maha Anna Menchaca, chair of the museum’s board of directors. “His experience and knowledge of contemporary art and the contemporary art of the twentieth century allows his colleagues and students to visualize his work and understand how it was produced. This is a powerful tool for the museum.”\n\n\nThe Italian artist, who was one of the first to use live animals in his works, has died at age seventy-eight.", "The next Biennial should aim to answer the question: what is the future of art, and what can replace it? ‘In the current climate, what is the most important work of art being created today and in the immediate future?”\n\n\nThe Uffizi Foundation in Italy launched an initiative to support artists whose livelihoods are at risk due to the coronavirus. The foundation is collecting and distributing arts and cultural artifacts from artists, collectors, and institutions that have lost work as a result of the virus and is giving the funds to organizations that specialize in supporting artists and their arts.“The fund will help artists and cultural groups and institutions who are facing financial difficulties and who need financial support, including small and mid-size enterprises,” Giulia Bocconi, director of the foundation, said. “It is essential to support artists in their difficult situation and to support their work in order to prevent them from losing the necessary income to survive.”Among the organizations that have received support from the fund are the Arts Foundation Alpinenza, Arts Foundation Milan, Arts Foundation Turin, Arts Foundation Venice, Arts Foundation Venice, Arts Foundation Milan, and Arts", "The next Biennial should have a more diverse group of artists representing different artistic communities and should be able to address issues such as gender, race, class, disability, sexual orientation, and political beliefs, and will be organized according to a more inclusive format. The theme of the exhibition should be “Art and Passion in the Age of Resistance.”As part of the reopening of the Institute, the curators of “Art and Passion” have created a new exhibition, “Art and Passion: Talk to Us Today” at the Art Institute, curated by architect and curator Yoko Ono, which will inaugurate the new Biennial on March 31. The show will feature the works of thirteen artists, including Eric Fischl, Wayne Koestenbaum, Mark Hanan, Aaron Paul, and Rirkrit Tiravanija.Invited artists include Nicolas Carré, João Sousa, Alex Katz, Paul Mpagi Sepuya and Lelisa Grant, and Raymond Caïa.“On the artwork and the body,” said Philippe Auger, director of the Art Institute in Paris. “This exhibition is an extension of the work of the artists we invited, to give them the", "The next Biennial should be set up in the summer of 2022 and will focus on the development and storage of giant marine life in order to generate new ideas about how to care for and restore the planet.Based on the work of the Danish artist Lars-Eric Svedberg, the exhibition will focus on the conservation and management of more than 5,400 species, including sharks, rays, whales, sea lions, and dolphins. The design of the exhibition is inspired by the International Ocean Museum, L.A. (I.O.M.) in Copenhagen. The exhibition will include the first work by a single artist on a single platform since the pavilion was inaugurated by Jean-Luc Moulène in 1981.\n\n\nThe National Gallery in London announced today that it is planning to move its current exhibition “The Naked City,” an annual tribute to Victorian era industrialism, to a new location in the city’s Greenwich Village. The exhibition will now go online in spring 2020, with the inaugural exhibition “The Material City,” which debuted in February 2018, to celebrate the institution’s centenary.The move marks a new chapter in the National Gallery’s history, following a major expansion and renovation in 2016", "The next Biennial should be held in 2022–23, but it may not be ready by then.\n\n\nIn a move that could reshape New York City’s skyline, the New Museum, which folded from the ground up after it was acquired by a group led by Charles and David Horowitz in 2011, is planning to hold two inaugural exhibitions at a time—one on the radical radical idea of a global commons, the other on the architecture of the commons. The first will be in the fall of 2022, followed by the second in the spring of 2024. The move, which is part of a larger reorganization of the institution, will allow the museum to re-think how it integrates art and social practice—and will also allow the museum to explore new mediums.“We are not going to be afraid to make bold choices,” museum director Patrick Gaspard told the New York Times. The museum will also significantly reduce the size of its building, from more than eight thousand square feet to around three thousand, reflecting a new vision for the space by Gaspard and his team. The museum is currently planning to increase the museum’s footprint by building a new Central Intelligence building on the same block as the current headquarters,", "The next Biennial should be held in the spring of 2022.  This year’s edition, titled “Sustainability,” is an exploration of the relationship between human activity and the environment. The theme of the exhibition is “How do we care for the biosphere in the interests of a just and sustainable future?” The show will take up themes from environmental justice movements, sustainability activism, and religious teachings, and will be curated by Ahmad Abdurrahman, the director of the Abu Dhabi-based nonprofit the Abu Dhabi Artists’ Village. Commenting on the exhibition, Suit and Paper brought up the exhibition’s themes in a post shared by her on February 24: “Sustainability is a universal language that we can all use to articulate the urgent and the sublime, to call out to one another and to the world to join us in confronting the crisis of our time.”\n\n\nFrench artist and educator Renaud Léger was one of the many architects behind the iconic Trafalgar Square monument that commemorates the victims of the terrorist attacks of November 13, 1963. However, the work was not made in one fell swoop and was not finished until 1966. A new", "The next Biennial should be a celebration of African artists who have made important contributions to shaping modern and contemporary art from Africa. The programme should also focus on how art can act as a vehicle for social change and address issues that affect our everyday reality.”The shortlisted artists for the 2019 Biennial are:Fujaya, Brazil; Elena Benitez, Brazil; Lagos, Nigeria; Limerick, Ireland; Macon, Georgia; and Cape Town, South Africa. The full list of shortlisted artists is as follows:\n\n\nFilm-maker and philanthropist Robert Irwin has been given a $10 million grant for his foundation to commemorate the centenary of his death. It was established in 1989 by his widow, Rona, and his kids, Robert, Lawrence, and Christopher. The money is slated to be distributed in three installments, with the first being slated to occur in 2021. In a statement, the foundation said: “The next iteration of the Robert Irwin Foundation’s centenary celebration will take place in 2022. ‘Robert Irwin: Film’s Greatest Pioneer,’ will celebrate the legacy of the American filmmaker, whose work has impacted and changed how we think about the art, and will celebrate his", "The next Biennial should be held in 2021.\n\n\nThe Chicago-based nonprofit ArtPlace Chicago announced today that it is expanding its collection by introducing new and exciting exhibitions, performances, and residencies that will take place in the city’s Grant Park neighborhood. The organization is also introducing a new collection of works by Chicago-based artists to the region and is partnering with the City of Chicago to make the Park North Arts District (PNEAD) in the city’s North Lawndale neighborhood more self-supporting. In addition, the museum will launch a new public arts initiative, ArtPlace Plays, an online platform that will showcase the works of Chicago-based artists in an effort to increase engagement with local communities.“The PNEAD program is a perfect example of the extraordinary power of art and the city of Chicago as a whole to change the world for the better in a meaningful way,” said Chicago Arts Commissioner John Michael. “This year’s PNEAD show, which debuted in March and ran through April, featured work by fifty Chicago artists in its first season. It also showcased the unique and often overlooked talents of some of the city’s most celebrated artists, including Hisham Farid,", "The next Biennial should explore “the relationship between art and society as a whole, the relationship between artists and audiences, and the relationship between art and society’s central questions: ‘Love and work. ’”The exhibition is only the latest manifestation of the PRINCIPAL PAST, a series that will take place this fall. It will also feature pieces from the PRINCIPAL PAST '70–71, “PRINCIPAL PAST ‘80–86, and “PRINCIPAL PAST ‘90–present.”The 2017 exhibition “PRINCIPAL PAST:SINAI” will be held in Art Basel Hong Kong from October 3–October 4. The exhibition will feature works by forty artists, including Amanda Lee, Alighiero Bisanti, Josette Cervetto, Suzan-Lori Glimcher, and Anna Dieterich.The exhibition’s curator, Ryutaro Hoshine, said: “The PRINCIPAL PAST is a very large and diverse collection, so it is not possible to list every artist’s work in this exhibition, but I think it’s safe to", "The next Biennial should be held in 2022.  Sylvia and Olivera Albright, the parents of the late architect and philanthropist Richard Albright, are founding partners in the New York firm Olivera & Albright. The project will include the installation of the works that have been lost since World War II and will be organized as a combination of architecture and design. The partnership was established to help families through the loss of their family members in the Holocaust and is headquartered in New York and London.\n\n\nThe Art Newspaper - the English daily art magazine based in Paris - has announced that Emmanuel Pain, its chief curator and artistic director, will retire in December 2020, after seventeen years as editor in chief. Pain—who has been a part of the editorial staff from the turn of the century to the present—helped shape the magazine by creating a wide-ranging, multi-layered, interdisciplinary style of journalism that catapulted Harold and Maude Kahle to fame as a prolific and insightful critic. Pain’s influence on the magazine extends further still, as his \"Art for Life\" project opened the prestigious contemporary art biennial Art Obsessions in 2008. Pain’s", "The next Biennial should take place in 2021, and the first exhibition should take place in 2022. The 2020 iteration, titled “The Future Is Present,” saw the artist showcase his “Post-Collapse Art,” a conceptual series that explored “post-collapse art” through works that were created before the pandemic.The forty-fifth Biennial, featuring works by fifty-two artists, will be held in 2021. \n\n\nThe Tatmadaw Gallery in South London has received a $30,000 grant from the Sotheby’s Prize, which recognizes artists who have made significant contributions to the conservation of modern and contemporary art. The grant, which was announced last week, consists of a retrospective of the work of artist and champion of European art, Joseph and Paul Mpagi Sepuya, and a special exhibition of work by artist Harry Hayter, a key supporter of the Tate’s art department.The work of Mpagi Sepuya’s group, the Tatmadaw Collective, comprises three mediums: the unfinished and in-progress work The Parachute, which was painted in the early 1950s; an early work called “The Cloud House,�", "The next Biennial should take place in 2022 and will be led by a team of twenty-one artists, from fourteen continents. The twenty-two artists selected for the award are: Paul Mpagi Sepuya, Tanya Sargent, Cara Cote, Timur Martens, Tanveer Rajan, Yoshitomo Oda, Tania Bruguera, Maximilian Bruguera, Elisa Camacho, Lévy Gorvy, Amanda Carbery, Emma Barlow, Ashley James Marshall, David H. Dreyfuss, Cara Dreyfuss, Fiona M. Doran, and Milena H. Allen.The theme of the biennial is “LIFE AFTER LIFE.” The public will have two weeks to submit photos and videos for the prize show as well as two additional awards, each worth $100,000. The 2019 winners are Joan Newman, Thomas Jane, Chris Ofili, Michael Gira, JB Hiu, Verónica Lazzara, Anila Karunanagi, and Gustavo Miro, as judged by ", "The next Biennial should be held in 2022. \n\n\nThe Tate’s board of trustees has appointed Laura Friel as managing director. Friel comes to the museum from the MCA, where she has served as director of development since 2014. She succeeds Simon Wheatley, who departed the Tate in March 2019 to head the Royal Shakespeare Company, and will assume her responsibilities in July.“Laura brings decades of experience and knowledge to the Tate. She comes to Tate with years of experience leading a development team, which includes leading Tate’s development and engagement teams in London and Southeast Asia, and she has extensive experience in the international restaurant and tourism industries,” Tate director Maria Balshaw said. “We are truly excited to welcome her to the team and she will continue to drive development and innovation at Tate.”Friel comes to the Tate from the UK’s Department for Culture, Media and Sport (CMS), where she has served as chief executive for more than two decades. During her tenure at the department, she oversaw the development of the UK’s exhibition strategy and engagement with the public, oversaw the launch of the UK’s largest free urban festival, Ranjani Festival, and", "The next Biennial should take place in the near future, and is currently looking for a host. The 2018 edition, titled Polar Night, was staged at the Endeavour’s home ground of the Arts Quarter, and was a collaboration between the Arts Council, the O2, the Royal Shakespeare Company, and the National Portrait Gallery. The 2019 edition, entitled The Skin I Live In, was curated by Helen Cammock and Matthew McLean and was staged in the National Library in London. \n\nIn a move that could pave the way for the reopening of the major London art galleries, the local authority will now be able to impose a legal duty on galleries that fail to make repairs and maintain spaces that were damaged when the Tate was closed for twenty-four hours in April because of the coronavirus pandemic. The announcement marks the first time this has been carried out in a major UK city. London’s Mayoral Team said that the authority would be able to order galleries to make repairs to spaces that were damaged when the Tate’s east London building was hit by a train in April. Tate director Maria Balshaw said: “This is a challenge that we have", "The next Biennial should be held at the Institute of Contemporary Art, Los Angeles (ACLA), in December 2021. \n\n\nThe American Institute of Art (AIA), New York, has released an update on its collection of artworks by African American artists in the city, which has been closed since March 26 due to the Covid-19 pandemic. The museum said that it plans to restitute the works to the descendants of the original donors, but that it will take a year to complete the restitution process. The institution has also created two new positions to support the collection and the museum said that it intends to establish a new position for programming in the fall of 2020.In a statement, the museum said: “We are fully committed to working with the descendants of the original donors to ensure that the works in this collection are made available to the public in the future. We are also working with city government officials and state and federal officials to introduce new opportunities and support for the collection and restoration of African American art.”The works featured in the update are A.L. Cassie, 1865, at the A.I.R. Gallery in Harlem, New York; Alexander Campbell, 1877, at", "The next Biennial should be a great success. Mr. Li, on behalf of the committee, thank you for your service and looks forward to future cooperation. The selection of the ten artists was a great honor and we are grateful to the organizers for providing us with the opportunity to present this year's Biennial. We look forward to a successful exhibition of works and to future collaborations.\n\n\nThe team behind the 2011 blockbuster film Armageddon, which dramatized the destruction of the biblical Flood and stars Tom Cruise and Anne Hathaway, has announced that it is returning to New York for a second edition, titled Apocalyptica 2: Floods of Fire. “The flood is not over,” said film director Jordan Vogel, “it is only beginning. The Flood of Fire is a new and fresh beginning.”The event, which will take place across six venues from September 29 to November 2, 2020, will be co-organized by the Museum of the City of New York, the New Museum, the Solomon R. Guggenheim Museum, the Metropolitan Museum of Art, and the Whitney Museum of American Art in New York and will run concurrently with the upcoming biennial of the Icelandic artist Sigfus Saga, which", "The next Biennial should take place in 2020–21. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, California, has appointed Sawant, a socialist socialist and former Black Lives Matter organizer, as the new director of the museum. She will be charged with bringing the institution and its cultural legacy to the forefront in the fight against police violence and inequality. Sawant will assume her post in January 2021.“We are thrilled to welcome Sawant to the MoCA family,” said director Ronsy Raymond. “She embodies the spirit of the institution—strong, open, and smart, with the vision and energy to make the MoCA Museum a more essential place for black and indigenous communities.” Born in Seattle in 1976, Sawant moved to the United States as a teenager and attended the University of Alaska Fairbanks. She earned a degree in political science from the University of Alaska, Fairbanks, and began her career at MoCA as a curator of African American art. Her work has been exhibited at the Museum of Contemporary Art, Houston (2017); the Seattle Asian Art Museum (2017); and the Los Angeles County Museum of Art (2018). She has also curated projects for museums including the Hir", "The next Biennial should take place in the spring of 2021. “It is important to note that the construction of the Biennial was not authorized by the monarchist government, but was undertaken in the name of the people of Palu,” said President Bienvenu.  The construction of the exhibition, which featured art spanning the history of the region, was inspired by a letter written by a student from the institution in a celebration of his degree. The letter read: “I hereby pledge myself to you that I will not alter, distort or break any law, including the law of the land, to secure an exhibition of my artwork at the exhibition of my work, in accordance with the wishes of my fellow students and the institution’s board of trustees.”The event will be held in the Presidential Complex in Palu and will run for twelve months. The organizers state that the exhibition will be a “social experiment” in which the exhibition will reflect on the legacy of the Biennial and the ways in which artists have been employed to create new identities for Indigenous people. The exhibition will also address issues such as what the future holds for art and culture in a turbulent world, and will include works by twenty-", "The next Biennial should take place at the Imperial College Museum in London in 2021. Actual dates for the next two years will be revealed. While the exhibit will change slightly from year to year, the theme in 2021 will be The Future We Deserve, and its opening will coincide with the festival's theme year. While the exhibition is open to the public, it is not open to the public during the exhibition. Its full programme, which will be presented by director Andrew Kreps, will be unveiled in two years' time. The event, which was founded in 1971, has previously featured works by seventy-five artists. Among the artists whose works will be on view are David Hockney, Julia Kristeva, Rayyane Nadra, Nili Naidoo, Hélio Oiticica, Kiki Smith, Zoya, and Chizhya.\n\n\nThe Arts Council in London has announced the winners of its biennial prizes, which recognize excellence in both original and experimental work. The projects will be presented at the city’s Tate Modern and the London Gallery of Modern. The Arts Council awarded the prizes to playwright Noma Dumezweni, photographer Robin Mayhew, urban designer Yul", "The next Biennial should be in 2021. The exhibition will be titled “Art in the Age of Mechanical Reproduction,” focusing on the work of the late British painter, and will be held in conjunction with the 2017 edition of the Yuz Museum Basel. The exhibition will also include “Anima Keno: A Journey around the World” and “The Colour and the Shape of Animals: Contemporary Art in the Age of Mechanical Reproduction” among other themes.\n\n\nThe J. Paul Getty Trust in Los Angeles has commissioned artist Adam Scheiber to create a new public sculpture, “Ascension,” for the landmark redevelopment of the Getty Museum. The Work will sit in the center of the Museum’s new complex, which opened in the spring of 2021, and will include three bronze statues of angels, three angels in human form, and three angels in miniature.“We are delighted to have Adam Scheiber, an international artist whose artistic practice spans sculpture, installation, performance, and installation, as the curator of our new complex,” said James Cuno, president of the trust and chair of the trustees. “Ascension is a monumental work, and will require the full", "The next Biennial should have been held in August 2019, but the organizers were forced to postpone the event after the UK issued a state of emergency due to the coronavirus. The 2022 edition, titled The Year of Our Lord, was also supposed to be held in the UK and will likely be held in September.The twenty-sixth edition of the Biennial is slated to take place in September 2021.\n\n\nThe Pittsburgh Art Museum (PAM) has announced that Carole Wilson, who served as director of the institution from 1991 to 2013, has been appointed interim director of the museum. Wilson will assume her post on January 9, 2021. During her tenure at the museum, she helmed the institution through its seven-year renovation and expansion project, which increased its exhibition galleries by 44 percent; oversaw the museum’s expansion of the Carnegie Gallery of Art; and oversaw the museum’s acquisition of works by several of Pittsburgh’s most prominent artists.“Carole has been instrumental in the transformation of the PAM into a leading arts institution, and her appointment marks an exciting chapter in our history as we enter its seventeenth year,” said board president Amy Spilman. “We are grateful for the", "The next Biennial should be held in the autumn of 2021. \n\n\nThe museum’s board of directors has issued a third set of guidelines to the museum, which were issued on Thursday and were issued just two days before the August 7 closure of its two main buildings, the Biennial of Modern Art (BMA) in New York and the Museum of Modern Art (MoMA).The board’s new five-year strategic plan for the museum was made in response to the coronavirus pandemic and the institution’s move to a new space in Manhattan’s Hudson Yards (HHY). In a statement, the board said, “We are committed to ensuring that the BMA remains an important cultural resource for New Yorkers and the nation. We are also committed to working with our community and stakeholders to inform the design of the new space with the BMA’s original vision.”The guidelines state that the museum will follow a new Master Plan, which was released by architect Hiesha Rech this June, while also creating more than 1,200 jobs for interior designers, curators, and architects. The museum plans to open the new museum on the third floor of the historic building on September 5 and will"]