["The next Biennial should open in 2021. \n\n\nFour hundred artists are working in the Philippines to protest the reopening of the country’s wartime penitentiaries.The protestors are demanding that the government cancel the 2016 exhibition “Rebuilding the American Home: Prison Art in the Philippines,” a presentation organized by the National Museum of the Filipino in the capital, Manila. The exhibition, which was staged by the Philippine-born, Baltimore-based artist Niamat C. Abad, was meant to be a highlight of the upcoming **Victory in the Making” biennial. “The exhibition was supposed to be a celebration of the work of the artists that were incarcerated in the Philippines’ prisons,” said Abad. “But this exhibition was not well received by the many Filipinos who expressed dissatisfaction with the exhibition.”The artists representing the biennial are Eli Ayala, Jorge De Jesus, Lonnie Ho, Deana Montano, Carol Ramos, Cara Santiago, Koryo Akbar, Naima Hamid, Tanya Izquierdo, Jorge Rizal, and Yel", "The next Biennial should conclude with a presentation of the work that previously won the prize, the work that has the most immediate and profound impact on the work of the series. The exhibition would then be given a period of rest, and a retrospective of the artist’s work would follow, with the artist as the main focus.The first Biennial was organized by the German collector Helmut Lang, who founded the institution in 1987. The successor, curated by another collector, Klaus-Peter Beck, was organized in 1998, the same year the work of the acclaimed Belgian architect Frank Gehry, who died a few years before the festival’s inaugural edition in the city of Kassel.The theme of the 2019 edition, “Cycle of Life,” is a reflection on the interconnectedness of all life forms on Earth and their interconnectedness is reflected in the work of the wasps. The exhibition will mark the 40th anniversary of the exhibition.\n\n\nThe National Portrait Gallery in London has named its new deputy director, Anna Melling. Melling joins the institution from the Metropolitan Museum of Art, where she is currently deputy director of public engagement. She will be responsible for showcasing the work of artists and designers, and will take up the", "The next Biennial should be held in 2022, with the exhibition marking the five-year anniversary of the event.  The biennial’s theme, “Future Present,” is a reference to the previous edition, “Future History,” which was staged at the Museum of Modern Art in New York in 1994.The 2019 edition of the biennial, “Strangers in Our Town,” featured work by ten artists, including Sibel Kekilli, who is known for creating works that challenge contemporary notions of art history, and Olu Boony, who created paintings that explore the idea of time as a continuum.\n\n\nAmerican artist, philanthropist, teacher, and educator Henry David Thoreau, whose dedication to social justice and compassion inspired generations of artists, is being rediscovered through a $1.5 million restoration project in Griffith Park. The work, titled “Henry David Thoreau: Between Two Worlds” (Thoreau, 2017–2019), is the culmination of a three-decade quest to re-create Thoreau’s famous 'fountain house' in a pastoral setting in the foothills of the Cascades in Washington state. The new installation", "The next Biennial should be held in December 2021. The new exhibition will focus on the history of the museum’s collection, exhibitions, and programs. The redevelopment of the institution’s ground-floor exhibition space, a new collection centre, the restoration of the museum’s historic glass facade, the reopening of the museum in 2021, and the introduction of a new exhibition series.The biennial is being organized by the Abu Dhabi-based organization, AlUla, and the Los Angeles–based, artist-run organization, LACMA, with help from the artist-run nonprofit, the Abu Dhabi Diwan al-Maktoum, as well as the management and architect teams of the Abu Dhabi Museum (ADAM) and LACMA.“We are delighted that the twenty-first edition of the Biennial is now more than a year away,” said Karl Oster, director of ADAM and LACMA. “The dedication and skill of the organizers, and the team’s commitment to the exhibition, exhibition, and program is evident throughout the exhibition’s program, which addresses themes of contemporary art, the history of the collection, and the future of art.”The", "The next Biennial should be held in 2020.\n\n\nThe Polvell Museum in New York is looking for an executive director. The institution is seeking a director to lead the biennial, titled “NIRIN,” for the 2020–21 season, and will prepare for the exhibition in the coming years.The institution all-but eliminated its steel fabrication plant in 2014, when it closed for a period of eighteen months to prepare for the loss of more than two hundred jobs, and moved the exhibition’s headquarters to a new building in the same building, which was completed in January. The move has been credited with reducing the museum’s carbon footprint by at least twenty-five percent.In an open letter from the Polvell Museum’s board of trustees, trustees said: “We are thrilled that the next biennial of NIRIN will be organized and curated by the talented and visionary staff and the dedicated curators who took the time to create this exhibition. We are confident that this collaborative effort will deliver an outstanding exhibition as celebrated in the city of New York as the final edition of the exhibition ‘NIRIN.’ We welcome the opportunity to collaborate with the new director and to further enhance the exhibition by growing", "The next Biennial should take place in 2022 and the first in 2023. The event will examine the history of the fifty-one artists that will participate in the exhibition. Titled ––“The Wind is Not: A Present of Modern Art” and inaugurated by an exhibition of work by King Abdullah, the biennial is expected to draw an audience of thirty-five thousand people.“With the recent events in the Middle East and North Africa, it is not surprising that the global situation is bringing about a difficult situation for many artists,” said Nabil Fahmy, president of the Saudi Royal Commission for AlIsha and \u0097AlIsha. “But I believe that once we start discussing the future of art, the most important thing for us all will be the future of our country.” The first edition of the biennial was held in the capital of the United Arab Emirates, Abu Dhabi, in 2019 and was organized by the Abu Dhabi Foundation for Islamic Art (DHAI), the Museum of Modern Art, and the DHAI Art Museum.\n\n\nThe Hong Kong–born, Hong Kong–based artist, filmmaker, and writer Kyung-Min Lee, whose multi-", "The next Biennial should focus on “The landscape of art in the twenty-first century,” and will be held at the Art Institute of Chicago. The venue will be inaugurated with a retrospective of the work of artist Clement Greenberg, who died last year at age eighty-eight. The show will then quickly move to the Exhibition Court in the museum, where it will undergo a redesign in late November and reenter the public eye in late December.Inaugurating the exhibition will be a solo exhibition of work by the American artist Susan Sontag, which will be presented by curator Gia Radin; a presentation of work by the Italian photographer and director Paolo Baratta; a review of the artist’s first exhibition at the Biennial, “LACMA 20,” in New York City in April. The second exhibition, “NIRIN,” will open in March 2020, and will focus on contemporary art in the Northern Hemisphere.\n\n\nGerman chancellor Angela Merkel announced on Thursday that the Federal Republic of Bavaria, which has been ravaged by a series of devastating fires that have killed at least 159 people and forced more than one-hundred thousand to flee their homes, will be given a $10", "The next Biennial should bring together artists, filmmakers, musicians, and writers to reflect on the themes of their respective disciplines, and explore new ways of relating to one another. The show will also include the first exhibition of work by a woman and a man in the collection of the museum, the first exhibition of work by a non-British artist in the United States, and the first exhibition dedicated to a woman in the collection of the museum. Upon completion of the biennial, the National Museum of Women in the Arts will dedicate the first exhibition of work by a woman to the collection of the museum. The biennial will go beyond the museum to include a series of performances, lectures, workshops, and other events throughout the city of Washington, DC, in the coming months. The first exhibition will open on October 27 and will include a selection of works by artists from around the world.\n\n\nThe Kastner family, the philanthropists who have established a foundation for cultural preservation in Los Angeles that has supported cultural institutions in the city including the Metropolitan Museum of Art and the Los Angeles County Museum of Art, has donated $10 million to the city’s arts and cultural sector. The donation includes $8 million for arts preservation, and another $", "The next Biennial should be held in 2020. It is being suggested that the venue for the art event will be expanded to include a residency program such as the South London Biennial, which will be held at the Tate in 2021. The museum has also copied the Director of the Royal Academy of Arts, the City of London’s arts and cultural development authority, Lord Mandelson, who is also the chairman of the museum’s board of trustees.“The museum is committed to supporting the Royal Academy of Arts as it continues to grow and diversify its collection, as well as delivering on the academy’s ambitious plans to host a biennial per year,” said the museum’s director, Maria Balshaw. The Royal Academy of Art is currently considering whether to move forward with the construction of a new building for its collection. The institution has also received a £5 million grant from the Tate’s endowment for the construction of a new biennial gallery in the museum.The biennial is co-organized by the Royal Academy of Arts, the City of London, and the Royal Academy of Arts. The biennial will be hosted at the Royal Academy of Arts, which is located in a former munitions", "The next Biennial should take place in the city in 2022, and the first in the country in 2024. Its theme, The Future Is Present, will address the emergent issues of the digital and the physical.The art world is challenging the current model of a biennial by putting forth new and innovative ways of presenting works. In other words, the Biennial is not merely a platform for exhibitions. Its mission is to be an encyclopedic knowledge exchange with a direct and immediate interest in contemporary art. It is an expression of the spirit of Hong Kong. The Art Newspaper wrote of the events in Hong Kong earlier this year; the Art Newspaper goes on to say that the event is emblematic of the challenges the region faces in the face of the global pandemic.\n\n\nIn the ongoing effort by the City of New York to reduce the number of traffic accidents resulting from its massive expansion into Manhattan, New York Governor Andrew Cuomo announced on Monday that the state will reduce the number of traffic fatalities by a third by the year 2021. While the announcement was made as part of a comprehensive traffic safety package Cuomo unveiled on Monday, it also addressed the city’s rapidly growing homeless population—the governor announced that the state would reduce the number of homeless individuals by 70", "The next Biennial should explore the contribution of Afro-Caribbean artists to the Americas and the Caribbean, and should consider their relationship to the Americas, at least since the late nineteenth century.”Stevenson explained: “I would like to see more of a commitment to the Americas, and to the Americas artists, as a region, as a community.” She added that the prize should explore how “African art and its representation within the Americas has historically been represented in a dominant European and American way. . . . I would like to see more European and American artists show their work through their own artists, and more African artists show their work by their own artists.”The biennial will be hosted by the Los Angeles–based artist and curator Tala Aluko at the Los Angeles County Museum of Art (LACMA), and will run through February 21. The institution co-organized the first ever Los Angeles Biennial in 1974, and Aluko will serve as the artistic director for this year’s edition, which will take place at the UCLA campus from March 5 to March 7.\n\n\nRoger Rodas, the famed Cuban painter, sculptor, and educator, whose surrealistic, atmospheric polychromatic work", "The next Biennial should be held in 2020, according to the organizers.\n\n\n\n\n\n\nWhen fighting the authorities in Astana, Russia, in April, a group of twenty-five artists took to the streets, calling for the ousting of President Vladimir Putin and the reinstatement of the 1917 revolution. Protests against such an overhaul of the country’s monarchy and its alleged repression of anti-government protests had been underway for months.On April 3, the activists, who were protesting against police violence, set off fireworks in the Kremlin in support of the February 21 revolution. The event, which was organized by local activists, drew a large crowd, which also set off fireworks in support of the February 21 protests. Soon afterward, police used tear gas to disperse a protest, which had been organized by members of the Russian Orthodox Church. The next day, the authorities began evicting protesters from the Kremlin complex, which was already under construction, and the TV studio complex, which was slated to open in 2020, sparking protests and the departure of the president.In late April, a court in Moscow suspended the arrest and trial of Nikolai Patrushev, a leading artist who was arrested on suspicion of inciting subversion in connection with the incident. According", "The next Biennial should be held in October 2020.\n\n\nThe French Ministry of Culture and the Louvre have agreed to work together on a new exhibition dedicated to the work of French modern and contemporary artists, and the Louvre has released a statement announcing the event. The project will be organized as part of the country’s long-awaited overhaul of its public spaces. The overhaul—which aims to modernize the Louvre and the Sittwe-Ouile—will include the renovation of the Tuileries and the Palais de Tokyo.The news comes days after the Louvre announced that it would close its doors indefinitely, citing the Parisian calendar’s spring as the reason for the move. “The decision to suspend the exhibition programme for the whole of 2020 was made in order to continue collaborating with our partners in the French Federal Ministry of Culture and the Louvre, and to continue the work of our organization,” said Jean-Luc Martinez, director of the museum. “The French Ministry of Culture and the Louvre have always been conscious of the value of cooperation, respecting each other’s positions and keeping the exhibition programme open. The Louvre and the Ministry of Culture, together with the state of the", "The next Biennial should be held in the spring of 2021.The $5.9 million project, which was funded by a group of investors led by the Los Angeles–based collector and collector-designer Peter Hujar, was announced in December 2019 and is currently underway. It will include a new public sculpture, the first work by the artist in more than ten years, called “Atlas,” which will sit in the Los Angeles Memorial Museum until at least 2021. The museum will also have a new outdoor plaza on the museum’s south side, named for the city’s loneliest street, and will host an exhibition of work by Hujar’s contemporary artists, including Mark di Suvero, Tanya Ghent, and Bruce Pearson, and its first documentary film.The new exhibition will follow the documentary “Atlas” (2018), a feature film by the British filmmaker Mike Leigh, a documentary about a series of fictional events that took place in the fictional fictional town of Atlas, where Hujar lived and worked. Filmed in his mother’s basement, it was shown by a number of international filmmakers and was nominated for a BAFTA for Best Documentary at the Venice Film Festival, where", "The next Biennial should be held in 2020. The Art Newspaper reports that the 2019 edition, titled The End of an Age, was a bit more restrained than the recent event, which is why the museum chose to hold it in 2019. The exhibition’s director, Marina Redon, said: “The narrative of an artist who has lost her memory and is forced to face her past is often the only thing that remains of her achievement. The end of an artist is an end of a narrative, but one that may be meaningful to the audience. The theme of an artist who has made a real contribution to a larger art history and can help us understand and appreciate the global art history of the future is to us a very timely and compelling theme.”The upcoming exhibition will consist of fifty works, chosen in a triennial, as well as a new selection of work by artists that have worked on the agenda of the 2020 exhibition. It will run from April 16 to April 21, 2020. The 2019 exhibition was organized by the Institute for Art and Architecture in Milan and will be followed by a new exhibition of works by six artists from the United States in February 2020. The show will conclude with a discussion with the artist Stephen Friedman.", "The next Biennial should host a group show (2014–15) and an exhibition of works by artists who have not yet been included in a Biennial’s previous editions. The 2015 edition, which was held at the Museum of Modern Art, New York, announced plans to hold a special exhibition of works by new and established artists in 2020. The biennial will also include a new themed project by the Chicago-based artist Olu Oguibe. The program will be overseen by Sarah Hamilton, the Director of Contemporary Art at the Museum of Contemporary Art Chicago.“We are excited to work with Sarah Hamilton to shape the next Biennial and the upcoming exhibition with her vision and passion,” said Mark Bergin, the Director and Chief Curator of the biennial. \n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has received a gift of more than one hundred rare works by Marcel Proust, a key member of the French Modernist movement, and has named Adam D. Weinberg as the gift’s new patron. In a ceremony at the museum on Thursday, the Hirshhorn revealed that Weinberg, a Canadian citizen, will receive the first of a series of twenty-two", "The next Biennial should take place in Tokyo in March 2022. The artist-run exhibition will be hosted by the Hiromasa Museum of Art, which will serve as a staging site for the exhibition in the city. The exhibition will be organized as a symposium between the artist and the Hiromasa Museum of Art.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has appointed James Golding as its next executive director. Golding will be responsible for leading the institution for the next twelve months and will assume his post on January 6, 2020.“James is a seasoned leader who has been instrumental in transforming the Met into one of the most admired cultural institutions in America,” said Peter W. Singer, the institution’s board chair. “He is well prepared to guide the museum through a period of major change and will continue to shape the Met’s trajectory under his leadership. We are proud to welcome him to the Met, and look forward to working with him.”Golding came to the museum as executive director of the Port Authority of New York and New Jersey in 2014, following a nearly five-year tenure as the director of the Brooklyn Museum. The port authority, which serves as the hub for", "The next Biennial should be held in May 2021. The museum has already expressed its interest in the works of the late American artist Patrick Hayes, an early proponent and organizer of the Nude on the Floor movement, and has even hired his contemporary artist, Ruth Macgregor, to create a new exhibition about his work. The main focus of the upcoming exhibition will be the work of the pioneering bullfighter Billy Boyer and the impact it had on the careers of several American and international artists.\n\n\nIn a stunning move, the National Gallery of Art in Washington, DC, has voted to remove a group of twenty-one artists from its public collection for \"incompetence\" following a lawsuit filed by the heirs of the late Whitney Museum of American Art director Larry Gagosian. The museum’s board of trustees voted 3–2 in favor of removing Lazarus Scudder, John Scudder, and David Salle, who were accused of fraud and conspiracy by the heirs of the late collector Andy Warhol.It is the latest in a string of high-profile controversies surrounding the museum, which is grappling with the fallout from the death of Warhol’s longtime secretary of art, Chester Helmer. Helmer, who had been a longtime advocate", "The next Biennial should be organized in late spring or early summer 2019.The upcoming edition of the Berlin Biennale, titled “Between the Sun and the Moon” will take place in February 2020. Hereafter, the festival will continue to mark the seventh anniversary of its founding by organizing exhibitions, performances, screenings, events, and other activities under its auspices. Inaugurating the exhibition will be an exhibition of works by the Berlin-based artist Aline Maudltjäger, whose series, The Future Is Now, explores how the future of our planet may be determined by scientific research and technological advancement.“The Berlin Biennale is deeply committed to supporting artists and the creative process in diverse ways that are mutually supportive of both,” said Herbert von Kremer, chair of the Biennale’s board of directors. “I cannot think of a better partner for the upcoming Berlin edition than the BAM, which is committed to supporting both artists and academics.”The Biennale’s first-time partner, CERN, will invest more than $500 million in its research arm in order to advance research and to establish a new FabLab in Geneva. The proposed", "The next Biennial should take place in 2021, and the twenty-seventh in 2022.\n\n\nThe Museum of Tamagotchi, Japan, is planning to open a new museum dedicated to the 1920s on March 4, 2020. The museum will be located in the building that previously held the contemporary art arm of the Fuji TV station. The museum, which will offer more than twenty thousand works, will be inaugurated by a solo exhibition of work by artist Tanita Kawamura, which will be followed by a five-day exhibition of work by her daughter, Kimi Kawamura, which will be followed by a solo exhibition of work by artist Tatsuya Nakamura, which will run concurrently with the latter.The 55,000-square-foot museum will be inaugurated by a three-minute video work by the artist Miki Igarashi, titled Aru Naru (Blue Moon), which will be followed by a thirty-minute video work by the artist Takashi Kawamura, titled The Perfume of My Heart, which will be presented by director Satoshi Hasegawa. The works will also be featured on the institution’s website.The 2020 edition of Tamagotchi will be the theme “The Simple and", "The next Biennial should be held in November 2021. \n\n\nThe Metropolitan Museum of Art in New York has appointed Lauren Diamond as its next president and CEO. Diamond was chosen from a group of five finalists by director Maria Bontação. Diamond joins the museum from the Boston-based firm W.A. Burke & Partners, where she has served as chief executive since 2011. She succeeds Mary Anne Miller, who departed to become the director of the San Francisco Museum of Modern Art, and will take up her new post on January 6.“Lauren has been instrumental in the growth of the Met, supporting and cultivating artists and inspiring generations of artists,” Bontação said. “Her vision and energy are infectious, and we are honored to have her join us. The Met has been and will continue to be a member of the cultural fabric of the Bay Area and beyond, and Lauren has been instrumental in providing the platform for that to continue.”Commenting on her appointment, Diamond said: “We are privileged to have the opportunity to be partners with Maria and Paul in their journey to build upon the Met’s collection of contemporary art and to embrace the transformative power of art, both as an innovative", "The next Biennial should take place in 2020, and the final event will be held in 2022. The full list of participating artists is as follows:\n\n\nMERRY LUCK SHOW, LOS ANGELES, CA: LINDSAY CONNOR & ELLEN WILLIAMS (“The Lonesome House:” “The Grapes of Wrath:” “The Dangerous Game:” “The Big Sleep:” “The Last Picture Show:”  The Best of Friends, Ed and Eddverett: “Across the Room:” The Doomed, James D. Merwin:  “The Dove:” The film was shot on location in Los Angeles. “The Dove,” Hannah Wilke, and James D. Merwin, 'The Dove and the Wolf,” September 22, 2018, Los Angeles: \"The Dove’s’s’s’s Making of a Film,” September 22, 2018, Los Angeles: “The Dove:” October 29, 2018, Los Angeles: “", "The next Biennial should be held at a location that is accessible to the general public and will be organized following the guidelines laid out by the Art Fund. The 2019 event will be held at the artist-run space Mattamy Art Space in Venice, Italy.\n\n\nDian Dan Gallery in London announced today that the searched, museum-quality collection of ancient Chinese ceramics, ceramics from the Shang Dynasty, and Ming Dynasty, which is currently on display in the exhibition “Making of the Modern World,” will be the subject of an exhibition at the museum in 2022. The exhibition will be co-curated by Hua Chunying, curator of contemporary art at the National Museum of China, and Andreas Jonassen, director of the Kunsthalle Bern.The exhibition brings together seventy-four Chinese ceramics, ceramics from the Shang Dynasty (AD 618–11), Ming Dynasty (AD 12–19), and Tang Dynasty (AD 691–8), as well as twenty-three works from the Tang Dynasty and twenty-two from the Ming Dynasty (AD 691–98), among others. The exhibition is curated by Hua Chunying and will debut at the Kun", "The next Biennial should be held sometime in 2020. A second one will take place in 2022. The first will be held in the city in 2021. A third biennial will be created in 2021, and a fourth in 2020.\n\n\nThe Newark Museum in New Jersey has received a gift of fifty-six works by American contemporary artists, including the controversial “Die,” 1978, by Elia Saar; “The Emperor Sleeps: Art in Motion” 1981, by James Turrell; “Avant-Garde in America” and “Seth Rarick: Avant-Garde” (both 2009), by Seth Rarick; and “The American Worker in a Time of Crisis: A C. Wright Mills Narrative,” by Paul Klee, will also be restored. The works, which were donated by the artist and collector Steve McClellan, were acquired by the museum by way of a private sale in 2017 for $32,500. McClellan also lent the works to the museum.“This is a great day for the Newark Museum,” McClellan said. “I am very excited to restore these works to the collections", "The next Biennial should be held in the spring of 2021, the president of the European Commission, Jean-Claude Juncker, has said. The proposal for the event, titled “El Cómo Pábbaro”\u0097which translates roughly to “Apres de línea”\u0097was presented by José Manuel Barroso, the president of the Commission, at a summit in Lisbon.According to the president of the Commission, a number of artistic institutions are petitioning the Commission to hold a special exhibition during the event. Among these are the Museum of Modern Art Berlin (MoMA) and the Kölnischer Kunstverein (KUNST), which has been transitioning to a “multidisciplinary practice.” The institution has also been working on a redesign, which will be completed in the spring of 2021. The work of the artists who created the works in question will be showcased in the exhibition. The exhibition will be held at the Fondazione Prada in Milan and will include works by Mieczysław Bech, Wolfgang Bech, Claude Monet, Kamel Moulène, Pierre-Auguste Renoir, and others.The commission has faced resistance", "The next Biennial should be the final edition of Biennale Toronto, announced the organizers of the fair. “The opening of the exhibition is a defining moment for the entire city, and it is also a moment of great uncertainty for the artists participating in the exhibition. It is therefore essential that the exhibition be reopened as soon as possible.” Since the severe heatwave hit the city on March 13, the Biennale’s online viewing rooms have been closed, and the theme of the show has been “Telling Stories,” a theme that has previously been part of the biennial series. The theme of this year’s edition was that of the increasing influence of technology in people’s daily lives.The first edition of the Biennale in Toronto, which was held at the Rogers Arena in the spring of 2019, featured seventy-eight works by fifty-two artists, and was held on March 20–March 22. The second edition, which was held at the Rogers Centre in the fall of 2019, featured sixty-four works by fifty-eight artists and was held on March 24–March 28.The third edition of the Biennale in Hong Kong, which traditionally has taken place in the autumn,", "The next Biennial should be held in 2022. \n\n\nThe Mineralogische Kunstverein Berlin (MKW) has announced that Monica Schipper will become the next director of its Kunstverein. Schipper comes to the institution from the Rämistrasse, where she currently serves as organist of the yearly event, which attracts more than 1,500 artists and collectors. She succeeds Paul van der Egg, who announced in November that he would not be returning to the museum.Schipper will assume her responsibilities in August 2019. She will also assume the role of director of the museum in June 2020.Commenting on her new responsibilities, Schipper said: “I am very much looking forward to utilizing the new powers of digital technology, and by using them, to expand the Kunstverein’s activities. I will work to combine the museum’s collection with that of the Rämistrasse and other contemporary art museums in the country. The new digital platforms will help us to produce an exhibition whose beautiful interplay with the natural world will include a daily and weekly outdoor audience.” \n\n\nThe National Galleries of Scotland (NGA) has launched a new online platform dedicated to the work", "The next Biennial should be held in 2021. <|endoftext|>1. It is now playing at the top of the box office for the fourth consecutive weekend, with The Force Awakens having topped the domestic tally for the first time. The film opened to $55.5 million on December 15, ending its three-day run with an estimated $151.3 million take in its second outing, for a total of $168.4 million. Force Awakens will likely set a new record for the most wide releases in a single calendar year, eclipsing that of Avatar, which opened on December 12, 2013, and Jurassic World, which opened on December 14, 2015.The figure is actually higher than that of Avatar: $143.1 million, a collaboration between director Colin Trevorrow and principal photography company 20th Century Fox, which is affiliated with billionaire Richard Branson. Branson was listed as a partner in the film company in an auction listing that was released on Tuesday, January 8, but the sale was only for the visual effects, and has since been placed on hold. The auctioneer, who invited several galleries to participate in the live event, including Damien Hirst, Giacomo Savill, Alexander Mc", "The next Biennial should focus on issues of sustainability for art, culture, and people, and will unveil a new initiative, “Sustainability for Art,” that will engage with the artists, designers, and institutions that create and host contemporary art. The biennial will also unveil the willowy, color-saturated, wood-paneled, glass-enclosed, stone-enclosed, and stone-enclosed homes and institutions of the biennial.The opening of the biennial remains a key element in the cultural and economic revitalization of the capital, which has had a chronic unemployment rate of over twenty percent since the pandemic began in Wuhan, and is a major draw for visitors. The biennial has also become a magnet for visitors from China, India, Japan, Korea, and Vietnam, who flock to Wuhan to see the artist-driven works of the past. \n\n\nThe Pan-African Art Museum (PAMM) in Dakar, Senegal, announced on Tuesday that Njamela Horan has been appointed director of the institution. In her new role, Horan will oversee the management of the museum’s collection of contemporary art and will provide strategic direction for its expansion in", "The next Biennial should be held at the LASALLE University in Santa Ana, California, in 2021.“The journey of finding a new home for the exhibition will be an inspiring one,” said Kate Martin, director of the museum. “We look forward to the events of the future as we reflect on the exhibition’s legacy and its original intention.”The museum will also honor the museum’s founder, George Gillett, who served as president of the department of anthropology at the institution from 1969 to 1975. In recognition of his lifetime achievement, the museum will organize an exhibition dedicated to his life and legacy.\n\n\nThe National Museum of Fine Arts (NMA) in New York has appointed Sharon Hayes as its new executive director. Hayes comes to the institution from the Scudder Museum of Art, where she has served as director since 2010. She succeeds Meredith Mathews, who was hired as director of the Washington, DC–based arts-fluence biennial The Future Is Present, in October 2020, and will begin her new position in January 2021.“Sharon is a leader, knowledgeable and creative, who is dedicated to supporting the NMA as a national leader in the collection and presentation of contemporary", "The next Biennial should take place in 2020.\n\nFor years, the Biennial of Venice designated the 1,500-year-old Madonna’s Garden as a monument to the memory of the Italian designer Giacomo Beccaria, who designed the building in the late 1940s. On February 3, 2017, the Italian government approved a special commission to carry out a comprehensive renovation of the city’s historic Mezzogiorno complex, and the planning committee convened to approve the project.“I believe that this work will bring the city of Venice the true history of Giacomo Beccaria, and will show him the way to create a new world, a new model, a new vision for the city,” said Silvio Cical, the city’s culture minister. The commission, led by architect Leonardo Cicutto, was established to establish a new monument to the Italian designer as well as to carry out a detailed survey of the garden, which is located in a one-hundred-thousand-square-meter parcel of land in the city, and to make a selection of works by Beccaria.“There is no better time to manage a garden than right now", "The next Biennial should be scheduled for 2020. The date of the opening of the Swiss city of Basel is also still unknown.\n\n\nThe National Geographic Society in the United States committed on Wednesday to ending its relationship with the fossil-fuel company Royal Dutch Shell in a landmark legal move that could reshape the way the world consumes and uses oil. It also said that it plans to begin rethinking the way it purchases and uses fossil fuels.“This is a historic moment,” said Norman Chan, president of the National Geographic Society. “We are embarking on a new chapter with a new company, one that will operate in an environmentally responsible way for the next fifteen years. This will include rethinking how we develop and store the world’s natural resources, and determining how we get to zero emissions and how we move forward.”The announcement marks the end of a nearly twenty-year legal battle between the Smithsonian American Art Museum (SAAM), the National Gallery of Art, and the National Museum of African Art in Washington, DC, which had pitted the institution against Shell, which it partnered with for the last fifteen years, against the backdrop of the global climate emergency. The court ruling marked the culmination of more than two decades", "The next Biennial should open in March 2020. In the meantime, the museum is working to organize more exhibitions, more education initiatives, and more community events. The exhibition hall will be expanded to provide more space for the museum to display the works of emerging and established artists. The biennial will also dedicate more space to local communities and the exhibition will focus more on how to engage with local and regional communities.“Communities and artists are our powerhouses, and when they step into the museum, they are given a sense of community and a sense of purpose,” said Burkhardt. “I can’t wait to see what they do next.”\n\n\nThe Sandstone Art Museum, Los Angeles, is planning to shutter its doors in March 2020 amid an ongoing funding crisis. The institution announced on Tuesday that it is using the $3 million from the Doris Duke Charitable Foundation and is working with the Doris Duke Foundation on a new $2 million gift.“The museum is being guided by a very clear and simple logic: the more we give to causes that benefit artists, the more we get back in our own pockets,” museum director Tom Fazio told Artnet. “We are not in", "The next Biennial should be held in 2022, the earliest date the city has announced. An immediate goal of the city is to raise $50 million to expand the exhibition’s 35,000-square-foot space to 55,000 square feet. The new venue will host a number of exhibitions, including a retrospective of the artist’s work, Lilly James-Landreth’s “The Self-Creation Papers: Avant-Garde Painting and the Paris Exposition” (2019), and a special exhibition of work by the Los Angeles-based artist Miki P and a number of work by artist-at-large such as Mario Tatar and Oliver Wong.The Biennial will be held in the city’s Bayview district, which has been the site of significant redevelopment projects in the past few years. A new luxury apartment building, completed in 2016, is planned for the area, while a new public park, the newly renovated Civic Center, and the Museum of Contemporary Art LA, which opened in 1977, are also part of the city’s plan. The city also plans to open a new museum in 2020, but the first exhibition of art by the artist-at-large Hiromi T", "The next Biennial should be held in 2020.\n\n\nAlexander Wang, artistic director of the Shanghai Biennial, said: “Over the last few years, the Chinese art scene has undergone a period of great transformation, and our collaboration with the local, regional, and international community has been an important step in building on this emerging stage. Since the inception of the Shanghai Biennial in 2016, we have worked tirelessly to establish an international platform for contemporary art. We are now proud to present our inaugural exhibition in the city of Shanghai, ‘All in a Day’s Eye,’ which shows the works of more than 130 artists. It has been an inspiring experience to collaborate with artists from around the world, and to work with the talented and dedicated team at Coachella Valley Viewing Gardens, which is nestled in the foothills of the Yangtze River in the heart of the medieval city of Beijing.”In addition to hosting the exhibition, Coachella Valley Viewing Gardens also partnered with the local museum to create a new public art project for the showcase. The new work, titled Fly, was made with the help of a drone, which soared above the artists’ heads as they created a highly realistic, multi", "The next Biennial should be held at the upcoming edition of the Venice Biennale, and will be staged in June 2022.  Source: The Artist and Artforum/Artforum Artnews<|endoftext|>This post may contain affiliate links; please read the disclosure for more information.\n\nPin 3K Shares\n\nThe Metropolitan Museum of Art in New York City announced today that it is preparing to reopen to the public in mid-March, following a four-month closure due to Covid-19. The institution, which is located in the former factory district of East Harlem, has been closed since March 3. On Thursday, March 7, the museum re-opened with nearly three-hundred exhibits that were temporarily closed due to the pandemic. While the museum continues to face a $62 million shortfall due to the coronavirus, it expects to open this week.According to the New York Times, the Metropolitan Museum of Art has spent more than a year developing the public-health strategy for a statewide response to the coronavirus, which includes developing an emergency plan for museums, developing outreach to local communities, and improving the accessibility of exhibits and services through the museum, which has more than 3,600 galleries and more than 260,000 square feet", "The next Biennial should take place in the city in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco is planning a major renovation of its building. It intends to re-activate the ground-floor and upper-level galleries and add new activities and public areas. The project, called the Center for Contemporary Art, will include a new public gathering space, a new public sculpture garden, and new public spaces for education, visitor services, and research and preservation.The renovation will also include the construction of a new lecture hall, a new reception room, and a new entrance on the first floor. The renovation is part of the $750 million renovation project that also includes the expansion of the museum’s main building, which is being made in partnership with the city of San Francisco, the San Francisco County Supervisor, and the San Francisco Museum of Modern Art (SFMoMA).According to MoCA spokesperson Amanda Eller, the renovation will bring the museum’s total renovation costs to $1.5 billion. MoCA director Robert Giard said: “We will be able to weather the storm, but this is a new era. We must keep moving forward and sustain the Museum’s artists and the program we offer each", "The next Biennial should take place in the summer of 2021.\n\n\nChiang Mai Art and Architecture Festival’s board member and founder, Koki Tse, announced on Tuesday that the event’s next edition will take place in the second half of the year. The 2019 edition, which was held at the Chiang Mai Art and Architecture Festival (CMAF), saw only a few hundred visitors.The announcement followed discussions with festival-goers and the board of directors. “We were all in agreement that between 2019 and 2021 you had enough of the year to spare,” said board member and CEO Koki Tse in a statement. “So we asked ourselves, what year will it be in 2021?”\n\n\nThe Zurich-based nonprofit Art Basel and the Hong Kong-based exhibition house PAMPEL are expanding their collaboration in the art world by launching a new digital platform, Artnet News.The online platform will be powered by Artnet and will deliver daily updates about Art Basel’s digital initiatives, including its upcoming events and the development of its new digital initiative, Innovations, which was launched last October. The platform will also serve as a platform for the arts and culture industry,", "The next Biennial should take place at the Museum of Contemporary Art in Washington, DC, in 2023.  JOHN KIRK-BASCH Illustration (1940–1966)The photojournalist John Kirks’s first project for the museum was “The Strange Case of Jean-Luc Godard.” The exhibition was organized to commemorate the artist’s 150th birthday and to present a reconstruction of the film for the first time. The exhibition was also inspired by a previous work the artist made for the museum, the “Lucie Art Gallery” in New York in 1940. A retrospective of the artist’s work was organized for New York’s Museum of Modern Art in 1972.John Kirks, who lives and works in New York, has presented work in the exhibition galleries of the Museum of Modern Art, the San Francisco Museum of Modern Art, and the Brooklyn Museum of the Arts. Kirks was a member of the staffs of the Los Angeles County Museum of Art, Los Angeles, and the Metropolitan Museum of Art, the Warner Theater, and the Los Angeles County Museum of Art, and was a contributor for the Los Angeles Times. His photographs are in the collections of the Los Angeles", "The next Biennial should be on May 24–May 28, 2020. During April and May, the museum will be closed to the public. The museum has also unveiled this year’s exhibition of the work of the late Pakistani artist Gulaaz Ahmed. His works will be on view in the newly opened Biennial of South Asian Art.The design of the biennial, which commemorates the beginning of the “liberation of South Asia” in 1947, was inspired by a painting by the late Pakistani architect Zulfiqar Ahmed. The former Pakistani chief architect collaborated with Ahmed on the project, which was part of a larger project to design a museum dedicated to the history of South Asia. The museum would become the first museum of its kind in Lahore. “In 1965, Zulfiqar Ahmed, with Iqbal Bhatt, we conceived a building for the museum in Lahore, which is still in the planning stages,” said Zulfiqar Ahmed. “We chose to make the museum in Lahore a contribution to the history of South Asia, a museum of the past, a museum based on the power of art, and a museum of Pakistan. We also wanted the museum", "The next Biennial should open in December 2021, the organizers say, and will feature six works by twenty-seven artists, including Nicky Khouri, Jonah and Luiza Bruguera, and Felix Groll, among others who will come together around a theme that is interlinked with themes of life, death, and rebirth.The artists will be chosen through a public competition, which will run through March 28, 2020, and will be announced on February 29, 2021. The theme will be determined by a jury comprising Zhelezni Naidoo, artist, Gorillas in the Mist; artist and educator Zoya Sargent; visual artist and educator Gustavo Delvalle; artist and educator Denys Obel; and artist and educator Anibal Sanz.\n\n\nNew York–based collector, artist, and educator Michael Kanda, who passed away last month at the age of eighty-one, was a central figure in the history of modern art and architecture. A pioneer in the field of Japanese design, Kanda was a prolific creator of works in both print and digital form. His photographic series, which often featured artists who worked alongside him, was highly influential both for his visual vocabulary and for the way he shaped the postwar Japanese", "The next Biennial should focus on: “Imagining the Future,” the theme of which was “curating the future.” It should also explore how the future of art and culture might be impacted by the pandemic, and how this might shape the public understanding of art and culture. Pace’s curator of photography, Mihai Pichai, said: “I’m constantly inspired by the artistic and artistic endeavor of the students and faculty of the school. I also like to think of them as the new Tadao Ando, the first to take on the role of principal curator.I think that they are a dream team and their collaboration and collaboration is well deserved. Their passion for photography is infectious, their enthusiasm for collaboration is contagious, and they have a great sense of humor. They are sincere about their vision of what a future should be for the university, and I know they will pull their weight together to make it a priority this year.”\n\n\nThe Metropolitan Museum of Art in New York has released the list of seventy-six donors who will receive a significant sum of $3.8 million in the construction of the new Met Galerie in the fall of 2020.", "The next Biennial should begin in February 2020 and be completed by March 2021.\n\n\nThe Smithsonian’s National Museum of African Art in Washington, DC, has completed its renovation and expansion of its building, which recently underwent a $100 million facelift, and is now ready for its inaugural season. The undertaking, which involved the removal of more than 1,900 artifacts from its holdings and led to the reopening of ninety-four of the museum’s seats, has been described as one of the most ambitious restoration projects undertaken by a museum institution in its seventy-five-year history.“Building on the promise of National ‘American Art’s’ founding in 1916, the National Museum of African Art seeks to make a new kind of contribution to the country’s intellectual life and to the history of art,” said David Krasner, president of the Smithsonian.The renovation of the National Museum of African Art—which opened in 1940 and was relocated to its current home in 1977—also included the creation of the National Museum of African Art Research, which will bring together the collections of the Smithsonian’s African Studies Center, the African American Museum, and the Library of Congress in a new venue that", "The next Biennial should take place in the autumn of 2021. The festival will be held in the capital city, Helsinki, as part of the Helsinki Art and Architecture Biennial. The exhibition will commemorate the reopening of the museum in December 2021, and will be curated by Hoa Hakanen, the director of the early-career Helsinki Art Museum. The exhibition will be supported by a new exhibition funded by the deputy director of the Helsinki Art Museum and the new exhibition hall, which will be erected on the second floor of the Museum of Arts and Architecture.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Amanda Zuccaire as its new deputy director. Zuccaire will be responsible for leading the museum through its first restructuring in thirty years, and will assume her new post on August 1.“I’ve long admired Amanda and her ability to create compelling new experiences for audiences in partnership with art and her dedication to the art of the arts,” said Mark Bradford, chairman of the board of trustees of the Museum of Contemporary Art (MoCA). “In the years since she has built a reputation as one of the most important and influential women in modern art. She’s done this while managing", "The next Biennial should be held at least once a year. \n\n\nThe Metropolitan Museum of Art in New York is rethinking its long-standing practice of excluding certain works from its exhibition “Hard Times,” which explores the legacy of American capitalism, and is instead planning to present its first exhibition with a new collection of works by artists whose work has rarely been on display. The exhibition will feature “Surrealism” and “Avant-Garde” paintings and will run until March 14, 2020.“Harriet Coles has served as the head of the Met since 1997, following a tenure that coincided with a period of rapid growth in the museum’s international art collection,” said Michael Govan, the museum’s president. “Harriet has led the Met through a period of remarkable transformation and has been instrumental in helping shape the current exhibition program. She remains an integral member of the Met’s family.”Coles, who has helmed the museum since 1999, began working on the exhibition, which opened to the public in 1992 and featured the first paintings by American artists such as Ed Moses, Elyn Zimmerman, Pierre-Auguste Renoir, and Kurt", "The next Biennial should focus on the role of art and culture in the ongoing work of the colonialists. We should also reconsider the historicity of the festival, which has become a platform for the promotion of Western values and a platform for the revival of colonialist ideas.”Commenting on the upcoming event, Mohebbi said: “The future of the Biennial lies in the hands of the people of Bangladesh, who are resolutely dedicated to the future of their country and to the future of their nation. We are determined to work together in harmony with them, and to offer them a platform for their voices to be heard.”\n\n\nThe Bessie and Richard A. Neugroschel Collections, which have curated more than sixty-five exhibitions spanning more than three hundred years in New York, London, and Paris, are parting ways with the artist-run nonprofit ArtStation, which has hosted the works of Neugroschel and other artists since the 1970s. The company said it lost confidence in the curatorial team’s ability to sustain the nonprofit’s ongoing programming, which has included programming that was planned for low-income and Black communities and other events with participation from artists such as Rashid Johnson,", "The next Biennial should take place in the spring of 2022 and will be inaugurated by an exhibition of works by Maurice Breuhler, and will include a selection of works by artists who have been excluded from previous editions. The show’s curator, Per-Olaf Ricke, described the event as “an expression of our collective past; one that belongs to us, and one that we can’t forget.”The 2019 edition of the exhibition, “United States,” featured work by forty-eight artists including Takir Ali, Jamar Sobran, Tiran Saeed, Ahmad Shakir, Reem Akram, Andra Al-Hadid, Wangari Desai, Yishuang Jiao, and Wang Chih-Hui.\n\n\nLiberty House, the nonprofit organization dedicated to supporting and providing access to art in crisis, has announced that it is expanding its work to include “non-commercial, not-for-profit, artist-led interventions.” The nonprofit was founded in 2011 by Carolyn Bennett, Tyler Bennett, and Nicholas Negrete, and is headquartered in the Allen Center in Atlanta. The", "The next Biennial should take place in Dubai in 2022. In the meantime, the institution is encouraging artists and creatives to consider working with the institution in order to foster a more sustainable future. “Doha is an important base from which to organize exhibitions and programs,” the museum said in a statement. “In order to prevent the deterioration of the exhibition and program, the museum has established the Biennial Awards (BAs).” The awards are given out in recognition of the contributions of artists and small and mid-size galleries and organizations, as well as artists and artists-in-residence.The first award, which was established in 2017, is given annually to a Bahraini artist. The figure of $50,000 for the second award is even more auspicious. The institution said that the BAs will be given to “two artists based in the United Arab Emirates, one from the UAE’s Economic City of Doha, and one from the UAE’s northern province of Ras AlKhaimah.” The biennial will then return to New York for its third edition, which will take place in 2022, and will conclude with a taqwa, or a religious celebration.\n\n\n", "The next Biennial should be held in the Qatari capital Abu Dhabi, in March 2021. The Biennials were established by the Qatar Foundation in partnership with the Abu Dhabi Contemporary Art Centre (ADCC), the Al-United Arab Emirates, and the Qatar Institute of Art.\n\n\nThe Leos Art Museum in Beijing announced today that its acquisition of three works by the late Taiwanese artist I-San, published in Taiwan’s 一本建秀, 全建秀, and 圔面, respectively, in the January 2018 issue of Artforum, is now complete. The acquisition, which was part of a larger deal signed by the museum and the artist’s heirs over the last twelve months, netted the museum $6.5 million for the exhibition.The total value of the works at the museum is now $91 million, bringing the total value of the estate over the course of the artist’s career to $223 million. I-San’s works are currently on display in the museum’s Contemporary Art Museum, and his works are currently on display in the artist’s hometown, Taipei; at the Coronet Museum, London;", "The next Biennial should document and analyze the history of the contemporary Cuban art and culture from a Cuban perspective, particularly from an urban and rural perspective, and should consider the relevance of the art of Cuba to the cultural life of the United States, the Americas, and the rest of the world. The theme “Don’t Forget Cuba” should be used as a metaphor for the contemporary Cuban experience.“With a view to celebrating the centenary of the founding of the institution, the forthcoming biennial will also reflect on the importance of the museum in contemporary Cuban history, including its evolution as a state museum.”The biennial will also include a retrospective of the works of the Cuban-born Venezuelan artist León Rosales and the first exhibition at the institution. Two works, 1983 and 1983, are currently on display in the museum.28 years after the museum opened in the Castro, the museum exhibits more than 4,500 works.\n\n\nThe Museum of Modern Art (MoMA) in New York has hired Laura Burke as its next executive director. Burke will be responsible for coordinating the museum’s fundraising and programming, overseeing curatorial and educational initiatives, and overseeing the institution’s expansion into a new building that will take", "The next Biennial should be called for the next two years. The Biennale will be held at the new venue in the second half of the year. Istanbul’s design will be inspired by the city’s Rose Garden, which celebrates the Islamic holiday of Eid al-Fitr.The exhibition will also include Abridged editions of the works, which will be accompanied by a new website and a special exhibition, “Amerindian Art of the East,” curated by Hukum Ertejav, which will run from January 12 to March 8, 2020, and curated by Sallu Umitvi, which will run from March 23 to March 25, 2020. The exhibition will feature works by new and returning artists, and will include new works by artists whose work has not previously been exhibited at the Exhibition, including Ravindra Nath (1958), Patil (1958), Sajid Dutta (1959), and Terjea (1961). “The exhibition will engage with the history of the exhibition and the design of the exhibition, and will seek to understand the contemporary cultural landscape in a way that is respectful of", "The next Biennial should take place at the Museum of the Moving Image in New York in 2021. “The Art of Life: Biennial of the Art Museum, Chicago’s 'Life Cycle” will be held at the Horton Center in 2019. The third edition, “The Art of Life: Biennial of the Smithsonian American Art Museum,” will take place at the Museum of Modern Art in 2021. The fourth and final iteration, The Art of Life: Biennial at the Metropolitan Museum of Art, will be staged at the Metropolitan Museum of Art in 2020. The 2020 edition of “The Art of Life” will also include the contributions of J. Paul Getty, James M. Cain, John Henry, Robert Rauschenberg, and Richard Avedon. For the 2020 edition of Artforum’s 'Ask the Experts”, Larry Gagosian and Juliana Savitzky presented the collection’s first exhibition of new work by artists such as Robert Irwin, Angela Pausch, and Lynn Nottage. \n\n\nThe Museum of Contemporary Art (MoCA), Santa Monica, announced today that it has received a gift of twenty-three works by Kathleen Cleary", "The next Biennial should take place in Beijing in 2022. \n\n\nA group of artists, including Emily Chan and Lee We-qi, have launched a campaign to have the British Museum’s Venice Biennale declared an international cultural heritage site. In a letter sent to the museum’s board of trustees last week, the artists urged the board to support the activists’ efforts to have the exhibition declared a “world heritage site” by the United Nations. The letter claimed that the institution has failed to appreciate the “global economic crisis and the fact that the cultural sector and the economy is facing unprecedented challenges,” and demanded that the museum board recognize the significance of “Venice’s’ engagement in the global cultural life of the world and act as a model for cultural cooperation and collaboration in the future.”The letter was signed by the following artists: Matthew Booth, Christopher Wool, Sianne Ngai, Jay-on Kang, Swaleel Ahmad, Elyn Watson-Pritchard, and Yashar Ali.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Jodi Redgrave as its next director. Redgrave comes to the museum from the Los Angeles", "The next Biennial should be announced by May.\n\n\nItalian artist to earn $1.5 billion for painting projects at the Milan-based nonprofit Renaissance Center. The Hesperia-based organization had been working to raise $500 million for the three-building project, which will create more than 1,500 architectural and interior spaces, and was planning to break ground on the center in 2016. Its previous iterations, the Enzo Cipolletta Gallery, were completed in 1965 and 1966, respectively. The new project, which will be called the Museo Dalluzio, will be managed by the same team that designed the Enzo Cipolletta, and will be inaugurated in the Italian city in 2019. The institution will house up to 1,500 works.The $200 million third project, the Museo Archeologico, will expand the museum’s collection by adding more than 300 new works by the likes of Wernher von Braun, Joachim Neubert, and Franz Kohn. The Centro Museo di Lettice will be relocated to the northern region of the city, and the institution will hold its inaugural exhibition in 2021. The new location will also include a conserved �", "The next Biennial should aim to indicate the boundaries of contemporary art, to introduce a new generation of artists to the revolutionary process of the twentieth century and to bring them to the exhibition. We believe that the exhibition can be a positive initiative for the integration of the entire world around us.”Dürer’s seminal exhibition Biennale des Jahres (1938–1940, Bochum) is considered to be the template for the exhibition-formatting biennial, which is repeated in the Biennial of the Paris Obelix, the Biennial of the Sherwood Forest, the Biennial of the Helsinki, the Biennale of Moscow, and many others. The show, which celebrates the transformative power of art, was organized by Herbert A. Münther in collaboration with the Frankfurt-based artist Hans Kültler, and is considered one of the first exhibitions devoted to “visual art” in Germany.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Barbara Kruger has been appointed as its next executive director. Kruger has served as interim CEO of the museum since April and has been a board member since September. She succeeds João Barbosa, who retired in September 2019", "The next Biennial should capture the essence of the experience; and should combine the English and the German language, the physical and the spiritual, and be organized according to a single theme.”\n\n\nThe Bienal Gallery in Rome, which has been closed since June because of Covid-19, is planning to reopen in early October with a new exhibition titled “The Last Autumn: Italian Art in the Eighteenth Century.” The show will feature works by eighteen artists, including Hannah Wilke, Marc-Olivier Gaillard, and the late Gio Ponti, and will be held throughout October in both the Bienal Gallery and the University of Bologna.The exhibition has been in the works since 2018, when the Italian artist Stefano Cattelan published a series of photos, taken in Palermo, Italy, in 2011, that showcased the works of a dozen artists in his studio. Cattelan was not aware of the cultural center’s location in the city of Bologna, which was then under construction and undergoing a reopening.Following the artist’s death, the Bienal Gallery organized a show of his works in 2017. The show, titled “The Last Autumn", "The next Biennial should focus on what ends up happening when people are denied basic civil rights. It can and will change. I am convinced that the future of a free and democratic Ukraine rests in the hands of the people. I am hopeful that in the face of this crisis, we will be able to emerge stronger, more united, and with a future in Europe and the world.”\n\n\nThe National Gallery of Art in Washington, DC, has received a $21 million donation from the Charles and Lucille King Family Foundation. The gift is the largest gift made to the institution since it was founded by the couple in 1967. The $8 million gift also includes a $5 million loan to the institution that is being repaid within a year. The National Gallery of Art was established in 1889, when the brothers Charles King and W. R. King donated $5 million to the family’s plan to build a new national museum. The National Gallery of Art has long been regarded as one of the nation’s leading cultural institutions, hosting more than 150 exhibitions and events annually. The family’s historic trust has contributed millions of dollars in support of the museum’s expansion efforts, including the construction of its first building, the Charles", "The next Biennial should be a celebration of the archives at the Palazzo Grassi, the institution where the landmark exhibition “Lorenzo Codreanu” (1927–1997) was organized. The work will be curated by Paolo Manzoni, who was appointed director of the Palazzo Grassi in April and was given the task of reopening the National Gallery in Rome in 2019. José Manuel Roldan, the former director of the National Museum of Modern Art, announced that the institution would reopen in May.The next edition of the Venice Biennale will take place at the Stedelijk Museum, Amsterdam, from May 25 to May 30. The event will also be hosted in the Italian city of Bella Città, from April 17 to April 19. The twenty-fifth edition, slated to take place at the Palazzo Grassi, will be hosted by the National Museum of Modern Art in Vienna, and will be held at the MAMCO, the National Gallery in Graz, and the National Palace of Fine Art in Beijing.\n\n\nThe French artist, who passed away in Paris on Sunday at the age of eighty-three, was known for his use of materials created in his", "The next Biennial should begin in October 2020 and conclude in March 2021. The 2019 exhibition was held in the same location as the museum since its opening in 1984. On January 5, the museum’s business and cultural district began a weeklong shutdown, and on January 6, the museum’s operating budget was halved. The museum’s new budget of $6 million was announced on January 10. For more than a year, the museum has been closed owing to COVID-19. On July 23, the museum reopened with new programming, including an exhibition of works by German and international artists. For the past six months, the museum has been closed because of a lack of funds. “We are currently facing a difficult situation,” said Museum Director Amada Cruz. “Our team works tirelessly to support the full range of curatorial and historical work at the museum, and to come up with new ideas that will allow us to continue to present exceptional exhibitions and programs that are open to the public.”\n\n\nThe Pérez Art Museum Miami (PAMM) has been awarded a $750,000 grant by the Art Fund to help defray the cost of the", "The next Biennial should take place in the second half of 2020. The theme for the 2020 edition will be “Changing Cultures,” and the first exhibition will be “The Great Reset.” The 2019 edition of the exhibition was organized by the Los Angeles–based firm Artnet and featured work by forty-four artists.\n\n\nThe Pérez Art Museum Miami (PAMM) has received a gift of fifty-two works from the Pérez Collection, including fifty-six works from Pablo Picasso, twenty-four from Louis Vuitton, and twenty-three from the artist’s principal collaborator, Luisa Del Carmen. The works, which are currently on display in “Aristoteles: The Autobiography,” are part of the museum’s collection of “Feminine,” a retrospective of works from the artist’s previous period, the prelude of which lasted from 1977 to 1982.The works were donated by the Pérez Family to the museum in 2016, following three decades of exclusive exhibition-based relationship with the artist. The gift includes forty-three works, all from the Pérez Show, between 1973 and 1975.", "The next Biennial should be announced by the end of the year, and the Board of Directors will then decide whether the exhibition should take place. The twenty-fourth edition of the biennial, which will also be hosted by the Association of American Prostitutes, is currently on view through November 25.\n\n\nThe California Arts and Arts Spaces (CAAS) announced today that it is organizing a series of events and exhibitions in support of the film-and-video-art movement and the fight for better working conditions. The October 20–25 event, titled “Fight for Better Working Conditions,” will be hosted at ‎CAAS’s campus in San Francisco. Participants include the California Nurses’ Association (CNA), the California School of the Arts (CSA), the California School of the Arts (CSAAS), and the Los Angeles Police Department (LAPD).“I’m excited to partner with CAAS to foster a conversation about the art of the digital age,” said Kate Kelly, the executive director of the CNA and a cofounder of the advocacy group CSA. “These are critical times for artists and their unions, and we must push back against the new digital-age bosses", "The next Biennial should open in 2021.\n\n\nSydney’s Mira-Riën Arts Centre has received a gift of $10 million from the Mercedes-Benz-linked philanthropic organization Art + Change. The grant was made in support of a new $50 million initiative that will 'explore how art and technology can transform the way we live, work and play together.”The Mira-Riën Arts Centre is the latest institution to receive a significant sum from the Mercedes-Benz Foundation, which has given $7.5 million to the Sydney Opera House, $5.5 million to the Sydney Museum of Art, and $5.5 million to the Sydney Museum of Modern Art. The foundation also recently gave $1.2 million to the Australian Museum of Fine Arts, $1.4 million to the Australian National Gallery of Art, and $1.3 million to the Australian Museum of Contemporary Art.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the ongoing reopening of public cultural spaces that were partially closed due to the Covid-19 pandemic. The guidelines outline how cultural institutions can reopen if more critical infrastructure", "The next Biennial should be held in 2022, before the novel coronavirus is contained. However, Dr. Prescott told the Art Newspaper that she is still anticipating the demand for the exhibition to continue past 2020. Dr. Peter Moen, the president of the Moen & Co. gallery, said: “We are hoping that the festival will continue to be a platform for contemporary and global art. We hope that it will continue to be a place where artists can come together for an open and welcoming environment. It mustn’t be overshadowed by any other event or by any other theme.”\n\n\nThe museum’s board chairman, Jeffrey Katzenberg, announced today that it will add six more works by women artists to its collection, bringing the total number of female artists represented in the institution to thirty-five. The changes will be made in the next stages of the exhibition process, which is currently under way. Following the announcement, Katzenberg said: “These new works are part of a long-term project to further define and elevate the museum’s representation of women artists.”The six new works will be added to the exhibition “Women Artists in the Modern World” (2017–18", "The next Biennial should look more like a mix show, with different artists from different countries performing together. It also said that the theme for the upcoming event should be an extension of the theme for the Festival. The organizers have not yet decided whether to call the event the ART Biennial, which was originally scheduled to open in 2019, or the ART Pavilion, which was originally scheduled to take place in 2020. \n\nThe Tate’s board of trustees has appointed Andrew P. Davies as its new chairman and CEO. Davies succeeds Alan Parker, who has served as director of Tate Ireland since 2017. He succeeds Peter Schäfer, who has been in charge of the museum since 2007 and is retiring this month.“The board is grateful for Alan’s service to the Tate, as well as for his leadership and vision for the museum’s future,” said board president Maria Balshaw. “The board is confident that Davies will continue to enhance the museum’s international reputation and develop new and innovative ways to give back to the local community through exhibitions, education initiatives, and retreats.”Called for work to be carried out by artists and galleries in collaboration with Tate staff and visitors, Davies", "The next Biennial should take place at the Centre Pompidou in Paris next year. Speaking to the Art Newspaper, the museum said: “On behalf of the committee, I am very pleased with the result. The conference will be an exciting continuation of the events that have taken place in France since 1920. And in the new Centre Pompidou, we have the opportunity to create a new dialogue with the East, to create a new international exhibition series. We look forward to introducing the new works from all over the world to the followers in New York and Paris.”\n\n\nThe third edition of the National Galerie Galerie in Paris, titled “Sensuality/Sensitivity,” was held on September 29–30 and featured work by twenty-four artists, including Jacky Boehm, Yoshitomo Takahashi, Bainaz Ansari, Diane Arbus, Eike Schmidt, Dragan Scarlatti, Carsten Slonimski, and Taa Sofya. The exhibition ran from September 29–October 18.For its twenty-fifth edition, titled “A History of Naked Worlds,” the museum opened its new 14", "The next Biennial should be in 2020. Over the years it has hosted twenty-one exhibitions, including “Sulik” (2016), “Odd*,” (2016), and “The Elephant in the Room: Art in the Age of Mechanical Reproduction” (2016).Commenting on the commission, the artists said: “While we may not be able to see the exhibition through to completion, we are fully committed to presenting our work in the most immersive and experiential manner possible. We hope that the show will serve as a model for others to consider collaborating with us and think of additional ways that their art can be exhibited.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines outlining how private collectors can display works by artists and institutions in the city, as part of a five-year, $2 billion plan that aims to improve accessibility and diversity in public art.Under the guidelines, which were published by the DCLA on June 5, artworks must be placed in a location that is accessible to the public and must be accessible to a reasonable degree of mobility. In other words, museums must live up to the “compelling aesthetic needs of a given community", "The next Biennial should be held at the end of March 2020.  The 2019 event, which was originally scheduled for March 24–March 27, drew an announced attendance of only 3,500 people and was canceled. The hectic Springboard for the Arts (HoFA) in San Francisco will simultaneously host the first and second Biennial biennials in the spring of 2020. In a statement provided to Artforum, the institution said: “We are excited to have the opportunity to present the first exhibition of our next project, the exhibition ‘The Rise and Fall of American Literature,” which will consist of “two handpicked texts on the history of American literature,” in the spring of 2020. The exhibition will follow the Biennial’s March 2019 presentation of ‘The Great Gatsby.”The 2018 edition of the biennial—which was originally scheduled for March 25–March 29—came to an abrupt end on March 11, when a fire gutted a portion of the exhibition space, dubbed “The Vault,” in Chelsea, New York. The exhibition was supposed to feature new drawings by the artist Hans Mohn, plus works by American painter", "The next Biennial should be held at Los Angeles’s Santa Monica Museum of Art. “We’re not there yet, but we are thinking of biennial as a term that embraces the many overlapping narratives that make up our lives,” said Artist and curator Claire Natividari, a founding member of the Los Angeles–based nonprofit Artadia. Natividari also noted that the term cradle of culture refers to a region within the United States where culture is deeply rooted. “It is one of these places where the American dream can be realized for all of America,” she said.\n\n\nThe Institute of Contemporary Arts (ICA) in New York announced that Tamara Jeffries has been appointed its next president. She succeeds Mark A. Salter, who retired in October 2019 after a decade at the helm of the institution, which is based in Manhattan and has a campus in the Catskills, and will assume her responsibilities on January 6, 2020.“Our board of trustees and I congratulate Tamara on her appointment and thank Mark for his leadership, vision, and energy,” said board chair Charles Stewart. “After a distinguished seventeen-year tenure, Mark was one of the", "The next Biennial should take place in 2019. The board of trustees of the National Gallery of Art in Washington, DC, has announced that the twenty-third edition of the Art Basel Hong Kong will take place in Hong Kong from November 22 to November 28, 2021. The event will be hosted by the Hangzhou-based Hangzhou Contemporary Design Museum (HACC), which is currently undergoing a $5.5-million renovation, and will be held at the Hong Kong Cultural Museum. The museum will also have a companion exhibition space at the Huntington Library in New York. The deadline for the event is November 20. The Hilton Art Museum and Gardens in Los Angeles has announced its representation of Nina Boghotti in collaboration with Brooks Group. For the exhibition, the artist will stage a solo exhibition at the gallery in February 2020 and will have a solo exhibition at Brooks’s New York location in October 2020.“Nina Boghotti’s work is grounded in modernist realism, in the construction of a system of materials that has direct connections with solid, metallic, and glass, and a deep understanding of how materials work together as a system to create, decompose, and dissolve,” said Whitney Bi", "The next Biennial should be held in the second half of 2020.”\n\n\nGillian Wearing, the curator of contemporary art and a curator of contemporary art history, died on November 4 at her home in the French city of Lèvre-Thibodaux, Paris, at the age of eighty-nine. She was eighty-seven years old.Born in Montreal in 1942, Wearing studied art history at the University of Manitoba before moving to London to study at the University of Cambridge, where she met Charles Darwin. Together, they raised the theory of evolution and the development of art history at university. In 1975, after graduating, Wearing worked at the Independent, where she met Charles and the duo became the founding members of the conceptual arts group the Butterfly Effect. The group expanded into a collective as the group “become one with the environment.” The group’s exhibitions include “The Daphne Sciarr-Davis Show” (1986–87), which presented the work of seven artists at that year’s Venice Biennale; “Live From the Sender and Receiver” (1987–88), an exhibition at the Metropolitan Museum of Art; and “The Art of Movement�", "The next Biennial should be held in 2022. The next edition, “The Wonder Years,” will take place in Central Park in 2020 and will be staged at the park. The2019 issue of Artforum will be published by Artforum and Artforum International in collaboration with Artforum, the Art Newspaper, and Artforum.com.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has unveiled its new board of directors. Chaired by David Breslin, chair of the institution’s board of trustees, the twenty-six-person board will consist of three women and three men, with two women and two men representing different parts of the United States.“I’ve always been fascinated by men and their roles as creators,” said Breslin. “I’ve always believed that when it comes to being a curator, it’s more important for a woman to be a creator than for a man.”Breslin stated that the new position, which will begin in March, is not about creating an institution for men’s art but about fostering a culture of creativity and innovation. Since creating works by women is at the core of the museum’s", "The next Biennial should take place in the spring of 2020 and will be hosted by the Santa Fe Institute (SFEI) in New Mexico. The exhibition will include a number of works by artists representing the most recent and most important periods of their careers, including several new exhibitions of work by the late artist and trans-Atlantic muralist José Gonçalves, which will be presented at the Getty Center in Los Angeles in April 2020.\n\n\nThe UES Group, a New York–based arts organization that works with artists to support their projects in communities across the city, has announced that it is establishing a new $100,000 grant program. Awarded annually, the program will be focused on the collection, preservation, and dissemination of artworks, and will focus on artists' efforts to make a positive impact on social change through the arts.Funded through a combination of donations and membership dues from artists who identify as LGBT+ and will be awarded as part of the organization’s 2020 triennial “We Are All in this Together,” the two-year grant will launch with the first launch at the Museum of Contemporary Art (MoCA), New York, on September 8, 2020. The program will extend to the Getty Villa,", "The next Biennial should be held sometime between May and September 2020. In the meantime, the museum has created a new digital platform that will allow visitors to experience the museum from a mobile phone or tablet. The app will feature the full collection and will allow visitors to browse the exhibition by topic. “It is a tremendous honor to launch the latest exhibition in the Biennial,” said Richa. “The museum has been a great success in fostering the development of new and international collaborations in architecture and design for more than twenty-five years. Our exhibitions, exhibitions, publications, publications, books, books, books, books, books, books, books, books, books, books, books, books, books, books. We are truly honored to be able to present the new work of Dr. Lütjma in this exhibition.”Earlier this year, the museum was awarded the European Commission’s 2020 Innovatellity Award for its “Innovation for Life” program, which recognizes projects that have demonstrated improvements in the environment and improve people’s life situations. The exhibition was selected for its exploration of the interconnectivity of ideas and materials in art and technology. It was also selected", "The next Biennial should take place in 2020 and will be selected by the National Union of Journalists of Canada. The theme, “Spiral Glimpse,” is inspired by a painting by the Swiss artist Jan-Baptiste-Casteleu, which depicts a woman bathing in a stream, a quotation from the Danish poet Harald Sæther: “The sea is the ocean of dreams.”\n\n\nThe Center for Art and Culture in the Bay Area (CAC) and the Museum of Contemporary Art (MoCA) in San Francisco have announced they are severing ties with the same company that manufactured Ray-Ban aftermarket headpieces for the brand, following a New York Times report that first revealed the allegations of widespread labor abuse surrounding its Chinese supplier, Yishu.“We are deeply concerned by these allegations,” said Robert Lietaer, the director and CEO of the CAC, which was founded in 1980 by Jeffrey Sachs and Lawrence Livermore National Laboratories (LLNL) director Walter De Maria. “We took the position not long after the initial allegations to avoid compromising the ongoing investigation and are committed to ensuring that the panel and our panel of independent experts, convened by LLNL’s", "The next Biennial should be held at the same site as the final exhibition. As we look towards the future, we are planning to create a new area for educational activities and activities for the creative community. We believe that the current exhibition area has the potential to be a source of inspiration, inspiration for learning, and inspiration for the working artists. “We are currently exploring the possibility of moving the exhibition and the program to a new venue in the city of Reykjavík, which will be located within the new cultural complex, and we are preparing for a subsequent exhibition at the Museum of Modern Art at the archive. The Biennial will therefore remain at the Archive until the end of the exhibition in 2021, at which time we will be able to reopen the Biennial for free.”\n\n\nThe world-renowned American photographer Robert Irwin was recently accused of sexual discrimination after a report published by the American Foundation for the Arts (AFA) accused him of discriminating against women in his work. “In his work, which challenges mainstream notions of beauty and beauty standards, the artist presents a nuanced and sometimes contradictory portrait of beauty,” Anna O. Foa, director of the AFA, said. “The critique was that his", "The next Biennial should focus on “Ideas in Motion” and “Individual Reciprocity,” with works by art-historical and contemporary artists that address subjects such as the construction of created environments, the film and video arts, and the past and future of cities.\n\n\nThe Minneapolis Museum of Art (MMA) has received a gift of nearly five hundred works by Russian avant-garde artist Alexander L. Goncharov, whose oeuvre spans three decades and includes works made in Cherkassy, the Siberian city of central Russia, beginning in the late 1950s. Goncharov’s works will be displayed in the museum’s 2017 exhibition “Goncharov Art: Modern and Contemporary” for ten years, beginning in 2020.The gift, made by Goncharov’s longtime apprentice Valery Mamosov, comes a little more than a month after the institution opened its new wing, the Alexander L. Goncharov: The Marble Catalyst, in his former studio in the city’s historic St. Paul’s St. Paul Art Museum, which has leased the space since 2003. The show will showcase works made by Goncharov and his", "The next Biennial should be held at the Museum of Contemporary Art in London in 2020. The exhibition, entitled “Odd Future,” will be distributed by the Museum of Contemporary Art. Museum director Maria Balshaw has announced that the exhibition will “continue to prioritize the critical work of contemporary artists, which is a core mission of the museum.”The Biennial was launched by Pop artist Steve Mitchell, who is also the director of the artist’s residency at the Liverpool Biennial, and the late poet and artist Alice Aycock, who was known for her writing on queer, feminist, anti-racist, anti-imperialist, anti-colonial, and anti-racist struggles. The six-week event will continue to focus on “black anarchism” and “how it relates to the issues of our time\u0097to our politics and our society.”\n\n\nThe Metropolitan Museum of Art (the museum) in New York has sold the paintings that defined the Harlem Renaissance, as well as the art of the Harlem Hellfighters, a radical New York neighborhood watch group that emerged in the ’70s. The works, which were acquired by the museum for $3 million in October 2019,", "The next Biennial should be held in 2022.The Arts Council said: “The next Biennial will be a celebration of modern and contemporary art, collaboration, and the imagination. We believe that the new Fondazione Biennale will be a landmark achievement for Milan, which will be an object of pride for a generation of visitors to the city, and we are eager to see what the new architecture of the Fondazione Biennale will be.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the distribution of $25,000 grants to cultural organizations and nonprofit organizations that have been impacted by the coronavirus (COVID-19). The guidelines state that “gifts of cultural heritage, historic sites, or artifacts” are exempt from the restrictions and that individuals may distribute $25,000 in grants over a three-year period. The guidelines were developed by the DCLA in collaboration with the New York Historical Society (NYHS); the City Council, which is considering a $1.2 billion expansion of the city’s historic sites preservation program; and the city’s Department of Cultural Affairs. The DCLA will submit the guidelines to the city’", "The next Biennial should be held in 2019.\n\n\nThe newly revamped Museum of Contemporary Art (MoCA), Chicago, has appointed Bruce A. Clarke as its first director. Clarke comes to the institution from the Saint Louis Art Museum, where he has served as interim director since January 2019. He succeeds Amy Sherald, who was promoted to director of curatorial affairs last March, and will take up the post in February.“Bruce and I are excited to welcome Bruce to the team at MoCA,” said Sherald. “His expertise and passion for art and communities extend to museums of all sizes, and we look forward to working with him to advance MoCA’s mission and expand its audience.”Born in Chicago in 1976, Clarke is a graduate of the University of Chicago and the University of Michigan. He has served as a curator at the Museum of Contemporary Art in Los Angeles, as associate curator at the Museum of Contemporary Art, Chicago, and as a curator at the Museum of Contemporary Art, Chicago’s production house. Clarke is also a cofounder and the curator of Bruce A. Clarke Contemporary Art, an initiative for which he has worked with artists and organizations to bring out art from his extensive collection.“", "The next Biennial should be held at the Pavilion of Arts in Warsaw, Poland, in December 2019. The theme of the exhibition should be “Art as Renewal.”The exhibition of the work of the artist Elissa Nalbandian will also be held at the Gallery of Modern Art in New York in December 2019. In December, Nalbandian will hold her first exhibition in the United States. In 2018, the artist was awarded the Stockholm Biennale. The exhibition will feature her work in the exhibition “Conceptualizing the Imagination: Nalbandian” (2019). The exhibition will also include performances by Nalbandian and Arsht, as well as a selection of photographs by the artist Naima J. Musgrave, who will create a new series titled “Nalbandian Photographs” in collaboration with Nalbandian.\n\n\nA group of New York City artists including David H. Koch, Yinka Shonibare, and Michael Chihuly have joined forces to create the Museum of Modern Art (MoMA) in Manhattan as the 2020 figurehead of the radical and experimental group the Avant-gardes. The project, which will also involve the construction", "The next Biennial should take place in 2020. For the first time in its forty-year history, the event’s themes will include the gender wage gap, climate change, and women’s rights.The year 2020 will mark the centenary of a landmark United Kingdom–wide strike, during which more than one million workers staged a protest in Parliament Square and other locations across the country. On Friday, March 9, Prime Minister Boris Johnson declared that the strike would continue until the government’s promised £8 billion for the NHS is scrapped and the health service treated as an essential public service. The government hopes that by then more than eighty thousand people will be participating in strikes across the United Kingdom.\n\n\nThe Museum of the City of New York (MoCA) has hired Stephanie D'Amico as its new senior curator of early modern art. D'Amico comes to the institution from the Getty, where she has served as a curator of modern art and architects for twenty-five years and has curated numerous exhibitions, including “Feminine” (2013), “Museums: America After the Fall” (2017), “The Brooklyn Museum’s ‘Museum of Immortals’", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is teaming up with the foundation of the Metropolitan Museum of Art, the Long Beach Museum of Art, and the Los Angeles County Museum of Art to create a new $15 million gift for the Met. The funds will go toward the construction of a new gift vault at the museum, which will house the bulk of the collection and will be inaugurated by the film-and-video institution Christopher Nolan’s Interstellar.Launched in 2018, the new initiative, which is named for the fictional fictional city of London, was conceived by museum director James Sanders and MoCA board chair Darren Schlier as a way to recognize the importance of the institution in the city’s cultural landscape. In honor of the partnership, the museum will donate $2 million to the foundation, with the money to be used by the three institutions to develop a new project.“As many of you know, we’ve been working incredibly hard to make sure that the museum is a cultural juggernaut—to keep it at the forefront of the cultural conversation and to make it one of the most visited museums in America,” Sanders said in a statement.", "The next Biennial should...be held at St. Mark's Episcopal Church in Atlanta, Georgia; the Museum of Fine Arts in Boston; and the Museum of Contemporary Art (MCA) Los Angeles. The 2020 iteration will be staged by the new organization, Art Atlanta, which was founded in partnership with the City of Atlanta and the Metropolitan Atlanta Planning Department. Related to Art Atlanta is a series of exhibitions, performances, lectures, and other events that will be organized by the city’s various community groups.Art Atlanta will invite five artists to the city for the exhibition. Titled “The City,” the forty-fourth exhibition will showcase work by artists such as Dorothea Rockburne, Patrice O’Donnell, Margo Rosales, and Michael Ryckert. The series will launch on April 8 and run through April 19.“The project and staging of Art Atlanta is especially meaningful for me as a city-based artist who is deeply influenced by stories of African American art and history,” City Councilman Jimmy Watters said. “Art Atlanta is a way for us as a city to acknowledge these artists and their influence on our own city and the region.” “The City of Atlanta", "The next Biennial should take place in 2020, but the first move of the institution was already toward the future. In an interview with The Guardian, the curator and Frank Gehry partner said that the show would focus on the relationship between art and technology and would engage with biotechnology in general and artificial intelligence in particular. The theme of the exhibition is: 'Art and Technology, Technology and Society, Technology and Life.”It is not known if the show will include works by artists including Thaddaeus Ropac, Lévy Gorvy, Baron‐Antoine-François Huyghen, and Sheldon Witherspoon.\n\n\nThe Somerset Museum in England has received a $250,000 donation from the Gates Foundation. The funds were made in recognition of the company’s support of arts and cultural projects in the United Kingdom. The Lesley Foundation, which was founded in 1999 by actress and producer Lesley Manville, also graciously pledged $50,000, and the Bessies Foundation for Arts and Cultural Life in the United States stepped up to another $250,000.In a statement, the foundation said: “While the Lesley Foundation has been a strong supporter of the Somerset for twenty years, this", "The next Biennial should take place in 2020, the date on which the show is currently scheduled. “We are eager to continue our work in partnership with the local community, the city, and our fellow professionals, and continue to advance the ways that this biennial can be used to empower the young artists of Birmingham,” said Rachel Hsu, director of the National Council on the Arts. \n\n\nThe British Museum has appointed Kate Maltby as its next director. She will succeed Sir David Cheskin and take up the post on February 16. Fellow appointments include Mark Borthwick, who will retire after twenty-three years at the helm of the institution, and Elizabeth Anagnos, who will retire after twenty-five years at the helm of the institution.Maltby was appointed director of the museum in London in March 2019 and assumed her post in January 2020. Prior to joining the museum, Maltby served as director of the National Museum of Scotland, where she helmed the institution for seventeen years. During her tenure, she oversaw the museum’s expansion, which added more than three hundred galleries and attracted more than three hundred thousand visitors annually. During her tenure at the National Museum of Scotland, Maltby also organized eleven exhibitions", "The next Biennial should be held at the same venue as the first, in the same year. The theme of the second edition of the event is “Sustainability,” and will be “Sustainability,” meaning a “future beyond earth,” according to artjournalist and curator Tarek Atoui.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that Adrienne Edwards has been appointed the next commissioner of the Metropolitan Museum of Art. Edwards currently serves as the commissioner for artistic programs and operations at the museum, which is currently undergoing a major renovation\u0097the Met has purchased the building that houses the museum for $525 million\u0097and will assume her responsibilities at the institution on January 5, 2021.“Adrienneʙs long history of achievement on behalf of the Met and the city makes her uniquely qualified to lead the Met in the next phase of its history,” said commissioner Andrew Cuomo. “Her commitment to championing the museum’s rich history and existing collections, including the museum’s recently acquired works, will ensure that the museum continues to thrive and remains a major cultural and cultural draw for New Yorkers.�", "The next Biennial should focus on issues of resistance and commemoration as well as on the legacy of Shawangunkiri, a British colonialist who murdered thousands of people during World War II and whose mass graves have never been opened. The exhibition will also highlight recent works by artists who are working today to challenge the legacy of colonialists, including Kimberly Donath, who is working to create a new monument to her colonial-era homeland in the Gambia, and Olu Oguibe, a West African artist who is working on a new series of voyeuristic works that examine the histories of modern and ancient slavery. The biennial will be hosted by the British Museum from March 4 to March 7, 2020.\n\n\nThe 2018–19 academic year has marked one of the most tumultuous periods for the arts in the United States. Many arts institutions have seen layoffs and furloughs, arts programs shuttered due to the Covid-19 pandemic, and cultural producers furloughed or laid off. It also saw a steep drop in attendance, with the majority of colleges and universities canceling their spring semester events and facing crippling financial losses. As a result, arts professionals are facing an uncertain future.“We are living through a", "The next Biennial should focus on the social, political, and economic impacts of climate change, as well as on how art and design can be a powerful tool for alleviating poverty and promoting social justice,” said Charles Grant, chair of the board of trustees. The 2020 event will be curated by Tanya Baron, curator of Modern Art, and will take place at the National Gallery in London. In addition to the biennial, the museum is working on creating a new master plan that will leverage the art by artists whose works are on display at the new exhibition. The plans are expected to be unveiled next spring.\n\n\nThe twenty-third edition of the Panorama Detroit will now be held at the Detroit Institute of Arts (DIA) from March 21 to March 23. The inaugural edition, “Between Time and Night,” also known as the Detroit Triennial, featured works by several artists whose work is currently on display in the museum’s new traveling exhibition, “Between Two Worlds: The Detroit Museum of Art” (2019). This edition will be held March 19 to March 21, 2020.For the first half of the show, artists such as Christian Fang, Gavin Brown, Stéphane Barham,", "The next Biennial should examine the chronology and culture of the exhibition as part of the show “The Black Box: Painting in Cinema” (2019); the second should be a “Reissue of the Black Box” (2019); and the third will focus on “Rendering the Black: New Art and Blackness” (2019).\n\n\nThe Israeli curator Saar Gartenfeldt, who was detained in the United States for six months by the Department of Homeland Security (DHS) in the middle of a lawsuit accusing him of anti-Semitic harassment and intimidation, has been cleared of the charges, the European Jewish Congress (EJC) reports.Gartenfeldt was charged with four counts of harassment and intimidation by the Southern District of New York, where he is based, and one count of making malicious contact with a journalist. The court found that the harassment had continued beyond the six-month detention period set by the indictment and found him not guilty by reason of insanity.“While we acknowledge the difficulties of such a prolonged detention, the court found no evidence of anti-Semitism,” Gartenfeldt said in a statement. “I am pleased with the result and am confident that I will soon", "The next Biennial should take place in 2021, following the first Biennial in 2020. \n\n\nThe Museums Association (MA), the British organization that represents more than 3,500 museums, announced today that it has received £9 million from the sale of works in the exhibition “Under the Skin.” The acquisition, which also included three new works on sale, amounts to a 10 percent increase in the museum’s total endowment. The institution will capitalize on its new 11 percent endowment by selling works from its holdings that are valued at more than £500 million. The sale represents the first time the institution has sold works from its collection in more than a decade. The sale also coincides with the opening of the new exhibition series “Under the Skin: The Untold Story” at the Museum of Modern Art, which will run from October 27 to November 19. “This is a very significant milestone for the Museum of Modern Art, which has been striving to see through the exhibition series, and it is a milestone that will set us on a path to many new heights,” said David Cameron, the British prime minister. Cameron added that he was looking forward to the program’s first leg at the Tate", "The next Biennial should take place in the city in 2022, and the biennial will be held in the capital of the State of New York.\n\n\nThe Museum of Civilizations in Vienna, founded in 1868, is planning to close its doors to the public in 2021. Focused on long-term research, the institution has stated that it hopes to reopen in 2022. The Mangrovekstern Museum of Art, which serves as the institution’s primary exhibition space, and the National Museum of Fine Arts, Vienna (MFA), which was established in 1972, are currently undergoing renovation.MSA Vienna is still working on the exact timeline for its reopening, but it will likely begin by the end of April. The first artist exhibition will take place at the institution in February 2020.Mangrovekstern Museum of Art director Maria Bocherella told the Art Newspaper that the museum will close with a bang, announcing that the institution would be 'in a state of flux, with many changes and events at the same time.” The closing of the museum will mark the end of the museum’s current three-year season, which runs from March to October. The institution will be shuttered until March", "The next Biennial should be in 2021. The exhibition will mark the centenary of the birth of Rita Bennett, the American poet and theorist who created the modernist painting movement. Bennett was a Richard-Jones collaborator, and his work is in many ways a synthesis of the avant-garde and the avant-garde’s avant-gardes.“Family and friends have fought for years for the Biennial to be held in Washington, DC, as a direct tribute to the late artist’s enduring legacy,” said Mark L. Smith, chair of the Biennial’s board. “By eliminating the thirty-fourth edition of the Biennial, which would have been held in 2019, the Biennial has created an opportunity to reaffirm the artists’ legacy and to extend the artistic life of this extraordinary public collection. In doing so, the Biennial has affirmed the public’s right to be informed and to share with our community our cultural heritage.”The 50th anniversary edition of the exhibition will take place in 2021.\n\n\nThe Abbey Arts Centre in London has appointed Elizabeth Bonyata, president of Tate’s board of trustees, as its next chair. Bony", "The next Biennial should be held at the Embassy of Spain, Madrid, the Palazzo delle Papesino, the Art Museum Brindisi, and the University of Trento.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Owen Benham as its next executive director. Benham succeeds Matthew Teitelbaum, who is retiring on August 31 after twenty-six years at the helm of the museum.“Owen is an exceptional leader and organizer who has built a remarkable museum,” said board chair Masaoka Saitoh. “His ability to bring around-the-clock administration and curation of a museum’s collections, collections programming, and exhibitions to the entire community has been instrumental in the museum’s transformation into a world-class institution.” Benham will step down from his position on August 29 and will return to New York in June 2020 to serve as the United States representative at the Venice Architecture Biennale.Commenting on his new role, Benham said: “This is a transformative time for all of us at MoMA. We are embarking upon a new chapter, a new chapter that will take us through a new period as we", "The next Biennial should be released in the spring. The dates for the fourth and final editions will be announced in the coming months.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is expanding its mission by instituting a new master plan that will include the construction of a new contemporary art museum in downtown. The new master plan, which was released on Monday, May 27, outlines a new urban core encompassing the Museum of Contemporary Art (MoCA), the California Film Institute (CFI), and the greater Los Angeles area.The plan is part of a $1.4 billion redevelopment plan for Los Angeles that was unveiled by the city and county in June. Mayor Eric Garcetti has since pledged to spend $1 billion restoring and expanding the city’s infrastructure, and to create at least 150,000 new square feet of gallery space for arts and cultural organizations.“This is a moment of great change for our city, and I’m confident that the Master Plan will deliver for the future of our city and county,” said Garcetti. “This is a dream project for all of us, and it’s a project that will alter the face of Los Angeles for generations to come. We must seize", "The next Biennial should be held in the summer of 2020. “The Arts and Culture Commission is and will remain a part of the City of London,” said ‎Andrew Gwyn. “The exciting thing about the Biennial is that, unlike many other major British cities, no longer has to rely on the private sector and, instead, will be run by the City of London. This is a game-changing moment and I want the city to have a huge say in how our future city is made.”In the meantime, every year, the Biennial’s team makes more than twenty thousand new works for the exhibition. The next edition, “The Future of Art: The Exhibition of Art in the City,” is scheduled to open in 2020.\n\n\nThe Royal Academy of Arts (RA) in London has scheduled a new exhibition devoted to the life and work of Edward Hopper, a noted British painter and sculptor who experimented with various light, color, and form in order to redefine the concept of abstraction. The exhibition, “Edward Hopper: A Retrospective,” will open on August 4 and run through September 3.“Edward Hopper: A Retrospective”", "The next Biennial should take place in 2021 and will be led by a new curator and director, Nina Hauser, and will take place at the Museum of Modern Art (MoMA) in New York.\n\n\nArt historian and critic Paul Mpagi Sepuya has been a critic for ArtsJournal since 2013. He has spent the last twelve years traveling the world to engage with contemporary art and contemporary thinking, and he is currently based in Paris. He currently has a solo exhibition at the Museum of Modern Art in London and is the editor of Art in Motion, a quarterly magazine. Sepuya is a professor at the University of Pennsylvania, Philadelphia, and a member of the board of trustees of the New School, the Museum of Modern Art, the Museum of Modern Art and the Metropolitan Museum of Art, and the Association of Art Museum Directors. He also serves on the boards of the Association of Art Museum Directors and the Art Museum in Phoenix, the Association of Art Museum Directors in New York, and the American Association of Museums.Sepuya was invited to the annual Woodrow Wilson International Center for Art and Space in New York City in 2009, but his residency was denied in 2010 and his work was never exhibited. He eventually returned to his native Tanzania", "The next Biennial should also feature a selection of monumental works by artists and collectors interested in the exhibit as well as a selection of works by artists whose work has been previously displayed in the exhibition. Together with the art world, artists and collectors are committed to the ongoing dialogue with scholars, researchers, and scholars in the museum. Art historians and curators are eager to participate in this exhibition’s next edition. “It is a great honor to stand with these artists and their families and colleagues at the very exhibition that changed my life and that will continue to change the lives of many more,” said B. P. Le Guenne, president of the Biennale de Lyon. \n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it has approved the acquisition of ten works by the late Brooklyn-based artist and activist Byron White in an ongoing initiative that aims to obtain works from his estate for the DCLA’s permanent collection. The works, which were sold at auction at Christie’s in New York last month, were originally on view in a public exhibition at the museum in March 2019, but were moved from the exhibition in March 2020 after a dispute between the DCLA and the estate over", "The next Biennial should be held in the autumn of 2021.  The work, titled Future Vision,” is a composite photograph of overlapping photographs, each depicting a future vision of the artist as well as a future land. The show will feature works by twenty-six artists, including Abraham and Sara J. Mese III, Rory Mulligan, and David Salle. The event, which costs $10,000, will take place at Haus der Kunst in Frankfurt and will run from October 13 to October 20. The exhibition will be accompanied by a multi-city tour, which will run from September 16 to September 18. \n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it has received $2.6 million from the Cincinnati Art Museum’s   $4 billion  Art of the Party fund. The funds will go to support the establishment of a new museum, which will draw from proceeds from the sale of works by twenty-four artists, including Albert Ayllu, Cary Davies, Carmen Edelson, and Eleanor Gerber. The  Museum of Modern Art in New", "The next Biennial should be held in 2021. The 2017 edition, entitled “The City of Modern Life in the Late Middle Ages,” was held at the Amsterdam Museum of Modern Art and was made available in full to the public on February 24, 2020. The museum holds the copyright to the work.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has removed a work by Pablo Picasso that drew controversy from the institution in 2016 over its alleged connections to the opioid epidemic. Titled “The Parachute of Venus” and displayed in its galleries since 2008, “The Parachute of Venus” was pulled from the exhibition after its director, John Alÿs, was named the dean of the university. Alÿs has since been charged with two counts of tampering with evidence and will be sentenced in March. He has pleaded not guilty.In a statement on Sunday, the museum said: “The museum has determined that this work is in violation of our anti-tampering procedures. We have taken the appropriate action.” It added that it was currently reviewing the museum’s current exhibition schedule and its upcoming exhibitions and that Alÿs will not be", "The next Biennial should focus on “the practice and the aesthetic of photography as a whole.” The year 2019 will mark the twenty-fifth edition of the Paris Photo Festival, which will take place sometime in March.\n\n\nThe Museums Association (MA), the United Kingdom’s professional, trade-union, and advocacy organization representing more than 1,500 museums, has announced that it is boycotting the upcoming Royal Society of Arts (RSA) biennial “Me and My Uncle: Portraits from the Visual Arts” due to the institution’s support of Brexit, a controversial British exit from the European Union that has divided the UK and inspired protests across the globe.The Royal Society intends to stage “Me and My Uncle” at the Royal Festival Hall in central London, the National Theatre in London, the South Bank Center in Manchester, the National Galleries in London, the County Museum of Scotland, and the National Museum of Scotland in Edinburgh, and will unveil the full list of participating artists and institutions on August 29. The boycott follows a series of actions by art workers, including the British Library Union and the National Union of Journalists, which called for a boycott of the RSA, which they claimed ", "The next Biennial should focus on the legacy and future of Art Deco,” Stefan Wächtler, chair of the museum’s department of modern art and design, said in a statement. “A Deco retrospective will allow us to revisit the exhibition and showcase the exhibition in its entirety in the museum. The exhibition will be opened with a new series of interviews with key artists, including the greatest contemporary painters of the last century, to reveal their legacy and the museum’s current exhibition program.”The Biennial was established in 2013 by director Stefan Wächtler and his wife, Winnie. The Triennale, which is organized by the Wächtlers and runs through March 28, 2020, was selected from a shortlist of three. Wächtler became the first president of the Berlin Biennale in May 2013 and was succeeded by Hans-Ulrich Haider in September 2015.Inaugurating the exhibition will be a series of interviews with Jean-Luc Godard and Bertolt Brecht. The interviews will take the form of a conversation between two people who are not related. Wächtler said the exhibition will allow the viewer to “go to some of the most", "The next Biennial should be held in the spring of 2021, but the organizers of the exhibition, which will be hosted by the University of Southern California, are expecting a delay. In the meantime, the exhibition will go on.\n\n\nItalian art historian and curator Stefano Sforza, who was recently appointed the new director of the Piedmont Abbey Museum, has apologized to the community for closing the museum as part of a proposal to reduce its budget by $50 million. While he did not specify the exact details of the proposal, he said that the museum will likely need to cancel exhibitions and events and the production of new works. “The reasons for the closure are manifold, Sforza told the Art Newspaper. The most important among them are the following: a) the archaeological research carried out by the excavations and the institutional policy of the museum b) the diversified collection of Modernism and the new wave of Art Deco c) the need to focus on concertina types, especially Monet and Warhol’s works d) the financial impact of the museum.”During a meeting with the Italian president, Dario Franceschini, on May 27, Sforza proposed cutting the museum’s", "The next Biennial should be held in 2021.\n\n\nThe Golden Lion of the Venice Architecture Biennale, the prestigious award given to the most outstanding architectural achievement in the city of Venice, has been revoked by the Italian institution. The decision was made on the grounds that the award was awarded with the intention to stifle artistic freedom by influencing the selection of works, it is reported.The artistic director of the Palazzo Nazionale di Beppo, Oleda Mihailović, announced the revocation of the award following a joint letter signed by Giulia Bonetti, president of the Palazzo Nazionale di Beppo, and Marco Bonetti, chief of the Beppo Community, and was published on Sunday by the Art Newspaper.Bonetti wrote: “The Golden Lion of the Venice Architecture Biennale is an item of great artistic and cultural importance that was presented at a time when the city of Venice and its cultural and artistic center were experiencing tremendous transformations. It underwent a major renovation in 2017, and is now the largest building in the city. Its design was conceived and developed by the Beppo Foundation, which was chaired by Antonio Bonetti, Ondine Bonetti, and Andrea Bonetti, and was financed by the", "The next Biennial should be held in the spring of 2022 to coincide with the seventeenth edition of the Venice Architecture Biennale. The Helsinki Art Center will also host a biennial of modern and contemporary art in the spring of 2022.Both the Art Newspaper and the Art Newspaper Europe were among those that published photographs of the exhibition, which is scheduled to run from March 13 to March 20, 2022. The exhibition’s opening party will be held on February 24 at the Helsinki Art Museum and Art Gallery, a new twenty-five-thousand-square-meter complex, and will feature a selection of works that were selected by the directors of the institution and will be presented by the artist(s) Nino and Anton Korpi.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to move the forty-second edition of the Whitney Biennial to April 14, 2022, after the institution received a $1.2 billion donation from the Sotheby’s Prize in February. The move follows a new agreement between the institution and the $9 billion Bridget Riley Foundation, which will help with the construction of the new building and oversee the installation of works from the decades that have been on display.The move marks", "The next Biennial should take place in 2020, and the first in 2021. The exhibition will reveal the next iteration of its main theme, “The Future Is Present.”\n\n\nThe National Galleries of Scotland has appointed Anna Chip, the former director of the National Museum of Scotland and a leading curator of Scottish art, as its next director. Chip will be responsible for the development, exhibition, and collection of new works by artists from across the world. She succeeds Helen Cammock, who served as director of the National Museum for Wales for twelve years, and will take up the post on December 30.“We are extremely pleased to welcome Anna to the National Gallery of Scotland, and delighted to have the opportunity to present her first work at the institution, ‘My Body, My Rules,” in the weeks leading up to its inaugural exhibition, “The Future Is Present.”Commenting on her appointment, Chip said: “The National Gallery of Scotland has diverse collections that are particularly rich in work from Scotland, and I am very much looking forward to working with the talented staff, the younger artists and the wider community. The next edition of the National Gallery of Scotland will bring an exciting array of works, including two shows", "The next Biennial should be held at least twice a year. If the event is held for only two weeks, the biennial will not be able to commemorate the biennial. The organizers will instead have to decide whether to move the event to another time.  The initiative to organize the biennial was started by Nian Zhang, a Chinese artist who is known for his portraits of colonialists and mass killers. Zhang originally planned to hold the premiere Art Biennial at Shanghai’s Atlas Tower on October 3, but the event was suspended after the authorities received a complaint and took the exhibition offline.The event’s organizer, Nian Zhang, told the Art Newspaper that the organizers were not sure whether the event would resume when the authorities stepped in. As a result, Zhang presented the exhibition Herbert of Exeter: Art in the Age of Christ, 2002–03, to coincide with the upcoming exhibition “The Last Days of Judaea” at the National Museum of Art. “We should not forget that China’s art heritage is embedded deep within our cultural heritage and is an essential part of the nation’s identity,” said Zhang. “We hope that the authorities will continue to", "The next Biennial should take place in 2021.\n\n\nThe National Gallery of Art in Washington, DC, is recalling three items in its collection from the seventeenth century due to their possible link to the coronavirus. The collection, which includes works by Sir Christopher Wool, Giacomo Balla, and Jules and Lemuel Beck and three paintings by Thomas Joshua Norton, will be replaced with new replicas that are free of the virus. The affected works are the Amara Malsu and Mafalda, two early drawings by Countess Diane Ackermann; a portrait by William Byrd, a contemporary of Lord Alfred Russell; and a painting by Thomas Seroussi, a sculptor who experimented with clay and steel.The museum has since faced backlash over the timing of the recall, as some in the art-world community expressed concern about the spread of Covid-19. In a statement, the National Gallery of Art said: “We have not made any changes to our security measures or procedures in response to the public health crisis. We will continue to monitor the progress of the coronavirus and will provide updates to the public on our security posture as needed.”In a letter sent to the public on October 18", "The next Biennial should be held in 2021. The next Rendez-Vous is scheduled for 2021. The next Venice Biennale is scheduled for 2019. ELEAST Art Biennial will be held in the fall of 2021. The next Art Basel Hong Kong is scheduled for 2022. The next Art Dubai is scheduled for 2022. The next Art Dubai and Art Basel Hong Kong are both on track for 2022. The next Art Dubai and Art Basel Hong Kong are both on track for 2022. The next Art Dubai and Art Basel Hong Kong are both on track for 2024. The next Art Dubai and Art Basel Hong Kong are both on track for 2024. Event organizer the Dubai Art Foundation (DBEF) said: “The wish of the artists attending the upcoming Art Dubai and Art Basel Hong Kong is to participate in such a great festival. We are looking forward to working with the local & international artists and architecture teams to present an exciting and immersive 2019 edition.”\n\n\nLennon Mark, the founder and director of the prestigious company that represents the world’s most renowned modern and contemporary art galleries, has been appointed as the new chair of the Royal Academy of", "The next Biennial should take place in the spring of 2020. At this stage, the museum will pursue new initiatives and will continue to work with the public across the globe to present a diverse collection of contemporary art.“We are continuing to experiment with new and different ways of presenting art,” said Frances Morris, ‎director of the Metropolitan Museum of Art, in a statement. “We are also working with our partners to develop new ways to make the museum experience more engaging and diverse. The museum’s new campus in the former offices of General Electric, which opened to the public in 2014, will make the most of the expanded gallery floor. We’re also working to make the best possible use of the new space by incorporating new energy-efficient technologies and by creating new opportunities for education and public programming.”In the meantime, the museum will continue to present exhibitions dedicated to artists who have made significant contributions to the history of the art world. Most recently, it released its “Avant Garde” series, which brings together artists from the greater Chicago area. The first exhibition, which opened at the Metropolitan Museum of Art in 2016, launched by the museum in honor of the centenary of the birth of the American artist", "The next Biennial should unveil a design for a permanent exhibition of work by a select group of artists, headed by artist-in-residence Yoko Ono. The show will focus on the theory and practice of “street photography” as a vehicle for a “radical new vision of photography and photography history.”\n\n\nThe Metropolitan Museum of Art in New York has appointed Paul Morigi as its new associate curator of international art. The new position is part of the museum’s reopening plan for its DUMBO, the nineteenth-and-last-century museum built in a former factory in Manhattan’s East Village, on May 19. The museum will inaugurate its new building, which will sit in the same neighborhood as the Museum of Modern Art, by hosting a free general admission event.“Paul’s work brings a fresh and compelling vision for presenting contemporary art internationally, both as an extension of the Metropolitan Museum of Art and as a result of the museum’s relationship to the Met,” said Marc Glimcher, the museum’s curator of art history. “His expertise and enthusiasm for the Met, as well as his relationship to the museum’s curators,", "The next Biennial should include a selection of works by contemporary artists whose work is currently understudied and whose work has not yet received a significant international exhibition. In the coming months, we will continue to present work that explores how we as individuals and institutions can continue to shape the future of art through a combination of programming, exhibitions, and events.”\n\n\nThe Turner Prize, which honors British artists who have made significant contributions to the United States, has announced today that Sigrid Rösler has been selected as the winner of its 2019 prize. It also revealed that the prize will be awarded to an artist who is recognized worldwide as embodying the spirit of the  “New Statesman”\u0097a term that describes a variety of indigenous, post-colonial, feminist, and queer-associated movements\u0097in the United States. In a statement, Haim and Janet Waldman said:“We are delighted to accept this year’s prize, which represents the spirit of New York City. Sigrid Rösler is a gifted and important contemporary artist whose work is both intimate and widely read. Her live performance, which explores the relationship between performance and the social and the political, is a great example of", "The next Biennial should be held in 2021. The last one was in 2018. Last year, the museum opened its new headquarters in the city of Cologne. The Biennale, which was organized by the Center for Contemporary Art in Hamburg, was held in conjunction with the Asian pavilion, the Biennale des Hautes Études, and the European Union pavilion in Beijing.“The future of the exhibition is absolutely critical,” Peter Bader, director of the Nationalgalerie Berlin, said. “We are working hard to ensure that the project will be able to continue and thrive in the future. The next edition will be the most important and will have a new theme. We have already set the date for the exhibition in 2021, but we must act quickly and in order to assure the museum’s future programming. Moreover, we must do this in order to preserve the Biennale’s unique heritage and architectural elements, which were developed in a very short time, and also to show the building of the museum.” The September 2020 exhibition “The Datalogue” will highlight the exhibition’s twenty-fifth edition, “The Horizontal Dimension,” and the", "The next Biennial should take place at least five years after the biennial is completed. The biennial will include an exhibition of works that were created by twenty-seven artists, which will be arranged in six themes: sculpture, performance, painting, video art, and installation. The biennial will also be a reflection of the international community.The exhibition will feature approximately eighty works created by sixty-one artists and will run for twelve weeks. Each week will be dedicated to a different theme, such as the exhibition of an artist’s work in conjunction with a certain festival or a certain season. The exhibition will be inaugurated by a solo exhibition of work by the German artist Hanna Hofmann (August 14–August 17). The exhibition will be followed by a survey show of works by Harald Szeemann (August 27–August 28) and a special event that will be held on February 28.The next exhibition will be organized by the curator of the artist’s studio, Dutch artist Peter Hofmann. The show will be titled “Das im mit sollicithe Künstlerung” (The art of photography). The show will include the work of forty-three notable artists, including Hansa, Giac", "The next Biennial should be held in 2021. The museum has yet to set a date for when the next edition of FGM-Free Weddings will take place. The exhibition, titled “The Center of the World,” will run from January 13 through February 16, 2021. “We are deeply worried by the violent spread of this dangerous and complex virus and have been working hard to ensure that the health and safety of our staff and guests is of paramount concern,” said Sara White, director of Frieze. “We have restricted exhibition space for this week and for the next weeks, including the first week of February, and we are making all possible preparations for an emergency withdrawal of our exhibition.”In the past two weeks, Frieze has been hard at work preparing for the pandemic. On Wednesday, March 22, it opened its new location in Kensington Palace Gardens, and on Thursday, March 25, it announced that it would temporarily suspend all programming, including the biennial’s inaugural edition, “Dragons and Trojans,” which was due to run from March 16 to March 20, 2021. On Friday, March 28, it revealed that it would temporarily suspend all programming", "The next Biennial should be held in the year 2022. The winner will be selected through a large-scale public exhibition in collaboration with the BAM and will be announced at a later date. The finalist will be announced in 2020.“This is a landmark year for Britain, marking the centenary of the outbreak of the first outbreak in the UK, and a great opportunity for the next generation of artists to be involved in this extraordinary story,” said Simon Nathan, director of Tate Britain and chair of the biennial team. “The biennial will also introduce a new platform to showcase the work of future-generation British artists; and will celebrate the rich legacy of British art in Korea. The biannual event will also mark the 150th anniversary of the outbreak of the disease in Britain and will be a great way for younger artists to discover and appreciate the work of contemporary British artists.”The biennial is an extension of Tate’s annual Journey, a major international artistic exploration into the roots of contemporary art in China. The museum opened in Beijing in 1984 and is based in the former textile factory campus of British Petroleum, the British Petroleum Foundation, and BP. In 2016, it was awarded a £50,000 Kwanza", "The next Biennial should be staged in 2021, in the year of the third Dalai Lama, and will initially focus on the development and prevention of mental and physical health disorders. The event will be hosted by the CNA and will aim to “expose the deficiencies of the current mental health system and the role of the state in maintaining health and well-being in society.”As the Dalai Lama and his followers have struggled to win international recognition and mass attention in recent years, the conflict in Tibet has become increasingly divisive and the number of those currently imprisoned in China has grown. The Dalai Lama visited North Korea in 2015 and has since been touring the country. The Dalai Lama’s wife, the Tibetan spiritual leader, Lama Tsering, is currently in Beijing. The two are scheduled to meet China’s president, Xi Jinping, on November 21.\n\n\nThe Museum of Modern Art (MoMA), New York, has released guidelines for how it might move forward with an expansion of its collection of the history of art. The exhibition, “The Future is Present: Art in the Twenty-first Century” (2019), is being organized by the European Arts Center in Bratislava. The museum will hold the", "The next Biennial should focus on: “How do we care for and rebuild social cohesion in our communities? How do we care for one another and how do we care for the planet?” The theme of the twenty-second edition of the Art Biennale will be “Over and Over,” which will include works from the collection of Johannes Kluge, the Dutch director of the Institute for Contemporary Art in Brussels, and will be held at the Institute of Contemporary Art in Oslo from September 19 to September 21, 2020. The exhibition will be curated by Rhys, Scott, and Amada Cruz.The following artists will be represented in the exhibition: Anton Kern, Headlands, New York; Eric Long, New York; Haus der Kunst, Berlin; Johan Peter Brundage Gallery, New York; Nerema Bontemps, Lisbon; Andrew Kreps Gallery, New York; Alexandre LeBlanc Gallery, New York; Andrea León-Alÿs, Los Angeles; Beatriz Leon, New York; Alexandre María Salazar, Los Angeles; Benedict Oostra, New York; and Benedict Arnaud", "The next Biennial should take place in the summer of 2022, at an undisclosed location in the United Arab Emirates. \n\n\nThe National Galleries of Scotland and the National Art Gallery of Scotland (NAKS) have agreed an agreement to collaborate on the conservation and future restoration of the National Gallery of Scotland’s holdings of British colonial and imperial art. The announcement was made on the heels of a statement by the National Union of Art Historians (NUAMD) which called for an end to the exhibition and exhibition of “situated objects” (ISS), a new exhibition that is currently on view in the National Gallery, and the institution’s decision to close its doors for a period of twenty-four hours on Saturday, October 10.The move has led some cultural figures within the art world, including David Kordansky, Simon Conway, and Wolfgang Linder, to accuse the National Galleries of painting a “pretext” for a second exhibition of the works of South African and British colonialists, with the aim of encouraging people to “feel the pain and anger of our ancestors,” said Andrew Scott, director of NUAMD, to the Art Newspaper. The announcement follows a month-long campaign", "The next Biennial should take place in 2020. The next exhibition should be held in 2021. The next museum should be relocated to a new location in the city. The next exhibition should be held in the summer of 2022. The next Ujazdzayan Art Museum in Warsaw should open in the spring of 2025. The next international art fair in the city should be held in the fall of 2022. The next 12 months of the institution’s calendar should consist of twelve consecutive days of exhibitions. The next exhibition should be a diverse collection of contemporary art that is organized in a way that allows the exhibition to reflect the varied interests and needs of the city. The next exhibition should be a collection of contemporary art that is organized in a way that allows visitors to see how the city in the year 2020 will look. The next exhibition should be an amalgamation of contemporary art and architecture that reflects the transformation of the city and the significance of art in tomorrow. The next exhibition should take place during the annual Polish Spring Festival in March and will be a retrospective of work that is currently on display in the Museum of Complex Art, Warsaw.\n\n\nThe linter Peter Løtjær, who served as director", "The next Biennial should be held in 2021. \n\n\nThe J. Paul Getty Trust in Los Angeles announced today that it will establish a new program that will provide millions of Americans with a new, unrestricted, emergency fund from which they cannot withdraw unused funds. “Corporate welfare is an issue that compels us to reconsider the costs and benefits of interventions,” said Trust President and CEO Alice E. Larmon. “We will work with our partners to develop a plan that will provide millions of Americans with access to emergency funds in a way that is both flexible and targeted.”The program, which will be modeled after the Association of State and Federal Low Income Drug Refusal Programs (ASFDR), was created by the J. Paul Graham Foundation in partnership with the California Community Foundation (CCF), the California Nurses Association, and the California Food and Workers’ Union (CWAWU), and will operate as part of President Donald Trump’s $1 trillion Health Care and Left-Over Fund for Emergency Fundraising Act. “The Marshall Plan was an attempt to distribute emergency relief funds to a large number of Americans in a way that would not compromise", "The next Biennial should open in 2020 and will be directed by Zoë Quinn, who is currently working on a new book on the artist’s work. The title is a reference to the artist’s new conceptual art work, The Black, which was presented at the end of the fiveteenth Biennial.\n\n\nThe Metropolitan Museum of Art in New York is planning to build a new $9.7 billion, 125,000-square-foot museum on its campus, the Met, to house the collections of the Metropolitan Museum of Art and the Whitney Museum of American Art. The new museum will replace the existing museum and will be built in the former site of the former Saint Paul’s Cathedral, the former home of the Catholic Church. The announcement was made during a presentation of the new museum at the Metropolitan Museum of Art. The project is slated to be completed in the 2020s.The Metropolitan Museum of Art is planning to open the new museum in 2021, but the exact date has yet to be decided, and the museum will remain closed until at least 2023. The museum will be situated on a nine-acre campus on the northwest corner of Fifty-Third Street and First Avenue, and will boast a library, a gallery,", "The next Biennial should be held in 2021.  The 2019 Festival was in fact the first exhibition organized by the new Jewish Museum in Jerusalem since it opened in 1948. “I am deeply honored to be able to present these artists,” added Luisa. The work of ten artists who had participated in the event for two years is on display in the exhibition “Israel and the West: Exhibitions 1942–1947” (2019), and will be presented in “The Politics of Paintings” (2020), a joint project of the Josef Koudelka Foundation and the National Union of Arts in the United States.Commenting on the exhibition, the Los Angeles–based artist and curator Joëlle A. Kappel, whose works often grapple with the histories of civilisations and the physical landscape, said: “In presenting the works of these ten artists, the exhibition is presenting a window into the world of Jewish artists and their journeys, and what could have been. The work of the artists is interwoven with their own histories and with the narratives of their texts, and with the histories of their communities.”Since the exhibition, “The Politics of Paintings” (", "The next Biennial should be held in 2021 and is a collaboration between the Embassy of the Republic of Korea and Art Basel. The event will take place in the Embassy’s new campus, on the second floor of the Museum of Modern Art, which will open in 2020.“The fourth Biennial will take place in 2020 and will be hosted by the Embassy of the Republic of Korea and Art Basel, in collaboration with the Art Museum of the National University of Tokyo, the Nihon Museum of Art, and the National Museum of Fine Arts, Tokyo, in Nara, and the Museum of the History of Technology, the University of Tokyo, in Yurakucho, and will be organized in collaboration with the local arts and cultural organizations of the Republic of Korea, and will highlight Korean contemporary art and will feature a selection of approximately 600 works, as well as a keynote address by the artist Kim Yeo-kyung, the founder of the digital space Artshojo.“As the #1 international art destination in the country, we were excited to collaborate with the art community of South Korea to create a unique event that would showcase the incredible catalogue of contemporary art created in Korea,” said Markus Schäfer", "The next Biennial should focus on how the exhibition form can be employed to reflect on the radical potential of art and the exhibition as a whole, and how art can serve as a vehicle for social change. “The Architecture of Destruction” will go on view in the exhibition’s first iteration at the Bardo di Bari in Rome on October 9. The Biennial will also present a selection of the work of Alex Kapur and Nick van de Allende, whose works are featured in the upcoming exhibition “The Concrete Garden” at the Albright-Knox Art Gallery in Philadelphia, which will run through February 15.\n\n\nThe Toronto-based gallery Philip Johnson Gallery has appointed Cara Soares as its first director. She succeeds Natalie Johnson, who has helmed the gallery for over two decades, and will begin in her new role on January 29.“Natalie and I have had the privilege of working together for almost twenty years as a team, and she is an incredible leader,” said Soares. “I’m excited to welcome her back to the organization as a senior member of our team. She has been instrumental in our growth and is responsible", "The next Biennial should be announced soon. \n\n\nThe Museum of Contemporary Art (MoCA) New York has received a gift worth $9 million from the Lévy Gorvy, which also acquired the historic property formerly known as Art Deco. The donation, which is the largest gift made by the former publisher of Art Newspaper, was made on behalf of his son, Thomas, who was the head of the publishing company from 1964 to 1970.“\"It is a tremendous honor to receive the Lévy Gorvy’s gift of the historic art that has served as the iconic site of Art New York for more than forty years,” said Thomas. “The gift is a tribute to the pioneers who defined the exhibition medium, and it reflects the broad and enduring impact of the Lévy Gorvy’s name on the art world. He was a visionary driver who transformed Art New York into a modern and internationally recognized institution.”The gift includes an early-modern stone panel by NADA’s artist-in-residence, Jack Hiltzik, which was installed in the galleries of his former space in the 1970s; a 1990s retrospective of Michelangelo Antonioni, Salvatore", "The next Biennial should be called the Future of City Planning, where it will present the first joint series of exhibitions on urbanism and design, organized in cooperation with various institutions and researchers, in the autumn of 2021.\n\n\nThe Solomon R. Guggenheim Museum and the Metropolitan Museum of Art in New York have opened their museums in the new year in a new era. Both museums will be powered by solar panels and will be able to draw 40 percent more power from their sunlit environs than they could from their normal indoor spaces. Both of the institutions—which were bought and renovated by the Guggenheim in partnership with the Rockefeller Foundation—will also boast new glass, new wood, and steel.The Guggenheim’s new six, eight, and ten-story buildings, which were built with a total of $5 billion, are nestled in the heart of the arts district of Lower Manhattan. The new spaces, which were designed by the Guggenheim in partnership with New York–based firm I.M. Pei, employ a combination of solar panels and photovoltaic cells to generate electricity. The new buildings will also boast new glass, new wood, and steel.Pei, which designed the", "The next Biennial should take place in New York in the spring of 2021. In the meantime, the Museums Association (MA) has created the Biennial House, a platform for international exchange and collaboration, and has launched an online survey to help advance the exhibition process.Any artist or museum that would like to register for the 2020 Biennial can visit our website here. \n\n\nThe Solomon R. Guggenheim Museum in New York has received a gift of more than one hundred paintings by Yayoi Kusama\u0097a Japanese artist whose work explores ideas of creation, sustainability, and materiality\u0097from the artist’s family in Japan. The museum has set up a $500,000 fund to assist the Guggenheim with its transition to a new exhibition program, the organization announced on Thursday.The gift includes works by twenty-five Japanese artists, including the Matsuoka group, which produced works that merge urban and industrial environments, and the Tsukasa group, which creates works that involve the construction of attractions such as miniature theaters, miniature theaters, and live performances. The museum also received a donation of twenty-three paintings by the Kunstakademie Kunstakademie Kunstak (KUNST) in", "The next Biennial should be held in the fall of 2020. The 2020 event will have a theme of the relationship between the artist and the institution. The theme will be “Daniel MLK: Existence as Event.”The pavilion will be made up of the Stella and Frederick Rinder house in New York and the Tuskegee Institute in Alabama. The Rinder house is currently undergoing a $30 million refurbishment and is expected to open in October 2020.\n\n\nThe Pinellas Museum of Art (PMA) in Miami Beach has received a $1.9 million donation from artist and collector Koko Usui, who is widely known for her intricate works that draw from pop and contemporary sensibility to create emotionally resonant works that are highly portable and can be exhibited anywhere in the world. “Koko Usui’s art is a perfect example of the rethinking of how art should be experienced and experienced,” said PMA president and CEO Andrew Harris. “Her work continues to change how we think about the world through a deeply personal and ethically challenging lens. Her work reimagines the canvas, the medium, and the performance with the intention of"]