["The next Biennial should have a new exhibition format, a new theme, a new program, and a new theme-park in the center of Rome. The teams behind the five-year event are calling for a “living, breathing, the performance world.” The 2018 event, titled Toni and Michelangelo, presented the works of Marc-Antoine Prouvé, Emmanuel Barozzi, Jacques Bujold, and François Donner.\n\n\nThe Museum of the Jewish People, Jerusalem (Museum of the Jewish People) has announced that it is reopening in March 2019. Following a six-month delay due to the coronavirus outbreak, the museum will open on September 4 with an exhibition of the work of Merel Harrods, a collaboration between the London-based artist and the Berlin-based nonprofit Open Gallery. “We are extremely excited about the exhibition, which will include some of the work that was lost during the Covid-19 pandemic, and the opening of the museum’s new building in the city,” Museum director Anatole Shagal said. “It will be a true home for the museum", "The next Biennial should be held in 2021, although it is currently being considered for a two-year run in 2022. The 2019 event was the first to take place in the city, and the first to be held in the Aladdin Theater. The 2020 event will be held at Shiraz Cultural Center.\n\n\nThe Museum of Art in New York has been added to the long list of cultural institutions that have been classified as historic sites that have sustained significant damage in the ongoing conflict between the Syrian government and opposition forces. The announcement follows a report released on Monday by the nonprofit Syrian Coalition Against the Regime (SARC), an NGO working in solidarity with the Western-backed Syrian Democratic Forces (SDF), which found that at least 260 structures in the city are in danger of collapse as a result of dust and water damage caused by the ongoing civil war.The Syrian American Foundation (SAF), which has been working with the Syrian American Coalition to rescue cultural sites in the city, said that it has identified several hundred structures that are at risk of collapse due to the civil war, and that the eleven largest structures in the city are among them. The organization is working with dozens of partners across the US and Europe to help save cultural heritage sites as part of its", "The next Biennial should be held at least 3 years after the last one. The organisers are considering several options, including holding the exhibition once a year as is currently planned, or holding the first exhibition in the new format at least 2 years after the previous one. The new exhibition will be focused on the theme, “The Body, The Body Art,” and will run for 6 months. “Our collective view of the world has changed profoundly since the late 1970s, and in that time we have been influenced by a number of seminal artists, including Ralph Yeo, Dennis Crouter, Frank Gehry, and Frank Stella. We are striving to be better and to do more.”\n\n\nThe Royal Academy of Arts (RA) in London announced today that it plans to award a $15,000 prize to a contemporary artist for their “most innovative and original work in the field of film.” The award is part of a new initiative launched by the Royal Arts Council to encourage more diverse and innovative work in the arts.The Royal Academy of Arts was established under the authority of the Act of Union in 1822. The academy, which has a current collection of more than 1.2 million works, was established in", "The next Biennial should not only present exhibitions of work that is based on a sustainable aesthetic, but also the rethinking of how future exhibitions should be framed.” The forthcoming edition, which will celebrate its sixtieth anniversary this year, is to be held at the City Gallery in London from February 5 to March 21, 2020. The theme for the inaugural edition was “Love, Politics, and the Future of Art.”Prize money will be distributed in two rounds of judging, the first from March 29 to March 31, and the second from March 31 to March 4. Curator and curator-turned-biohacker Wangechi Mutu, who will curate the biennial, Matora, the first book on the subject by anthropologist Richard Black, will receive an additional $1,000 for his work on the exhibition. The full list of curators who will curate the exhibition is as follows:Cullman GalleryCullman GalleryLondon, EnglandCullman Gallery, LondonCullman Gallery, London, EnglandCullman Gallery, London, EnglandCullman Gallery, London, EnglandCullman Gallery, London, EnglandMontreal, CanadaCullman Gallery, London, EnglandC", "The next Biennial should begin in the spring of 2022 and conclude in the fall of 2022.The exhibition will receive an additional $2 million from the sale of the Peabody-Essex National Historic Landmark, the Peabody-Essex Naval Air Station, and other assets formerly owned by the Navy, and will also receive $1.5 million from the sale of the Naval Academy. The total sum to date for the exhibition is currently $851,732.“We are grateful to the current and former Navy employees and their families for their service to our country and are eager to see how the new generation of artists and collectors, led by talented and dedicated advocates, will shape the next edition of the National Geographic Society’s National Geographic Biennial,” said National Geographic director Matthew Teitelbaum.\n\n\nThe nonprofit Organization for Transformative Art (AT) has announced that it is organizing a two-day event at the Minneapolis Art Museum in April 2020 to coincide with the recently reopened biennial—the institution previously announced in March that it would begin welcoming visitors on March 15. The event will be titled “Beyond the Biennial,” and will feature works by fifty artists, including David C. Dris", "The next Biennial should take place in the spring of 2020. “The exhibition of the exhibition should give the young people of the city the chance of seeing the work,” said Artur Schäfer. “I would like to see an exhibition that is moving them, and not just telling them.”\n\n\nThe forty-third edition of the Biennale of Sydney, titled “In the Skin of Others,” will return to the city for a sixth edition in 2021. Titled “NIRIN,” it will unfold across eight venues, including the Museum of Contemporary Art, Sydney (MCA), and the Museum of Contemporary Art, Melbourne (MCA), in the September 3–September 7 exhibition. “In the Skin of Others” will explore racial and religious identity in the context of a sociopolitical and economic crisis. The exhibition will also address climate change and the impact that art and art-making can have on the environment and on people.”The 2020 edition of the Biennale, titled “NIRIN,” was curated by Australian curator Karina Campbell. The 2021 edition will be hosted by the National Gallery of Art in Melbourne and the Art Gallery of NSW.", "The next Biennial should be held at the Art Gallery of Ontario in Ottawa in April 2020. In the meantime, artists from twenty-five countries will present their works at the Biennial’s inaugural edition in the city of Münster on June 5–June 6, 2020. The upcoming exhibition will be led by a group of British artists, including Rachel Whiteread, Nell Doran, and Adam Levine, and will run alongside the 2019 edition in the city of Glasgow.The 2020 event will be hosted by the Water Tower in London. The 2020 exhibition will focus on the role of women and men in the history of art. Its twenty-third edition will take place at Tate Britain in November and February.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of more than eight hundred works by thirty-six artists in its current exhibition “Theaters of Error”, which will return to the Museum of Modern Art in 2020. The donation includes works that were previously on display in “Theaters of Error” from 2008 to 2016, and comes during a time of major shifts in the museum’s collection, which has undergone several expansions and reopening efforts.As part of an agreement", "The next Biennial should take place in 2022. However, many festivals have since cancelled or postponed their events in an attempt to distance themselves from the coronavirus, and in the process precipitated reopening of major art institutions. Professor John Ericksen, director of the Art Gallery of South Florida, told the New York Times that the risk of a pandemic is real but that the art world may not be able to prevent it. In the meantime, the risk of the coronavirus reaching the United States is increasing.In the meantime, the United Kingdom is expecting to lose an estimated eighty thousand visitors by March 25. According to the Guardian, 34,000 people will be forced to leave their homes by then, and the number of cases is expected to double by the end of the week. In an attempt to mitigate the risk of a spike in cases, traveling exhibitions have been canceled or are scheduled to be canceled in the coming weeks. On Thursday, March 16, the British Museum unveiled a plan to welcome around four hundred visitors each day, curating a selection of art and design by British-based artists, and has released the first annual count of visitors to the institution. The museum said that seventy-nine percent of visitors were returning after spending less", "The next Biennial should look at the resonance of the opening of the exhibition, the installation, and the exhibition, and its future exhibitions, the organizers said. The next edition of the exhibition will take place in May 2020.\n\n\nThe Museums Association (MA), the United Kingdom’s professional trade association for museums, has announced that it is now urging the government to establish an emergency fund for cultural institutions under financial pressure due to the coronavirus pandemic. The organization is asking for $9.5 billion for “overseas collection damage and loss,” and for a “comprehensive and immediate plan to ensure long-term solvency for cultural assets under pressure from Covid-19.”The organization is also urging the UK to establish a “public service commission” to oversee the dismantling of the country’s cultural monuments and artifacts and to develop a long-term strategic plan for its arts and heritage. The American Alliance of Museums (AAM), a trade group representing more than 1,500 museums, has received a donation of $5 million from philanthropist and former US president Bill and Melinda Gates. In a gift that will benefit museums and cultural institutions nationwide, the couple", "The next Biennial should occur in the spring of 2022. The 2019 edition featured the first work by a British artist of African origin and the first by an African woman to be exhibited at the Stevenhaus, Frankfurt. The 2020 event will be held at the Central Library in London in the autumn.\n\n\nThe US House of Representatives voted yesterday to condemn Donald Trump’s inauguration as president and to condemn his administration’s plans to roll back social progress made by black Americans. The legislation introduced by Republican Congressman John Lewis of Georgia, the nation’s longest-serving congressman, and fellow civil rights leader John Lewis, who was killed by a white supremacist last month, would divert funds from the $1.1 trillion Homeland Security and Governmental Affairs (HSG) bill into savings accounts and block grants to certain local, state, and local government agencies, including police, fire, and police departments.“The time has come for the White House to stop equating hatred with hate groups, and hate with hate groups with hate groups,” Lewis said in a statement. “We must focus on the real threats we face—the racism and bigotry directed at communities of color and people of all backgrounds—and not hate groups.", "The next Biennial should be held in the spring of 2021.\n\n\nThe National Gallery of Art in Washington, DC, announced that it has received a gift of over ninety works from the National Endowment for the Arts (NEA), which represents the National Association of the Arts (N.A.A.). The gift includes works by fifty-four artists, including Chris Albrecht, Michael White, Benjamin Kanu Cole, and Michelle Joyce.“The National Gallery has long championed the work of American artists, and we are particularly excited to present their first collection of their recent work since the late 1970s,” said Anne-Marie Olszewski, director of the National Gallery. “The gifts from NEA are a great example of the visionary leadership of Laura and James Merritt, and their commitment to providing immediate, meaningful, and focused support to artists. Their work will further the work of their predecessors, who established the NEA as a central agency for the Arts in the 1970s.”The collection includes works by fifty-six artists, including Sarah Orsi, HENRY BALLINGER, DANIELA ARRIVEDES, JEREMIAH BERGER, GARDENER TOD", "The next Biennial should take place in Helsinki, the capital of Finland; the eighth in Stockholm, the national art destination and the capital of Sweden; and the fifth in Beijing, the capital of China. A retrospective of the exhibition “The Future Is Present:” will be held at the Kunsthal Charlottenborg in Stockholm in 2020.The proposal comes at a time when the art world is facing unprecedented challenges from climate change. According to Artnet, the number of cases of the coronavirus has surpassed the number of cases of COVID-19 and is projected to surpass the number of cases of DINA. The United Kingdom is currently working on setting up a global emergency fund to help artists and galleries facing the crisis. According to the Guardian, the emergency fund will likely draw from the UK’s international art assets and would likely be run by UK’s art council. The UK’s government has pledged £7.5 million ($9.4 million) to help artists and cultural organizations in the UK cope with the coronavirus. The  Art Newspaper reports that the sum is far less than the $86 billion in relief that the United States is asking the UN to give it.  ", "The next Biennial should be held at least once every two years and will be curated by a panel of international scholars. The exhibition will feature work by eighty-four artists, including the biennial winners, as well as works by emerging and established artists and artists-in-residence. The inaugural exhibition was held at the city’s ArtTowns facility in March 2019. “The Biennial has all the elements of a vibrant event, but now we seek to build on its legacy,” the organizers said in a statement. “It has to be a forum for real conversation, not an outlet for sensationalist self-promotion.” The exhibition will return to the city for a second edition in 2021.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Carole Adams as its next director and CEO. Adams succeeds Moa Wang, who departed the institution in May 2019 to head the Seattle Art Museum. While at the Seattle Art Museum, Adams helped shape the museum’s collection strategy, organized several exhibitions, and developed the institution’s annual End of Summer Festival.“Our board and staff spent time and effort in identifying a leader who has the vision, temperament, and ability to drive", "The next Biennial should be in 2022. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Paul Maffi as its next executive director. He succeeds Mary Martin, who retired in May following more than two decades at the helm of the museum.“Paul will be a great addition to our team and an excellent steward of the MFA Boston’s history,” said Martha Graham, chair of the board of trustees. “We are grateful for all of his years of service to the museum and look forward to his leadership of the MFA in 2024.”The MFA’s board president, Thomas Campbell, said that MFA Boston’s board has always been heavily dependent on Maffi’s leadership. “As we have learned over the years, leadership is the lifeblood of a museum. Leadership is, above all, the strength of the institution. For more than two decades, he has been the driving force behind the MFA’s transformation from a modest institution in the exclusive Charlestown neighborhood of Boston in 1978 to a national model of excellence. I am proud to serve as his successor.”MFA Boston director and CEO Samson Levin said", "The next Biennial should take place in 2020 and the date is still under discussion. For the past four years, the group has been working with artist-activists, artists, writers, collectors, and other groups to create the event that would culminate with the exhibition of a work by a selected group of artists. The show would be curated by a group of curators who include Yinka Shonibare, Heino Kekka, and Tanya and Luta Roo, and would be organized in collaboration with the artists. In the past, the event was organized in collaboration with the artist-activists themselves.\n\n\nThe National Gallery in London has commissioned an artist-in-residence to create an exhibition of works from the collection of British Prime Minister Winston Churchill. The commission was made by artist Peter Winton, the former director of Tate Britain, and was for a piece titled The Drawings of Winston Churchill, which will open at the National Gallery at the end of the month.Winton will be tasked with creating a parallel work for the former prime minister, who has served in office for just over two years, which he says will test the limits of the imagination.“Winston Churchill is a complex figure whose art has been", "The next Biennial should be hosted at least six weeks after the opening of the exhibition.”The redesign of the Biennale comprises an expansion of the exhibition’s physical footprint, with a new pavilion and a new stage for the installation of the works. The new pavilion will be divided into ten areas with the architecture of the Pavilion, while the stage will be relocated to an adjacent building. The new exhibition will also incorporate new works by artists who have recently been selected for the exhibition, including Sara Buckley, Carol Graham, Gillian McKeith, Â José Campos, and Marc-Antony Crespo.The Biennale will also receive $1.25 million for its programming, including the Constructiv Exhibition. The prize is an extension of the $10 million that was awarded to the artist for the installation of his work in the forthcoming biennial, “The Commonplace of the Infinite.”The search for a new director for the Biennale has intensified in recent months with the departure of Sara Kiss, who led the Festival for the Arts and is in the process of opening a new venue in the city. Four finalists were presented at the end of the first round of interviews", "The next Biennial should be held in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it will hold the next edition of the fifty-eighth Venice Biennale, which will take place at the Venice Architecture Museum in the summer of 2020 and will run from March 13 to March 16. The event will be rebranded the Venice Architecture Biennale and will be hosted at the Italian city’s new Tivoli Artola building, which opened last summer to the public.The event will mark the first time the museum has hosted the event since it reopened in November 2019. The tour will focus on themes including energy and the environment, art and architecture, the city, and the earth, and will feature 360-degree views of the city. “These two epochs are today marking the last stage of a history of visions,” said Joana Cattelan, director of the Contemporary Art Museum St. Louis, which was one of the main organizers of the event. “With this new iteration of the Venice Architecture Biennale, the museum has great excitement about its future, and the potential for engaging audiences of all ages and backgrounds across the globe.”\n\n\nThe National", "The next Biennial should launch in June 2020 and will focus on “ecology and its relationship with art and artmaking.” The museum plans to stage around two hundred exhibitions annually and will open a new location in the city for the arts in 2020.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has hired Andrea Weiner, who previously served as director of the Joan Mitchell Foundation and as associate curator of contemporary art at the Metropolitan Museum of Art, as its new deputy director of curatorial affairs. Weiner will take up the post on February 7.“As we enter a new phase of our history at MoA, we are excited to welcome Andrea to the board,” said director Klaus Biesenbach. “In her new role, Andrea will remain involved with the foundation as it transitions into its next phase, which will include a multi-million-dollar fundraising campaign and will begin in March 2020. We are confident that she will continue to expand MoA’s mission and be an important voice in the organization’s work.”Previously, Weiner served as deputy director of the David K. Ogden, Jr. Foundation. She began as head of the Joan Mitchell Foundation in 2016 and has worked as", "The next Biennial should be scheduled for March 2021, when it will be held in Hong Kong and will be held at the Hong Kong International Film Festival (HIFFI).Dubbed “Global Cinema” and “A Global History,” the program will highlight the rich history of cinema in Asia and will be organized by veteran curator and director Hiwa Sungho, who was recently promoted to the position of director of Hong Kong’s Film Festival. The announcement of the inaugural exhibition was made at a ceremony held at a local festival in Hiroshima. The inaugural exhibition will be housed within the exhibition space of the Art Museum Fudan in Tokyo.The next iteration of “Global Cinema” will be hosted at the Art Museum Fudan from May 3 to May 5, 2020. The inaugural exhibition will feature twenty films made by forty artists in twenty countries. The selected artists will also feature in the exhibition “A Global History,” which will be presented by the Palazzo Bellini in Rome from April 23 to April 25, 2020. The show will be organized as an interactive and collaborative project with assistance from the artist-run studio Imaginary City in Venice.\n\n\nThe Swedish Museum of Modern Art (Skull", "The next Biennial should be organized in early 2020 to coincide with the opening of the new Museum of Contemporary Art (MCA) Paris. The fall event will focus on MCA artist-built environments and the work of lesser-known artists, while the spring event will focus on urban design.\n\n\nThe Metropolitan Museum of Art (the museum), in partnership with the Gabriel Foundation, has established the Tacita Bridge Fund, a $1 million grant program dedicated to artists whose work is currently being exhibited in an institution. The inaugural grant cycle will launch with MMA’s inaugural exhibition “The Met Art of the Body: Art of Body in the Space of Modernity” on March 3. The fund will award $730,000 to forty-nine artists, including Kevin Alston (New York–New York), L'Ancienne Proyectique (New York), Xiāo-Lei (New York), and Dia Artica (New York). “The Fund has been a long-standing objective of the Gabriel Foundation. We had hoped to support the artists who were the focus of previous grants but we were never able to secure their contracts through the 2020 grant cycle. We hope that", "The next Biennial should be held in 2021.\n\n\n[Update: March 4, 2020] The 2019 edition of the Hong Kong Biennale has ended after two weeks because of the Covid-19 pandemic. Organizers issued an apology for the delay and said that they will move forward with a new edition of the exhibition. The event will also mark the last time the Hong Kong pavilion will be crowded. The Hong Kong Arts and Culture Festival (HKACE) will continue, however.The 2019 edition of the Hong Kong Biennale, entitled “Maybe Tomorrow,” was organized by the Hong Kong–based platform artforum.com, which was founded by a group of artists and activists to promote art in the city. The inaugural exhibition, titled “Getting to Know Art,” was held from March 3 to March 4 and featured work by twenty-four artists. Represented by the Hong Kong-based collective Madhouse, the exhibition, which was staged in collaboration with the Hong Kong Arts and Culture Festival, received a prize at the event.“Hong Kong is a vibrant and vibrant city full of artists and their works,” said Shin Yu-kyung, director of the Hong Kong Arts and", "The next Biennial should decide whether to include the works of Johannes Kepler and the rest of the sixteenth century in its exhibition. The aim of the exhibition is to examine how the works of Eisenstein and the sixteenth century are presented in a given context through the history of art in the twenty-first century. The first iteration of the Biennial was held in the Bauhaus in Frankfurt in 2009. The event was widely attended by contemporary artists and art historians.\n\n\nJanet Bloom, the director of the New York and London branches of the Museum of Modern Art (MoMA), has made it clear that the institution will not restructure to account for the departure of Olivier Roumier, who has served as the museum’s director of the London- and New York-based Montage Projects for the past two years.“I have been deeply moved by the amazing vision and warmth of Olivier,” Bloom said in a statement on Wednesday. “I’ve been inspired by his work for years, and I’m so proud to have worked with him to build upon his legacy. His art is world renowned and his work is treasured by so many. I’ve always believed that", "The next Biennial should open in 2020, with the first exhibition in 2022, and the exhibition schedule for the thirty-second Biennial should be determined by the Royal Academy.The biennial’s theme, “Culture and Art,” is a response to the many exhibitions that have been staged in the United States this year, and the recent revolution in exhibitions. The biennial will focus on a theme of the artist’s flux; it will also include a selection of works by the Danish curator and designer Sigrid Alberts, which will be numbered in the seventy-fifth Biennial’s catalogue.The biennial’s exhibition program will be curated by Hanna Günther in association with the Royal Academy of Fine Arts (RAFA), whose director, Harald Vossenhuber, will serve as director of the new biennial. The fifty-ninth Biennial will be hosted by the Red House in London in 2020, with the theme “Femininity in Art: From the History of the Art of the World, 1950–1956,” and will be presented by the Royal Academy of Fine Arts in 2022.The biennial’s inaugural exhibition, “Femin", "The next Biennial should take place in the spring of 2021. The exhibition will be hosted by the Museum of Contemporary Art (MoCA), New York, and will be divided into two parts: a biennial-level presentation on the exhibition floor and a studio-level performance. The biennial will be hosted by the Los Angeles County Museum of Art (LACMA), Los Angeles; the Museum of Contemporary Art, Houston, Texas; and the Museum of Contemporary Art, New York, New York.\n\n\nThe French daily newspaper Le Figaro has launched a new digital publication that will capture, analyze, and share photographs and videos by and about nature artists. The platform will be launched in partnership with the nonprofit group Bénédicte Savoy, which has offices in Paris and New York. The organization will host a series of “instances” each month, featuring work by three Parisian artists: Carla Aickem, Andrée Aiguille, and Christoph Glanville, and will also create a digital cataloguing service that will allow the public to track their collections.“We're delighted by the launch of the new digital publication Le Figaro’s’s", "The next Biennial should be in the Spring of 2021.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that it has received a gift of more than 4,500 works by seventy artists from the collection of wealthy collector Richard Parke-White, the founder of the Whitechapel Gallery. Established in 1898 by his parents, the London dealer Richard Parke-White and his brother Henry, the museum became a major hub for the city’s art scene in the early 1980s. In addition to presenting exhibitions, Richard Parke-White made his first-ever solo exhibitions in the UK in 1984. In 2016, he was awarded a CBE for services to art for his lifetime achievement award.In a statement released by the museum, Richard Parke-White said: “The Museum of Modern Art has provided a wonderful home for the exhibitions of the last thirty years and achieved extraordinary success in the process. With a gift of the new works, I can now see for the first time the full range of his collection, which was founded by his parents. I am extremely proud to have played a part in securing the work of seventy-four artists and am particularly pleased to present forty-eight works by Catherine Hicks, who has", "The next Biennial should also be a celebration of the centenary of the founding of the Biennial Board of Canada, which was founded to protect the interests of Canadian artists and cultural institutions in the event that the museum was taken over by the government of Quebec. In the intervening years, the board has worked to open up new partnerships between the museum and the European Union and to promote more diversity of perspectives through the hiring and appointment of board members. In a statement, the Biennial Board of Canada called the changes it has made since 2009 “transformational” and said that the board “has struggled to find a balance between supporting our artistic and cultural mission while maintaining a strong professional relationship with the government of Canada.”\n\n\nThe artist-run space the Gorilla Museum in London has welcomed the new tenants of its former space in the city’s Fulcrum district, which it has operated since 2019. Abigail and Malcolm McNamara, the Gorilla’s founders and directors, and their families, which include Peter McNamara, the former chairman of Tate Britain; and Susan McNamara, the former head of the European commission, announced the launch of the nonprofit Gorilla Living Space. The organization will host more than one hundred", "The next Biennial should be held sometime in 2020 and will include works created in the city between 1950 and 2020. The event will run concurrently with the 40th Anniversary celebrations of the city and will be held at no cost to the city.The biennial’s curator, Claudia Dallù, told the Art Newspaper that the theme of the exhibition is not “about the past,” but “about the future,” and that the theme of the exhibition is not “my story,” but “my question: When will we be able to live together in the beauty of our own bodies?”\n\n\nThe National Museum of the American Indian (NMI) in Boise, Idaho, has become the latest institution to welcome visitors back to its campus. The institution recently announced that it will host a series of public lectures and other programming in March 2020, followed by a public launch of a new digital platform, which will feature public writings, including by renowned author and artist Virginia James Rinder.“While the digital platform will provide visitors with a more interactive experience, it will not solve the questions raised by Rindermann’s works,” said Hugh MacAskill,", "The next Biennial should be held in 2021.<|endoftext|>It is a sad fact of life that many of us put off purchasing a first-hand artworks until the last moment of our lives, when it may be most accessible to us. However, this reluctance, and the consequent loss of the opportunity to own a work, is not meant to be taken as a negative.On the contrary, it is a means of emancipating ourselves from the constraints imposed by the constraints of our own lives. The work of an artist is a living thing, and as such, it is an essential resource for the physical body. As such, it is an integral part of our lives. It is a resource that we are to rely upon in times of need. It is our duty to use it in ways that will benefit those in our lives and those around us. To whomsoever might wish to benefit from it, we encourage our fellow citizens to do likewise.In a time when the art world is being disrupted by a multitude of threats, the art world is being disrupted by the reasons why it is being disrupted. The art world is being disrupted by the fact that we live in a digital world. Our lives are digitally mediated. Our lives are digitally mediated through our devices.", "The next Biennial should be organized in a manner that respects the sovereignty of the states in the City of Berlin. In this way, the biennial will have the potential to grow and develop as a unitary format, without the need of a host country.”\n\n\nThe Institute of Contemporary Arts (ICA) in Vienna has named Charlotte Hagerl as its first executive director. Hagerl will be responsible for organizing exhibitions, curating programming, and spearheading the design of the Institute’s three-story, 356,000-square-foot headquarters in the Friedrichstadt district of Vienna.She succeeds Joachim Neugroschel, who will remain involved with the museum until his death in October, and will assume her responsibilities on July 1.Hagerl comes to the ICA from the Vienna Foundation for Contemporary Art (VFB), which she cofounded in 2016. She was named director of the ICA, which opened in 2020, and holds a master’s degree from the University of Vienna and is the author of the forthcoming book “VFB-Viennese-Alte Model,” which was published by the VFB in conjunction with the exhibition “Alter,” which was staged at the", "The next Biennial should take place in 2022, with the exhibition being organized by the same group that organized the first iteration of the exhibition. The new format of the exhibition will be similar to the first, with several new sections dedicated to the physical and biological sciences and a new section devoted to design. \n\n\nPeru’s Ministry of Culture is planning to build a new headquarters in the capital of Lima for the country’s cultural heritage organization, the Museo de Arte de Lima (MAS). The organization is currently evaluating the feasibility of constructing a new facility on the Arsenale de Lima, a former sugarcane plantation, and is also considering the development of an indigenous heritage district in the city, which would be located in an area of the city designated as a national monument by the government.According to the New York Times, the Ministry of Culture estimates that the construction of the new museum would cost more than $150 million and would be inaugurated in 2021. The project will also include the renovation of the institutions’ existing campus and would see the creation of a museum dedicated to the arts, a theater, a library, an auditorium, a visitor center, and workshops, and would include the construction of a new theater and the restoration", "The next Biennial should be held in 2020.\n\n\n\n\n\n\nPatrick Cox, the British artist who photographed students at London’s Charing Cross College of Art and Design (CCDC), and of the BFI, has won the London Independent Art Awards. The twenty-third edition of the awards, which honor the visual arts, will be held at the Tate in London, on October 27, 2020, and will feature work by fifty-four artists.Among the awardees are Andrew Davies, Joanna Ben Greenfield, Antony Hudspeth, Richard Inglis, and Mandy Elmejia. The artist-in-residence will be chosen by a jury that includes James Coburn, Ciarán O’Leary, and Mandy Elmejia. The jury also comprises Helen Craig, editor of the exhibition series British Art, and Nikhil Desai, director of the Museum of Modern Art, New York.The jury is made up of:Alex, Barry, BFT, British Film Institute, London; Catherine, BFI, London; Dan, CAA, London; Daniel H. Silver, director of the Museum of Modern Art, New York; Diana, MFA, London; Dines", "The next Biennial should be announced soon, and when it does, the full programme will be accessible on-line. Originally slated for February 2018, the event has been put on hold after the city of Bristol declared a state of emergency due to the coronavirus. The biennial is currently being hosted at the Museum of London; the Serpentine Galleries, Tate Britain; and the National Museum of Art. The Bristol 21st Century Festival is also currently on hold. The Metropolitan Museum of Art in Washington, DC, is currently encouraging visitors to its Woodward Building in downtown Washington, DC, to arrive early for its March 29 edition. The Metropolitan Opera House in New York is also reopening on March 16, and the Metropolitan Museum of Art, the Metropolitan Museum of Art, and the Metropolitan Washing Machine Company in New York will welcome visitors in March. The Milwaukee Art Museum is continuing its March 31 reopening, and the Metropolitan Opera House is re-opening on March 15. The New Museum in New York announced today that it is working to reopen to the public again on March 21. New York Governor Andrew Cuomo declared a state of emergency after the coronavirus outbreak began in Waltham, Massachusetts, on Thursday", "The next Biennial should be held in the spring of 2021.  The future of the Festival is at risk as the twenty-fifth edition of the Biennale d’Art Contemporain (BAC) in Leipzig, which is currently on hold due to the Covid-19 pandemic, is slated to run from April 3 to April 5, 2021.The German Federal Association of Art (BFA) has released a statement regarding the future of the festival: “The future of the BFA is at risk. The upcoming BFA für die Art und Freier, which has been postponed several times, will likely not be realized. Rehearsals for the festival will begin soon. The BFA is preparing a comprehensive financial and organizational plan for the event. The financial situation of the festival is also currently under review.\n\nThe Art Newspaper reports that the Metropolitan Museum of Art in New York is planning to move the exhibition “The Gilded Age” from its current home in the Museum of Modern Art in Chicago to its new home in the Hudson Yards development. The move is part of a $3 billion redevelopment plan for the neighborhood, which includes the construction of a new museum that will include an extension of", "The next Biennial should also include a discussion of the history of the exhibition in the museum and how it can make a positive contribution to the Chicago Art Institute’s ongoing celebration of the history of American art and how it can be practiced in other settings.”The inaugural edition, “The Man in the Van,” was staged in 2008 by the Museum of Fine Arts, Art Museum, and the Williamie Simon Museum in London. The second edition, “The Museum of Modern Art” was staged three years later at the Contemporary Art Museum St. Louis. The third and final edition, “Lincoln: The Freedom Experience,” was staged in 2018 at the Goodman Gallery in New York.\n\n\nThe National Gallery of Canada announced today that it is preparing to welcome visitors back to the institution—and public artworks in general—in March 2020 and has put out an announcement about the reopening of the institution’s museums and educational spaces a few days ago. The announcement of the reopening dates was made in the context of a “march of black art,” a yearlong event that runs from September to June. The theme for this year’s event is “Blackness in Theory.", "The next Biennial should take place in 2020 and the inaugural exhibition will be held at the Museum of Contemporary Art in Scranton, Pennsylvania, next year. The History Channel Presents will also showcase the work of artist Richard Avedon in the United States in September. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a significant donation of $10 million from a group of wealthy individuals and organizations led by American businessman and philanthropist David Kestenbaum. The gift includes $8 million for the institution, and $7 million for the Los Angeles County Museum of Art, which serves as the central hub of MoCA’s collection. The funds also include $6 million for the museum’s new theater, an amphitheater, and the construction of the new David Kestenbaum Theater at the museum.“MoCA has been a remarkable and enduring success over the last twenty years as a center of the American dream,” Kestenbaum, the director of the private art museum Paradigm in New York, said in a statement. “This year’s historic gift is an example of the kind of philanthropic leadership that we all need to be doing more to support artists, and at", "The next Biennial should be up by April, 2020. The 2020 edition is scheduled to be held at the Grand Opera House in London.\n\n\nThe Museum of Fine Arts (MFA) in Boston has issued a statement about its decision to end its relationship with the Israeli cultural center Bezalel Adham, following a wave of anti-Israeli protests across the United States. The museum’s announcement came a day after MFA director Adam D. Weinberg issued a statement conceding that “in the interest of Israel and the many good causes it supports, we have decided to end our relationship with Bezalel Adham.” The move follows a wave of anti-Israeli protests that swept the United States in the lead-up to the November 8 inauguration of Donald Trump, whose anti-Israel views are deeply unpopular with large numbers of voters.In recent weeks, protests against Israel have also been taking place in cities and towns across the United States. On Sunday, thousands marched in Washington, DC, chanting \"No more settlements, no more racist policies, no more oppression. No more oppression. . . . no more oppression. No more oppression. No more oppression. No more oppression. No more oppression. No", "The next Biennial should be held in 2022.\n\n\nThe London-based nonprofit the Royal Shakespeare Company (RSC) announced today that it intends to raise $10 million for its Next Gen British Film Festival, which will take place in the city, in April 2020. The funding will be used to cover costs associated with organizing a festival that will address issues that affect British Film and British Cinema. The announcement follows The Guardian s analysis of the 2019 Royal Shakespeare Company biennial, which examined the history of British Cinema and British Film through the lens of Laurence Olivier, the late author of The Merchant of Venice, and Masaccio, a contemporary art historian, as well as the 2018 RSC biennial Film/Video, the first ever by a woman director.“At this stage of our history, it is essential that we continue to present an exciting and challenging alternative vision of the future for British Film and British Cinema,” said Matt Card, artistic director of the Royal Shakespeare Company. “Next Gen will give us the opportunity to create a platform for this new kind of British Film and British Cinema, and will give our audiences a new way to discover and engage with our collection of works. It will also give us the", "The next Biennial should take place at the Museum of Contemporary Art (MoCA), in New York, in 2021.  According to the Los Angeles Times, the next iteration of the event will include at least twelve artists. \n\n        \n\n\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has announced that it will cease all operations at all of its locations in 2020, in order to return to the city for a new exhibition, “The Body,” designed by artist Fiona Bruce, at the venue. The exhibition will kick off with a discussion with Richard Serra, the curator and writer, about the themes of the exhibition, which will be followed by a performance by Bruce and the band Shelter. SFMoMA will reopen in 2021, but only with the consent of the city. In a statement, SFMoMA said:“SFMoMA is continuing in a thoughtful and deliberate way as it continues to carefully consider the long-term legacy of the building, the museum, and its collection. Given the current local, state, and federal government policies, the future of the museum is not in jeopardy. We have made a decision to bring the show to a close. We hope that the", "The next Biennial should include a program of interviews with scholars and artists, exhibitions at the institution, and a survey of current affairs and international events. The exhibition will also include a selection of new works by seventy-five contemporary artists.The Brixton Academy of Art (BBA) is one of the oldest and largest arts academies in London. Founded in 1810, the school boasts of forty-two acres of land and a 250-seat auditorium that opened to the public in 1928. The center was purchased by the British government in 1960 and has served as an incubation lab for British artists since the 1960s. The cultural center has hosted film, television, concerts, workshops, and other events for several hundred thousand people, and is generally considered one of the most important arts institutions in Britain.The school’s founding director, London-born artist Arthur Asper, died in 1966. After he passed away, the academy opened as a private organization that has been supported by the Brixton Academy of Art Trust since 2014. The trust is run by two trustees, Peter Wright and Adam Durer. Together they oversee a board of trustees that oversees the school’s charitable activities.In October 2018, the academy commissioned artist and scholar Nigel R.", "The next Biennial should begin with a discussion of the history of art in the United States and will present a selection of the year’s main exhibitions. The biennial will be based on the themes “art and culture in the twenty-first century,” an initiative the museum said will highlight “the similarities and differences between contemporary art and its past, the future, and the past.”The museum also announced a new partnership with New York’s Metropolitan Museum of Art, which will host the next edition of the Central Park ArtWalk, which is scheduled for April 28–April 30. The event will focus on partnerships between New York and surrounding areas. The first half of the event will be open to the public from April 9 to April 16. The second half of the program will be closed to the general public. Following the announcement of the partnership, the museum rebranded from the National Gallery of Art to the Metropolitan Museum of Art. The show will return to the Met in 2020.\n\n\nThe Museum of Fine Arts (MFA) Indianapolis will not renew the contracts of two of its top executives, after the museum’s board of trustees found them “unfit and untenable.” The trustees who made", "The next Biennial should also aim to address the institution’s relationship with the Palestinian Authority (PA), which continues to detain and abuse Palestinian prisoners, and should focus on Palestinian art, culture, and people. The museum’s current exhibition “Odedine Bicchi: The Innocent Painter” is a response to the current events and to the work of Solomon R. Guggenheim, the founder of the museum, which was founded in 1941, and to the delegitimization of the work of the PA, the majority of its paintings, sculptures, and works on paper.The museum is petitioning the PA to release more than 1,500 Palestinian prisoners, which it claims it does not need to keep in prison. The PA’s current round of legislative arrests, which have been in place for almost five years, was criticized by human rights organizations for their vague wording and for failing to address the PA’s human rights abuses.\n\n\nThe Institute of Contemporary Arts (ICA) in New York announced on Saturday that it will become the next home for the works of Israeli-born artist Naima Jarrar, whose strong Jewish identity made her a target for anti-Semitism. The news was celebrated by politicians", "The next Biennial should organize a double exhibition, the first a retrospective of the artist’s work, the second a presentation of works by the same artist that are currently on display. The exhibition should include work by biennial artists as well as works by the artists of the same name in a separate exhibition. The exhibition should focus on the life and work of the artist and center around a single question: “How can we live our lives in harmony with one another and with nature?”The program will come together in two ways: The biennial will present the work of the artist in a double show; the artist’s studio will produce works that will be presented in a retrospective. Biennial artists will take up the theme of the exhibition by creating works that address the themes and issues of the exhibition. The studio will produce a selection of works based on the theme of the exhibition and the exhibition.In the first show, \"Art of Time: A Biennial in Retrospect,\" the artist will present a new work based on the theme of the exhibition, “Soul of a Nation: The Struggle for Racial Equality”. In the second show, “Art of Life: A Biennial in the Anthropocene,” the artist", "The next Biennial should be held in 2021, the book states, but the future of the exhibition is uncertain. The International Center for Photography's current exhibition, “Tales of a Black Family,” which is open until March 15, 2020, is not affected by the Covid-19 pandemic.The exhibition will be moved to the National Gallery in London, which will stage the first show in the center in December 2020. The collective will work closely with the gallery to produce a show that examines the evolutions of African and African American art from the perspective of the museum and the institution. In addition, the group will prepare a biennial exhibition for the center in 2021–22, titled “Dream's Fall,” which will be curated by Valerie Hudson and will open March 23–March 25, 2021. “We are delighted to be able to recommence our work in the long-term future as this will allow us to continue to present compelling exhibitions, exhibitions, performances, and photography exhibitions in the National Gallery,” said James A. Farquharson, the curatorial director of the National Gallery. “These exhibitions will celebrate the rich history of the National Gallery and its mission to present compelling", "The next Biennial should be a powerful example of how art can change lives, can reach places that no longer welcome it, and will set an example for future generations.”\n\n\nThe Museum of Contemporary Art (MoCA), Boston, has received a gift of three hundred works by the Japanese artist Tatsumi Ota. The works were donated to the Art Museum of Fine Arts (MAFA) in partnership with the artist from the Japanese organization the Museum of Contemporary Art (MoCA), which owns the works. The gift includes works by Piero Manzoni, Ota’s wife, who is the director of the institution; Elena Bienstock, the director of the Doris Duke Art Museum in Louisville, Kentucky; and Ota’s brother, Takashi Ota.The works were acquired through the pockets of collectors Giuseppe Manzoni and Tatsumi Ota. Giuseppe Manzoni, a former vice president of the Metropolitan Museum of Art, acquired the works by Ota in 1985 and they were displayed in his gallery for several years. In 1988, Giuseppe Manzoni, a retired collector, sold most of the art to the Duke Art Museum, which acquired them in 1991.\n\n\nThree hundred works by", "The next Biennial should be held in 2020 and the first in 2021. The first edition of the exhibition, titled “Art and the Structures of the Body,” was held in Frankfurt in 1963. Its next iteration, titled “Bodies in Space,” was staged in London in 1974. The organization Modern Art has previously asked the National Gallery of Art and the Tate to postpone or cancel their annual fellowships, which commemorate the American artist William S. Burroughs. The institutions have refused to recognize the changes made to the pasture, and art historian David Halberstam called the move a “blatant denial of the Burroughsian legacy.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is launching a new $1 million grant program aimed at supporting artists and small to mid-size arts and cultural institutions in California. The program, titled the “Creative Alliance for Arts and Culture,” will provide $500,000 grants to artists and $500,000 to small to mid-size arts and culture organizations. “The program is a continuation of the work of the MCA Foundation for the Arts and the foundation’s", "The next Biennial should focus on the art of communication, art of the unconscious, and art of the body. It should also include a debate on the role of technology in the development of an affective and neurosis-based aesthetic within the context of a cultural and political climate facing a future of mass incarceration, climate change, and ecological disaster. \n\nThe seventy-fifth Venice Biennale, titled “In the Shadow of the Masses,” will host an exhibition dedicated to the work of Patricia Arquette and will present the first ever “Biennial History” of a pavilion to include the work of two women. The event will take place at the Museum of Fine Arts (MoFA), the Louvre, the Art Institute of Chicago, and the Whitney Museum of American Art. The art museum will stage the event in the exhibition space of the Louvre, which will host the exhibition for a month.In a statement, the museum said: “The great artists of our time have always been concerned with the capacity of art to change the world for the better and always have had in mind the social and political demands and the historical precedents that inspired them. In order to achieve this, the Louvre Museum, the", "The next Biennial should be formed to embrace the flexibility of a diverse range of perspectives through artistic practice and exhibition. The biennial should also consider the current political and social situation, the artistic ability of the artists, the impact of art on society, the importance of art in social and political struggles, and the possibility of the pavilion in the Biennial as a new form of expression.” The 2019 edition of the Biennale will take place in Paris from March 8–March 10, 2020.\n\n\nThe Saudi Arabian Ministry of Culture has ordered the eviction of all non-Saudi-owned and run cultural institutions and websites in the Kingdom from the kingdom’s AlUla province, which borders Saudi Arabia and the United Arab Emirates. The official announcement followed a months-long investigation into the demolition of artworks, shrines, and other cultural artifacts in a series of demolitions that revealed that the Kingdom’s Ministry of Antiquities and Museums had been systematically dismantling the country’s cultural heritage sites with the goal of stifling dissent.“The Ministry of Antiquities and Museums has been destroying sites of historical significance for more than a century to push forward the Saudi dream of a modern, state-controlled museum,”", "The next Biennial should be held in the spring of 2021, and the 2019 and 2020 editions were held in the spring of 2019 and the spring of 2020 respectively.\n\nThe end of the exhibition series was announced on September 7th, with the opening of the new show, “Building Bridges,” at the Museum of Modern Art in New York. The 2019 show, “Building Objects,” featured work by seventy-four artists. The museum will hold two exhibitions of work in 2020, including the first of the group “Building Bridges,” with the works of forty-three of the artists whose works will be included in the exhibition. The exhibition will also feature “Beyond Bridge,” a new work by twenty-six artists whose practices are intertwined with the historical and contemporary connections of the Biennial.\n\n\nTwo years after an agreement was signed that would establish the Museum of Modern Art (MoMA) as the nation’s premier cultural destination for the first time, lawmakers in New York state are threatening to take the institution to court over the decision. Last week, Governor Andrew Cuomo signed legislation that will allow for the prosecution of museum directors who violate the terms of the landmark deal—it will also allow the attorney", "The next Biennial should be held in 2021. The institution will also launch a new online portal dedicated to contemporary art. The project will be led by Perrotin and is being funded through the sum of $8.5 million. The first exhibition will be a selection of work by the artist Anna-Marie Leon. The second will be a curated selection of works by the curators Erick Abad and Ochila Lidija. The third will be a retrospective of the artist Karin Roesler, which is being curated by Elena Zagor. The fourth will be a retrospective of the work of the late painter and sculptor Lévy Gorvy. The fifth exhibition will feature the work of the late British conceptual artist Ian McEwan. The sixth will be a retrospective of the late Italian designer Giovan Battista. The seventh will be a retrospective of the late British textile designer Fergus Henderson. The eighteenth exhibition will focus on the early work of the artist Katharina Schöffer. The nineteenth will feature the work of the Russian German writer Rudolf Hilfer, a collaborator of Mephistopheles, and will open in October 2021. The twentieth exhibition will open in June 2022.", "The next Biennial should take place in 2020, the full list of organizers is as follows:Architecture and Design: The British Institute (BA) at the University of Manchester (UK)Art History Museum and Society: The Art of Art Museum is a special exhibition that will examine the history of objects in the museum, and aims to present them in an original way. It will be followed by a lecture series that will highlight contemporary developments in design. Boston: The Art of Art: *Originally scheduled for November 2020 but moved to the end of January for lack of space and financial reasons. Gallery Director: Carlotta Massieu. Los Angeles: The Art of Art: Originally scheduled for March 2019 but moved to the end of March. New York: Originally scheduled for March 2019 but went on hiatus until April. San Francisco: Originally scheduled for March 2019 but has since been rescheduled. San Francisco Art Institute: Originally scheduled for March 2019 but has since been canceled. Seattle: Originally scheduled for March 2019 but has since been canceled. Los Angeles: Originally scheduled for March 2019, but has since been canceled. Los Angeles County Museum of Art: Originally scheduled for March", "The next Biennial should take place in 2020. This year’s edition will include the work of 150 artists, and will open in February.The biennial will be staged in collaboration with the Museum of Contemporary Art, Los Angeles (LaCrosse), the Museum of Contemporary Art, Chicago (MCA), the Los Angeles County Museum of Art, and the Los Angeles Museum of the Arts.\n\n\nThe United Kingdom’s Office for National Statistics (ONS), which reported that the UK economy was growing at a rate of 4.7 percent in the third quarter of this year, has released its quarterly GDP figures for the twenty-third to the twenty-fifth quarters. The quarterly figures are based on data from the Office for National Statistics’ GDP and Business Outlook, which is released biennially by the Office for Budget Responsibility (OBR).The quarterly GDP figures for the twenty-third to the twenty-fifth quarters are as follows:· March quarter: 3.5 percent· June quarter: 4.3 percent· September quarter: 4.2 percent· December quarter: 3.9 percent·January quarter: 2.8 percent\n\n\nThe Center for Contemporary Art (CCA) in New York has released the quarterly financial results", "The next Biennial should be held in 2022. The festival will also be moved to the streets of the capital city to address the city’s housing crisis. The programme will be hosted by the CNA and will run from September 25 to September 27. “We are thrilled to be back on Alberto’s... this year’s edition was the highlight of our programing,” said Roderick de Sousa, president and CEO of the CNA. The program, which will feature an eclectic mix of artist exhibitions, residencies, book signings, and other programming, will be held in conjunction with the completion of the CNA’s CNA 102, which opened in 2017 and stands as a symbol of the institution’s commitment to contemporary art and Latinx art.\n\nThe National Museum of Contemporary Art (New York) announced today that Jorge Sánchez-Villalba, who has worked at the museum for twenty-five years, will be its next director. Sánchez-Villalba, who previously served as a curatorial assistant in the department of visual arts at the Museum of Modern Art for ten years, was appointed director in January", "The next Biennial should be held at the National Gallery of Art, which is currently closed until at least April 20. The museum hopes to reopen in April.  The National Gallery of Art, of which the National Museum of the American Indian serves as the headquarters, is located at 1301 Pennsylvania Avenue NW in Washington, DC.In a statement, the National Gallery of Art said: “The National Museum of American Indian has had a long and distinguished history of excellence in collecting, exhibiting, organizing, and curating American art. In recent years, the museum has enjoyed sustained success in advancing the National Museum of Art’s mission to explore the history of American art and in providing opportunities to connect with local communities through exhibitions, educational programming, and special events. We look forward to providing the museum with an improved experience as we continue to explore and experiment with new ways to present and present American art.”\n\n\nThe US House of Representatives voted yesterday to approve a landmark $2 trillion stimulus package that will provide billions of dollars to combat the coronavirus, and expand disability benefits and unemployment insurance, and raises the federal minimum wage by ten cents an hour. The $2 trillion package, which now goes to President Donald Trump for his signature, will", "The next Biennial should take place in the spring of 2020. \n\n\nThe Royal Academy of Arts (RA) in London announced today that the institution will award the $100,000 Special Envoy Award to Louis van Gaal, the former Manchester United and Dutch national team coach, for his leadership of the Dutch club to the 2019 FIFA World Cup. The prize, which is named for an academy in the United Arab Emirates, will be given in recognition of his achievements in developing young talents across the Netherlands and Europe in his professional career. Van Gaal will be presented with the award at a ceremony in London on February 9. The ceremony will be preceded by a day of reflection for the winners of the prestigious Royal Academy of Arts Lifetime Achievement Award, which are presented annually.Lutz Bacher, the president of the Royal Academy of Arts, said: “The Royal Academy of Arts is delighted to welcome Louis van Gaal to the academy. He has been instrumental in securing the future of the academy through his vision and work, and we are grateful for his confidence in us and our work. He has also been a true mentor to a number of our students, and has shown a deep appreciation for his expertise and insights in bringing up a number of", "The next Biennial should take place in late June 2020. The upcoming event will be held at the Maryland Institute College of Art (MIA), in partnership with the National Museum of African Art (NMAA). The theme for the biennial will be “Invisibility: How Technology and Illusion Shape Our World” The deadline for entries is June 4. The 2019 exhibition “Invisibility” premiered at the NMAA. The event will also feature work by artists such as Amy Sherald, Jadoto Wood, Haroon Mirza, and Zulfiqar Nuri.\n\n\nThe Spanish Ministry of Culture and the National Science Academy in Madrid have named Stefano Pindell as the next leader of the institution. Pindell will take the helm of the Palacio de Arte Contemporáneo, which is the institution’s main building in Madrid and has been transformed into a museum in the city, on June 1, after he succeeds Hélio Oiticica, who resigned in June after a fierce campaign by his supporters.Pindell succeeds José Manuel de la Madrid, who was named director of the Palacio de Arte Contemporáneo in September 2018. Following his departure", "The next Biennial should be held in the autumn of 2022.\n\n\nHunted: The American Story, an exhibition that aims to use photography to examine the violence and pain of American culture, has announced that it will cancel its sixth edition, held at the Brooklyn Museum in New York, on October 20–21. The twenty-third edition, which was curated by Brooklyn-based artist John Akomfrah, was also cancelled, and the twenty-fifth and twenty-sixth editions, which were hosted by the Museum of Modern Art and the Metropolitan Museum of Art, respectively, were rescheduled for the fall and winter.The exhibition, which was co-organized by Akomfrah and artist David McNew, is focused on the intimate relationship between the American and Israeli art and culture industries. “The topic of violence in American art is very relevant for us at this moment, especially considering the current moment,” said Akomfrah. “In light of this year’s terrorist attack in New York and a further year of war and violence in Palestine, I felt it was important to take a moment to reflect on the historical roots of our art and to re-examine the relationship between the United States and Israel.�", "The next Biennial should have had the foresight to include more women artists and should have included both the two biggest female-run galleries in Los Angeles, the Compton Museum of Art and the Santa Monica Museum of Art. Instead, the event was overrun by angry attendees, many of whom were upset because of a subpar three-day run of the show. The show was closed until October 26, the weekend of the upcoming Women’s March. The reason: the exhibition was supposed to take place in September. What happened next will determine whether the show will survive the storm and whether it will be able to reopen in the spring.The exhibition was originally supposed to open on October 6 and run through December 17. It has since been moved to September and on January 8, 2020. The move was made in an attempt to avoid disrupting the March for Life, which was also scheduled for September 23–25. The postponement was made after organizers learned that the work of five artists, including Mariachi Natalia, Isabel Modrovica, and Marta Pérez, would be included in the exhibition.The work of the four women featured in this year’s exhibition is called “Luz,” a performance by Judy Barilla", "The next Biennial should take place in 2020.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, is reopening to the public next week following a $100 million expansion designed by architect Daniel Libeskind, the Washington-based firm responsible for the renovation of the Solomon R. Guggenheim Museum and the National Museum of Modern Art in Washington, DC.The museum’s new home, dubbed the Museum of Art, was completed in 2020 and opened to the public in December of that year. In the intervening years, the museum has undergone a number of expansions, including the construction of the newly renovated MBCG, the MHC, and the Hirshhorn Museum and Sculpture Garden, which new exhibits will introduce in the coming months. The Hirshhorn will reopen on January 13, 2021.The new Hirshhorn and the new MBCG will be inaugurated by “The Body,” a revamped show on the history of art that will explore the ways in which bodies and their bodies have impacted and intersected with art history over the course of 600 years. “The Body’s’s first section, ‘Lanterns of Earth,’ begins with", "The next Biennial should take place in 2021, and the auction house is currently collaborating with the museum on a special exhibition series, “Amerigo,” the first of which will open in 2020.\n\n\nThe Metropolitan Museum of Art in New York has received a $10 million donation from the Lauder family. The donation, which was made on behalf of various members of the Lauder family, including Richard and Maurice Lauder, was made in support of the Met’s construction of the new Walton-Besse Modern Art Museum.\n\n\nThe magnate collector and philanthropist George Lauder announced in a statement on Wednesday that he is donating $10 million to the New York Museum of Modern Art (NYMoMA) in support of the institution’s expansion into a cultural center dedicated to the collection of the art of South Asian art. The gift comes as the Metropolitan Museum of Art in New York works to enter a new phase of its expansion plan.In a statement, George Lauder said: “The Met’s expansion into a contemporary, global art museum centering on the collection of art of South Asian heritage is an incredibly exciting and important development for the Museum. We are excited to see where it takes us in the next few years and are", "The next Biennial should take place in 2021 and will lead to the first exhibitions of work by women artists in the United States. The event, entitled “Women in the World,” will run from March 28 to March 31 and will feature work by forty-two artists. A selection of the artists “previously excluded by the state,” and will be presented by artist-in-residence Sylvia Marciano. The festival will feature the work of sixty-nine artists from twenty-two countries.“Biennials are a universal, time-honored practice,” said Mary Anani, executive director of the Art Gallery of Ontario. “The first Biennial was a collective effort of Kathleen Knowles, Susanne Vielmetter, Mary Ellen Loretta, and I. F. Hoffmann. In the decade since the inaugural event, we have worked hard to expand on the theme of the Biennial by elevating it to become an annual platform for the collection and exhibition of work by artists of all ages. The times we live in are changing, and we are more attentive to the work of younger artists. We think we have a responsibility to honor their vision and spirit by supporting them in their work and by", "The next Biennial should be organized in a way that will enable museum directors to work together to develop a platform for critical reflection on the contemporary world and, hopefully, a future exhibition which will reflect the breadth of the collection.\n\n\nThe Piers du Palais de Tokyo in Paris and the Palais de Tokyo in New York have been awarded the 2020 Florence Architecture Biennial, which will take place from March 27 to March 29. The event’s organizing committee announced the dates for the exhibition, which is organized as a collaboration between the Pritzker Architecture Prize and the Architectural Society of the Pacific, on Thursday. The exhibition will be organized as an ambitious project on the Pritzker-designed Punta della Dogana, a former Catholic school in Florence, and will be hosted by the Palazzo d’Arte Moderna and the Palazzo di Rivoli in Milan, Italy, respectively.The museum’s first virtual exhibition, “Monumenta,” will be augmented with a series of virtual exhibitions that will launch in the spring of 2021. The exhibition will also feature the first real works by Italian avant-garde artist Roberto Cicutto. The Italian architect is known for designing institutional interiors,", "The next Biennial should take place in 2021. The twenty-fifth is currently on track to take place in 2022, and the twenty-seventh is currently on track to take place in 2023. “The next edition is an opportunity for us to reassess the themes of our exhibition, to return to them again and again and again, and for us to reflect on the past,” Katja Neumann, artistic director of the exhibition, told the Art Newspaper. “The future is constantly being envisaged and we are in the process of integrating the show into our cultural offerings. This is a chance to re-create the space for a very personal and intimate remembrance of the history of art. Our visitors will be able to share the experience with someone familiar and familiar with our exhibition will be able to participate in a meaningful way in the future.”In January 2018, Lee grew excited about the exhibition “The Phenomenon of Tomorrow,” which he described as “a spectacular voyage through the digital realm,” and his work was selected for a special exhibition at the Museum of Modern Art. Although the exhibition was not part of Biennials, Lee was given a special exhibition hall in the museum and featured in", "The next Biennial should be held at the new museum, which opened in the city in 2009.\n\n\nThe International Council of Museums (ICOM), an alliance of fifty international organizations, has released a statement criticizing the Trump administration’s withdrawal from the Paris Agreement, a global accord reached by the world’s nations in 2015 to reduce greenhouse gases.“We are deeply concerned by the decision to pull the US out of the Paris Climate Agreement,” reads the statement, which was organized by the ICA, the Paris Declaration of the Right of Nations, and the Sierra Club. “The Paris Agreement is one of the most ambitious climate commitments ever undertaken. We call on the US government to recommit to the Paris Agreement and to keep its promises to the world. We call on the US to commit to the full implementation of the Paris Climate Agreement, and we call on all countries to join the Paris Agreement.”Under President Donald Trump, the US has withdrawn from the Paris Climate Agreement, which commits nations to reducing carbon emissions by 26–28 percent below 2005 levels by 2025, and has so far kept its promise to leave in early March. While the US has since faced backlash over its decision, Trump claimed it was making the US", "The next Biennial should be held at the new museum, which is currently being built on the campus of the Art Institute of Chicago, in 2021. “The Biennial is a critical step in moving the museum into the future,” director Marcia Albizu, who directed the museum for twelve years, told the Chicago Tribune. “In the coming years, we will find ways to invite visitors to experience the museum as part of our mission. We are excited to present our next exhibition at the Burke Museum of Art, which opened on June 12, 2021.” The Burke Museum of Art is currently undergoing a $450 million expansion that will add galleries, a public art space, a theater, an amphitheater, and a library.\n\n\nThe Spanish government has given the green light for the private sale of the entire collection of the late Spanish collector and educator Alfredo Pizarro. After years of legal battles, the heirs of the founder of the dynasty that produced some of the greatest collectors in history—including Diego Rivera, Jorge Luis Borges, and Franz Kline—won a historic victory on Monday. The government announced that it had unanimously approved the sale of the collection, which includes works by José Pizarro, Juan", "The next Biennial should be held in the LA area and should be open to the public in 2020. Adeline Luber, director of the Galleries of Modern Art Los Angeles, said: “I am thrilled for this opportunity to central the incredible art of Ellsworth Kelly’s Los Angeles Biennial. It’s an honor to have this opportunity to present the first exhibition in the city of Los Angeles in more than thirty years.”\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it will open its first permanent space on the grounds of the University of California, Berkeley, with a ten-by-eight-foot mural by artist Vinnie Bagwell in September. The show, “Time to Change,” will depict three scenes: a Cal-Berkeley campus, a cityscape and a skyline.“We’re thrilled to present the first exhibition at MoMA that is dedicated to the local Berkeley community through the work of a visionary artist, Vinnie Bagwell,” said David Rothschild, director and CEO of the museum. “Animation, painting, sculpture, photography, and video are an essential part of Vinnie Bagwell’s work, and our", "The next Biennial should be in the year 2122 and be organized by the Custodian of the Legacy, the same organization that owns the Museum. The institution is already working on a new plan for the reincarnation of the Biennial and its reinstallation of the institutional collection, titled “Be/longing.” The exhibition will also include a new exhibition of works by Kiki Smith and a new group show “Sylvia LaBouvier: The Modern Age”.There have been rumors and reports of a new museum dedicated to the work of the late Japanese contemporary artist Usui. The curator of this new museum is Kanetsuro Takeda, who was formerly the deputy director of the J. Paul Getty Museum. The curator’s contract is to open the new Museum of Modern Art in 2020 and is not yet up. The museum will be cofounded by Usui’s son, Usui Usui Jr., and his wife, Nanaki. The museum will be located in a former auto body shop in a former auto body plant in the city of Tadakano, in the central island of Hokkaido. The museum will be inaugurated by a reception of U", "The next Biennial should be an important milestone for the museum. It should be a time for us to reflect on the past and the future, and how we live in the present. It should also be a chance to remember the art that was on display in the exhibition, and to reflect on the future.”The biennial, which will feature work by forty-eight artists and scholars in twenty-eight countries and will be organized in the museum’s collection, will be inaugurated by the exhibition “NIRIN,” an exhibition of work by twenty-nine artists in the collection, which was organized by the museum in collaboration with the National Galleries of Scotland. The show will also feature work by artists such as David Hockney, Elizabeth Ayer, Naima J. Keith, and Eugene O. Wilson.The exhibition will open on April 3 and run through June 8. “NIRIN’s Artistic Commitments: Fundamentals of Photography” is a follow-up to the exhibition “NIRIN: Fundamentals of Photography” (2019–20), “NIRIN’s Artistic Commitments: Photography in the 1960s” (2019", "The next Biennial should begin its inaugural program on September 17, 2020 and will run for twelve months. Because of the ongoing health crisis and the current exhibition schedule, the number of entries in the exhibition will be significantly reduced from the current exhibition. The Biennial will also include a collection of original works, a special exhibition of works created for the inaugural exhibition, and a special exhibition of works created for the Contemporary Biennial. The full list of participating artists is as follows: 1. Adam Lambert (Switzerland)M., D., and E. (New York)2. Amedeo della Francesca (Italy)M, D., and E. (New York)3. Alessandro Graziano (Italy)M, D., and E. (New York)4. Jonas Gebbia (Switzerland)M, D., and E. (Switzerland)5. Benedict Pfeifer (Germany)M, D., and E. (New York)6. Benedict Anderson (Germany)M, D., and E. (New York)7. Bianca Deluxe (Italy)M, D., and E. (New York", "The next Biennial should focus on “The Art of Death” and will consider “taking the full measure of a person’s existence,” said the organizers.André Breton, the French artist best known for his paintings composed of multiple corpses, wrote about these themes in a 1965 essay on the body in the magazine Artforum. “The body has been reduced to a form that is at once a reflection of the universe and a plane of perception, the body as a continuum of motion, a system of the mind, a system of the soul, a system of the spirit, a system of the soul as the totality of being,” he wrote. “These are the concepts that I wish to express in my paintings: a variety of forms, different scales, different densities, different speeds, different densities as well as different states of being.”\n\n\nThe twenty-fourth edition of the Fifty-Ninth Venice Biennale, curated by an intergenerational group of South American curators led by Marcela Barral and Ada Cervetto, has announced its opening dates. The event will kick off on March 17 with an exhibition of work by the Argentinean artist Hélio Oitic", "The next Biennial should be held in 2020. I would like to take this opportunity to thank all of my colleagues who have worked with me over the years and to thank our Board of Directors, Executive Directors, and Board of Directors of the Arts Council for their invaluable contributions to the project. I wish you all many successes in the future.\n\n\nThe Art Newspaper has revealed that the inaugural edition of the Artforum Biennial, staged at Tate Britain between September 10 and September 13, 2019, suffered a major shortfall due to the Covid-19 pandemic. The event, titled “An Unseen Future,” was billed as “a celebration of the art of the future alongside a celebration of the art of the past.”Tate UK is now attempting to re-create the concept of the Biennial by incorporating more art from around the world into the year 2020, although it is unclear whether the planned events will be based on the theme of the exhibition.“The new Artforum will be a celebration of art from across the globe, but most of all, our past,” said Kate Fowle, director of Tate Britain. “The theme of the exhibition will be ‘plant into a new, contemporary context", "The next Biennial should be held in 2020. The event is currently slated to run from December 2020 to March 2021. “I’m looking forward to developing the York Cultural Centre as an institution that is able to offer a unique and important platform for a new generation of artists to explore and engage with York’s rich visual and performing heritage, as well as its wider world,” said curator Nigel Levey, who curated the inaugural exhibition. The first edition of the Biennial, “The Artist’s Community,” was held at the York Art Gallery in 2015 and was followed by “The Art of the Future,” which was held at the Museum of London in 2020 and “The Meaning of Art,” which was held at Tate Britain in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has agreed to pay nearly $2 million to settle a lawsuit by the estate of Irving Penn, the American photographer who was one of the first to recreate the 1960 transatlantic crossing of the Atlantic Ocean along a single-engine aircraft. The $10 million settlement was reached with the estate of Carla Guggenheim-Scherbak, who was one of the first", "The next Biennial should be held in the fall of 2020. The event’s artistic director, Jared Dorsky, said that the remaining 75 percent of the program's programming would be postponed, with the remainder scheduled for release in 2021. “We’ve had a lot of support from the city of Detroit and from the public,” Dorsky told the Detroit News. “I’m really looking forward to the future. I’m excited to see the work of our artists, and I’m excited to see how people respond to their work. Isolation is not the answer. Art should be a tool for self-expression and compassion.”\n\n\nThe Massachusetts Museum of Contemporary Art (MACA) announced today that it is planning to move the contemporary art museum’s permanent collection to a new home in Cambridge, Massachusetts, in 2021. The announcement coincides with the reopening of the Museum of Fine Arts, also in Boston, on September 8.“We’re thrilled to announce that in 2021, MACA will open at the newly renovated museum, with a new collection of work by renowned international artists, including Carlos De Jesus, Victor LaViolette, Pierre Luc God", "The next Biennial should take place in 2021. The new exhibition, which will include work by seventy artists including John Pritchard, Katja Ruba, and Agniveska Kanata, will be held at the museum until September 2021.\n\n\nThe Museum of the African Diaspora (MoAD) in Atlanta, Georgia, has hired Elizabeth A. Lieberman as its new executive director. Lieberman will be responsible for developing a long-term strategic plan for the institution, which was founded by a group of donors in 2005. She succeeds Carolee A. Connor, who retired in 2016 following ten years as director after the presidential election of Barack Obama.“Elizabeth has been instrumental in transforming the MoAD into a destination for artists, scholars, and communities,” said director and CEO Jim Garlow. “She has built a strong track record of working collaboratively across disciplines to advance our mission, and has demonstrated a commitment to championing and expanding the work of artists of color.”Prior to joining MoAD, Lieberman served as the curator-in-chief of the exhibition “Theater of Operations: The African Diaspora” (2019); cofounded the institution’s annual Book Awards; and organized numerous", "The next Biennial should take place in the spring of 2021. The theme will be “Alchemy at Work: From Figuration to Alchemy,” curated by Jill Thompson, who will lead the exhibition. “Alchemy’s most recent incarnation was the five-year, five-hundred-and-fiftieth anniversary exhibition, ‘Alchemical Vision,” which opened at the Museum of Modern Art in New York in October 2018.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Elizabeth Niles as its new interim director. Niles comes to the institution from the Los Angeles County Museum of Art (LACMA), where she was the deputy director of public affairs. She succeeds Sarah Schroth, who departed the museum in March 2019 to head the Pasadena Museum of Art, and will take up the post on September 6.“Elizabeth Niles: The Art of the LASALLE.” In her new role, which was created through a recommendation by board chair Tom Fries, Niles will oversee the museum’s transformation from a Los Angeles institution to a regional, not-for-profit, nonprofit. The first phase of the renovation, which began in 2017", "The next Biennial should take place in November 2021. The twenty-eighth will take place in February 2022. The twenty-ninth will be hosted by the New Museum in June 2022. \n\n\nThe Museum of American Art (MoA) in New York is planning to open a new location in the city in March 2020. The museum, which has been in the works for more than two decades, plans to expand the museum’s collection by three hundred works; the institution has received more than $1 billion in public funds to build the new building.The museum is also planning to create more than 230 full- and part-time positions, with an additional 150 additional volunteer positions. The museum hopes to attract an additional 150,000 visitors to its new space in the city. The expansion project, which is part of MoA’s $2 billion redesign, is expected to be completed by 2022.Inaugurating the new venue will be a discussion group for artists and their guests, an interactive exhibition, and a public gathering space, called the Museum of Art. The exhibition, “The Future Is Now,” is slated to run March 22–March 28. The exhibition is curated by Michael Chabon and features more than", "The next Biennial should focus on “radical new modes of production and distribution,” and should be held in 2020. The three-day event will run from May 18 to May 20.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Debra Hoberman as its next director. Hoberman joins the institution from the Metropolitan Museum of Art, where she has served as interim director since April 2019. During her tenure, the museum has welcomed more than 5,200 visitors for its first collection-wide reopening in more than twenty years. She is also attempting to address a number of issues, including affordable attendance and visitor engagement, the museum’s long-standing gender imbalance problem, and the institution’s long-standing criminal justice system backlog.“Debra brings a wealth of experience and knowledge to our team as she has overseen major exhibitions at MoMA, including “After the Blackout: From Black Power to Black Lives” (2018) and “Black: Current Anthropology” (2017) and has led six high-profile exhibitions, including “Sale of a Life: Marc Anthony” (2019) and “The Artist’s Box: Avant-", "The next Biennial should be a celebration of the twenty-fifth anniversary of the Biennale, in the same year that the biennial will be remembered for its pioneering work to expand the concept of art history through a series of exhibitions and residencies that included the first exhibitions of artists from the African diaspora, artists from the indigenous and Third World traditions, and art from the Middle East, North Africa, and South Asia. The theme of the 2020 edition will be “Life and Death in the Twin Cities.” When the show is over, the Biennale will hosted a biennial exhibition of works by the new artists.\n\n\nThe São Paulo Biennale has announced that it will suspend the exhibition “Capital” for six months following a fire that broke out in the exhibition’s temporary space in the city’s São Paulo District at the end of March. According to the artist’s representative, Joao Paulo Sousa, the firework’s sculpture “Covid-2”—a large nude sculpture installed on the platform of the exhibition, called a “living sculpture”—is still unsafe due to the explosive temperature and smoke damage caused by the fire", "The next Biennial should be held in the fall of 2021. The exhibition will run between September 15 and September 20.\n\n\n\n\n\n\nThe Museum of Fine Arts (MFA) in Boston has received $76 million from the National Endowment for the Arts (NEA), the American Federation of Arts (AFA), and the California Community Foundation (CCF), to help it maintain a inclusive, diverse collection that reaches back into the history of the United States. The gift includes $58 million for direct support of the museum’s work by women artists, which will be reinvested in the museum’s ongoing narrative of the intersection of art and politics; $40 million for direct support of the museum’s cultural and political advocacy for artists and cultural producers; and $30 million for direct funding of the museum’s National Endowment for the Arts (NEA) and the National Endowment for the Humanities (NEH) through 2019.The gift is part of the NEA’s commitment to expanding the museum’s collection and its engagement with the history of women artists, immigrants, and African Americans. The NEA’s gift will also", "The next Biennial should take place in the city in 2020. The works on view include paintings by the Mexican painter León Mier and the German sculptor Martin Erich Hartmann; a portrait by Pierre-Auguste Renoir and a work by Pierre-Auguste Cezanne; and a sculpture by Pierre-Auguste Cezanne. Even before the exhibition opened to the public in 2010, the artist-run biennial was repeatedly vandalized, with some of the works being hung above platforms on the biennial’s courtyard and some pieces being doused with gasoline. If the Biennial de Lyon is allowed to continue as planned, the city’s art museum, the Musée d’Art Contemporain, will only reopen once it has received a permit from the local council.\n\n\nA group of artists, activists, and collectors are suing the State of New York over its plan to shutter the Museum of Modern Art (MoMA), which it plans to turn into a museum of science and technology, in the summer of 2021. The lawsuit, filed in federal court in Manhattan on Thursday, claims the move violates the Getty’s landmark 1968 agreement with the state over the dismantling of the institution, which was", "The next Biennial should take place in 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) is launching a cultural initiative to help cultural businesses stay connected to the arts through the reopening of designated virtual tourism sites. The initiative, dubbed Connected Communities, was developed in partnership with the New Arts for New York (NAMI) coalition and will provide local arts organizations with more than a thousand arts-focused tools, including bus tours, arts education, and artist studios.“With the recent coronavirus outbreak in Europe and the United States, the department is acutely aware of the value of our cultural and nightlife communities for the local economy and for the city as a whole,” said NYC commissioner of cultural affairs Michael Feuerstein. “Connected Communities will help cultural businesses and neighborhood institutions like the Museum of Modern Art and the Bronx Museum of the Arts stay connected with their communities and our communities.”NAMI has launched a fund to assist cultural businesses affected by the Covid-19 pandemic. Anyone interested in applying for aid can do so here.\n\n\nCultural Producers and Distributors Association (CDPAs), an industry group representing more than 1,500 arts and cultural producers and distributors", "The next Biennial should be in July, with the exhibition slated to run from September to December.\n\n\nThe Art Newspaper has launched a new online subscription service, Artnews. The service will be free for everyone who is a member of the Art Newspaper’s UK, US, and Europe divisions and will provide weekly news, reviews, and other content. “The Art Newspaper is a global platform, built on a strategy of collaboration, that aims to develop and present the most important art and art-related news in the world, across all digital platforms,” said Julie Brown, director of Artnews. “From the early days of its existence, Artnews has been a true platform for our news coverage, offering a dedicated site for art news and reviews, along with a dedicated app for our readers to receive our news on their devices. We are delighted to introduce new readers to the platform and to continue building upon the strength of our existing readership.”In order to operate a digital subscription platform, an organization such as Artnews has to register with the Art Newspaper and obtain a UK license, which the company says allows it to create an account on the site. The company also needs to secure the art-world news", "The next Biennial should take place in the seaport city of Port-au-Prince, where the first Pan-African event took place in 1964. The seventy-ninth edition of the Art Basel show, which will focus on the art of the West, will be held in the United Arab Emirates from March 8 to March 13 in 2022. The art of the West series, which was started by the Malaysian artist Kohn, will feature works by twenty-eight artists and will be curated by Kohn and his group, Kohn Linné, in collaboration with the UAE-based architect Ahmed Asiri.\n\n\nThe Christie’s New York store has announced that it plans to open a new location in the city next month. The launch of the store will also include a new online marketplace and library where customers can purchase art. The new space will be located at the Galleria Savoie in Manhattan, adjacent to the Galleria Savoie di Planète in Savoie and will be integrated into the main building of the museum.“Across generations, art lovers have come and gone, and the gallery has remained relevant through the process of discovery and acquisition,” said David Childs", "The next Biennial should focus on how the art world impacts on our psyches and our lives. It should also include a consideration of how art development affects and reconceptualises the relationship between the artist and the public sphere, a theme that has been explored previously in various biennials. “We are now entering a new phase of our artistic development, one that will certainly embrace the creative process in a much more holistic manner,” Anand said in a statement. “As we enter a new creative moment, I know that the art we create will continue to shape and animate our lives and we as a community will continue to shape and animate our lives. As this new phase of the exhibition takes place, I am especially proud to be a part of it.”Among the exhibition’s inaugural works are these sculptures from the sixty-four-hour Biennial, “No Exit: Art in Transition,” which was inspired by a late-night visit to the gallery by the late Japanese foreign minister, Isao Hashimoto, in 2003; “Anus and the Web: Art and the Resurrection of Steve-O” (2017), a large-scale installation featuring more than 150 works by contemporary artists such as", "The next Biennial should be held in 2020. \n\nThe theme for the next iteration of the Art in General, curated by Benjamin Harnwell, is “Art as a Force.” The biennial will examine the intersections between art and the environment.Harnwell’s show will be staged in the former Royal Academy of Arts, where it will host an exhibition of work by the Adrian Piper-designed Houses of Parliament. The museum will also feature an exhibition of works by Yehudi Menuhin, a multi-million-selling Israeli contemporary art collector, as well as works by the Barbara Sze. Inaugurating the pavilion are new works by the Tel Aviv–based artist Zvi Shor, who has been featured in several documentaries about Israel, including Culture Watch and Artforum. Shor’s work will be presented in the pavilion’s theatre of the Future, one of a number of new collaborations between the museum and the Israeli Ministry of Culture.Commenting on his role, Harnwell said: “My goal in organizing the biennial is to create a space that is a living museum but one that is profoundly sensitive to the local", "The next Biennial should take place in Hyderabad in March 2021. The calendar also describes an exhibition of art from the Dawood’s collection; a series of lectures by Zakir Naik and an introduction by the late author Michael Collins; and a book. The book will be a collection of essays on how a society should respond to the threats posed by climate change.The International Water Management Association (IWMA), an American conservation NGO, has also called for a new global climate action plan. The organization wants the United States to commit to cutting greenhouse gases and to accelerate the transition to renewable energy sources. The United Nations is currently working toward agreeing on a global climate treaty that would address the global crisis. \n\n\nThe British designer, director, and owner of the eponymous fashion label LORAC, Mary O’Grady, has been named the winner of the $65,000 Oxford Fashion Awards. The accolade comes with a $50,000 cash prize. According to the New York Times, the award ceremony took place on Wednesday, February 24, at the Savile Row venue in Oxford, England.The contemporary designer, who served as a director of the label for more than twenty years, was also named the recipient of a £", "The next Biennial should also be a celebration of the Portuguese, who were known for their ingenuity and penchant for invention, as well as the works of the Spanish painter María Berrío, who lived in the Venice Biennale and created a series of experimental sculptures that were exhibited at the Venice Museum of Art.The institution also said that it is developing a new platform, called the intelligencia platform, which will help foster greater understanding between artists and the public through a combination of online and in-person exhibitions. The platform will aim to provide a platform where the public can exchange information and experiences.The announcement comes less than a month after the Spanish minister of culture, José de Alamón, ordered the removal of all 160 works in the institution’s collection from the museum’s website, and a week after the museum’s board of directors voted to start a campaign for the collection to be returned to Spain. The move followed a complaint from the museum’s artists, who were demanding that the works be returned to Spain for their exhibition “La Pica de Misericorde,” which is a “classic” presentation of modernist architecture. The exhibition, which is on loan to the Spanish", "The next Biennial should focus on how we design our biennial to recognize and reflect our changing world. We will also need to rethink what a biennial is, and what it might look like in the future. One of the first tasks of the new Biennial Council will be to revise the existing guidelines for the 2020 edition, which are available on the Council’s website. The 2020 edition will take place in Oslo, the largest city in Norway.The International Confederation of Art (ICA), a United Nations agency, issued a statement on August 30 expressing concern about the consequences of the coronavirus and the need to prepare for them. “The epidemic has triggered unprecedented public health emergencies and has resulted in a global health emergency,” the statement reads. “The ICPA strongly urges all countries, international organizations, and governments to take all appropriate and immediate actions to contain the spread of the coronavirus. The ICPA has published guidelines for countries and international organizations as well as a set of guidelines for international travel. To date, travel is the main mode of spread. However, it must be borne in mind that travel by air and sea, and indeed by land, is a leading cause of transmission.”The Geneva-based artist and", "The next Biennial should focus on the historical development of the institution (from a single museum in 1958 to its present location) and on the exhibition of new works by contemporary artists. The fourth will focus on the art of the contemporary era, and the fifth will examine the relationship between contemporary art and the modernistic movements and their practices.\n\n\nThe French Ministry of Culture and the Louvre have announced a partnership that will see the Louvre renovated and expanded in Paris. The construction of the new 13,500-square-foot building, which will also include a new museum, cafés, and a theater, is expected to run sometime in 2023. The extension of the museum’s footprint also includes a thirty-seven-acre extension of the museum’s collection.The Louvre has been under construction since 1994, and the renovations are anticipated to take two years. The Louvre, founded in 1889, has more than 1,500 works by some of the most prestigious artists of the twentieth century, including Pierre-Auguste Renoir, Geneviève Rene, and Jacques-Louis Adam, as well as works by artists such as MoMA’s Christopher Wool’s The Unseen, Garry Winogrand’s", "The next Biennial should focus on the production of works that address current social and political concerns in Argentina, such as the recent campaign against the construction of a new military base in the country.\n\n\nThe Art Newspaper has announced that it will no longer publish its flagship issue in May, which was scheduled to feature work by more than sixty artists from twenty-five countries. Titled “Best of the Rest,” the first issue of the biennial was released on May 23, and featured work by thirty-five artists, including Amedeo Anfangioli, Abdelkader Almasry, and Asma Al-Hadid. The next issue will be released in June. The deadline for submissions is June 28.The biennial is sponsored by Artforum, which was acquired by MediaVest for $153 million in January 2019. The magazine is a subsidiary of the Sotheby’s Group, which also owns the New York Times and the Washington Post. The company announced its acquisition of the business last month and said that it expects the yearly event to draw up to five thousand visitors.Olivier House, who cofounded the first magazine in 1971 and served as the founding editor of the Art Newspaper from 1987 to 1998,", "The next Biennial should be set in the SE, and, according to the organisers, will include a selection of monographic works by the greatest contemporary artists of the Americas and Europe. The theme of the upcoming exhibition is “The Body and the Other,” and the artists selected for the exhibition include Georges Aposté, Damien Hirst, and Ursula von Rydingsvard.The exhibition will be inaugurated by an exhibition of works by the Danish artist Jonas Økstedt, which will be presented by Dave, and will last through March 25. Both the Danish and Norwegian embassies will hold local events in Oslo and Bædhus. The Biennial will also carry out an international edition, which will take place in June. \n\n\nThe Smithsonian Design Museum (Stern) in Washington, DC, has announced that it has awarded Patricia K. Littman-Bennett, the director and CEO of the San Francisco Museum of Modern Art (SFMoMA), $50,000 in support of the expansion of its children’s museum. The funding will allow the institution to create additional indoor and outdoor spaces for the development of new programming.The museum will also receive $50,000 in tax credits, which are designed", "The next Biennial should be held at the new museum’s former home on East Fifth Street in the spring of 2022. The event will be inaugurated by a presentation of the exhibition “Latin America: Contagious Disease and the Body,” which will be followed by an opening of the new retrospective of Galería de Sáez, “How to Survive a Plague,” which will run from March 21 to March 27.The museum will also have an expansion planned that will include the construction of a new exhibition space and the renovation of the building’s courtyard. The project is valued at $1.8 million.The announcement of the project comes amid the ongoing crisis in Europe and Asia as the pandemic enters its fourth year. In the US, where the number of cases surpassed the total for any other year since the pandemic began, the coronavirus has killed more people than any other illness and has been blamed for the highest number of hospitalizations since the pandemic began. In Australia, where the coronavirus has killed at least twenty-six people and infected at least 185, the coronavirus isn’t considered a health emergency because of the pandemic.In response to the coronavirus,", "The next Biennial should take place in 2020, and a new edition of the exhibition will be held every four years thereafter.\n\n\nThe United States Senate unanimously approved a $2 trillion stimulus bill on Monday that will invest more than $2.5 trillion in the economy through various federal agencies and provide billions of dollars to small and mid-size arts and arts-related charities and nonprofit organizations throughout the United States.The $2.5 trillion package, which was passed by a vote of 98 to 1, will provide $1.8 billion to arts and cultural organizations, including $200 million for the National Endowment for the Arts, $200 million for the Corporation for National and Community Service, and $250 million for the American Alliance of Museums.The Ânorthern leg of the package—which Âs also known as the Space Act—is called the Space for Public Benefit and will allocate $600 million for the general welfare. The southern leg—which is called the Space for Industrialization—is slated to be introduced in the Senate on Wednesday and will allocate $450 million for industrial development, recreational activities, and environmental protection. The legislation also allocates $300 million for the arts, and", "The next Biennial should be held in 2022.The exhibition will be staged at the Museums, New York; the Museum of Modern Art in New York; the Museum of Modern Art, New York; and the London-based organization, Tate. The institution will also be holding a selection of works by the artists whose work is currently on display at the exhibition. The 2017 edition of the event, “March/April,” featured work by Daniela Pape, Phyllida Barba, and Ulrich Pfeifer.\n\n\nThe National Gallery of Art in Washington, DC, has named Chloe Borthwick as its next director and CEO. Borthwick joined the institution as director of collections and exhibitions in January 2019. She succeeds Sabrina Berlind, who has served as interim director since March 2019.“Chloe is an exceptional leader, and I’m confident she will continue to inspire and empower our team through an open, engaging, and transparent culture,” Berlind said in a statement. “Her leadership, vision, and ability to prioritize, align, and prioritize across the collection and exhibition team and across the organization will be critical to our future success.”Berlind, who helmed", "The next Biennial should be on February 9.<|endoftext|>A new report released by the National Association of Theater Owners (NATA) and the American Alliance of Theater Owners (A.A.T.O.) claims that the industry is facing a loss of more than $300 million due to Covid-19. According to the New York Times, the A.A.T.O. estimates that the costs of treating Covid-19-related illnesses will total at least $2.5 billion over the next three years.In a statement, the A.A.T.O. said that the study's findings are \"disturbing\" and that it is working with the Centers for Disease Control and Prevention (CDC), the Food and Drug Administration (FDA), and other stakeholders to make sure that the industry has the resources to contain the virus and prevent a spike in Covid-19-related respiratory infections.“The Covid-19 pandemic has already had devastating consequences for our local, state, and federal governments, and we continue to anticipate more devastating consequences for the theatergoing public in the months and years to come,” said Steve DeGrazia, president of the A.A.T.O. and former CEO", "The next Biennial should be released in 2022.\n\nThe Venice Architecture Biennale, which is taking place in the Bahamas from November 13 to November 16, will also introduce a new event, titled the 'Arkangeli Ungelegten', which will embrace architecture from the Middle East and Africa, and will host twenty-two works by forty-eight artists.The event will run for three weeks, and will feature twenty-four works by fifty-three artists. The theme of the event will be “ecology of value,” and the exhibition will be centered around the theme “Eccentricity as an Axis in Space.” The seventy-five-foot-long, seventy-two-foot-wide, and seventy-two-foot-wide exhibition space is the new venue for the annual Biennial. The exhibition will be held at the Grand Opera House in central London from November 13 to November 16, 2022, and will open on December 2, 2022.\n\n\nThe Art Newspaper has revealed that the Japanese architect Eiichiro Sasaki, whose video games were inspired by Trisha Brown’s work, will be the next pavilion curator at the 2020 edition of the Venice Architecture Biennale. He", "The next Biennial should be held in the summer of 2021. The festival will be in cooperation with the St. Petersburg City Hall and the Central Institute of Fine Arts.\n\n\nThe CNA has released its list of fifteen artists and creatives who have received the \"Artist Prize\" award in the form of a triennial grant from the Museum of Modern Art (MoMA), in partnership with the Architectural Alliance. The award, which honors excellence in design and is given annually to an internationally recognized Chicago artist, was established in 1994 to provide financial support to artists who are pioneers and have demonstrated a passion for architecture.Since its inception, the award has awarded $7.5 million in unrestricted funds to fourteen artists: Anselm Kiefer, Adrienne Edwards, Carlotta Lezcano, Hernán Maldonado, Hélio Moscatelli, Kayode Kaskar, Yvonne Oostra, and Martha Tuttle. The seventy-three-year-old organization is one of several ways that the museum hopes to support artists through its collection and the development of its collection-based program.The seventy-four-year-old institution is currently working to complete a $200 million expansion, which will include the creation of", "The next Biennial should open in 2020 and will take place in the city of New York. In the meantime, the biennial’s catalogue of works, curated by Léonard Beaux, will be exhibited in the exhibition “Défense/Art et Mémoires/” (Durrance, 2020) at the Centre Pompidou, Paris, in 2022. The show will also be presented as a journey to the United States, which will be followed by a future exhibition.”In addition, plans are now in place for the London/New York fair to reconfigure the exhibition space at the Museum of Modern Art (MoMA) in New York, which is currently undergoing a $1 billion expansion, into a different exhibition space that can accommodate the biennial. There has already been talk of staging the exhibition in a different location, but the organizers said the new exhibition will be “more collaborative, more equitably shared, and more open to the public.”The announcement of the exhibition coincided with the opening of the biennial’s studio edition, “Démonin,” at the Museum of Modern Art (MoMA) in New York. The exhibition was curated by", "The next Biennial should be the culmination of a five-year, $175,000 project to redesign the museum. The design will incorporate the museum’s existing galleries, the Durham Arts Center, and the former airfield. The project will also involve the rehabilitation of the building’s original facade and interior.The new building will feature 950 open galleries, plus a presentation room and an audience gallery, the Museum of Contemporary Art (MoCA), which was formerly known as the Art Gallery of Chicago. It will also boast new spaces for student engagement and a larger public plaza. In addition, the Durham Arts Center will be expanded by forty feet and will boast a theater, a meeting room, an amphitheater, and a gallery.The redesign will also introduce new ways for visitors to experience Biennial events, such as the museum tours and special exhibitions, courtesy of a new digital platform. The redesign will incorporate a new public space in the center of the museum, where the Biennial will have its largest outdoor gathering space, the Durham Arts Center. The new building will also receive a $50,000 renovation and conservation project.The Durham Art Museum and the Biennial will close on March 31. During its closure, the Durham Art Museum will continue to operate", "The next Biennial should be held in 2021, according to the organizers. \n\nThe biennial will be held in the glass-enclosed pavilion of the ExCel Center in New York from May 24 through May 29, 2020. It will feature work by eighty artists, including Kasper Lehmann, Emily Hall, J. Barata, Laura Øzetta, Martina Cipolotti, and Julio César. The event, which will be financed by the city of New York, is organized as part of the city’s initiative to encourage the exhibition of work by underrecognized and underrecognized artists. Artists who were selected for the exhibition include Mel Garfinkelman, Jessica Ashley Fox, Amy Goodman, Julia Alexandra Rineva, and Paul Mpagi Sepuya, among many others.\n\n\n\n\n\nSydney’s Museum of Contemporary Art (MAS) is launching a new digital platform designed to better serve the needs of artists and give them a more efficient and accessible way to communicate with the public. Called the Art Newspaper, the platform will feature a single curated collection of more than 2,500 artworks, curated by selected artists, curated by", "The next Biennial should be held on the two-year anniversary of the announcement of the project, which will be held in November 2021. While the exact date has yet to be decided, a decision is expected by the end of the year.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, confirmed yesterday that artist and activist Rachel Corso will serve as the theme for the 2021 edition of the Hirshhorn Biennial. “Rachel Corso’s work is direct, provocative, and sometimes incredibly moving,” said Hirshhorn director Amada Cruz. “It demonstrates the power of art and activism to affect and change the world.”Corso, a New York–based artist and activist, began her multi-city campaign to revitalize federal lands and air quality in the city in 2013 when she began working on an art project for the Gateway Project, an initiative of the Center for American Progress Action Fund. A year later, she founded the environmental organization the Environmental Action Network (EAN), which operates an online community in which people can share ideas and learn about how to reduce their carbon footprints and help each other’s projects. The next iteration of the Biennial, “The Present", "The next Biennial should aim to present on a more global scale the works of the five artists in the collection who were recognised last year as the international winners of the Prize for Excellence in Contemporary Art. The artists are: Tadao Ando, Torbjørn Lække, Nari Ward, Tristan Prade, and Andrea Guarani.In response, the organisers have released the following statement: The biennial was founded in 2004 by Tadao Ando and Nari Ward, in collaboration with the members of the biennial team, to produce a new exhibition every five years. The first Biennial Indoor (BIM) was held in 2007 and the last was held in 2009. Judging the exhibition was a joint project between the teams of Tadao Ando and Nari Ward. A special exhibition for the museum was staged at the Biennial Laboratory in Copenhagen in 2011. The museum for the first time assembled the entire collection, including the works of the biennial winners and presented the work of five artists selected by the biennial team. In addition, the institution had the opportunity to present the works of the remaining ten finalists in a competition organized by the museum. In the first edition of", "The next Biennial should be in December 2019. “The upcoming Biannual will be an extended edition of the inaugural exhibition, and will offer an extended range of works, including a collection of photographs by Arturo Gramsci, and will be held in association with the Museo de Arte Contemporáneo del Museo de Barcelona, and will be hosted by the Museo de Arte de São Paulo, and in collaboration with the institutions of the Universitat de São Paulo, the Institut d'Arte de São Paulo, and the Universitat de São Paulo.”Louis Vuitton has appointed Windex, an artist-run space located in the Broad, Manchester, as the next artistic director of its U-23 program. Windex, which was founded by artist-activists Paul and Evelyn Vuitton in 2006, is currently run by the couple, who have a daughter together and live in the United States. Its inaugural project, “The Nothing Show,” was a retrospective of works by thirty-four female artists who were selected for the program, which debuted at the Venice Biennale in 2013 and was held at the venue until 2017. Its second, “", "The next Biennial should take place in 2021. Didier Rocheleau is the producer of the next edition of the exhibition, which will take place in the month of March. The first edition of the biennial, Biennial d'études en sciences, was held in February of 2018.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has received $50 million from the Javits Center for the Arts. The funds will be used to expand the museum’s collection of African art and to create two new works by American artists. The expansion project, which is part of the museum’s 'Keep It Real,” has been in the works since April 2019 when the J. Paul Getty Trust awarded the institution $50 million in support of the construction of the new J. Paul Getty Trust Building in Los Angeles. The Keep it Real,” is a $125 million renovation of the museum, which originally opened in 1978 and has been undergoing a $95 million expansion since 2015. The new structure is scheduled to be completed in June.The J. Paul Getty Trust’s major grant is for “Keep it Real: American Art in the Age of Black Power” ", "The next Biennial should have a new location for the exhibition and will be inaugurated by a presentation of work by the artist, called “After the Empire” (2018), at the Kunsthalle Basel Berlin. The biennial will be hosted in the Berlin Art Museum until 2027.The first exhibition of work by the internationally-recognized artist M. Thais at the Kunsthalle Basel was “After the Empire” (2015) and was the first exhibition organized by the Kunsthalle.The artist will also be featured in a special exhibition at the Museu de Arte de Berlin, which is currently on view, in the spring of 2020. Thais is the first African American artist to win the Forschungradprize, a prestigious award that honors the most important contributions to art. A winner is chosen by a jury comprising two artists and one curator. “I’m honored to be a part of this exhibition and beyond excited to promote Thais’s work,” said Jürgen Pfaffen, the director of the Kunsthalle. “We are grateful to the artists for coming together to create a memorable exhibition for a new generation of artists and the history of", "The next Biennial should focus on “the art and the culture of Iraq’s historical monuments,” according to a statement on the festival’s website. “The festival will additionally have the theme of the art of the past, which is an attempt to present the art of the past through the eyes of a child.”The next show will be staged at the Center for the Arts in Baghdad from January 17 to January 20. It will include a selection of work by forty-eight artists, including Reem, Ali, Nima Nouri, and Asma al-Hadid, and will run for six days. \n\n\nThe Shoreditch Art Exchange (SHAX) announced today that it is shutting down its London outpost in 2020, citing the decline in demand as the reason. According to the Art Newspaper, the art fair has warned that the ongoing reopening of the Tate and the March reopening of the Serpentine Galleries will likely cause a “significant loss of business.” The event will also see the departure of 140 employees, who will be replaced by part-time employees.The news follows the announcement of a new set of guidelines for exhibitors at the annual Shoreditch Art Fair.", "The next Biennial should be held in 2020. \n\n\nVictor Wootton has announced that he will step down as director of the British Museum in London following a board meeting on Saturday, March 28. The seventy-three-year-old director will take up the post on April 23. Wootton will remain involved with the institution through March 2020. In a statement, he said: “In my fifty years of experience at the museum, I have never worked as closely with the museum as I have over the last ten years. I am very much looking forward to continuing the work of my predecessors, and the work of my successors. The board and I are determined to ensure the museum remains a major international cultural destination in the heart of London and remains at the forefront of contemporary art in its time.”The museum has been working on revamping its urban setting in an attempt to create a more sustainable future for the building and the building site as part of the $4bn overhaul of the museum’s grounds. The project, which began in 2003, involved the removal of more than 1,200 artifacts from its collection, including the surviving works of Henry James and Adrienne Priestley, as well as paintings by Pierre-", "The next Biennial should have a new theme, a new collection, and a new format. However, as it was, the exhibition was cancelled. The opening of the exhibition was postponed several times, and the event was always on hold. The exhibition was supposed to open in September of 1970, but it was never intended to be staged. The show was moved to Tuckeda Gallery in Weymouth in the spring of 1972. The show ran for only ten days, but changed its title from “The Murders of Flum­ton” to “The Murders of New York City.” A new fictitious tour guide was installed in its place of honor, entitled The Seven Biennials, and the biennial was also moved to a different location. Finally, in August 1992, the exhibition was moved to its new home at the Museum of Modern Art, New York.“I don’t think this is a landmark event in terms of the history of art, but it is one that has profound and immediate lessons for future events,” Bruce A. Cohen, director of the Museum of Modern Art, said in a statement. \n\n\nThe Art Newspaper reports that the Museum of", "The next Biennial should open in the spring of 2021 and will be dedicated to “Souha Art & Science Park,” a new, self-contained institution founded in the capital of Bahrain that aims to transform the lives of Bahrainís by providing them with a state-of-the-art cultural and scientific center, a museum, and other educational and recreational facilities.Dubbed “Souha’s science parks, the initiative will combine the best of contemporary art and science in order to engage with the cultural and scientific heritage of Bahrain,” said Sajid Jum, director of the Biennial. “With the invitation to help make this a reality, we are fully committed to sharing the vision of Bouwa Art Museum and Science for the future of the region and the world.”Commenting on the Biennial’s new location, Jum said: “We are excited to welcome the world to Souha. The city of Bahrain is a major cultural and scientific destination, and Souha is an ideal spot for visitors from all over the world.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Marta Mogensen its next director. Mogensen comes to", "The next Biennial should be held in the autumn of 2020. The biennial will also be its first in the United States. Cultural historian and curator, Elizabeth Anderson, will serve as director of the biennial. Her first assignment will be to select a selection of works for the exhibition. Among the works selected are The Cathedral (2014), a collaborative, multi-disciplinary exhibition that combines sculpture, installations, performances, performances, events, exhibitions, and research. The exhibition will visit the American Southwest and the American West, and will feature art from the biennial's inaugural edition in 2020. The exhibition will also feature the show’s final work, a virtual reality experience that will allow visitors a temporary glimpse into the exhibition’s installation. The full list of participating artists is as follows:Artists:Anna-Sophie Barlow, UKAnna-Lynne Bass, UKBenedict Bennett, UKBenedict Bradley, UKBenedict Bove, UKBenedict Butler, UKBenedict Culberg, UKBenedict Dunn, UKBenedict Foster, UKBenedict Hardie, UKBenedict Hunter, UKBenedict", "The next Biennial should take place at the Museum of Contemporary Art (MoCA), Boston, in 2021. The date is still being decided, and the dates for both museums will be announced soon.\n\n\nThe London-based charity Artspace has launched an online platform that will help artists and their families across the UK adapt to the coronavirus. The platform will provide artists and their families with advice, advice on how to set up an emergency fund, and other resources.It will also help them understand the financial situation and advice on how to set up an income during the Covid-19 crisis. The platform will remain live until March 29, 2020.“The Covid-19 crisis has made clear that we live in an interconnected, global world where we are all interconnected by blood, soil, and air,” said Stephen Deuchar, director of Artspace. “However, as the coronavirus spreads, there is a danger that the social and psychological distress caused by the virus will be compounded. Therefore, the Artspace team has created the Covid-19 Impact Toolkit, which will give advice to help you and your family through this extremely distressing time. ”\n\n\nThe National Poetry Library in London", "The next Biennial should be held in 2020.\n\n\nThe 1977 International Council of Art in Rome, which renamed itself the International Council of Museums (ICOM), has announced that it is planning to dissolve its current organization into a group of seventeen Italian cities. The decision was made in the wake of the mass demonstrations in Rome in March 2019, which were sparked by the country’s conservative government’s decision to scrap the proposed reopening of the InterContinental’s Grand Trunk rail transit system.The Italian city of Venice was also the epicenter of the protests, which have since spread to other cities throughout Italy and the region of Lombardy. While the protests have been mostly peaceful, the unrest has spread to cities throughout Italy and has even resulted in the deaths of hundreds of people, although so far most of the deaths have been in the form of heat stroke or suicide.The reopening of the rail system has been stalled since March 2019, when the Italian government passed a series of emergency legislation, including a series of temporary subsidies, in an attempt to mitigate the economic fallout of the coronavirus pandemic. The legislation was supposed to take effect on August 1, but it has since been suspended, and construction on the first section of", "The next Biennial should be held in June 2020, and the earliest successor should be held in March 2021. Once the new museum is established, it will have an average of fifteen thousand visitors a year and will be led by a board of directors of which Ai Weiwei, Yoko Ono, Susanne Vielmetters, and Hans Ulrich Obrist will serve as chair. The museum will be housed in a former Bechdel-designed textile factory between the city of Nuremberg and the town of Fuchs-Damm, in the western state of North Rhine-Westphalia. During the construction of the museum, the city spent $500 million on the renovation of the existing Bechdel-designed building, which is currently used as a cultural site by the city of Munich. The autopsy panel convened by Chancellor Merkel in the Chancellery on November 20 concluded that the two-year construction project, which was funded by the German government, was not feasible, and that the museum, which will be located in the city of Nuremberg and host around sixty thousand visitors, should focus on developing its own collection of artworks, with the aim of increasing the museum’s international profile. The project also called", "The next Biennial should be in February 2020. The 2020 edition will be held in the city of Port-au-Prince, in the country’s west, and will be organized as a joint project of the Museums Association of the United States and the House of Representatives, which is controlled by the United States. The museum will be built on an existing site of the former United States Embassy in Panama City, which was converted into a museum in 2015.“The President of the United States has made it clear that he wants to continue to support the Art of the Americas’ mission with new programs and exhibitions,” said Katherine Cross, president of the United States. “The President has said he wants to build on the work of our partners to be more innovative in how we present exhibitions and what we do . . . and the President has said he will not let the next edition of the Biennial be a setback for our relationships with our partners.”The exhibition will also feature a new series of collaborative projects with artists, researchers, and organizations working in the Americas. The first project, “Lulu and the Arts,” will invite twenty-six artists and scholars to participate in a three-day event", "The next Biennial should be held at the Art Museum Auckland in December 2020. The Biennial will be hosted by the London-based artist Charlotte Hutton and will be led by designers Adrian Toton and Øyvind Pape. The exhibition will be curated by Alex Johnson, the former director of the Smithsonian Design Museum in Washington DC, and will be co-produced with Pirkko Design and Architecture, the Helsinki-based design firm founded by Artur Di. The exhibition will also feature the work of artists such as Daria Pape, Craig Robinson, and Omar El Maar; as well as works by the author and artist Benjamin Giroud. The Artists' Choice Awards, which were established in the 1970s to recognize contemporary artists in the United Kingdom, will be given out in conjunction with this year’s biennial. \n\n\nThe Museum of Contemporary Art (MoCA) in New York announced today that it is preparing to welcome visitors back to the institution once the coronavirus shuts down the country’s public health infrastructure. According to a report published by the New York Times, by the end of the week more than 50 percent of the city’s public buildings will", "The next Biennial should take place in 2023, and the date of the exhibition is uncertain; the exhibition should be staged in the City of London and should be open to the public. The museum’s collection would be the first to be digitised in more than seventy years.The exhibition would also include a virtual reality experience, and or an underground museum, to house the exhibition’s curatorial team, and a newly commissioned print from the artist and the contemporary art journal, Artforum.“London’s museums and galleries are experiencing significant growth,” said Stephanie Gill. “But museums still face long-term challenges. They are working hard to find new ways to support the galleries, and they are implementing new support for exhibitions and collections as they seek to adapt to meet changing demand and new technologies. We are confident that the next exhibition will deliver a movement-changing experience that will inspire and challenge as we revisit our cities and our museums.”\n\n\nThe National Galleries of Scotland (NGA) is planning to sell off twenty-nine of its art assets to British billionaire Richard Branson, who recently pledged more than $50 billion to build a new domed stadium for the institution. The sale includes the", "The next Biennial should be held at least ten years after 2020 but should not be a continuation of the current programme. The first Biennial will be held outside Italy in March 2020 and will be hosted by the Italian city of Venice. The second Biennial will be held in May 2020 and will be hosted by the Italian city of Venice.The City of Florence, which had previously refused to confirm plans for the exhibition, is also committed to holding one of the thirty-eight editions of the exhibition. The Italian pavilion will be made up of twenty-three works by twenty-one of the artists represented in the exhibition, which will be accompanied by an exhibition of their works in the Italian pavilion. The first edition, which included works by Alberto Badal, Pattee Aamir, Francesca Bertani, Fabio Cipolotti, Hernán Cortés, and Jes Fan, will be given a retrospective at the Museo Max Mosso in Milan in March 2020. The second and third editions will be staged by the city of Milan and the Southern Museum of Fine Arts in Venice in March 2021 and March 2022.The institution has already released three editions of the exhibition, which were shown at two different Milan locations—the Casa del", "The next Biennial should be held in the fall of 2020. In order to ensure that the exhibition will present a timely story and reflect the current global situation, it should also take into account the current exhibitions, exhibitions, and programs and, in recognition of the biennial’s continuities with the institution, will include original works, paintings, and drawings.“Markus’s paintings, which have served as a wonderful example to me, are very much in keeping with the spirit of the exhibition,” said curator and founder of the Biennial Østby Røg. “His paintings are very much about the soul of painting and about the creative process, and about what he calls ‘experimental poetry: not surrealistic, but poetic, searingly direct, and intensely personal. I think he has a gift for the extraordinary. I think he is going to be missed.”Over the past twenty years, the Biennial has become a very popular venue for contemporary art exhibitions and has attracted a large and loyal following of visitors. The 2015 exhibition “The Secret Life of Art” attracted nearly eighty thousand visitors and the exhibition “The Enigma of Painting”, which presented work by fifty artists,", "The next Biennial should take place in 2022 and the next in 2023. The next edition of the Exhibitions, entitled “One Hundred Years of Photographers,” will be held in 2020 and the next in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Santa Monica, California, announced today that Marta Gómez-Ramos has been named its nineteen-searched associate curator of contemporary art. Gómez-Ramos comes to the institution from the Museum of Contemporary Art (MCA), where she has worked since 2009, and will assume her new responsibilities in January 2020. The appointment marks the museum’s first since 2012, when it was restored and expanded by the California-born architect Daniel Libeskind.Gómez-Ramos will be responsible for supporting the collection and display of work by José Andujar (1909–1966), Hans-Ulrich Hahn (1903–1966), and César Alarcon (1903–1966), among others, and will partner with senior curator Mihai Hochner. The institution will also re-create the exhibition hall by opening up a two-story, 230,000-square-foot", "The next Biennial should be held in 2021, the same year as the ten-year anniversary of the event. The theme, “The Wind That Shakes the Earth,” has been shared by the Pavilion in the past, but in the case of the exhibition, it will be “The Future We Want,” a direct response to the current global crisis. \n\n\nThe Schutzer Art Museum in Vienna (SAVA) is going to open a new exhibition dedicated to the artist-blues, titled “The Promise of the Future.” The show will feature work by fourteen artists who live and work in the city of Vienna, including Connor LeBlanc, Akifumi Enomoto, Ewa Palma, and Yoko Ono, among others. The exhibition will run from March 20 to March 26, 2019.“Art is the main story of the world and of the young,” said senior curator Rolf Schmutzer, who added that the new exhibition is “a popularity contest between the artists, which is very important, and the audience. I like to think of this exhibition as an extension of this.”\n\n\nThe National Galleries of Scotland are planning to launch", "The next Biennial should be announced soon.\n\n\nThe New York City Department of Cultural Affairs has released guidelines for the reinstallation of the city’s art museums in the event of a major power outage. The guidelines, which were issued by deputy commissioner of cultural affairs Timothy Roach on Wednesday, October 3, and were distributed by the NYC Department of Cultural Affairs to all fifty state governments—New York, New Jersey, and Connecticut, as well as the District of Columbia.The guidelines advise museums in the event of a blackout, including the Metropolitan Museum of Art and the Bronx Museum of the Arts, as well as institutions that are currently closed, such as the Whitney Museum of American Art and the Brooklyn Museum, as well as institutions that are currently undergoing construction, such as the Museum of the City University of New York and the Museum of Modern Art.The guidelines state that museums with five hundred or fewer employees could open as long as eight hours after being shut down, but that a maximum of eight hours should be allowed before a blackout date should be determined. The opening of a museum would only be allowed during a blackout if the institution was equipped with an emergency plan in place.According to the guidelines, the first thing a museum should do should be to register to", "The next Biennial should take place at the Guggenheim in Milan, Italy, sometime between July and September 2020. The exhibition will include an exhibition of work by forty-two artists, including Natalia Bonetti, Filippa Fornosi, and Agnieszka Soskala, and will include a documentary by the artist-in-residence Lina Esparza. Biennial Director Valentina Miro and director Patrizia Catellani-Bicchier, who has helmed the Biennale since 2005, are planning to open the exhibition in March 2021.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has received a gift of forty-six works by seventeen artists from the collection of artist-in-residence Lina Esparza. Included in the gift are Leonardo da Vinci, Nancy Edmonds, Giovanni Bocchieri, Nora Bonakdar, José Luis Codlijr, and Celcer Tate. The works were donated by Sixtus and Michele Ferraris, and were acquired in response to a grant made in 2018 by the John and Lucille King Family Foundation.The", "The next Biennial should draw from the forthcoming collection of the Gorakhpur-based artist and playwright K.M.G. He is also the cofounder of the Gorakhpur-based art project Paryush Tiwari, which allows artists to showcase works in the city.\n\n\nThe Tate is planning to push back the opening of its new £500 million, Tate Modern Art, London, by a year by introducing a new conservation initiative modeled after the museum’s core mission. The initiative, “One Year On,” will focus on protecting the collection and exhibition space—and on curating and exhibiting works by the Tate’s current and future artists—by analyzing the current exhibition schedule and cataloguing and cataloguing curators’ practices.Its director, Maria Balshaw, told the Art Newspaper that the goal of the program is to create a compelling reading list for future exhibitions, which will allow Tate Modern to ramp up its exhibition programming around the time of the biennial. The biennial will kick off with “The Death and Life of Pablo” in September. The show will be curated by Tatjana Naidus and will be led by Nusar, the curators", "The next Biennial should be held in 2020, and a new exhibition of work by the same group should open in 2021. The institution will also continue to receive funding from the National Endowment for the Arts (NEA), the National Geographic Society, and the Walt Disney Company.The museum’s director, Michael Govan, said: “With the approval of Congress and the President, the Biennial will continue to thrive and thrive an institution of unprecedented and timeless beauty. I’m convinced that the transformation of the National Museum into a museum that is truly reflective of the nation can only be realized by a visionary board of directors and a strong staff.”\n\n\nThe Prince and the Pauper, the contemporary art center in the exclusive Pinkertons neighborhood of the city of Boston, has announced that it is moving to a new location. Located at 575 East Dorchester Street in the heart of the Arts District, the new venue will be inaugurated by a solo exhibition of work by the artist Imane de Bellanova, whose series “Men in Black” was curated by the artist’s husband, the architect Frank Gehry (who was named America’s first director of the Biennial in 1972). The show", "The next Biennial should be held in 2021, and the final in 2023. The museum will work with the European Regional Coordination Body (EREB) to develop a series of immersive experiences.“We are thrilled to collaborate with Ereb, whose mandate is to foster dialogue and social cohesion between cities and peoples, and to develop new ideas,” said H.S.Wang. “We hope that this exhibition will be a model for how we might reflect on the importance of art and culture in strengthening our cities.”\n\n\nPace Gallery announced today that it is expecting a $50 million shortfall this year due to the Covid-19 pandemic, and has launched a new fund to try to mitigate the financial impact on its artists and staff. The move follows the announcement of a new three-year grant program, called the Artist Relief Fund, that will provide immediate relief to arts professionals across the United Kingdom. “The Covid-19 crisis has made it impossible to stage a successful exhibition this year,” said Kate Fowleman, the CEO of Pace. “The Artist Relief Fund will give us a great way to help our artists and staff through this difficult period. We know they are hurting and", "The next Biennial should be held at the National Museum of Modern Art in Washington, DC in 2021.\n\n\n\n\n\n\nTania Bruguera, Juan Orozco, and Seungho Seo (0814) are among the artists who have been selected to participate in the 2020 Venice Architecture Biennale. The six-day event, which will be held at La Scala, Italy, will feature works by seventy-three nominees; the chosen ten finalists are Bruguera, Orozco, and Seo, who collectively received more than five thousand votes. The exhibition reopens on March 3, 2020.The exhibition will feature new works by forty-five artists and twenty-six curators, including Cécile Béchard (New York–based), Gianluca Raffaele (Venezuela), Zinedine Leibovici (New York–based), Luca Giunta (Venezuela), Riccardo Poggioli (Italy), Andrea Hahn (Germany), and Anish Kapoor (India). The exhibition will also include two new projects. One, a project by Gabriella Bruguera in collaboration with", "The next Biennial should be held in the autumn of 2020. The new works will be selected by a jury comprising Berthold Plath, an artist and curator based in Cologne, and Hannes Hopp, a curator and accomplished painter who has organized the exhibitions “Kamala Saeed” & “Suzanne Modigliani” and “Tachiko Kuno” in Tokyo. An exhibition of anamorphic works by the German painter Ludwig Pohl will be presented at the Biennale in the summer of 2021. “We are thrilled to bring the new work of the Biennale to London and to introduce it to the young artists in the city who are already enchanted by its vision and the impact of our art here,” said María Dolores, art director of the Biennale.\n\n\nThe Seattle Art Museum (SAM) has evolved its summertime programming schedule by adding two new works from the now-defunct Bergen Conference. Originally scheduled for June 14–June 16, the new series “The Challenge and the Sight,” which honored Bergen’s work Tachiko Kuno and was staged in a different location each year, will now run", "The next Biennial should mark the centenary of the Russian–Austrian artist Matvei Rublev. Rublev, who often depicted everyday life in his surrealist paintings, has been called a pioneer of the post-Soviet generation and has had numerous exhibitions organized by him. The event will be co-organized by the Center for Contemporary Art Research in Moscow, the Institute of Modern Art in Moscow, and the National Gallery of Art in Washington, DC.The inaugural edition, hosted at the MOST Pavilion in Singapore in 2009, was hosted by Anson Haroon and cost $3 million. Over the course of its three-hundred-year history, the event has attracted many thousand visitors. In recent years, the event has had several iterations, including the “Rostov Triennale” (2009), “BSTM: 50 Years of Drawing” (2012), and “Rostov 1932” (2013), and the “Rostov Cinema” (2015). September 9 marks the seventeenth edition, which will be held at the AMCA in London.\n\n\nThe Portland Museum of Art (PMA) in Maine has welcomed Christine McKean to its curatorial staff and board. McKe", "The next Biennial should be held in 2021.\n\n\nThe National Arts Center (NAC) in Washington, DC, has received a $2.5 million donation from Artnet. The gift, made on behalf of two NAC board members, Nancy and Marc Glimcher, as well as NAC cofounder and CEO Matthew Teitelbaum, was made on behalf of the NAC's Artists’ Union, which was established in 1991 to support artists who were struggling financially. “Nancy and Marc were committed to supporting artists in Washington, DC, and were delighted to receive this handsome gift from the NAC,” said NAC board president and CEO Marc Glimcher. “We are grateful for the generous support of the National Endowment for the Arts (NEA), the National Endowment for Cultural and Creative Preservation (NEA), and the National Endowment for the Humanities (NEH).”The donation comes a little more than a year after NAC board president and CEO Nancy Glimcher and cofounders Marc Glimcher and Nancy Teitelbaum awarded a $1.8 million grant to the Arts’ Institute (AI) in Santa Fe, New Mexico. The grant also supports"]