["The next Biennial should focus on the legacy of the person who set the stage for the institution’s existence: John Michael Kohler. The biennial’s inaugural curator is a hot topic of conversation, especially since the late artist Michael Moorcock gave a talk titled “The Real Biennials” at the Museum of Modern Art in New York in which he questioned whether there is anything real about art.Kuhler died in 1999, but the museum stubbornly refused to publicly acknowledge his legacy. Instead, it set up a foundation in his memory. When the foundation was established, John Michael Kohler was its founder. In 2016, the museum began its Kohler Quad, a three-dimensional sculpture platform that explores the relationship between art and philosophy via a combination of contemporary and relational traditions. The institution also introduced a new quarter-mile of watercolor in celebration of its 150th anniversary.Curator and fellow artist Tilda Swinton, who curated the first Biennial, the “50/50/50,” said: “John Michael Kohler was a pioneer in the field of contemporary art, and an invaluable friend. He was generous with his time and generosity, and helped develop the biennial into the vibrant institution", "The next Biennial should take place sometime in the mid-2020s. “We look forward to continuing the work of presenting a diverse selection of contemporary works in a manner that respects the cultural heritage of our cities, our communities, and the people who visit them,” said Pia Fattal, president of the association. Founded in 1999, the organization works with artists to present museum presentations that address the theme of the exhibition, and takes submissions from artists and institutions across the world, including from the artist-run contemporary art space Brickworks. Last year, the full list of participating artists was announced.\n\n\nThe Solomon R. Guggenheim Museum in New York has received a gift of nearly two hundred works from the South Asian American artist and activist Kamal Mukhtar, who is currently incarcerated in a New York State prison after he was arrested on charges of attempted murder and aggravated assault in a brutal February 2018 attack on a New York City Transit Authority bus that left one man dead and another critically injured.Mukhtar, a Pakistani national who was granted asylum in the United States in 1993, was scheduled for trial in April of 2019. He was denied bail after he allegedly stabbed Brooklyn native Hishamat Hussain, who was also held", "The next Biennial should be held in Geneva in May 2021 and will launch on May 25.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it will begin a nationwide reopening of its two-hundred and fiftieth-anniversary year, “March into the New Year,” with a series of public events, including a virtual reality installation at the foot of the Manhattan Bridge. The event will also include the first-ever virtual-reality performance at the museum, which will stage the virtual-reality show “Tangled: A Virtual Reality Story,” on March 23.The reopening of MoMA is part of the plan of the architecture firm L.A. + LA, which will renovate two buildings in the former Cooper Union at 790 Fifth Avenue in Manhattan, and of the architects McKinn and de Meuron, which is renovating the building next door, for the five-day event. The event will also include the inaugural exhibition “Fashion” at the museum, which will feature work by fifty-six artists, including Bernard Campanella, Ed Moses, Frances Ghebaly, and Nada Ghebaly; an installation of new works by the", "The next Biennial should be held in 2020. “I’m looking forward to working with you to present the first Biennial in the near future, and to developing the exhibition program for the new pavilion,” said Alejandro Mondavi, the director of the collection.\n\n\nThe New York City Department of Cultural Affairs (DCLA) is planning to build a new twenty-five-thousand-square-foot museum dedicated to the city’s art and culture in the city’s Beacon Hill neighborhood. The new museum will sit on the ground level of the former site of the Israeli military base in Givatiya and will draw twenty-six thousand visitors annually.The city selected the Givatiya-born architect, developer, and collector Kamal Tochik for the project and awarded him the $500,000 Civil Rights Legacy Award. He was chosen from a shortlist consisting of Azizi Akram, Koenig & Wirth, and Pei Dawe. The association announced the winners of the awards at a ceremony held last week at Israel’s Ben Gurion Airport.The forty-one-acre site in East Harlem, where the Israeli military academy is located, was", "The next Biennial should be ready by April and will be hosted by the artist-run space Art and Design in New York.\n\n\nArt and Design, the New York–based nonprofit that helps artists and designers in the city, announced today that it has selected the theme for the 2020 edition of its New York–based biennial, \"Art and Design, New York: 2020,” which will take place in the space of the Museum of Modern Art (MoMA). The 2020 event will inaugurate the new exhibition, which will be hosted by the nonprofit Artadia, and will include work by sixty-four artists. The full list of participating artists is as follows: Sara Pretzley, The Great Escape: A Modern Artistic Exploration of the Present, New York: 2019The sculpture house Gagosian, New York: 2019The Painterly Studio, New York: 2019The Flea Market, New York: 2019The Public Theater, New York: 2019The Museum of Modern Art, New York: 2019The Human Rights Foundation, New York: 2019The Ground in the City, New York: 2019The Public Theater, New York: 2018The Human Rights Foundation, New York: ", "The next Biennial should be held at least five years after the end of the current year. The new format will accommodate a greater number of exhibitions and showcase the recent works of the chosen artists. The programme will also introduce a new theme, a new four-day festival, and a new exhibition series. The new exhibition series will draw from a larger range of contemporary and contemporary art, including collages, sculptures, paintings, photographs, video works, and music. “We are very much aware of the importance of social media and the rapid changes that it has brought to contemporary art, and of the change that it has on the school, and on the university, and on our institution,” Guggenheim senior curator Maria Freund told ArtnetNews. “We are also committed to supporting the university’s existing students, and to connecting with new and existing students through the university’s existing network,” she said, “so that we may continue to present the best exhibition in Milan, and of course the best show in the world.”\n\n\nThe Oklahoma Museum of Art in Oklahoma City has expanded its scholarship into the history of Oklahoma, the American South, and the Native American traditions, and", "The next Biennial should be held in 2020. The date has yet to be determined.While the biennial was initially scheduled for March, it was moved to April 15, 2020, because of the Covid-19 pandemic. Artforum has reached out to Organizaiton for comment. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has granted the artist-run nonprofit the Department of Arts and Design extensive new funding for its 2020 fiscal year, Artnet reports. The $9 million grant, which was granted on May 23, represents a $1 million boost for the arts, which have historically been at the core of the city’s cultural life.The $3.5 million grant was established as part of the city’s March for Art, which was organized by the New Arts for All coalition, Artists United for the Common Good (AUF), and was led by Michael S. Hayes, former director of the Metropolitan Museum of Art. The grant represents a $1.5 million boost for the arts, which have historically been at the heart of city-sponsored events. The grant will also provide $1 million for the development of programming changes at City Hall, such", "The next Biennial should be held at the Museum of Contemporary Art San Francisco, to open in February 2020. An open-ended theme of the exhibition will be “what it would be like to be us.” As part of the event, the institution will have a series of “interviews with people who have shaped the Biennial narrative.” The next iteration of “Lost Art: Art Beyond the Modernist Period” will be held at the Museum of Contemporary Art in Philadelphia in March 2020. During the Golden Gate Arts Festival in San Francisco, California, in January 2019, the museum received a $16 million donation from the Eli and Edythe Broad Foundation, which also provided funds for the renovation of the museum.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has hired art historian and curator Alexandra Barnett as its next director and CEO. Barnett will be responsible for overseeing a curatorial team that will organize over forty exhibitions annually. She will take the helm from curator and director of curatorial affairs Charles Watkin, who will retire after a decade at the museum in February 2020.“By bringing together talented professionals and art-lovers from diverse disciplines, the group has created an exciting new partnership between", "The next Biennial should be held in 2021. Asahi has been working on a new exhibition for the exhibition since 2016 and has presented its first exhibition in the new venue, “Foundations of Biennial,” at the Los Angeles County Museum of Art in the spring of 2019. The institution is currently preparing for its first exhibition in the new space, titled “The Future of Art,” at the Museum of Modern Art in New York in 2021.\n\n\nThe Haida Museum of Art in British Columbia, Canada, has promoted thirteen-year-old artist and educator Darby English to the status of an adult contemporary. English, a native of the city of Huntly, New York, was selected as the Haida Museum of Art’s 2020 recipient of the Vancouver Art Prize, which honors young contemporary art creators in the province. Darby is one of three Haida Museum of Art recipients, and the only artist to have been mentored by the institution in the twenty-first century. The other two recipients are Mary-Talia Harrison and Jocelyn Black. Both of the museum’s Peter Senn and John Senn-designed buildings are currently undergoing renovations. “I was really impressed", "The next Biennial should take place in 2021 and will be funded by the American Alliance for the Arts (AA), the nonprofit organization that represents the interests of the American art world. The organization, which is supported by a $6 billion gift from Larry Fink and the Solomon R. Guggenheim Museum, is also planning to cancel the event, called the 2020 Biennial, and is planning to hold a new event, the 2020 Summer Arts Biennial, in 2021.\n\n\nThe Paleontological Society of California (PSC) has received a gift of more than five hundred artifacts from the late sculptor Harry Andrus. Among the works are several of Harry’s famous glass sculptures, which have served as focal points for the artist’s career. Among the works that have recently entered the public collection are a miniature Henry Moore sculpture from the late 1940s, a work from the 1950s that depicts a female figure covered in a pale green satin robe, and a project that was completed in 1968.“We are so honored to receive this extraordinary gift from the late Harry Andrus,” said Rachel Cohen, chair of the board of trustees of the Paleontological Society. “This collection consists of a significant portion of his", "The next Biennial should be held in 2020, the commissioning organization wrote on its website. “In order to avoid overcrowding, Biennials may move to later dates if there is only a 50 percent decrease in attendance. This would only apply if no other events or exhibitions were disrupted. The committee is also aware that the exhibition calendar is constantly being revised and will release further information on the official site in the coming months.” The full list of participating artists is as follows:Artist\u0097Katja Gieb, Germany\u0097Natalie Lennard, Norway\u0097Edoardo Motta, Italy\u0097Ysi-Yue Hsu, China\u0097Hiroshima, Japan\u0097Simone Savitz, Germany\u0097Kazimir Levine, New York City, United States\u0097Mihai Farkoka, New York, United States\u0097Marianne Mauduit, New York, United States\u0097Josée-Philippe Villeneuve, France\u0097BOTTOM LINE: The Venice Biennials are offering a rare opportunity to see works of both established and emerging artists. They will be presented with the new exhibition format, which will be held in Milan", "The next Biennial should focus on the history of fashion from a global point of view and will be hosted in the city of New York, the United States of America.   The exhibition will examine the history of fashion through the lens of artists such as Ed Moses, Alberto Esposito, and Kate Moss, and will focus on the ideas of fashion in general, and fashion in particular. \n\nCurator, author, and educator David K. Brown, who transformed museums with his architectural and institutional design projects that coalesced around the mid-1950s, died on December 5, 2016 at age seventy-nine. The cause of death was cancer, and his death was ruled a suicide. Brown was an artist and curator whose avant-garde, experimental, and experimental design projects fused design and culture, and were rooted in urbanism. His projects included the architecture and landscape sculpture of the Pleiades, the sun-drenched campuses of Harvard University in Cambridge, Massachusetts; the exhibition “Contemporary Fashion” (1979); “Museums,” a 1983 installation at the Barbican Art Gallery in London; and “In the Universe of Ann Coulter” (1986), which satirized the presence of", "The next Biennial should be held in the city in 2021, the same year that Art Basel will stage its next edition in Hong Kong and the opening of the first exhibition at the new space Art Dubai. In the meantime, the international festival will continue to host events in various locations across the city and the region. \n\n\nThe Museum of the Jewish People (MoJP) in New York announced today that it has received a gift of over 2,000 works from the Jewish Museum in Jerusalem. The donation includes paintings by several notable Holocaust survivors, including Henri Matisse and Jean-Michel Basquiat, as well as some of the most important works by artists in the United States. The museum will now be able to show the works at a number of locations, including the institution’s permanent collection.“We are extremely gratified by the gift of this remarkable collection, which will enable us to continue to build the museum’s collection in a unique and powerful way,” said MoJP director Robert S. Cohen. “The works are significant not only for their historical significance, but also because they are valuable in their own right and because exhibition-driven museums are, paradoxically, places of a continuum, bridging the gaps", "The next Biennial should take place in 2021. \n\n\nThe Pérez Art Museum Miami (PAMM) has removed a bust of late Cuban revolutionary leader Fidel Castro from its collection after it was unearthed in a construction site in the city. The modification came after Pérez Art Museum staff questioned the authenticity of the piece, which was on display in a Masonic lodge in the museum for more than twenty years, the Miami New Times reports.The museum’s director, Carlos Otero, informed the public in a letter published by the museum on January 20 that the bust was “a forgery” and “discredited” by the Cuban government. Pérez Art Museum Miami had previously attempted to have the piece removed from the collection in 2017, but the request was denied by the Argentine ambassador to the United States, Nicanor María Martínez-Santiago, who argued that the country had no legal obligation to comply with the United States’ request.The Pérez Art Museum Miami’s letter concluded by stating that the board of trustees “agreed that this was a serious violation of our ethical standards and that changes need to be made to prevent this from happening again.”", "The next Biennial should be staged in 2020, but the organizers have already postponed the event, which was originally slated for March, saying that it is “currently undergoing a review and reopening of the biennial is set to take place in December 2020.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed Kate Dalack as its next executive director. The seventy-one-year-old former curator and art historian will assume her new role on June 30.“Kate’s leadership and vision for MoCA make her the ideal person to lead the museum into the future,” said McKay Littman, chair of the board of trustees. “Her passion for the arts and her ability to appreciate and connect with artists, collectors, and audiences make her the perfect candidate for the role of executive director.”During her tenure at the museum, which opened in 1989, Dalack has organized numerous exhibitions, including “Quartet: Twenty Years of Art” (2013), “Art and Confection” (2016), “The Painters” (2017), and “Sara J. Mapes: The Artist’s Case” (2017), and has", "The next Biennial should be held in 2021. “The new exhibition series will be a new way of supporting both the Biennial and the Art of Contemporary Art,” said Klaus Biesenbach, director of the Frankfurt Art Museum, Germany. “By combining the importance of the exhibition with the design of the exhibition, the new series will give an opportunity for a greater variety of research, exploring contemporary trends and new ideas in art.”\n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has received a gift of twenty-six works by artist Charles and Elizabeth Anderson. The donation, which includes works dating from 1876 to 1920, was made by the Anderson Family Collection, which consists of seventeen paintings, sculptures, photographs, prints, and installations—including two that were created in 2018 and 2017.“The collection is thrilled to present this important gift to SAAM,” said Elizabeth Anderson, the mother of Charles Anderson. “Charles and Elizabeth did great work in collecting and displaying Charles, and we are deeply indebted to the Anderson Family for their generosity in recognizing this important work.”Charles and Elizabeth Anderson are known for their long-standing support of the museum, which includes major expansions", "The next Biennial should be held in the fall of 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Cameron Rowland as its new associate curator of the contemporary art. Rowland comes to MoCA from the Smithsonian American Art Museum, where she has worked as a curator of modern and contemporary art since 2015. During her tenure at the museum, she curated solo exhibitions such as “Planet Art: From the Art of Michelangelo da Cunha” (2019) and “Tacita Dean: The Art of Destruction” (2019) and was instrumental in the acquisition and exhibition of over 250 works by twenty-six artists.“Carol is a gifted curator whose strong interest and creative energy is contagious, and to her I say: I cannot say enough good things about our museum and its talented curators and staff. I’m so excited to welcome Carol to the MoCA family.” She succeeds Suellen Motevalli, who retired in March 2019 after twelve years at the institution.“I’m thrilled to work with Carol, who has been a transformative force in our community in transforming the Museum into a critical canvas for the arts,” said M", "The next Biennial should be held in the spring of 2021.“This is a challenging moment,” Lloyd-­Mann said. “We have the opportunity to make a new kind of biennial, a biennial that takes place in the heart of the city, that is responsive to the needs and desires of our communities. And I hope that the next one will be as meaningful and impactful as the last.”\n\n\nThe US House of Representatives voted yesterday to establish a national museum of African American history and culture in the nation’s capital, DC, in a vote that overwhelmingly backed a historic $54 billion federal spending bill for arts and cultural institutions. Introduced by New York representative Nancy Pelosi, the $1.1 trillion bill, which also addresses the opioid crisis, will now head to the Senate, where it will be amended and voted on by the Senate minority leader, Chuck Schumer, and the House majority leader, Nancy Pelosi.“African American History and Culture is an American Story,” said Schumer. “African Americans have always been a part of American history, and it’s a story that has been told through the countless artists and cultural producers who have given their lives and their souls", "The next Biennial should represent the most current and vibrant interdisciplinary thinking about the body and art, and will include a selection of new and recent work by artists, including Yaya C. Ali, Sijîn Chen, and Andrew Carleton, and will be inaugurated by a presentation of works by three artists from the African diaspora: Dalia Al-Qasimi, Shiloh Ndiaye, and Soubrio Donatas.“I am so proud to be a part of this exciting and inspiring year,” said Andersen. “The theme of the upcoming biennial is the body and the body art. I see the biennial as the next stage of Maurizio Cattelan’s vision to merge art and body. I am deeply committed to playing a part in this project, not only as a speaker, but also as a curator. It is a dream of mine to be able to create a permanent home for the collections of the Biennale in this city and to be able to open a museum in the city.” A selection of the biennale’s greatest treasures will be presented in October 2020.\n\n\nThe Museum of Fine Arts (MFA", "The next Biennial should be held in 2021, according to an announcement on the upcoming event’s website. A spokeswoman for the fair told the Art Newspaper that the twenty-third edition of the event would be held in the city from March 24 to March 31, 2021. In addition to the usual programming, another event, Art+Life, would be held during the three-day event, which is a joint venture between the city of Barcelona, the city of Rovira, and the city of Extremadura. The Barcelona Art Festival is also organising a redesign, which will take place in March. Designed by Alexandre Brecheux, the design aims to change the feel of the fair by making the venue more accessible to the public, reducing the number of galleries participating in the event from twenty-six to eighteen and introducing a variety of exhibits, performances, lectures and screenings.“In the future, it will be possible to join an Artist-in-Residence program in the city of Barcelona, and to build on the success of the Barcelona Art Festival,” said Brecheux. This year’s edition, entitled “Amorà Nacional” (After the Sun), was held", "The next Biennial should focus on: “Why are there so many bodies in the place of life and death?” An established artist’s work should be presented, perhaps with a guided tour, followed by a short performance. The exhibition should include the work of twenty-four artists, including Jospeh Freund, Jakob Hoffmann, and Sverre Rigger, and should begin in the summer of 2020.A new exhibition dedicated to the “American Painters” will open on the campus of the University of Chicago in May 2021. The fourteenth iteration of the exhibition will be held at the Museum of Contemporary Art, Chicago.\n\n\nThe University of Washington in Seattle has received a gift of twenty-five artifacts from the collection of the Museum of Contemporary Art (MoCA) in Los Angeles. The fans, sculptures, photographs, and documents are part of the museum’s holdings of the late global artist Ed Ruscha, whose art explored social and political concerns such as ecology and the body. The gift includes a set of prints, a photograph, a drawing, a sculptural rendition of a pregnant woman with two young children, and two documents, including a marriage certificate and a divorce decree.“Ed Ruscha", "The next Biennial should be held on the island of Guadarala, in the Bahamas, in 2022. The exhibition will include work by forty-three artists, including Firat Ghebaly, Ciarán Ó Briain, Molly Crabapple, and Elizabeth A. Nourse, as well as the work of various artists from the Caribbean, Central and South America, and Australia.  The artists who will be represented in the exhibition will be announced in the coming months. ·       ·       ·  Prudence Morgan Gallery, New York: The first solo show by the artist will be held at the gallery in October. Morgan’s first show in the United States since the 2017 exhibition “The Death of an American Family: American Art in the Age of Black Power” will be at the gallery next March. Morgan has been a solo artist in New York since 1984. Her art has been exhibited at the Whitney Museum of American Art and the Metropolitan Museum of Art, and she has been a MacArthur Fellow and a recipient of more than seventy awards. ·       ·       ·  The Pushkin Museum of Fine Arts, Moscow: The Russian", "The next Biennial should be held in the Spring of 2021. The exhibition will take place in the museum’s Düsseldorf-area space, which is undergoing a major renovation, and will be curated by Alyssa and Rainerich von Düsseldorf. The biennial will include projects conceptualized by the artist and will run approximately three hundred meters (1,400 feet). The venue will have a gallery and performance space as well as a restaurant and a bookstore. The Biennial will be held in the museum’s Düsseldorf-area space, which is undergoing a major renovation, and will be curated by Alyssa and Rainerich von Düsseldorf. The biennial will include projects conceptualized by the artist and will run approximately three hundred meters (1,400 feet). The exhibition will be on view until October 21.The biennial will mark the first time the space has been open to the public since the renovation project began. The renovation involved the installation of new exhibition spaces, an expanded exhibition program, the preservation of the original archival materials, and the opening of a brand new museum. The redesigned museum is located in the Düs", "The next Biennial should be held in 2020.\n\n\nThe New Museum in New York has appointed the curator of post-World War II American art, Frank Gehry, as its new chief curator. The appointment, which was made on October 7, 2018, comes less than a week after the institution unveiled the museum’s new exhibition, Art: What Does It Mean to Be Human, which aims to address the historical and cultural legacy of American art. Gehry joins the institution from the Metropolitan Museum of Art, where he first worked as a curator. He will assume his responsibilities in November.“Frank Gehry and the New Museum are emblematic of the transformative power of art in America, and in this new world,” said Stephen Haus, a cochair of the institution’s board of directors and a senior curatorial advisor. “We are deeply honored to welcome him to New York and to continue to serve the museum with his vision and energy.”\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that Gisèle Delahaye has been selected as its next general secretary. Delahaye will succeed Mark Dugdale, who retired after eight years on March 31. Commenting on her", "The next Biennial should take place in the spring of 2022, after the expiration of the current five-year contract, in the interpretation of the existing works. \n\n\nThe National Gallery of Art (NGA) in Washington, DC, has received a $30 million donation from the Doris Duke Foundation. The donation, which was made by the philanthropist in recognition of her contributions to the arts, was made in conjunction with the foundation’s new 2040 goal, set in recognition of her lifetime contribution to America.“This donation ensures the future of the NGA, which was founded in 1974 in the shadow of the iconic building that was built to house the NGA, and brings the total amount donated to the NGA up to $130 million, the foundation said. The NGA is currently funding a series of exhibitions and educational programs for schools and local communities throughout the DC region, including a programming preview event for elementary schools and a weekend garden show for neighborhood kids.The deal also involves the acquisition of the remaining 154 acres of the former site of the Washington National Cathedral, which has been a center for civic engagement and educational initiatives since the institution opened in 1948. The National Gallery of Art will acquire the remaining fifty-nine acres of the", "The next Biennial should be announced in the second half of the year.\n\n\nThe Metropolitan Museum of Art in New York has been forced to postpone the upcoming edition of the Museum of Modern Art (MoMA) in the city, which was set to run from March 22 to March 26. According to Artnet, the postponement was made after the institution received twenty-one new cases of the coronavirus. The coronavirus is spread mainly from person to person, but it can also be spread to an animal, and it can be spread from person to person by sharing a home environment. “We are deeply concerned by the recent spike in cases in the United States, and the spread of the virus to people in other countries,” Museum director Daniel H. Weiss said in a statement. “While we have avoided making the decision to cancel the show until now, we felt it was in the best interest of the museum and the public to move forward with a show that was as exciting as possible.” The event, titled “Spies,” was scheduled to wrap up in the fall. The first episode, which was to be released on March 24, was never live-streamed. In an attempt", "The next Biennial should be on the neighborhood around the museum, which is located in the former neighborhood of the American Folk Art Museum in Brooklyn, New York; is currently being developed by developer Vincent Lelong; and is being spearheaded by the Brooklyn-based artist-run nonprofit, the Center for the Arts, and the village of West New York. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles plans to expand its curatorial expertise in the areas of ethnography, visual art, and performance through a new initiative called Align Your Life. The initiative will launch with a formal exhibition at the museum next month, and will culminate with a major exhibition at the center in February 2021.“MoCA is committed to drawing from the public’s lives and histories to provide a unique perspective, often at odds with prevailing conceptions of heritage,” said Daniel H. Weiss, the institution’s executive director. “Align Your Life will tap into that passion and offer a new way for our audience to connect with history, drawing from the lives and cultures of artists and others who inspire us. We hope that this new perspective will inspire us to think differently about how we connect with the past and the future.”The", "The next Biennial should be held in 2022, but the organizers say that an exhibition about the history of science fiction and fantasy, run by the artist Nick Hornby, will be staged in 2021. The artist and poet will also give a talk entitled “What is the Future of Science Fiction and Fantasy?,” which was inspired by “The Future Is Now.”The 2019 edition of Biennale San Francisco took place at the San Francisco Museum of Modern Art, and the exhibition featured work by twenty-five international artists. The theme of the exhibition was “Art and Science Fiction: From the 1970s to the Present.” \n\n\nThe Danish political philosopher Larsa Hafblæd, who died in 2006 at the age of seventy-nine, was a leading advocate for feminist and LGBTQ rights and a director and producer of the weekly program she created, the Danish Program. Hafblæd�s program, which debuted in 2008 and was hosted by the program and its Copenhagen affiliate, the Danish Television Network, drawn audiences from around the world and helped secure donations for the Danish National Museum for Women in 2008. It also featured works by artists such as Anna Atkins, Richard Assir, Jocelyn J. Masek,", "The next Biennial should be held in 2022.   Foundation for Contemporary Arts (FCA) in Cleveland, Ohio, is also planning this year’s edition to be held at the Fremont Art Institute in California in 2021. The San Francisco Museum of Modern Art (SFMoMA) is currently working on a new version of the event, which will involve the commissioning of new works by artists under the direction of curator René Maglié. The new theme, “We Shall Not Be Traded,” will come to SFMoMA in January 2022 and will mark the first year that the museum has hosted the event. \n\n\nThe National Gallery of Art in Washington, DC, has launched a new initiative that will increase the amount of art it acquires through a crowdfunding campaign and use the proceeds to support artists. The NGA Arts Initiative, which is being organized as a partnership between the National Endowment for the Arts (NEA), the NEA’s board of trustees, and the gallery’s staff, will aim to raise $5 million from a pool of donors to create new direct support for contemporary artists and encourage the collection to engage in “local, national, and international", "The next Biennial should be held in the spring of 2021. The institution also has plans to have the exhibition re-created in the 2019 event, and it will soon be able to re-create the upcoming show in the United Kingdom, but only in the institution’s home country, a move that would have immediate and significant implications for the exhibition.Curator Pilar Corrias and the institution’s director, Maria Francs, confirmed that the new arrangement will allow the biennial to create more immersive and cohesive works, incorporating films and audio works and other visual materials within the exhibition. It will also allow the exhibition to remain at the gallery for an additional six months, so that it can be completed on a schedule that is consistent with the biennial’s dates.The announcement follows the biennial’s appearance at the Venice Architecture Biennale in May. It marked the first time the exhibition was shown outside of its home country.\n\n\nOf the twenty-five artists represented at New York’s Fifty-Ninth Venice Biennale, only three were women: David McAllister, Yinka Shonibare, and Kiki Smith. “Women are not only underrepresented in architecture, in", "The next Biennial should explore the work of Abraham Kander, Paul Mpagi Sepuya, and Susana Navarro, whose work explores both the forms and the materiality of the body, respectively. Its theme should be “Body and Culture,” and its venue should be the Grand Palais de Tokyo. The biennial is not taking place in the flesh, but in the digital realm, with the forum for the exhibition mostly taken up with drawings and books. Its first exhibition was “Abraham Kander” (2013–14), and it held the second edition of the show in 2017. This week, the exhibition was presented at the Venice Biennale in a free event in the city.\n\n\nThe Susana Museum of Art in Lisbon has welcomed Andreas Krähenbühn to its board of directors and is planning to introduce the German artist to its curatorial staff. Krähenbühn has been a trustee of the museum since 2005 and is currently the founder of Heinrich Kunsthalle Süderstrasse in Kassel. Krähenbühn’s daughter, Haralda, is director of the Kassel-", "The next Biennial should take place in the city in 2022. The group will also unveil a new platform that will allow visitors to compare and contrast its exhibitions through the exhibition of artist-made works and will continue to develop and produce work-based experiences that tap the studio and the viewer. “We are grateful for the support of our artists and audiences, and of the sponsors who have made the more than thirty years of work we have done possible,” said Wojciech Kuk, chair of the exhibition and curator of the Twin Cities. In addition, the exhibition has received a further $47,000 in support from W. K. Polk-Dorsch grants and the Noguchi Foundation, as well as a $13,500 donation from artist-activists Laura and John David.\n\n\nThe Independent Commission Against Corruption (ICAC) in Brazil has condemned the Attorney General’s Office and the Federal Regional Court (inês administrativas) for blocking the release of thousands of photographs and videos seized from a suspected drug trafficking ring in the capital city of Rio de Janeiro and has demanded that the state pay a record $41 million to an independent monitor appointed by the federal government.  The indictment,", "The next Biennial should be held at least every two years. The biennial will focus on the theme of each year, a lecture series, and a social event. The first edition will be held at the Institut d'Art Contemporain (AAC) in Paris in March 2019 and will focus on the American artist James Turrell. The second edition will be held at the Palais de Tokyo in Paris in April 2019 and will focus on the artist Paul Gauguin. The third and final edition will be held at the Museo de Arte Contemporáneo Milano in Milan in September 2019 and will focus on the artist Jean-Luc Moulène.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has announced that it is planning to construct a new seventy-five-thousand-square-foot museum dedicated to the art world, which will include galleries and private collections as well as the works of a rotating group of masters. The new museum will be located on the ground floor of the Museum of Modern Art in Manhattan and will be designed by Koons and his company Gagosian; is set to open in 2022 and will have a running budget of $125 million.The proposal for the new", "The next Biennial should take place in the spring of 2021. \n\n\nThe two top art auctions in Beijing this year—the inaugural Exhibition of the Chinese Contemporary Art World (ICAW), which was held at the Chinese Ministry of Culture in Beijing in March and the second Beijing Art Market (BAMS) in November—were canceled owing to the coronavirus pandemic.Both auctions were scheduled to run from March 14 to March 17, but were rescheduled for April 5 and May 5, respectively. The canceled events were a setback for the Chinese government, which had hoped that the extra time would make up for lost sales and help the country avoid a recession. The government had previously committed to supporting the Chinese art market through a series of loan programs in March; the programs were supposed to run through April 30. However, the cancellation of the auctions coincides with the end of the biennial and the expiration of the loans.The Shanghai Art Market, which was scheduled to take place in the city of Qinghai from April 10 to April 12, China, canceled the event in March, and a September exhibition in Beijing was also canceled. The cancellation of the two events has reignited concerns over whether the coronavirus will disrupt the upcoming fairs and has", "The next Biennial should be held in 2021, but it is currently unclear whether the first will take place in 2021, or when it will begin. Until the 2019 event, the museum was only expected to draw a few thousand visitors. Its opening was originally pushed to spring 2021.The National Gallery of Canada (NCC) in Ottawa announced that it will not move forward with a redesign, renovations, or expansion even though it is planning to make the space a National Museum. The museum’s current building, the National Gallery of Art, also houses the federal archives, the British Library, and the Centre for European Art. While the museum serves as a significant cultural destination for visitors from all over the world, the institution cannot re-open if it does not change its design and the way it is made. The museum has received a $12 million donation from the Sacklers. \n\n\nSydney’s Solomon R. Guggenheim Museum has named Kate McAllister as its new international director and CEO. McAllister comes to the institution from the National Gallery of Art, where she has served as director since April 2018. Her new role is designed by Guggenheim Associates, from architect Peter Leuty, and", "The next Biennial should be held in 2020–21.\n\n\nThe Leslie-Lohman Museum of Art in New York has appointed Kate McKee as its new chief curator. McKee comes to the institution from the Metropolitan Museum of Art in New York, where she has served as associate curator since 2013. She succeeds Christine Lavin, who retired in March 2019 after eighteen years at the museum.“We are thrilled to welcome Kate to the Leslie-Lohman team,” said Leslie-Lohman director Anna Patchett. “In addition to her extensive experience in contemporary art, Kate has demonstrated an enduring commitment to bringing the Leslie-Lohman Museum of Art to life. Her passion and talent align perfectly with the museum’s mission to present the rich history of New York through the art of the city.”McKee joins the museum from the Metropolitan Museum of Art (MoMA), where she has served as chief curator since 2015. During her tenure as curator, she curated “The Empty Air,” a solo exhibition featuring work by Annie and George Andre and the museum’s inaugural exhibition “Museum of the Modern Heart.” McKee also curated “The Sleepwalkers", "The next Biennial should be announced in the fall of 2020. In the meantime, the museum will continue to present events and programs that have relevance to the city and region.”\n\n\nThe New Society for the Visual Arts (New Sculpture Garden) in New York has launched a $500,000 fund for visual arts professionals in need of financial assistance. The fund is a response to the recent financial crisis, during which the New York City government cut off its $3 billion budget over the course of two years, forcing the New York Museum of Modern Art (NYC MoMA) to lay off close to one hundred employees.According to the New York Times, the city’s arts and cultural sector, which employs some 3.5 million people, is now struggling even more than the rest of the city, which is currently reeling from a $4.2 billion budget crisis caused by the coronavirus. New York City’s economy is already suffering after the coronavirus hit the region in late March, and the number of people infected with the virus has continued to climb. With the help of $2.5 million from the New Society for the Visual Arts, which also lent $500,000 to the victims of Covid-", "The next Biennial should be held in 2022. \n\n\nNetherlands-based artist Janice and Peter Nijhoff, known for her dual-tasking performance and installation, will present a new exhibition at the Museum of Contemporary Art (MoCA) in Boston next month. The exhibition, titled “Wangechi Mutu: A Space for Truth,” will explore the concept of a “compassion space”\u0097a concept first suggested by the artist in an early 2014 video for “Submarine”\u0097a film about an underwater search for a missing submarine.The exhibition, titled “Wangechi Mutu: A Space for Truth,” is being organized by the museum in partnership with the artist and the immigrant-based nonprofit Stiefelkulturen. The show will take up themes of migration, climate change, cultural exchange, and identity\u0097and will be curated by Peter Nijhoff, who currently serves as a curator at the Museum of Contemporary Art (MoCA) in Amsterdam. “We are thrilled to be able to present this exhibition at the Museum, which is a true leader in the field,” said Nijhoff. “The exhibition embodies Janice", "The next Biennial should take place in the United States, and the inaugural event should also be held at the beautiful, historic, and extravagant new home of the Smithsonian’s National Museum of African Art. The first exhibition will open in 2021 and will travel to the Smithsonian American Art Museum (SAAM). \n\n\nThe Museum of Fine Arts (MFA) in Boston is planning a major revamp of its campus in collaboration with the local community. The renovation, which is part of a comprehensive overhaul of the institution, is expected to cost around $150 million and will involve the installation of more than one hundred new works and the acquisition of nearly five hundred artworks from the collection.“MAFA is reimagining how we educate and engage with the world around us, and we are creating new opportunities to increase the accessibility, diversity, and positive impact of art in the central city of Boston,” said director Matthew Teitelbaum. “MAFA’s design team has worked hard to ensure that Museum visitors experience MAFA on a global scale, and it is clear that the redesign is going to be a transformational step forward for all of us.”The renovation will also include the establishment of two new galleries on the museum", "The next Biennial should take place in 2020. The next Sundance should take place in 2021.  They added: “The Future is Our Future; Itself is Present; What is Present and What Hasn’t Been, is Present.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Steven H. Ellis as its next executive director. He succeeds Mark B. Lubell, who stepped down this May to head the Metropolitan Museum of Art, and will take up the post on September 1.“Steven has provided a unique perspective and vision for the MFA for nearly twenty years, and we look forward to his leadership as we build our new strategy, new relationships, and new partnerships,” said Mark B. Lubell. Ellis’s new role will begin immediately and will consist of a three-year term. During his tenure, he will work with the museum’s board, curatorial staff, and the general public to develop new programming and new experiences to support the museum’s work. “I’ve long been a fan of Steven’s work, and his unique curatorial practice,” said Mark B. Lubell.", "The next Biennial should be held sometime next year.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Rebecca D. Roach as its new deputy director of programming. Roach comes to the institution from the Brooklyn Museum, where she has been the director of development since 2012. Roach comes to the museum from the Gabriel Collection, where she previously served as director of development. Her new position is part of a larger plan that involves the reorganization of MoCA’s programming, the expansion of the museum’s rarefied atmosphere, and the creation of new programs.“We have had a successful and innovative long-term relationship for more than twenty years with the British artist and filmmaker Noah Algernon, and his extraordinary team,” said Catherine Fisk, chair of MoCA’s board of trustees. “We are thrilled to work with Rebecca and the team, and to continue to grow our programming in collaboration with the world’s most gifted artists and collectors.”\n\n\nUndercover archaeologists were hired by the United States government to dig up and expose the massive Cenozoic-age granite wreck of the Titanic, the colossal rammed-together remains of the historic shipping", "The next Biennial should be held in June 2020, and the 2020 edition will be staged at the San Francisco Museum of Art (SFMO), the Museum of Modern Art, and the Whitney Museum of American Art in New York. \n\n\nThe French Ministry of Culture and the Ministry of Education have agreed to work with the Spanish Ministry of Culture and the University of Madrid to create a new cultural exchange and education program, called “Concours des mots,” that will bring more than two thousand artists to Paris, according to Le Monde. The initiative will incorporate the cultural institutions of both countries, as well as the archaeological site of the ancient city of Palenque, and will involve traveling to Paris to perform at events, including the annual gala and the annual Les Demoiselles de l'Arles, as well as to Madrid to be present at exhibitions and events.The curriculum will include a performance by a group of seventy artists, including Lisette Matin, Michelangelo Antonioni, Anne Fontenay, and Elin Østby, as well as classical French and Latin American dance and dance studies, and will include a residency in France. The program is being organized by the Institut d’", "The next Biennial should take place in 2020 and will be supported with a $55,000 grant from the American Alliance of Museums (AAM), the sum of which will fund a festival that will showcase the work of twenty-six artists. The biennial will be organized as a platform for artists and will include a performance and a lecture series and a curatorial exhibition.The announcement also announced that it is expanding the features section of its website with new artist interviews, curated by veteran art critic Jorg Liguier, and author Naomi King, as well as new artist essays, curated by Rachel Chiu, who was one of the artists featured in the exhibition “A BIP” in 1999, and James Duncan, who was one of the artists featured in the exhibition “A BIP II: 2010” in 2013. In addition, the new platform will include a forum on biennial projects, a list of participating artists, and a special section for artists that will feature new artist interviews.According to the New York Times, the revised platform will be launched in 2020. It will also introduce a new biposting feature, a Jekyll and Hyde web site featuring interviews with", "The next Biennial should be a celebration of the life and work of Willem de Kooning, a Dutch director and artist whose work is a vital and timeless example for contemporary practice. The exhibition will also include a presentation of works by artists that are based in the United States and will have a particular focus on the contributions of Italian artists to the American canon. The first exhibition, “Tales from the American Midwest” will open at the Museum of Fine Arts in Boston on October 22 and will run through December 3.\n\n\nThe National Endowment for the Arts (NEA) announced today that Megan and Simon C.A. Lewis—coowners of the National Enquirer and National Enquirer and National Geographic magazines—are board members of a new media venture called the National Geographic Media Company (GMC). The partnership is a collaboration between the National Geographic Society, the National Geographic Discovery Institute, and the media company, which will provide a platform for artists to produce original and ambitious content on its platforms.“The National Geographic Society is committed to promoting a multidisciplinary approach to journalism and arts that builds on the legacy of Charles and Jerry Beckman, who pioneered the long-form format, created some of the most iconic images of our", "The next Biennial should take place on the banks of the Adriatic, in the city of Silistria. It will also present a series of exhibitions, including an exhibition of works from the artist’s 'Tales of an Italian Family', in which three generations of a family of Italian immigrants, including Giovan, Piero, Tommaso, and Virgil, are featured in the works’ narratives, which will be on display through February 21, 2020.\n\n\nThe Taipei Fine Arts Museum (TFAM) has appointed Yumi Tsuda as its next director, effective immediately. TSFAM is one of the two institutions in Taiwan that have recently experienced a revival. The exhibition program, which focuses on the history of modern art and of contemporary art, consists of new exhibitions, triennials, and a retrospective.The institution plans to create an additional space dedicated to contemporary art, which it has not previously held, in the city of Foshan. It will also place a new exhibition, “Until the Sun Shines,” at the museum in the fall of 2020, and is preparing a series of works on the history of women’s art. Tsuda will take up the post on January", "The next Biennial should take place in the spring of 2021.The commission, which was organized by the Los Angeles–based nonprofit the Museum of Contemporary Art (LA MoCA) and the Los Angeles County Museum of Art (LACMA), was established to honor the city and to present an exhibition that would explore the possibilities of rural life. The topic for this year’s biennial was “moving to a new place,” said curator and poet Cynthia Wilson. “The idea of a museum rooted in the landscape was born from the real world. LA MoCA is a significant cultural center, but it’s a community museum first and foremost. We wanted to create a new space that would nurture the community’s aesthetic and emotional well-being, which I believe is what the Biennale is all about.”The forty-eight-acre campus will feature thirty-one original masterpieces by fifty-one artists, including Charles Atkins, Mark di Suvero, David H. Dyer, Robert Irwin, and Gerald Koestenbaum. The full list of artists participating in the 2020 Biennial is as follows:Daniel AndrewsDaniel CliftDaniel FletcherDaniel Clift (artist)Daniel Clift (artist)Daniel", "The next Biennial should be held in 2020, the Art Newspaper reports. The 2020 theme is Life on the Move, which was inspired by photographs of people moving about in the city. The first edition of the twenty-three-day exhibition will be staged at Manifestation 4, a newly-constructed space that is being spearheaded by architect Yinka Shonibare and was inaugurated by Tadao Ando, the chief curator of the Art Museum Tokyo. The 2020 finalist will be announced in March.\n\n\nThe National Gallery in London has commissioned the work of Polish artist Wojciech Sosaniecki for a new installation, “All Things Come to Me: Politics and Art in the Age of Stalin,” which will open in the museum on February 13. Set to open in the summer of 2021, the installation will juxtapose photographs of political leaders, including Polish president Bronislaw Komor, with images of objects such as candles, flowers, and lamps that can be found in the National Gallery’s collection.Expanding on themes explored in his work “The Cultural Context of the Eecheński Building,” Sosaniecki pushes", "The next Biennial should take place in 2020, the Art Newspaper reports.  The program will be themed “Beyond Borders,” an inversion of the theme of the past two years, “The Future of Art,” and will be curated by Jean-François Gaillard, the director of the Studio Museum in Paris, and Anna-Sophie Berger, the artistic director of the Museum d’Arles. The event will be held in the National Museum of Art in Nantes, France.\n\n\nThe Museum of Fine Arts (MFA) in New York has appointed Shirley Tendall director. She will succeed Sandra Ford-Dessau, who has served as director of the museum since 1994, and will take up the post in January 2021, the Museum’s board president Michael DeMarco confirmed. Tendall comes to the institution from the K15 Museum of American Art in Santa Monica, California, where she has served as director of curatorial affairs since 2012. “We are thrilled to welcome Shirley to the MFA,” said director Doreen Kennedy. “Her deep understanding of our mission, as well as enthusiasm for the MFA", "The next Biennial should take place in 2020.<|endoftext|>Wells Fargo (WFC) is the latest financial firm to face a lawsuit stemming from the massive hack that unfolded at retailers Chase and Bank of America (BBVA) between March 13 and March 17. The New York Times reports that the suit, which was filed in a Manhattan federal court on Thursday, claims that the two parties have a valid contract over a long-term loan that was issued in 2017. The suit follows the announcement that WFC would pay $185 million to retailers in a settlement with creditors that was announced on March 16, and that BBVA would settle with creditors that was made on March 26.The suit alleges that retailers, who were already facing losses due to the virus, were only partially compensated for the work they have done to contain the spread of Covid-19, which is spread mainly from person to person and is spread through the air; that the company failed to properly warn merchants about the health risks of carrying out business with businesses that deal with WFC; and that the breach of the contract is causing creditors to pursue legal action.The suit also contends that the retailer breached their fiduciary duties by helping to mount the litigation against the company, which has been represented by attorneys", "The next Biennial should focus on themes related to the dichotomy between a 'normal' life and the fragile, unstable and distancing lives of the vulnerable. It should look at the ways that the lives of the most vulnerable are shaped by the movements and the rhythms of the most populated areas of the city. We know that homelessness is a health crisis, but we don't want to go backwards.”Suggested themes include: The architecture of hope The impact of the epidemic The impact of the pandemic on our communities and environment Consciousness and the body’s relation to the world What does it mean to be a human being in the face of death? How do we care for one another and for the planet? The future of the human being and of the earth is at stake. The fate of our planet and our species hangs in the balance.”\n\n\nThe National Gallery of Canada has appointed Suzanne Jones as its next chief curator. Jones will assume her post in January 2021 and will work closely with senior curator and director of development and programs Alice Redpath, who has led the National Gallery of Canada since 1997, to develop new exhibitions and public programming.“Suzanne brings a wealth of curatorial and", "The next Biennial should take place sometime between the years of June and November 2021. The theme of the 2020 edition will be “The Future is Present,” and will be “The Untold Story.” After the exhibition will air on October 31, 2020, and the exhibition will be “up against the wall.” The first show in the series will be “Theatre of Cruelty: The Art of Cruelty” on February 14, 2021. The second show in the series will be “Theater of Cruelty 2: The Strangers,” which will be staged in the United States in the fall of 2021, and the third show will be “Theater of Cruelty 3: The Subversion of the Stage,” which will be staged in the United States in the spring of 2022.Both events will be hosted by veteran American painter and scholar John McAllister, who traveled to Paris in the early 1950s to teach at the University of Pennsylvania. The work of the controversial curator and educator will be presented in an exhibition that will be inaugurated by his reopening work “Theater of Cruelty.”“Theater of Cruelty: The", "The next Biennial should have its opening at the water park, which is currently undergoing a $1.5 million facelift. When it reopens in 2021, it will boast a new venue for exhibitions and residencies organized by artists and other cultural organizations and will include a new biennial of social practice and performance. The pavilion will also host a new exhibition of work by Berlin-based composers Kølsten Albers and Wolfgang Pfaffenstein.\n\n\nThe Silver Lake Arts Center in New York has appointed Lorna Cunningham, Scott J. Alexander, and Barbara Eveno as associate curators of the first exhibition of contemporary art at the center. The show will consist of a group show, “MIDNIGHT MUSIC,” which is slated to run October 7–October 8, 2020, and will examine the connection between the performance and the body.Artnews reports that Cunningham and Alexander will work with curator Haroon Mirza to develop the themes and the visual content of the show. The duo will also be collaborating with the Silver Lake Arts Center on the development of multiple digital platforms for the exhibition.“Lorna and Scott are among the most accomplished contemporary artists working today with a strong vision and a deep understanding of", "The next Biennial should be held in 2021.\n\n\nMore than two hundred artists and cultural workers have endorsed a resolution calling for the United Kingdom to leave the European Union. The Art Newspaper reports that a group of artists and academics, led by Jeppe Aandenberg, director of the Württembergischer Kunstverein (WKU), in Berlin, issued the call in solidarity with those who voted to leave the European Union on June 23.A group of artists and academics, led by Kate Fowle, chief curator of contemporary art at Tate Modern, gave a presentation at the Hammer Museum in Los Angeles last week that addressed the implications of the Brexit vote. The exhibition “involves the question of a future for the arts in a post-Brexit United Kingdom,” the art historian and Yale University graduate told the New York Times.According to the New Art Newspaper, the artists’ proposals include the following: “[Remain] pledges to dismantle the arts and the physical fabric of our communities,” such as a £12 billion cut to the National Lottery; a “inadequate, harmful” international trade deal that could adversely affect the arts and culture of the United Kingdom; the dismantling of", "The next Biennial should be staged sometime in the next two years, with a new exhibition being organized every three years. Together, the team and I will deliver a show that will engage the public and articulate the lessons that we have learned along the way.”\n\n\nThe Bessies, an annual award that honors mid-career artists, has announced that the 2019 winner is University of California, Berkeley, graduate student Christopher Wool. He will be presented with the honor at the Bessies at Berkeley’s Brown Museum on Saturday, April 5, at 7 p.m. The ceremony will be followed by a reception in the Bessies’s residence hall. Wool was selected from a shortlist of three artists who were nominated by a group of thirty artists and curators whose work was featured in the inaugural award, which was established in 2017 by the Berkeleyside Foundation. Among the artists who were shortlisted for the $10,000 honor were Daniel Barenblit, Ethan James White, Takir Ali, Mira Arsht, and Zahra Breish. The full list of judges is as follows:Daniel BarenblitAlessandro Bian", "The next Biennial should take place at the new Museum of Contemporary Art (MoCA) in Los Angeles, the Los Angeles County Museum of Art (LACCA), and the Los Angeles Museum of Art (LAMo).The 2018 edition will be held at the Santa Monica Museum of Art (SMO), the New York City Museum of Art (NYCMoA), the Metropolitan Museum of Art, and the Metropolitan Opera House. The 2019 edition will be staged at the Paley Center for Media and Performance at Columbia University, and the 2020 edition will be staged at the Los Angeles Museum of Art (LALMA).A number of artists have announced they are withdrawing from the upcoming edition. “I have been thinking about this for years,” artist Chris Ware, who will not attend the 2019 edition, told Artnet. “When I announced last year that I was withdrawing I presumed that the decision would be easy. That I was just going to leave the country to my family and go back to my island home in the Pacific, to my island in Alaska. I never thought it would be this hard. I only tried to make it as fair as possible.”\n\n\nThe Allen Memorial Art Museum in Cincinnati has received a gift of twenty works", "The next Biennial should begin with a public celebration of the seventeenth and last International, which will be held in London in the spring of 2021. It will then begin a seven-year retrospective of the exhibition, titled “Models and Radicals: Contemporary Art from the South,” which will run concurrently with the biennial. The exhibition will also feature two-hundred works by forty-four artists from North America and Europe. Inaugurating the exhibition is the launch of a new digital platform, Biennial Trend, to showcase the work of emerging and established artists from the region.The new biennial is supported by the Biennial Fund, a UK–based charity that works towards supporting artists working in the biennial sector in London. The funds will support Art\n\nCongressman Richard E. Neal, who chairs the House of Representatives' powerful Governmental Affairs Committee, said that the committee will reschedule the 2019 event, which is set to run from March 13 to March 16, and will work with the National Endowment for the Arts (NEA) and the National Council on the Arts to develop a new strategy for the event. When asked about whether the 2019 event should be moved to December, the congressman said: “", "The next Biennial should take place in 2021–22, when the exhibition will be relocated to a new location in the city. The space, which will be inaugurated by a triple exhibition of work by Naguib, the country’s first renowned modernist artist, and will be overseen by the architect Minh-Jeong Kim, will be inaugurated by the new museum on October 16.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has appointed Thomas Macuga, formerly director of the Museum of Modern Art (MoMA), as its next director. Macuga has been appointed to the post by former chairman Daniel H. Weiss; he will begin his tenure at the museum on January 6, 2020. “With his deep experience in design and his ability to unleash the latent energy of New York City’s architecture, Thomas Macuga will become MoA’s first director in twenty years, and a major catalyst for this year’s architecture biennial,” Weiss said in a statement. “As MoA’s director, his vision for MoMA, and our collection, will be enhanced by our board of trustees, our staff, and our volunteers, and we’re confident", "The next Biennial should be held in the year 2022.When reached for comment, a spokesperson for the Guggenheim said: “We are not able to discuss the possibility of a future GC and are focused on developing a new model for exhibitions that will be sustainable.”\n\n\nWhen Filippo Barbera, the curator and director of the Palazzo Nazionale di Barbera, in Rome, opened the doors of the museum to the public in September, he did so with a message that felt both urgent and urgent to many: We are facing the most complex and challenging period in our history.” Barbera is referring to the five-year, ten-year, and fifteen-year terms that Italy has held for decades, and the uncertainty that comes with them. In an interview that aired on Sky TG24 on December 10, Barbera said: “I think we are facing a difficult moment. I think we are facing a period when, in a very serious way, we have to make a very hard decision. . . . I think the first thing we need to do is rethink the future of the institution. We have a vision for the future of the Palazzo Nazionale di Barbera, and we", "The next Biennial should take place in the spring of 2021, with construction scheduled to begin in the summer of 2022.  The theme, \"Theoretical Biennial: Architecture and the Problem of Form, ” will be curated by the Istanbul-based curator Fatosu Mamat, the successor of the founder of the unique and controversial architecture program, Wangechi Mutu, who died in 2020.The project will have an exhibition-like format, with exhibitions and discussions organized on the artist’s curating-and-decorating practices. The first exhibition of the program will open at Tuzla Art Museum in the central city of Tuzla, the second at the Fine Arts Museum in the American University of Ghent, and the third at the Museum of Modern Art, New York.The project will focus on themes in architecture and design, including the principles of form and the role of materials in contemporary architecture, and will invite the public to experience \"a modern architecture as it really exists,” according to design editor Asma Al-Qasimi.She added: “The idea of this exhibition is to explore and present the ideas and methods that are at the core of architecture, and to show how important", "The next Biennial should now open in 2021.\n\n\nThe Art Newspaper has revealed that the Oxford Art School (OAPS) will award its first Art Students Initiative (ASI) prize to a student-run organization in April. The organization will receive $25,000. The prize is one of several that the school will host this year, including an auditorium engagement with the British Contemporary art movement, a workshop on the history of the European art, and a reception for young artists.“OAPS has long been recognised as a leading contemporary art school in the United Kingdom,” said Michael Weston, director of the Art School. “By hosting the students in the first award, we hope to support their achievement and inspire new ideas for how they can take up their education\u0097and create a more positive future for art education.”Described as “a cross-disciplinary platform for artists and academics to share their research and to collaborate,” the OAPS is a platform that encourages students to return to the school to practice their art and pursue their studies. Its new initiative will aim to replace the school’s current Art Students Initiative, which aims to “encourage greater understanding of art history, to engage with students", "The next Biennial should take place in 2020. Photo: Yuki Nakamura/Wikimedia Commons.\n\n\nThe Metropolitan Museum of Art in New York has appointed Kate Barr, a Los Angeles native, as its next director. Barr will become the first woman to lead the museum. She succeeds George Suttie, who served as director for four years, and will begin her position in January 2021.“Kate is a visionary leader who has demonstrated a talent for visionary thinking about how art can serve as a vehicle for social change,” said Rob Walker, the museum’s director and CEO. “She is a colleague who knows how to use the museum’s resources effectively for social good, and a friend who has been instrumental in shaping the museum’s curatorial and educational programming.”Under her leadership, the museum has become an international destination for art lovers from around the world. Since opening in 1985, the museum has transformed from a historic art museum into a cultural hub, with more than nine thousand exhibitions and public programs that draw visitors from around the world. Its contemporary art collection is well famed for its extensive exhibition program, which has been described as the largest of its kind in the United States. The museum also boasts of", "The next Biennial should be held in the spring of 2021.  \n\n\nThe Museum of Kansas City, Missouri, has added Tommie Smith to its collection. Smith, a legendary American blues musician and the father of color, was one of the first black musicians to play at the institution. The museum added his signature style to its collection in 2014 and has been working to acquire additional works by him ever since. Smith's son, Smith 3, became the new director of curatorial affairs in 2016.Smith, who died in 1982, was born in Kindertown, Mississippi, in 1934. According to his son Tommie, Smith grew up listening to blues through a variety of sources, which included an uncle who was a blues musician and his father who was a bluegrass musician. A skilled blues player himself, Smith learned to play the instrument from his uncle, who taught him the basics, and began composing for the instrument. In 1965, Smith 3 left Mississippi to pursue a career in the music industry. He eventually landed in Kansas City, Missouri, where he eventually began his cataloguing efforts, which began in the early 1980s, and eventually produced a series of albums that included such works as Sitting in the Sun (1965), T", "The next Biennial should be held in 2022. The 2020 iteration of the event, titled 'The Future Is Present', attracted a worldwide audience of approximately seven hundred.\n\n\nThe new National Geographic Society-funded museum in London has appointed Pia Camil as its first director. She succeeds Ann-Marie Park, who left the institution in February 2019 to become director of the Museum of Modern Art in Paris, and will assume her responsibilities in June.Camil comes to the museum from the London-based firm Bechara & Partners, where she has served as director since 2016. Previously, she was executive director at the Museum of Contemporary Art (MoCA) in London, director of the Museum of Contemporary Art in China, and of the Rio de Janeiro Museum of Art. Commenting on her new role, Camil said: “I am excited to work with the team at National Geographic to advance National Geographic’s mission to be a leading force in the conservation of natural history and its collections through sustainable practice. We are in the process of making that mission a reality, building on the successes of the past and moving forward with a new perspective. I’m looking forward to collaborating with wildlife, architects, natural history curators and the rest of the", "The next Biennial should be held on the island in December 2021, and will welcome twenty-five artists from thirty-nine countries. The theme of the event will be “social, political, economical, scientific, and physical.” The inaugural exhibition will be titled “The Future Is Present,” and will open on January 12.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced the opening of two new public cultural and historical commissions, the \"Other Place: Between the Waves” and “The Odyssey.” The commission for the Odyssey will be on Long Island City’s Hudson Valley; the commission for the Other Place will be on Long Island’s West Side. Both commissions will be organized by the city’s Cultural Affairs Agency and the Cultural Heritage Foundation.The announcement of the New York City commission for the Other Place two weeks ago had been delayed due to the Covid-19 pandemic. The opening of the commission for the Odyssey and the completion of its construction and renovation marks the culmination of a ten-year project, led by architect Ymir Mirosh, that will create a new cultural and historic landmark in the Hudson Valley. The work, which was funded by the", "The next Biennial should aim to include a number of contemporary works of art, such as interviews with artist-activists, scholars, and activists, as well as lesser known artists whose works were first presented at the Rome Biennale in 2022 and then selected for a Los Angeles edition in 2021. The third edition of the exhibition will take place in New York City in December 2020.\n\n\nThe British Council is developing a new set of guidelines for the exhibition “Theater of Operations: The Gulf Wars 1991–2011,” which will examine the conflicts from a variety of perspectives, including those of veterans and activists, and will feature the work of twenty-seven artists, including Alice Aycock, Tarek Atoui, Janine Gibson-Parsons, and Sean Kelly, and will examine the conflicts through the lens of the conflict in Iraq. The exhibition will showcase new work by the artists in a series of demonstrations and will feature new pieces by young and established artists. The guidelines, which were created by the British Council and the Royal College of Art, and were drafted by the nonprofit Artforum, a British think tank, and the artist-run magazine dpa, and will be presented at the Mondrian-Sittweiler site", "The next Biennial should be held in 2024. If the program is canceled, the institution will still be able to hold the exhibition in February 2020, but only in conjunction with the upcoming exhibition of the work of American artist and theorist Robert Irwin.\n\n\nThe Los Angeles County Museum of Art (LACMA) has accepted a bid for the Los Angeles–based nonprofit the Los Angeles Indigenous Museum (LALIM), which was founded in 2017 by artist and activist María Berrada. The new museum will be located in the former site of the Griffith Observatory in Hollywood, and will include a center dedicated to the art of Indigenous culture, as well as a dedicated space for the collection of art and artifacts from the Los Angeles–area region.“This is a historic moment for LACMA, a museum that has been at the forefront of the LA–area theatre community and in the fight for justice and equity for Black and Indigenous communities,” said donor and LALIM board chair Alfredo Peralta. “I’m incredibly excited to be a part of LACMA’s history, and to continue to support this community through the art of art.”Since its inception, LALIM has been a champion for", "The next Biennial should be held at the Museum of Anthropology, in Tokyo, in 2021. The Japanese pavilion will consist of thirty-seven artists\u0097including Ai Weiwei, Masaoka Hiroki, and Tadao Ando\u0097and their works will also be included in a special exhibition at the gallery. The exhibit group will be composed of Anno Ogun, Singer/songwriter Keiichi Kawamura, Linda McCartney, and Eli Sher, and will include a selection of works by the late artist Katsuya Miyamoto.The exhibition will also include works by the late Japanese director Kiyomasa Miyamoto and will include the 15th anniversary edition of the exhibition, which will showcase the work of twenty-six artists from the late ’60s to the late ’70s, with a view to creating a new works on the seventeenth of March.\n\n\nThe eleventh edition of the Berlin Biennale, curated by an intergenerational group of British artists consisting of artists such as Tanya Cooper, Helen Cammock, Alan Parsons, Pia Camil, and Maureen Dowdeswell, has announced that the event will now take place at least twice a year", "The next Biennial should be held at the Museum of Contemporary Art in London, in 2021.  The 2019 edition was held at the Hayward Gallery in Chelsea and was a joint project of the Centre for Contemporary Art London and the Museum of Modern Art. The museum is currently working on the 2020 edition. \n\n\nThe National Geographic Society has been forced to acknowledge that it is not done bulldozing its own holdings to make room for new digs at its headquarters in Washington, DC. In a statement issued by the organization on Wednesday, the board chair Robert Graham said that the institution has yet to determine the future of the headquarters—which it has occupied for sixty years—and that the decision to move the exhibition space out of the city had nothing to do with climate change.Graham said that the decision to leave the center rested with the board, which consists of six members, including Nancy Spector, the executive director of the Society of Architectural Historians, and Christopher Hobbs, the director of the National Gallery of Art. “The board made a decision not to pursue the acquisition of the National Geographic Society’s properties in Washington, DC, and New York City,” Graham said. “We’re still evaluating", "The next Biennial should take place in the city in 2021. The 2019 edition was staged at the San Francisco Museum of Modern Art.The 2017 iteration of the award was presented by artist Franklin Alighier. The honor was awarded to the winner of a biennial for \"artistic practice and aesthetic achievement in the humanities, the sciences, and the arts\" in the spring of 2018.\n\n\nThe National Galleries of Scotland has appointed Taylor Bennett as its new director. Bennett replaces Scottish director Joanna Hadden, who announced her resignation in February 2019 following a controversy over the sale of a painting by the artist Ullstein & Nicholson, which has since been removed from the market.“Taylor’s appointment as the new director of the National Gallery of Scotland is a monumental occasion, and one which will serve as a landmark in the history of the National Gallery of Scotland,” Hadden said in a statement. “Her background and experience in the art world, coupled with her long-standing relationships with key members of the institution, will be essential in ensuring that the National Gallery of Scotland continues to thrive.”Bennett was first appointed as director of the National Gallery of Scotland in 2008. Following her appointment, she served as interim director until", "The next Biennial should focus on “Avicenna: The Evolution of Modern Art” (2019), which will open on July 22. As the exhibition moves from its location in the city of Leipzig to the Kunsthalle Basel in Switzerland, the Biennial will be moved to a new venue in Vienna, the Fondazione Ato. Vienna will also present the eighth edition of the Swiss pavilion, “Das Begriff des Modelles” (2019), which will open in October.\n\n\nThe Museum of Modern Art (MoMA) in New York is moving forward with plans to rebuild its iconic Yuz Museum after it was severely damaged during a major fire that broke out on the sixth floor of the institution in May 2018. The Yuz Museum is the largest art museum in the United States and recently underwent a major expansion. The renovation, which involved the construction of forty-one underground galleries, a new building, and a ten-story glass-enclosed theater, the expansion was completed in May of 2018 and marked the museum’s return to the Brooklyn waterfront. The new spaces are being described as “transformative,” “in harmony with the building,” and �", "The next Biennial should be a tribute to the memory of the late Polish photographer Polska Szymański, who in the seventeenth century photographed the historical Jewish Museum in Warsaw with her own photographic camera, and whose work continues to be collected by the various charitable organizations that have supported its exhibition space, the National Museum of Warsaw, in Washington, DC. The Biennial will be inaugurated by a presentation of the work of the artist-in-residence of the Museum of Polish Jewish Heritage in Warsaw, Zbigniew Wojtyła, who has been a professor at the Academy of Arts in Warsaw for thirty years. Wojtyła’s portrait of his mother and father, who were both members of the Jewish community, reflected the history of the family and the Polish nation. The work will be on display in the exhibition “Polemaowicz, Dress, and Life: Women in Jewish Art” at the National Museum of the Jewish Heritage until 2021. \n\n\nFormer director of Tate Britain, Ann Woolf, has been appointed the next director of Southbank Centre in London. She will take up the post in February 2020. After working at the museum for twenty-eight years,", "The next Biennial should take place at the Museum of Contemporary Art (MCA) in New York (MCA), next spring. The ten artists chosen for the 2018 edition of the TGIF exhibition were:Amara Gainsbourg, Zacharia Estévez, Lara*Jolanda Hassan, Matthijs Hoeijmakers, Christina Hirsi, Andrea León, Zarina Otero, Markus Plachta. The full list of exhibitors is as follows: *This year’s exhibition was curated by Krista Edmonds and is supported by the Philips Corporation, a division of the Philip Morris Company. Founded in the late 1880s in New York, the institution's first exhibition was produced by the artist Barbara Alkmaar. The first exhibition featuring the work of a Japanese artist was in 1964 by the Chinese artist Wataru Kitamura. The TGIF Biennial will be held at the artist’s studio in New York from February 14–February 19, 2020.\n\nAn irreverent tribute to the late progressive rocker, painter, actor, and activist Susan Sontag, whose works utilize surrealism", "The next Biennial should be the official Biennial of the Republic, which will take place in 2020. After the tribune of the Republic, intended to mark the fifteenth anniversary of the Republic, will open on February 1, 2020. The theme of the year 2020 will be “the dreams of the future,”” the opening of a new exhibition entitled “Dreams of a Republic,” organized by the Embassy of Japan to the United States.The next edition of the Dusan Biennial will take place in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Norman Guggenheim Jr. as its new senior curator of European art. Guggenheim will be responsible for championing the careers of artists whose work will be included in a retrospective of the artist’s most recent exhibition at the museum. The retrospective, titled “Norman Guggenheim: The Artist in the Present,” will open on April 3 and will feature work by sixty artists from twenty-four countries and will feature works that were previously on display at the museum or previously had exhibitions at MoMA.“Norman Guggenheim: The Artist in the Present” will examine", "The next Biennial should take place in 2021. In a statement on the biennial, the museum said that the project will work with the academic disciplines of art, architecture, design, and landscape to explore “the relationship between the sciences and the humanities, the future of humanity, and the relationship between art and knowledge.”\n\n\nThe Museum of Modern Art (MoMA) in New York is preparing to reopen to the public again this weekend following the opening of a new exhibition, “Un-natural History,” in collaboration with artist-activists, philosophers, and biologists, in conjunction with the launch of the museum’s new science center. The exhibit, titled “Warm,” will feature forty works by forty-eight artists in a variety of media. The work of the exhibition’s inaugural artists is exhibiting a new work by American artist and scholar Mary Roach, who will open the center in the fall.“When the number forty-eight began to change, the biennial had a new meaning for me,” Roach said. “I’ve been working towards creating an exhibition dedicated to the number forty for thirty years, and my project ‘Un-", "The next Biennial should be held at the Italian city of Turin in March 2021. \n\n\nThe Mariner Kemper Foundation and the Rosenheim KUNST Foundation have announced that they will donate ten works by renowned contemporary artists to the Kasmin’s new art museum, the Kasmin Research Center for Contemporary Art (KUNST), in Kasmin, Germany.The works, chosen by the foundation and the KUNST, will be presented through an exhibition, “The Art of Life: The Kids,” that will open in March 2020. The show will consist of twenty-one works by artists that have lived or are currently living on a planet.“The foundation and the KUNST are deeply committed to supporting and promoting artists in Berlin and throughout the world.”In recognition of their efforts, the works will be given a special facade at the museum, and the exhibition will be inaugurated by an exhibition of the works of the Kasmin Biennial, “Forbidden Fruit,” which was held in March 2018. The works will then be presented in a special exhibition, “Forbidden Fruit: The Children,” which will be presented in May 2020.According to", "The next Biennial should open in 2021. Sponsored by the Museum of Modern Art, the exhibition will feature works by ten artists of African and African American descent (AGA), and will coincide with the 100th anniversary of the Civil Rights Act. The twenty-fifth iteration of the Taft Pavilion will be staged at the Brooklyn Museum.\n\n\nThe Winnipeg Art Gallery has announced that Melissa Clift has been hired as its next director. Clift succeeds Laura Linton, who departed the institution in March after thirteen years to become the director of the Tennessee Williams Museum of Art. She succeeds Martha Chiu, who has served as interim director of the Tennessee for the past two years. Clift comes to the gallery after serving as a curatorial assistant in Carnegie Mellon’s Department of the Arts. She most recently held the position of associate curator at the Hamilton Museum of Art, where she worked on the exhibition “The Dreamers Come to Life: From the Black Revolution to the Black Lives Matter Movement,” (2017–18), the first such exhibition to open in the United States.Clift joins the gallery from the Kinz family, which has worked with the Kinz family for more than a century, where she served as the department", "The next Biennial should be held at the University of São Paulo in 2020. This year’s edition will feature work by twenty-four artists, many of whom were invited to participate by the university in the first place.\n\n\nThe Emmy-winning Canadian duo Tamara Day-Lewis and Robyn Clark, who have been working together in one capacity or another since 2013, are now collaborating again. The pair will present The Rules of Resistance, a biennial of choreography and performance that will take place in the autumn of 2022. The event will be co-curated by Masaoka Matt and Adam Dalloch and will be attended by a rotating cast of guests.The show will explore the impact of “rules”—a colloquialism used in the vernacular of Canada’s vernacular (vernacular art) and will feature work by forty-five Canadian artists—ranging from Carolee Schneemann to John Dunlop, from the New North West to the Hudson Valley, and from the Grand Canyon to the Arctic Circle.“We have been thinking about this project for some time,” said Clark. “The project has been in the works for three years but never", "The next Biennial should take place at the ART Kassel, which is currently undergoing a renovation, in the spring of 2020. The exhibition would consist of forty short stories.Advertisement Continue reading the main story\n\nGoogle and the National Gallery of Art in Boston have reached a tentative agreement on creating a new museum, the National Museum of African Art, in the city of Charlestown, Massachusetts. The institution will share the $75 million, 57,000-square-foot former site of the old Massachusetts General Hospital, which is currently undergoing a major $75 million expansion, with the city of Worcester. The institution, which will be located on the second floor of a three-tower, eight-story industrial complex, will be funded entirely by Google and the city of Worcester.The museum’s first director, Nancy Karr, spoke at a press conference held at the construction site on Thursday. “This is a historic site,” she said, referring to the former site of the former Massachusetts General Hospital. “It has the potential to be a beacon for those of us who want to see African art in a contemporary setting.”The budget for the institution, which is being built by the Los Angeles–based architects Koons, Foster", "The next Biennial should focus on “The Future of Art and Urbanism,” which is currently on display at the Taipei Biennale. The next edition of the Venice Architecture Biennale will take place in 2021. The 2020 Venice Architecture Biennale will be curated by Roberto Cicutto and Kristof Beno.\n\n\nThe US Department of Transportation (DOT) has launched a new initiative that aims to encourage the exhibition and sale of works that are made from materials that are created or produced in US cities. Called the Transportation Artist Grant Program, the initiative will give $150,000 to visual artists and $500,000 to sculpture and installation artists who are working or have worked in a metropolitan area.According to the New York Times, the program will award $1.4 million to 350 artists, artists-in-residence, and small-business owners who live or work in cities with populations between one and eighty thousand. Applicants will have the opportunity to submit one-year work in progress. The selected artists will receive $500,000, while the finalists will receive $300,000.The initiative was prompted by a petition issued by former Boston Red Sox pitcher Curt Schilling, who was featured in a 2011", "The next Biennial should be held in the Near East in 2020, and the next in South East Asia in 2021. While the main theme of the upcoming exhibition is “Ecology of Life” and will be based on a real-life project in the city of Kiaso, Japan, the exhibition will also encompass a number of historical works, including works by the artist-in-residence, the artist-lover, and the artist-hope.\n\n\nThe National World War I Museum in Washington, DC, has appointed Eric K. Jones as its new associate curator of contemporary art. Jones, who has worked at the museum since 2006, comes to the institution from the Smithsonian American Art Museum in Washington, DC, where he has served as associate curator of contemporary art since 2016. He will assume his responsibilities in January 2020.“We are truly honored to welcome Eric, who has helped us shape our curatorial agenda in ways that are not possible without his creative spirit,” said museum director John S. Alexander. “With his appointment to National World War I Museum, Eric has shown us that he is one of the most versatile and important curators in the field, and we are eager to see what he can do for", "The next Biennial should focus on integrating the collection into the local economy. The Museum hopes to organize a series of activities that highlight the work of emerging and established artists who are not represented in the exhibition. Lorenzo Tibbetts, the chair of the exhibition’s transgender committee\u0097whose first task is to choose a winner from a shortlist of seventy artists\u0097said: “The mission of the exhibition is to give some of the most established artists the opportunity to experiment with gender in a new way. We are also interested in fostering the development of new exhibitions that will include trans artists. We are working to find the balance between openness and rigour, between being honest about our vision of the exhibition and reflecting the artist’s practices.”The final phase of the exhibition will involve the exhibition of the collection in the museum’s first exhibition dedicated to the topic of gender. The exhibition, entitled “The Female Body,” will open in January 2020 and will feature thirty-six works by twenty-four artists. The exhibition’s second section, “The Male Body,” will open in March 2020 and will feature ten works by twenty-nine artists. The exhibition’s third", "The next Biennial should be in the first quarter of 2019. We are currently in the process of organizing a new exhibition, which will take place in the first half of 2020, and will soon have many exhibitions planned. \n\nThe Walters Art Museum in Los Angeles announced today that it is planning to open an exhibition dedicated to the late American designer Njideka Akunyili, the first African American woman to design the institution’s flagship museum. The fifteen-thousand-work, seventeen-minute exhibition, “Njideka Akunyili: The Fashion of the Impossible” will be staged at the Museum of Contemporary Art (MoCA) in partnership with the Museum of Modern Art in New York.“Njideka Akunyili: The Fashion of the Impossible” will be a collaborative effort between Museum Vice President and CEO Jodi Throckmorton, curator of the museum’s upcoming exhibition “Natalie Mayhew: A Fashion for Shadows” and the museum’s graduate students. The exhibition will be divided into two parts: the first portion of the show will tour the history of the fashion and will feature works by twenty-six curators from around the world. The", "The next Biennial should be held in 2020, and the dates will be shifted to avoid disruption from Florence. “We are eager to continue to work in partnership with the local communities, and to continue to present the Biennial in a way that will allow it to continue to thrive in the coming decades,” said Margot, who will resign in April. The request for a new extension of the Biennial was made last December, after Florence cancelled the twenty-fifth edition of the exhibition, which was to take place from March 22 to March 26. Artforum has reached out to the organizers of the Biennial for a statement.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of eighteen works by Joseph Beuys from Jeffrey Gibson, a Los Angeles–based collector and dealer known for his philanthropic endeavors. Beuys, an avowed collector who runs his own eponymous gallery in a former industrial building in the city, also founded the Joseph Beuys Foundation in 2009. The organization was established to preserve the collection of a distinguished Los Angeles art collector who passed away in 2007.Since its inception, LACMA has donated eighteen works to the foundation, which are currently on display in a", "The next Biennial should be held in 2020.\n\n\nThe Ottawa Biennial will now take place from September 17 to September 20. The organizers have announced that the event will be centered around the themes of community and the environment, and will offer both educational and cultural programming. The four-day event will feature presentations by twenty-seven artists, including Jodi Benitez, Leo Bech, Sohrab Mohebbi, Carol Wilson, and Mary T. Kahn, and will be organized in three stages.Stage One: September 17–September 20Stage Two: September 20–September 21Stage Three: September 21–September 21PROGRAMMING: Without a doubt, the exhibition of the exhibition is the most important achievement of the exhibition. It has been the greatest catalyst for its program, which embraces the history of visual art from the nineteenth century to the present, and it is essential for the program, which is the combination of more than ninety interviews and more than three thousand documents.“In the twenty-first century, the exhibition has become a beacon for exposing the ways in which art can transform lives and shape public attitudes,” said Jean-Denis. “It has been the virtual center of our", "The next Biennial should take place in July 2020.\n\n\nNADA North America announced today that it will hold its next edition, titled “NADA North America: Paris 2020,” at the newly renovated and restored Museo de Arte Contemporáneo on the Rue de Causses in Paris, France, from March 16–March 19. The twenty-fifth edition of the exhibition will be held at the same venue from March 20–March 21, 2020. The exhibition will be curated by curator Adam D. Weinberg and will feature works by forty-nine artists, including Joël & Paul Sousa (The State of Exile), Lafontaine (The Color of Life), Pablo Picasso (Landscape of the Garden), and Sara and Paris (The City of Ruins).Founded in 1976 by artist and collector Charles Baudelaire, biennial organizer and curator Melchior Murrell, composer and composer's grandson Brian, and filmmaker Olivier Assayas, NADA North America’s inaugural exhibition was staged at the Museum of Modern Art, New York, in 2006. The twentieth edition, staged at the Public Theater in New York in 2011, featured works by thirty-one artists, including", "The next Biennial should be in 2020. \n\n\nThe estate of the late French painter Georges Apostu’s influential series The Tasks of Man (1927–2007), which has inspired a host of imitations, is suing the artist’s heirs for $65 million, the New York Times reports. The heirs claim the estate is attempting to exclude a work by the late master, who also illustrated an exhibition of works that were on display in the 1970 exhibition “Lachette de l'Amiti.”Speaking to the New York Times, the estate, which declined to comment further, said: “These are very serious allegations. We are currently gathering information and will of course be presenting evidence to support our position.” The heirs are also seeking an injunction to block the estate from exhibiting the work, which was meant to go on view shortly after the show’s closing in 2007.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Susan Sontag as its next chief curator. Sontag comes to the institution from the Metropolitan Museum of Art, where she has served as chief curator since 2014. She will assume her post on December 3 and will begin her", "The next Biennial should take place in 2021. \n\nBurke and Steiner are the latest artists to end their collaboration with Vogue. Following a complaint from the artist, the fashion house issued an apology on February 13 for a shoot for its September 2019 issue that was filmed in the studio at the Four Seasons Hotel in Los Angeles. The apology did not address the issue of the endorsement, but it did address the fact that the upcoming exhibition was filmed in Burke’s hometown of Karlsruhe and not in the Hermès mansion.The artist’s body is not an exhibition and his work is not an album. It is an album comprised of images, spoken words, and videos. It is a work comprised of a selection of biographies, a selection of biographies that are not novels.It is a work that is constructed from images. It is a work that is constructed from the artists‰ own words.”Burke said: “I have always maintained that I am not a writer but an artist, meaning that I am a creator of images. The work is not written, but is a product of an artist’s voice. I have always been interested in the changing face of photography and the", "The next Biennial should be hosted by the City of New York in 2021 and should take up the theme “In Defense of the Heart: Gender and the Body in Art”\u0097a reference to a scene from the 1997 film The Body. The art, which will be curated by Rhys Davies, will be on view until April 1, 2020.\n\n\nThe South African Museum of Fine Arts (SAFM) in Pretoria has received $6.2 million from the Billion in Aid for Arts and Cultural Heritage (BBA) program. The funds will go toward making the institution’s facilities more accessible to the general public and increasing visitor engagement with its collections.SAFM director and CEO, Tshwane Ndzube, said the money will be used to create a new collection space in the museum, which is currently closed since November 2019 due to the Covid-19 crisis. It will also be used to establish a new program centered on art and the African diaspora. Ndzube said that the institution has been working with BBA for six months through a partnership between the BBA and the University of the Witwatersrand in Johannesburg on the design of the new 3,500-square", "The next Biennial should take place in 2022.\n\n\nThe CAAB Foundation, the American Alliance of Museums, and the National Endowment for the Arts are all collaborating to offer grants to help African American artists, organizations, and schools in the United States. The funds will be distributed in stages, with the hope that they can help defray the financial burden of future exhibitions, residencies, and other programming by black cultural institutions. “As the number of American museums that exhibit black art has declined, so has the incentive to build and present that art,” said Judith Browne, executive director of the CAAB Foundation and chair of the organization’s board of trustees. “The future of American art rests in the token’s hands of those who will honor its memory and preserve its legacy for future generations. We are grateful to the CAAB Foundation, National Endowment for the Arts, and the National Council on the Arts for supporting the work of our gifted curators and for their leadership in the fight for racial justice.”The grant program is part of a $1 trillion package that will help African Americans and other Americans of color in America, including those who have experienced racial discrimination, tackle economic barriers,", "The next Biennial should focus on the “biennial of the body”\u0097it has been suggested that the term “body art” is too broad, and that it is best understood as the art of 'having one’s body in one’s exhibition.”The Biennale will present a selection of European art from the last twenty years, curated by a group of artists led by Lars B. and Olafur Eliasson. The exhibition will run from March 7–March 10, 2020, at the Sackler Museum in New York. The first day of the event will be March 7.\n\n\nArtist Ai Weiwei’s new institute, Ai Weiwei’s New York museum, and the Solomon R. Guggenheim Foundation have announced that Ai Weiwei’s first exhibition at the new Guggenheim in 2021 will be “Ai Weiwei’s New York Museum.” The event will be staged in three phases: Artforum visited Ai Weiwei’s new home in 2019 to see how the artist is adapting his sprawling museum to serve contemporary audiences, and to learn more about how the museum will host future exhibitions and events. In order to", "The next Biennial should focus on “The Feelings of Water,” a project organized by artist and educator Andrei Shagalov. It will showcase the work of twenty-six artists in a series that will take place in the province of Kiasma, Kazakhstan, from June 3 to June 13, 2020. The exhibition will also focus on the relationship between art and language, and the history of the Kazakh language.The next exhibition will be “Aura of Life,” featuring paintings by Ilya Shagalov, who is best known for her sculptures inspired by the natural landscape of the Cordillera del Asturias, in the Spanish city of Plaza de Cultura, Madrid; the art of the Pacific, a public art project organized by artist and scholar María Berrío, in San Francisco; and the China Art Museum, an exhibition organized by the Kunsthaus in Beijing.The upcoming shows also include works by contemporary artists including Arturo Cervino and Olga Albizu, whose work is inspired by the ancient city of Izhezkaz, in the central province of Lítţrkaz; and newcomers like Julián Camarena and Alexandre Arukta", "The next Biennial should take place in 2021.\n\n\nAs part of the renovation of the former Landesbader brewery in Bremen, Germany, the MAMCOB Museum of Art in Kassel is planning to build a new exhibition space in the former brewery next to the Landesbader campus. The new space will be 600 square meters (1,200 square feet) and will be located in the courtyard of the MAMCOB. It will be comprised of three floors upon which a theater, a restaurant, and a guest house will be installed.The new exhibition venue will be inaugurated with an exhibition “Itsy Bitsy: Russian Art from the Soviet Union” (under the title of “For the Soviet People”) in 2021. The exhibition, which will showcase the works of seventy-four artists, will showcase the work of eighty-four Soviet artists. Titled “The Right Hand,” the show will also present the work of artists who were active during the Cultural Revolution such as Witold Ostrovsky, Aleksandr Solzhenitsyn, and Alexei Kuzma. The MAMCOB’s archives will also be renovated.Inaugurating the new exhibition", "The next Biennial should be held sometime in 2021. The project, titled Art and Memory, was founded by Professor Jean-Jacques Bière and François Prouvé to assess the impact that art and memory have on memory and the soul of the artist. The theme of the exhibition was “Theatre, Memory, and Art” and the show, which consists of a series of interviews with artists and scholars, will run until May 29. The biennial was first held at the Saint-Louis Museum of Art in Paris in 1972, and the theme of this edition was “[painting] and its art.” The exhibition opened on March 1, 1973, and the last exhibition of the exhibition was on March 28, 1973. The exhibition will mark the fourteenth anniversary of the biennial, which will be held in May 2020. The twenty-first Biennial of a painter will be held at the National Museum of Fine Arts, Tokyo, in 2021. The twenty-fifth Biennial of a sculptor will be held at the Museum of Fine Arts, Washington DC, in 2020. The twenty-eighth Biennial of a dancer will be held at the Museum of Contemporary Art, San Francisco", "The next Biennial should be held in the Spring of 2020, the organizers have announced.\n\n\nThe Kinz, the contemporary art museum in the Austrian capital of Vienna, has appointed Peter Schäfer as its new director and CEO. The appointment was made official on Wednesday, March 3.Schäfer comes to the institution from the Amsterdam-based Contemporary Art Foundation, where he has been the director since 2016. He succeeds Joachim Bayer, who has been with the institution for more than twenty years and was also recently promoted to director of the Schäfer/Forschung collection.“It is with great enthusiasm that I take the helm of the Schäfer/Forschung collection,” Schäfer said in a statement. “I have had the pleasure of working with both Erika and Klaus and could not imagine a better partner to build on their legacy and to extend it to the new century. Both Erika and Klaus are exceptionally talented, committed and determined. I am confident that they will be able to support the new leadership of the collection and I look forward to contributing to their creative and institutional development.”Inaugurating the König–Miltenberg collection, which was combined with the newly", "The next Biennial should be held in 2021. The project was founded by David and the late British architect Sir David Adjay and presented by the British Foundation in recognition of its contribution to the development of contemporary art. The inaugural exhibition, “The Future Is Present” will celebrate the final years of the present exhibition series as well as will offer a retrospective of a work that was on display for the longest time, “KIDNAPPED.” Adjay, who was ousted from the panel for “The Future Is Present” in 2017, sued the British Museum in Britain in 2017 for damages, but lost the case.According to the Guardian, more than ten thousand people have signed a petition in support of the decision, which was announced on Monday, March 15. It is an attempt by some who believe the institution has deprived the public of another “decade of art” in an attempt to deflect attention from the current crisis.Adjay’s legal team has attempted to discredit the decision by arguing that the museum is trying to “hide” the fact that the exhibition was never cancelled or resumed for another two years. “The Future Is Present” will be staged at the Centre Pompidou in", "The next Biennial should happen in 2021, but the project will be revived in 2021.Hales announced that it plans to open a museum dedicated to women artists in the city, and that a new exhibition dedicated to the work of women artists will be presented in the fall of 2021. The show, titled “This Is Not Your History,” will feature more than 150 works by thirty-seven artists—including Nari Ward, Nell Dorr, Marie Brennan, and Lise Obelançé—and will be organized as a “mini-lecture series.” The talks will begin in January and conclude in March.The announcement coincides with the opening of a new series of biennial exhibitions at the Art Institute of Chicago. The Art of Life, which will run for three weeks in the fall, will be titled “Why Women Make Art.” It will feature work by twenty-three artists, including Nari Ward, Amara Bara, Monir Shah, Antoinette de la Peau, and Agnieszka Brzezka, as well as a preview of “Ella and Eve” by Harald Szeemann and the Royal Academy of Fine Arts in London. The", "The next Biennial should inaugurate the exhibition “The Art of Living,” which will highlight the Diwali festival, which will be inaugurated by the Indian artist Raksha J. Dhar, and will be on view through April 26. The event will also highlight a long-overdue restoration of the Italian Renaissance Museum in Venice, which will be completed by the end of the year. The Italian Pavilion will be inaugurated by the Italian artist Dino Lavalletti, who will present a new series of paintings at the museum. This year’s exhibition “The Future Is Present,” will take its themes from life and its places in the environment and will run for twelve weeks. The biennial will also be on view through November 18–March 21, 2020. “It is the great privilege of the museum to present the twenty-eighth edition of the Diwali Triennial,” the institution said in a statement. “The Diwali Triennial is an adventure that will challenge us to reflect on our place within the world and to recommit to the art of our lives, which has been entrusted to us by God.”\n\n\nThe Brooklyn Museum has received a gift", "The next Biennial should be held in the spring of 2020.\n\n\nThe Museum of Contemporary Art (MCA), New York, has appointed John Lutz as its next director. Lutz will assume his post in January 2021. He succeeds Carol Augustine, who became the MCA’s interim director following the death of the current director, Joseph Henrich.“John is an accomplished curator and scholar who has had a long and distinguished career at the MCA, having helmed the institution from its inception as a New York–based arts space in 1967 until her retirement in 2007, when he was appointed interim director,” said director Robert Schier. “Together, John and Carol have shown the MCA’s skills and commitment for the past thirty-five years, and we are eager to continue to develop and support the MCA’s artistic, educational, and community programs.”Prior to joining the MCA in 1983, Lutz served as the director of the conceptual program at the Zaha Hadid Museum in Beijing and was a guest lecturer at the DePaul University Art Institute in Chicago, where he received his MFA. In 1999, he and Carol founded the MCA’s Center for Cultural Innovation.", "The next Biennial should be a step in that process.”The full list of participating artists is as follows:ArtistsSebastian Seel, New York, NYSara J. Terry, New York, NYAdrienne Edwards, New York, NYTom Goldstein, New York, NYMarnia Wheeler, New York, NYTanya Rubin, New York, NYTudor Laib, New York, NYRik Wolk, New York, NYJoshua P. Mone, New York, NYEdgar Alvarez, New York, NYKristen D. Harrison, New York, NYZarina B. Greenberg, New York, NYEddie Nygård, New York, NYTanya Rubin, New York, NYShirley Du Maurier, New York, NYKarolina Luschini, New York, NYBeth Revis, New York, NYKathleen Lee, New York, NYLukasz Kupka, New York, NYSara Krumholz, New York, NYSara Horne, New York, NYJulia Tutti, New York, NY Michael Lees, New York, NYValeria Nava, New York, NY", "The next Biennial should take place in 2021.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released a decision that will allow the Metropolitan Museum of Art and the Bronx Museum of the Arts (BMO) to open on September 9. The two organizations are still working on setting up their grand opening weeks, but the DCLA’s announcement states that both institutions will remain closed until at least August 29, 2020.Founded in 1970 by the late Polish–American architect Ludwig Kahn, the Museum of Modern Art (MoMA) in Manhattan has served as a cultural hub for New York City residents and visitors since its inception. The institution, which recently underwent a $200 million revamp, welcomed visitors in 1992 and closed in 1998. The museum reopened in 2015, and it has since staged more than eleven hundred exhibitions, including “Wangechi Mutu: From Nation to Museum” (2017), “Anne-Marie: The Proletarian” (2016), and “Marco Cerruti: An Exploration of the Holograms” (2017).MoMA will celebrate its seventy-eighth anniversary in 2021 with a special exhibition of work by forty-three artists, including Frank Gehry", "The next Biennial should be held in 2020. ŜWe are not going to stop, nor will we ever stop working towards the creation of more work by the best and most international artists, and will push forward with new initiatives that benefit the public in the cultural sector,” the museum said in a statement. Commenting on the commission, Biennale director Martin Bochereau said: “This is an extraordinary collection assembled in an astonishingly short amount of time. It is not an ordinary exhibition, but a very ambitious exhibition. The collection and exhibition is a celebration of the richness and diversity of the art world and is rooted in the history of the Biennale as a global phenomenon.”The exhibition will now go on display at the Museum of Contemporary Art, Atlanta.\n\n\nThe National Museum of Scotland is planning to move its major exhibition “The Creation of Modern Art” from its current location at the National Museum of Scotland (NMAS) in Edinburgh, which opened in February 2019, to the National Museum of Wales, Cardiff. The move follows the announcement last month that the show would move to Cardiff from Edinburgh. “This is an important step for our future, and a momentous", "The next Biennial should be held in 2021, the ICA said. Last year, the event took place in October, the month that commemorates the Black Death.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Jennifer Rosendahl as its next executive director. She succeeds Christopher Wool, who retired in May after a decade at the helm of the museum.“We are thrilled to welcome Jennifer to MoCA “where she will have the opportunity to lead through a reimagined museum at a time when art museums are reaching for a new low,” said Shira Schechter, interim director and CEO of the MacDowell Colony. “With a background in media arts and a passion for art, she embodies the vision and energy of MoCA. We look forward to working with Jennifer to ensure the future of this visionary institution, and to building on her legacy with future generations of MoCA visitors and visitors to the museum.”Rosendahl comes to MoCA from the Sidney and Willie Moulton Museum of Art in New York, where she has served as a curator since 2016. During that time, she collaborated with students in the school’s Curatorial Program on a", "The next Biennial should be held at the Shard. “We have long since ceased to be observers in the production of art,” said Mark Johnson, the institution’s director, after the inaugural exhibition, “Ateliers-Montparnasse,” which ran for fourteen days and twenty-four hours. The exhibition, which presented work by fifty-two artists, including Felicity Hammond, Agnes Martin, and Frances Stoneman, was accompanied by an extension of the biennial, “Ateliers-Giard,” which opened at the Stedelijk Museum in Amsterdam in April.  Ateliers-Giard’s director, Reinhold Messner, said: “We are very much looking forward to the new exhibition that will be inaugurated at the Biennial by Francis Ford. Francis is a contemporary artist who has so successfully integrated contemporary art with the ideas of the past. He is the perfect person to start this new edition of the Ateliers.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced that it plans to indefinitely suspend the exhibition “Red Hot Red Hot: Inside the AIDS Epidemic,” which", "The next Biennial should take place in 2019. If you are interested in becoming a series sponsor please contact us.  I have enjoyed doing work for the museum over the years, and have been lucky enough to work with some of the greatest artists of our time. I look forward to continuing to support the arts in the current exhibition venue, as well as collaborating with the community in bringing their works to life through my own works in the new exhibition space.”\n\n\nThe British Museum in New York has appointed Laura Schell as its next director. Schell comes to the institution from the South African Museum of Art (Sampans), where she has held the position of chief executive officer since 2018. During her tenure at the institution, she expanded the museum’s collection by adding new exhibitions and collections, executed major fundraising initiatives to support the development of new scholarship and the collection, and organized over seventy events, including the forthcoming sérénie.“Laura Schell is a passionate curator who has been at the forefront of the museum’s cultural conversation for thirty years,” said Nick Berlant, head of the museum’s Board of Trustees. “Her passion and energy are in intimate contact with the mission of", "The next Biennial should take place in the third city and the fourth in the fourth city, and it should be on the same date and on a different site.”The bids for the 2019 event will be open on September 23.\n\n\nThe Los Angeles County Museum of Art (LACMA), the Museum of Contemporary Art Los Angeles (LACMA), the Museum of Contemporary Art Art Los Angeles (LACMA) and the Museum of Contemporary Art San Diego (MCA) are teaming up to raise $30 million for their ambitious redevelopment plans. The museums will jointly construct six new exhibition spaces in the Los Angeles Art Museum and the Los Angeles County Museum of Art, and will collaborate with the nearby Santa Monica Museum of Art to make Los Angeles’s Chinatown a World Heritage site.“For years, LACMA and LACMA’s board of directors have been committed to creating new opportunities for local, regional, and national artists by developing programming that engages with local communities,” museum director Michael Govan said. “This is a historic moment, and we must seize it. LACMA and LACMA’s board of directors are excited to make this possible.”The partners have jointly developed a", "The next Biennial should be held in 2021. Click here to view a map of the lecture series.  At this year’s event (October 29–November 4), Panzhir and I participated in a panel discussion on liquid politics organized by the artist. The discussion covered the current state of the art in the field, the importance of cultural organizations in supporting liquid politics, the political dynamics of the art world in the last two decades, and the future of the Liquid Politics movement.  The exhibition will feature work by seventy-five artists, including Kori Schock, Paul Hlavsej and Mark di Suvero, and will be hosted at the Art Museum St. Petersburg from November 5 to November 8, 2020.\n\n\nThe London-based artist and educator Nereka Sitchin, whose practice encompasses sculptural interventions, performance, performance-based work, and performance-based policies, has won the 2019 Billie Jean King Award. The biennial, entitled “Reflections,” will run for eleven weeks in February 2020 and is part of the artist’s ongoing project to reframe the concept of reflection in order to promote a more holistic understanding of the world.“I’ve been", "The next Biennial should take place in 2020 and will comprise four exhibitions of works by artists from four continents. The exhibition will be organized under the theme “The Future of Art” and will take place at the National Museum of Australia (NMA), in Canberra. The exhibition will be divided into three archival periods: the “epoch of art” (1973–1979), the “epoch of art and art history” (1979–2013), and the “epoch of art and its history” (2013–2020).The third exhibition will be “The Future of Modern Art” and will be staged at the National Gallery of Australia (NGA), in Canberra. NGA staff have admitted that the museum is currently seeking new funding for the next two years.\n\n\nThe Palace Museum in London has received a $10 million donation from the estate of the late British artist David Hockney, who passed away in London on April 8 at the age of eighty-six. The gift includes a collection of sculptures, drawings, and paintings that were created in his studio between the years of 1941 and 1941, and one of his last works, a sculptural tribute to his late wife, the British photographer Jane", "The next Biennial should take place in the spring of 2022, and will be led by the same curators who will be responsible for the past two editions. The inaugural exhibition was curated by the curator and art historian Laura Mulvey.The 2019 edition of the Biennial was held at the Newcastle Art Gallery, Newcastle upon Tyne, in the United Kingdom. The exhibition featured work by sixteen artists who are represented in the 2017 edition. The first special exhibition of the twenty-first century, “The Fluxus Project: Art in the Age of Black Lives” (2017–18), was staged at the Fluxus, and the first show of art by twenty-seven artists in the United States was “Freakshow: From Paris to San Francisco” (2017–18), which opened on the Paramount Renaissance, a retrospective of the work of seventy artists in Venice. The exhibition “Themes of the Film,” which was curated by Nari Ward, will open at the Museum of Modern Art in New York in six weeks. The first Biennial of African American Art will take place in October 2022.\n\n\nThe museum’s collection of more than two hundred works by artists who have never been on display in New York", "The next Biennial should take place in the future, but the organizers have postponed it until May 2020. The 2019 edition was canceled, and the organizers announced that the event would be relocated to the Great Hall of the Estonian Parliament. The future of the exhibition is uncertain.\n\n\nThe Carnegie Museum of Art in Pittsburgh, the Museum of Fine Arts Boston, and the Metropolitan Museum of Art in New York have announced that they will not renew their leases with the same company that owns the landmark Art Deco building formerly known as the Gingerbread House. The ­autonomous museum in the city of Pittsburgh and the Met are currently at the center of a massive legal battle over the lease of the historic building, which was purchased by the Southwestern New York company, Diller Scofidio + Renfro, in 2011 for an undisclosed sum.The Southwestern New York Company (SNOC) leases the building from the federal government, which intends to demolish the historic Gingerbread House in order to build a new Metropolitan Museum of Art in the former warehouse district in October 2020. The new museum would consist of a two-story converted warehouse and would feature an exhibition space, offices, and a public courtyard.In March, the federal government filed a lawsuit against", "The next Biennial should be in 2021. For the Southern Egypt Museum in Luxor, the works featured in the exhibition will be restored and in the public domain. The next exhibition at the Museum of Modern Art in New York will take place in 2022. Last year, the museum announced that it would inaugurate the Fifth Biennial of Egyptian Modern Art with a spectacular display of the work of the same name by the internationally acclaimed Egyptian artist Madine El-Khoury. The exhibition was designed by Katherine Fletcher and features works by more than thirty artists. The institution is also planning to launch a new online portal for the Egyptian Museum of Modern Art in order to make the exhibition accessible to a wider audience.\n\n\nThe Metropolitan Museum of Art in New York has received a gift of twenty-two works by artist Hito Steyerl, a German-born, Swiss-based collector known for his lavish display of works by postwar and contemporary artists, including Georges Apost and Peter Andre. Steyerl’s son, Stefan, who also founded the international art museum, on Saturday announced the acquisition, which was made through a group sale with Anton Kern Gallery in Los Angeles.Steyerl paid $5.5 million for the works,", "The next Biennial should inaugurate with a performance by the legendary Canadian choreographer and singer-songwriter, Marc-Georges, who is known for his complex, movingly choreographed installations, often involving light, sound, and body. “Theater is the world,” he said in a 2015 interview. “It’s where we live, how we move, and how we live.” Cahn, who is also a professor of art history at the University of Toronto, and Sari Buhle, director of the Biennial, said that the theme of their show, “Affects of the Body,” will be directly connected to the work of the artist.\n\n\nThe New Museum in New York has appointed Andrea Rios, a curator and art historian who has worked for the institution since 1977, as its next executive director. She will be responsible for steering the museum through a multi-year renovation and expansion project that will add more than 1,000 square feet of exhibition space and expand its campus.“The New Museum has been a conceptual and institutional hub for artists and communities in New York City since it opened in 1984,” said Mark Lubell, the institution�", "The next Biennial should focus on a “decade of feminist feminism” and its legacy, in order to highlight the work of women artists of the twentieth century, “from Adrienne Esposito to Barbara Hambly.”\n\n\nAn exhibition of works by the late Nigerian artist Arifuka Ndzube, which was on display in London’s Tate Modern from April 2 to April 4, will be on view at the Rashtriya Swayamsevak Sangh (RSS) in New Delhi from May 29 to May 31. The show, titled You and I’ll Live Forever, will feature Arifuka Ndzube’s The Dollhouse, 2019, her fourth studio exhibition, which was held at the New Museum in New York from April 1 to March 31. The show is organized in a way that will allow the audience to follow Ndzube’s journey from the Nigerian artist to the Indian raison d’etre as she explores gender identity through dance, painting, performance, and sculpture.Ndzube’s work—whose first solo exhibition in Nigeria was at the Museum of Modern Art in Abuja in 1976—", "The next Biennial should take place at least five years from now: \"Art and the Rise of Modernism,\" slated for March 2021, will be held in London in March 2020 and will be preceded by a “portrait in light” solo exhibition taking place in September 2020. The show will also feature a “conceptual exploration of the use of light as a tool for social change” and “radical new perspectives on the relation between art and activism.” During the event, which will run until March 20, 2020, the museum will be transformed into a great hall for exhibitions, lectures, and other programming. The exhibition will also include a series of performances by artists such as Jen-Hsun Huang, Tundra Sasura, and Jonatan Garthwaite, plus a “post-art exploration of the relationship between technology and our lives” and “art in flight: an immersive virtual reality experience” (see the full list of exhibitors here).The 50th Anniversary edition of the Sundance Film Festival will be held at the Biennial in May 2020. \n\n\nThe Metropolitan Museum of Art has announced that it is planning to open a new gateway exhibit on the life and art of Pablo Picasso", "The next Biennial should take place at a location and in a manner that benefits the City of Portland. For now, the City has asked Tallinn to consider the proposal.The exhibition will be hosted by the city of Tallinn at the Geirskampske Winter Park, which is currently undergoing a $25 million renovation. The project will also include the construction of a new 21,000-square-foot museum dedicated to the collection of contemporary art. The exhibition will examine the relationship between art and culture in a number of European countries and will focus on the influence of the art-world in contemporary life in the Baltic States.“We believe that the next Biennial will provide a platform for contemporary art to engage the public in Tallinn and in the world in general,” said Mayor Jane Greaves. “The City of Tallinn is dedicated to supporting the creative and cultural activity of the city and region, and we hope that visitors to our city will feel that they have a place in the exhibition.”\n\n\nThe Schlesinger Foundation has announced that Andrea McClellan as its new executive director. McClellan succeeds Ann-Marie Lazbers, who has been the foundation’s chief executive and director since 2016 and will begin", "The next Biennial should be in 2021.\n\n\nThe United Kingdom’s Houses of Parliament, which are currently debating whether to set up a new agency to manage the country’s cultural heritage, are preparing to vote on whether to create an independent agency. The legislation to establish the new agency will be passed by Parliament in the coming weeks and will likely be enacted by June.The House of Lords culture, heritage, and science committee, chaired by Lord Macdonald of Kirkintilloch, has proposed that the UK’s National Heritage Heritage Heritage Fund (NHF), which will receive £9.7 billion from the UK’s sovereign wealth fund over the next ten years, be restructured to maximize the collection’s ability to be reused by the public—a proposal that has been opposed by some conservation groups and conservation organizations, including the Union of Concerned Scientists (UCS), which has called for the fund to be wound down. However, the committee, which also includes Lord Salter, Lord Macdonald, and Lord Hutton, chairman of the British Sculpture Trust, has stated that it is open to debating the future of the NHF and its funding.The vote on whether to dismantle the NHF is expected to", "The next Biennial should take place in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Oakland, California, has named Jennifer Egan as its next executive director. The twenty-nine-year veteran board member, who has served as interim director since September 2019, was previously the executive director of the Whitney Museum of American Art in New York and the architect of the former Whitney Museum of American Art.“Jennifer is an extraordinary leader and has demonstrated a remarkable ability to foster an environment of collaboration and understanding among colleagues and staff,” said Marc Glimcher, chair of the board of trustees. “Duane has been instrumental in building the MoCA brand and in attracting a wide and diverse group of artists to Oakland. Duane has led the museum through numerous expansions, and he is one of the few people in the world who has consistently done a phenomenal job leading a museum through an expansion without the need for a board of directors.”Prior to joining the Whitney in 2015, Egan served as the director of arts and culture at the Ruth R. Marder Collection in Los Angeles. During her tenure at the organization, she oversaw the acquisition and renovation of the museum’s William S. Burroughs art museum and", "The next Biennial should be the biennial of ideas, with the line-up of the first editions of the series The Embedded and Its Evolution and The Spatial Battlefield.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Laura Owens as its next director. In her new position, she will assume the role from Kathryn Edin, who departed in the summer of 2019 to head the Metropolitan Museum of Art in New York.“Laura is a seasoned leader who has built a strong record for the MFA as we have grown to become a significant center for the study and appreciation of African art,” said David Crockett, interim director of the museum. “She has an excellent record of preparing and delivering on MFA’s mission to foster a robust, interdisciplinary digital academy, and she is committed to working with our talented staff and the community to cultivate a more sustainable future for the museum.”Prior to joining the MFA, Owens worked as the executive director for Creative Media Arts, a nonprofit public arts incubator in the South End of Boston. During her tenure, she developed programs such as the MFA Digital Academy, an online program that engages with thousands of people each year to teach them about the", "The next Biennial should be held in 2022, and a further one in 2024. We look forward to future collaborations with the premier museums across Europe and Asia.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it has received a gift of four hundred works by twenty-seven artists spanning five centuries. The donation includes works by Albert Adè, Caravaggio, Guggenheim’s David H. Guttenbach, Pierre-Auguste Renoir, and Anna Atkins. The institution also announced the selection of twelve new works by young and emerging artists, including Aya Hoch (Chicago), Fernando Barajas (New York), and Susana Cáceres (New York).In addition, the institution received a gift of forty paintings by twenty-three artists, including Mark di Suvero (New York), Julian Grosvenor (New York), and Louise Bourgeois (New York). All twelve works will be presented in a triple exhibition, “Pinards From the Past” (2019), “Paintings From the Future ‘The Present’ (2019), and “Color In The Time of Sculpture” (2019).\n\n\nThe Natural History Museum", "The next Biennial should be held at the New Museum in New York on December 8–10, 2020. The 2019 and 2018 editions of the exhibition were staged at the San Francisco Museum of Modern Art (SFMoMA), and the 2017 and 2016 editions were held at the Turner Contemporary in London. The first iteration of the exhibition was created by an innovative collective led by David Adjay and Pierre Omidyar, who met through friends and developers of creative technology, who came together to create a platform for artists to collaborate and share ideas. The exhibition was awarded the prestigious Venice Prize, which honors institutional participants in the arts. The first exhibition of this kind was staged at the Diller Scofidio + Renfro–designed Tate Britain in London in 2014, the year of its reopening. In addition to the two exhibitions, the 2019 edition of the Biennale of London also received the prestigious £500,000 GSMA Link Award, which was presented to it by the Tate.\n\n\nThe 2017 edition of the forty-eighth Venice Biennale, curated by Jann Marden, was postponed until next year due to the Covid-19 pandemic. It was originally scheduled for March 23–March 28,", "The next Biennial should lead with a number of new works by artists of color as well as the first museum-scale exhibitions of work by indigenous artists, such as the first exhibition of work by artist Salaia Brasileira.  “We are working to make the institution more welcoming to all communities,” said Artnet editor-in-chief Simon Ooster, who has covered the museum for many years. “The Biennial is not a monolithic institution that is dedicated to white aesthetic ideals and that has predictive powers about what a museum should look and feel. It is a place where artists, scholars, and collectors come together and work collaboratively.” The museum opened in 1921 with the launch of the artist-run biennial by German Jewish designer Heiner Lüttges. The exhibit, which included works by twenty-four artists, was staged as part of a groundbreaking collaboration between Lüttges and the British architect Frederic Legrand that opened the first exhibition of Brazilian artist-designed buildings in New York in 1928. In the same year, the museum also introduced the world to the work of a group of Brazilians known as the Palmas de Campos (Landmarks of the Past), who created the Columbia City Modern", "The next Biennial should take place in September 2021 and will launch with a retrospective of the artist-centered murals by the team of the Beyeler Foundation, which was established by artist and billionaire Amada Cruz, and will be led by Oscar-winning director Pedro Alves.\n\n\nThe Beijing-based academic artist Ai Weiwei, whose abstract, painterly, and sometimes surrealist sculptures explored media and ideology through the lens of Chinese modernism, has died at age eighty-one. Through his use of free-form, unpainted, and abstract paintings and drawings, Ai drew attention to the influence of Chinese modernism on American artists and art critics.Born in New York City in 1941, Ai grew up in the city of Tiananmen (1992), where he studied at the New School. Following a stint at the Art Institute of Chicago, he went on to study at the University of California, Berkeley, where he received his bachelor’s degree in 1950 and his master’s degree the following year. Following a year-long stint at the Art Museum of California in 1971, Ai returned to New York to complete his studies at Columbia University, where he received his master’s degree in 1972.His first museum exhibition was at", "The next Biennial should open in 2022.\n\n\nBack at the Museum of Contemporary Art (MoCA), California, a group of artists and activists are demanding that MoCA board member Christopher Wool, who departed the museum last May to head the nonprofit Center for Art and Culture in Los Angeles, be reinstated. “MoCA’s board members should be allowed to decide whether to keep Christopher Wool on as chair; should be given the opportunity to recall or remove a board member; and should be legally required to recuse themselves from hiring and firing,” reads a statement by the group Statement of Concern. “We demand that MoCA board members regain the democratic right to make appointments and that they cease discriminating against their former employees.”According to the Los Angeles Times, the board removed Edward Lucas, a former security guard who was the center’s director of communications, and his wife, Michelle, from their positions last March following a complaint filed by a former staff member.Leigh Anne Boswell, a former board member and the executive director of the Los Angeles chapter at Artforum.com, told the Los Angeles Times that the board initially tried to make a deal with the former staff member but that it ultimately decided to fire them. �", "The next Biennial should aim to re-emerge as a viable medium for “direct democracy” in the digital age by combining the best of independent, artist-run and state-backed art museums with the free flow of ideas and exhibitions.“The 'new Spain’s premier contemporary art museum,” said the country’s cultural minister, Ana Navarro. “The museum will be a monument to the country’s rich and diverse heritage, a museum of the past that will promote and celebrate Spain’s rich history, but also reflect the spirit of our times and the spirit of the future.”Since university students take courses at different academies, it is difficult to know where a given institution stands on a given topic. Artforum spoke to several students who said that the institution’s position on climate change is a point of contention between them and their teachers. But in a recent Artforum article, Alex Gartenfeld, the curator of the exhibition “Climate War: Art and the Politics of Climate Change” and the author of the forthcoming documentary “Climate Hustle: Art and the Politics of Fashion” told Artforum that there is “a real amount of tolerance”", "The next Biennial should be on the National Gallery of Canada’s curatorial priorities, curated by a Canadian curator, and curated by a leader in the field.  The next edition of Art Biennials will take place at the Art Gallery of Ontario, curated by a curator from the United Kingdom and curated by a Canadian curator.This is not the first time that the Toronto-based artist has received the National Gallery of Canada’s Art Award. Last year, he was awarded the Royal Ontario Society’s Lifetime Achievement Award for his work Ashes of the World, a collaborative exhibition with the Royal Society of Canada and the Ontario Museum of Art. In 2007, he was elected to the Order of Canada for lifetime achievement.\n\n\nThe Carnegie Council for the Arts (CCA), the Carnegie Foundation, and the National Endowment for the Arts (NEA) have announced the winners of the Octavia Butler Memorial Award for Broadcast Journalism, the Charles Ferguson Memorial Award for Criticism in the Visual Arts, and the Parls-Dorothy Sargent Award. The Octavia Butler Memorial Award will be given to the late Pulitzer Prize–winning journalist Octavia Butler and will be presented", "The next Biennial should take place in 2019 and is currently in development. “The Future of Art: A Biennial for Art,” will be presented by the Kunsthalle Basel in Basel, Switzerland, with an exchange program led by the Kunsthalle Bern in Bern. The exhibition will include works from the exhibition “The Future of Art: ‘The Limit’’ and will highlight the emerging field of 'mathematical aesthetics’\u0097a term coined by Eduard Dietrich von Kleist and Kunstverein Frankfurt in 1923\u0097that is, painting and sculpture.The exhibition will tour the history of art and the history of science to explore the role that mathematics can and should play in the pursuit of art and culture. The show will also feature a retrospective of the work of the late French architect Pierre Huyghe (1957), a selection of work by the late German sculptor Ludwig Pecote (1963), and a selection of works by the late Japanese architect Hitoshi Miki (1968).Featuring works by K. R. Keller, the German architect and designer whose work incorporates elements from the ancient and modern worlds,” the first biennial will", "The next Biennial should be held at the Museum of Contemporary Art (MoCA), New York, in 2021. The exhibition will be themed “Battles of the Imagination: New Art from the Americas” and will focus on “First Men”\u0097a contemporary Native American work\u0097and “Rafael Alghier: The Artist and His Work,” a work by Alghier that explores the role of artists in contemporary society.\n\n\nThe Global Alliance of Arts and Cultures (GAC) has launched a new fund aimed at supporting cultural workers in the fight against the coronavirus, which has reached over 3.5 million people in the world’s largest country, China, and has been linked to the death of at least 29 people in China’s Guangdong province, where most cases have been reported in Fujian province. The fund, which launched in January with a goal of $1 billion, will provide funding and resources to artists and cultural workers in the six countries that have experienced the coronavirus outbreak: Belgium, Brazil, China, France, and the United Kingdom. The fund will also provide funding and resources for “CANCORVIDE the WORLD", "The next Biennial should be held in the spring of 2022. The biennial will feature a collection of over 1,000 works, and will draw from the current portfolio of the artist-run organization/museum, which was founded by editor-in-chief Marta, and will address contemporary issues of diversity and exclusion.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Nadim Zahra as its next director. Zahra currently serves as chief curator of modern and contemporary art at the museum and is the founder and head of the nonprofit, the National Gallery of Art/National Gallery of Art in the Arts (NGA) in the District of Columbia. He succeeds Christopher Simpson, who has helmed the institution for more than twenty years and will take up his new post on January 5.“Nadia fits the National Gallery’s unique and compelling story perfectly,” said director Mary V. Guggenheim. “Her expertise, passion, and enthusiasm for art, the arts, and culture are contagious, and she will bring the experience, knowledge, and vision to bear on our mission to serve the American people and region.” Zahra previously served as the director and curator of the exhibition “", "The next Biennial should be held in the city in 2021, with the construction of a new museum slated to start in 2022.The project, which is supported by the city of Bienniti, has faced some opposition from some local residents. After the architect Kiyoc Hodges designed a museum for the city in 1998, he was awarded the right to design a new city hall in the city. He chose the modernist Rathman Pavilion, designed within the grounds of the city, as the venue for the exhibition.“Wangechi Mutuo’s symbolism is of a distance, of energy, of light, of sound, of movement, of thought, and of the transformative power of the art of the body,” said architect and city mayor Erma Aoki, who was appointed by Queen Elizabeth II as the city’s mayor. “This exhibition is a way to reflect on this distance, and to explore how that physicality, and that distance, might be recreated in a new, contemporary city.”\n\n\nIn an unfortunate development for the New York institution, the cultural center Simon Westmoreland, which has served as the home of the University of Rochester since 1936, has received a shocking $"]