["The next Biennial should be a sort of gathering of these artists together to see what they may be able to produce. The project will also include the acquisition of artworks by a group of twenty-six artists who are currently incarcerated in the United States. The biennial is being organized by the Gerber Foundation, the Vera Institute of Art, and the Black-Chocolate Alliance. Earlier this year, the foundation, which has supported the work of incarcerated artists in the US since the 1990s, announced that it would establish a new award for the first time. The mission of the new award is to support artists who are facing imprisonment in the US, as well as their families, in an effort to highlight the impact that mass incarceration has on communities. The announcement was made this week by the Gerber Foundation, which has been supporting the development of art and other cultural projects for artists incarcerated in the US since at least 2008. The foundation received $148,000 to support its work for the first Biennial, which will run from March 15 to March 17, 2020. Last year, the foundation decided to cancel a physical exhibition in protest of the US’s mass incarceration policies. The commitment to supporting artists goes beyond works in the bi", "The next Biennial should take place in May 2021. The institution will offer free admission through the biennial’s opening week, and will present the first exhibition within the biennial, “The Fetish Experience.” As the modern and contemporary art biennials move forward, the city of New York is preparing to welcome visitors from six major metropolitan areas—New York, Boston, Chicago, Los Angeles, and New Orleans—as well as from fifteen other countries.Among the works that were on display in the exhibition are work by artists such as David Salle, Paul Gauguin, Frank Stella, and Pierre-Auguste Renoir. The exhibition also featured the work of fifty-seven lesser-known but internationally acclaimed artists, including Virginia Overton, Robert Irwin, Judith Ross, and Lee Hsien-chiu, among others whose works have recently been included in the forthcoming exhibition “Pareto” (Pareto di Cassino, 2019), which will open in September.A new public art exhibition organized by the city of New York will open in New York City in May 2020. The show, titled “New York: A Documentary,” will showcase the work of seventy-four artists, including", "The next Biennial should be held in 2020. Among the recent works to be curated by the, of the artist-run nonprofit GEO Group are “The Moral Landscape: Art and Virtue in a Time of Rejection” and “Wong Wai Yin: The Evolution of an Idea.”\n\n\nTHE MASONNAIDS, a New York–based collective of contemporary artists who are based in the Bay Area, have announced their candidacy for the 2019 Pulitzer Prize. The group, which includes artists such as Stefano Bignoli, Nari Ward, and Marisa Takala, has won the honor in the past three years, and its selections have been published in the January 2020 issue of Art in America.“These artists have created a new kind of work, a work that allows a viewer to feel its effects on the body, on the soul, and on the environment,” Pulitzer Prize–winning editor-in-chief, Christopher Knight, said in a statement. “They have touched on issues that have become hot topics of our time—climate change, transgender, and New York City politics—and brought them to life in inventive and compelling ways.”The 2019 Pulitzer Prize jury, which consists of", "The next Biennial should be hosted by the Institut für Kunst- und Kunstbau, the Nationalgalerie, and the Center for Contemporary Art Berlin, along with the South Museum of Art in Paris. The 2019 edition will feature work by thirteen artists, including Clement Berg, Sacha Baron Cohen, Eduardo Boniello, and Lea Baldwin, and will run from May 3 to April 17.For a full list of participating artists, click here. \n\n\nUnseen Gallery, which has locations in New York and Paris, is adding seven new artists to its roster, bringing the total number of artists represented by the gallery to twenty-five. The artists are Laurence Benhabib, Kamel Magari, Shani Barra, Callum Berger, Rirkrit Tiravanija, and Marcin Wojtaszek.Called Moving Images, the exhibition will feature work by twenty-seven artists, including Mihai Csikaru, Kwanza Dziewior, and David Isaacs. The event will also offer a public lecture at the studio of the Swiss architect Bertrand Goldberg. The show will take up topics including what it means to be alive and what it means to be an artist in", "The next Biennial should be held in 2020, and the exhibition should open in the autumn of 2020. The exhibition will feature twenty-four works by less-known and underrepresented artists, and will be held at the Sam-Kun Museum. The works will be presented as part of the Anish Kapoor’s International Festival of Contemporary Art. The show will also feature works by artists like Bajrangi Swami, Sitaram Ganesan, and Ashwini Dutt.\n\n\nThe United Kingdom’s Prince Charles’s new £10 billion initiative to promote culture in the Middle East, dubbed “The Future is Now,” has received a boost from a group of British artists, whose works were selected by a Royal Commission into the region chaired by culture secretary, Ed Vaizey. The group includes Hiba Elashi, Amira Barra, and Aya Alireza, who will now receive £3,000 grants to help them produce works that challenge the ideology of extremism and the state, as well as Wangechi Mutu, the newly appointed president of the Democratic Republic of Congo (DRC), who is pushing for the release of political prisoners.“This is", "The next Biennial should be held in Bali from April 5 to April 6, 2020.\n\n\nThe Sao Paulo Biennial for Contemporary Art will take place from March 25 to March 27. The seventy-ninth edition, which is being organized by the Museu de Arte de São Paulo (MASP), will be held at the Rosalind–Astić Art Museum in São Paulo, Brazil. The curated exhibition, titled “Sao Paulo/Brazil,” will showcase twenty-six new works by forty-two artists, including Raoul Miloš, Theresia Pape, Liza Tausu, and Nehebauta Naidoo, as well as a selection of photographs by Marcel Proust. The exhibition will also feature “Prospect: The Modern Body and Art” (2019) and “Adrienne Atget: Light and Space” (2015), and will present two other exhibitions: “Places,” which will open in September, and “Telling Stories,” which will open in June.The art of the fifteenth edition of the Rio de Janeiro Biennial, which was staged in March and March and June,", "The next Biennial should have been held not long ago. The other year, it was canceled due to the Covid-19 pandemic. This year, the event was rescheduled to December, and a follow-up exhibition, “Art in Progress,” was added in January. The reopening of the venue will coincide with the reopening of the museum, which is currently undergoing a $750 million expansion.The renovation aims to make the museum more accessible by adding more galleries, a theatre, and an outdoor plaza and to allocate more exhibition space for contemporary art. The history of the building and its conservation, as well as the conservation of its collection, is being developed by the National Gallery of Art in Washington, DC.\n\n\nThe Greenwich-based artist, activist, and educator Mona Johnson writes in her new book Behold the Missing: Art and the Death of Western Civilization” that she is baffled by the continued denial of the primacy of the artist’s work in contemporary culture.The author outlines several examples of the leftist artist’s work being appropriated by the right, including in her depiction of the Vietnam War in the film The Thin Red Line, 1972, which she wrote and directed with her husband", "The next Biennial should be held in 2021 and would likely begin as an exhibition about the oral history of the first world war, for which the director Tobias Witzel will take the helm. The first edition of the event, “From the Eye of the Storm (’’at the Museum),” was held in 2018 and was attended by eighty-eight artists, including Kiki Smith, Shery King, Boris Postak, and Christopher Wool, and would feature twenty-four works by national and internationally recognized artists. The 2019 edition, “Kiki Smith: the Eye of the Storm,” staged at the New York Public Library and the Metropolitan Museum of Art in New York, received a special exhibition of works by the London-based artist, which was curated by Kathryn Armitage.A final project, titled “From the Eyes of Humanity to the Eyes of War,” will be presented at the Venice Biennale in 2021. The exhibition will highlight the contributions of American artists to the formulation of a new international version of the biennial. \n\n\nThe European Commission has released a decree that will allow member states to appeal to the International Court of Justice (ICJ) to rule on whether French", "The next Biennial should take place in 2021.\n\nThe museum will make its first commitment to the Sonoma Valley in 2023. It will also work with local artist-run initiatives such as the Sonoma Art and Garden Alliance and the Sonoma Valley Regional Council and will launch a $50,000 Grant Program for artists in 2019. The program will provide $5,000 for a single exhibition, $10,000 for a series, $15,000 for a show, and $20,000 for a performance.The Sonoma Art and Garden Alliance facilitates public engagement through the stewardship of small and large works by local, regional, and nationally recognized artists. In June 2018, the alliance received $50,000 from the National Endowment for the Arts (NEA) to help further its mission to support and advocate for the conservation and restoration of artworks by local, regional, and nationally recognized artists.\n\n\nCurator, activist, educator, and author Joël Camille Ouellette has been named the new director of the Museum de l'Homme in Montreal. She succeeds Sérgio Nascimento, who has helmed the institution for more than two decades, and will assume her responsibilities at the museum on January 1", "The next Biennial should take place in the coming years. In the meantime, the studio is preparing for the possibility of a revival—including a reopening of the museum.\n\n\nThe Catalan National Museum (CEM) in Barcelona has requested the government to establish a commission to study the feasibility of the opening of an exhibition of contemporary art and architecture in the city. The institution and the National Union of Students (CUP) of Catalonia (UNAM) have jointly submitted a report to the Catalan regional government on the institution’s exhibition “Theater of Operations: The Gulf Wars 1991–2011” to the Ministry of Culture and the Catalan government, which will then consider the report.The report recommends that the city work with international partners to organize an exhibition that will be a “retrospective of the major events which took place in the period from 1991 to 2011.” The commission will also assess the possibility of creating an area for art, architecture, and architecture, as well as the possibility of creating a museum for architecture. The work, which is titled “Theatre of Operations: The Gulf Wars 1991–2011” and will run until November 21, 2020, will be organized by the CEM, which is", "The next Biennial should be held in 2022, when the project will be based at the museum. The first exhibition was organized by the same team behind the 2013 show “Amber Warhol: Life, Art, and Art” at the Museum of Modern Art in New York.The museum is currently working on a new strategy to prepare for the 2020 event, which will be held in the Bourse de Commerce in Paris between February 10 and February 13. The Shahid and Aram Saleem Foundation will assume the management of the institution.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is reopening to the public on Wednesday, February 9, following a $500 million expansion that added three new galleries, a theater, a café, and a 125,000-square-foot rooftop garden. The first phase of the renovation, which was funded by a $300 million gift from the Shahid and Aram Saleem Foundation, opened to the public on December 5, 2015. The second phase, which was led by architect Frank Gehry, wrapped up in December 20, 2016, and reconfigured the museum into an art center in 2017.“The expansion brought valuable new spaces to the museum, including a new exhibition space that was designed by", "The next Biennial should kick off with an introductory programming of the exhibition “Letters from the Plastic Garden” and a reception of sorts. The 2019 edition will be held at the Museo de Arte Contemporáneo (MAS) in Rome.The seventy-third edition of the Biennial will take place in the Italian city of Venice, featuring works by sixty-five artists, including Gio Ponti, Felipe Corrias, and Mihai Csík. The seventy-fourth edition will be held at the Santa Maria di Cinéma, the Italian town and cultural center of Cremona, in a village near the city. The seventy-fifth and final edition, which will be organized at the Palazzo Nazionale di Roma, will be held in the village of Bologna.\n\n\nThe Library of Congress has announced that in addition to the existing biennial catalogue, it also plans to add a new book devoted to American art. Titled “American Art and the Library: The Library,” the work will be organized as a series of collages, drawings, maps, and sketches that examine the role of art and libraries in American culture. The catalogue will include a review", "The next Biennial should take place in 2021, the same year that the exhibition will mark its thirteenth anniversary. The committee is also planning to reconvene the next edition of the World Architecture Biennial, which will be held in 2022, and is currently discussing with the artists and the participating institutions the possibility of reopening the exhibition. The next edition of the Paris Architecture Biennale will take place in 2022.\n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to open a new digital archiving facility that will allow the public to view its collections online. The museum said that the archiving platform will be an extension of its existing portal Shenandoah Valley, which has previously been used by visitors to the museum. It will also offer online viewing rooms for exhibitions, events, and other programming as part of an initiative to serve as a platform for cultural exchange.“Archiving is a life-saving option for many curators, especially those with limited means, and the digital platforms that we now have provide an endless source of inspiration and inspiration,” said Naima J. Keith, the institution’s executive director. Keith added that the new platform—which will initially be available only online—will", "The next Biennial should be held at MAMAM, in the heart of the city, one hundred years from now.  \n\n\nThe Sherwood Forest Museum in Nottingham has received a major donation of more than one hundred works by artists from the Nottingham Art Gallery (Naga), including a selection of works by Paul Gauguin, Henri Rousseau, and Pierre-Auguste Renoir. The works will be displayed in its new home in the forest, which is being renovated by the museum. Built in the 1960s, the Sherwood Forest Museum is currently undergoing a £29 million expansion.“This is a very special occasion,” museum director Nicholas Cullinan said. “The Sherwood Forest Museum is not only a rich legacy, it is the centre of a very vibrant and important art tradition in Nottingham. We are so proud to have contributed works to this legacy, and to continue to champion the work of the MGA over the years to help shape its exhibitions and collections.”Since the gift was made in the autumn of 2019, the MGA has been celebrating with a series of exhibitions and other programming. The show “The River: The Art of Watercolor” was staged at the Sherwood Forest Museum in October", "The next Biennial should take place in the spring of 2020. There are many projects that would also work to integrate the exhibition with local communities. Curator Ana Mendieta-Campos, who has worked with the exhibition since 2010, said: “I am so pleased with the exhibition ‘Alain Bastet: From Art to Life’ and the community collaboration that it has become. I am especially proud of the work of the local artists in the exhibition, and especially of the work of Stéphane Berthaud, Gerard Berthaud, and Jean-Luc Godard. Their beautifully curated shows take the exhibition back to its roots, to the artists who created the exhibition and to the future.”\n\n\nItalian artist Andrea Torretta, who primarily depicted a nude woman in her paintings, photographs, and prints, has died at the age of eighty-four.Born in Turin in 1923, the son of a shopkeeper, Torretta studied at the city’s Art School, the Palazzino Magistrale, and the University of Cagli. Though his work is often characterized as apocalyptic, the allegorical atmosphere in which he depicts her is grounded in nature’s inherent beauty,", "The next Biennial should be held in 2020. The institution will also present the group exhibition “Kiss of Life: Art in Motion” in 2020, and the preeminent three-dimensional art exhibition “Mozart” in 2021. Above all, the museum hopes to be able to present new works by artists whose works are currently on display in the institution, such as Gheorghe Mankarova and Ikon Houssen. A retrospective of the work of the same name will open in the city in 2022, and the institution will also continue to host artists whose works are currently on display in its collections. From 2020, the museum will focus on projecting new works by artists who are currently not represented on display. Additionally, the museum will invest in creating and maintaining a significant branch in the city. The development of the museum, which is located in a prime industrial area in central Jakarta, has been closely observed by the country’s cultural and cultural leaders. The country’s cultural heritage organization, the Jakarta Cultural Heritage Foundation (JKF), was founded by the architect, philanthropist, and collector Fotopraktika. The foundation is run by an advisory board comprising", "The next Biennial should take place in 2022, and will be hosted at the São Paulo, Brazil; the Museu de Arte Contemporânea de São Paulo, Brazil; and the Porto Alegre, Brazil; with the support of Brazil’s Ministry of Culture, the Ministry of Tourism, and the Ministry of Education. The event will be hosted at the Museu de Arte de São Paulo (MASP), a former gold mine in the Amazon, and will be organized in collaboration with the Museu de Arte de São Paulo (MASP), which last year organized the inaugural event, \"Feminismo: A Retrospective, 1910–1965,\" in 2019.The new exhibition, which will feature original works by twenty-eight artists from Latin America, Africa, and Asia, is part of the Brazilian government’s commitment to modernizing the country’s cultural heritage, which is currently in the process of being overhauled by the Bechtel Foundation, the Brazilian Workers Union, and other groups. Among the works that will be featured in the upcoming exhibition are works by the ­comprising artists of the Americas, Asia, and Oceania, including Danilo Corrin, C", "The next Biennial should be held in 2020. The new theme is “Romance and the Body: From Mary Cassatt to the New Art of the Body.”The new exhibition, titled “Romance and the Body: From Mary Cassatt to the New Art of the Body,” will feature works by the best-known contemporary artists whose bodies are more than multimillion-selling works. Among the artists chosen for the inaugural exhibition are Yana Paskova, Wesleyan Sykes, and Pascaline Garofoli.\n\n\nGreater Manchester Police (GMP) is facing backlash for firing a constable after he allegedly filmed himself punching a homeless man in the head with a closed fist. The incident took place on July 27, when the man was attempting to push a shopping trolley in a Manchester park.The incident prompted a number of complaints from pedestrians and bystanders, who were horrified to witness the terrifying moment when the constable pulled out his motorized fist and punched the victim in the head several times. The unnamed man suffered a concussion and is currently recovering at a nearby hospital.After viewing the video, Detective Constable John Levey, the head of the force’s public protection unit, said: “It is", "The next Biennial should be held in 2021, and the next will be held in 2023.“This exhibition has demonstrated that the most exciting, compelling, and challenging contemporary artworks can be created and exhibited in the most interesting, exciting, and challenging ways,” said Lisa Gilbert, curator of the contemporary art biennial. “We are thrilled to continue our work as a platform for sharing the work of artists whose work we have since identified as highly erudite and important, and for the discussion of the art world’s role in and democratization of art.”The exhibition will be curated by Richard Bevan, director of the National Gallery of Britain, and the artists will be announced in March. To learn more about how you can work with the artists, read about how you can meet the artists, and find out how to apply, visit the biennial’s website. \n\n\nThe independent New York nonprofit Arts in America (AIA), which is supported by the Walton-Woodruff Foundation, has launched a new initiative to recognize and reward those who create, preserve, and provide valuable arts and culture for New Yorkers. Designed to improve the cultural climate through local, state, and federal legislative and policy actions, the", "The next Biennial should focus on the history of art from Central and South America. “As we continue to observe and respond to the changing cultural landscape in the Americas, we need to continue to ask questions,” said Matthew Booth, director of the Greenwich Gallery. He added that the exhibition should focus on “how art can create new and positive social and political horizons.”The 2020 edition of the Biennial will take place at the Guggenheim Museum in New York from January 15 to February 16, 2021. The exhibition will be organized as follows: Event Calendar* 2019 NEW\n\nThe Museum of Contemporary Art (MoCA) in New York has placed a new, ten-foot-tall bronze statue of contemporary artist Susan Sontag in its lobby. The twenty-first-century Sontag, who created works such as her famous “Tit in a Bottle” and “Face/Off” in an attempt to challenge the notion of two-dimensional art, died in 1996. It will now stand alongside one of her paintings from her “Tit in a Bottle” series, “Abandon All Hope and All HOPE” (1996), and “Face", "The next Biennial should have a design by Cécile B. Evans, who has been named the 2020 curator of the group show, “Elijah Brown” (2019). As an artist-in-residence at the Cooper-Hewitt, she will have the opportunity to work with the exhibition’s first-ever curator, Sarah Cutforth, and will learn from her on the importance of creating narratives on a large scale.“As an artist, I am thrilled that I can continue working with Sarah and the biennial team with their new acquisitions in the museum,” said Brown. “I’m confident that the exhibition will contribute to the long-term health and well-being of the museum and its collection.”\n\n\nThe Brooklyn Museum in New York announced today that it will honor artist-philanthropist Donald Suggs with the 'Drawn and Sculpted' exhibition at the institution. The show is organized by artist-philanthropist Suggs on behalf of the Suggs Foundation. The twenty-third edition of the Drawing and Sculpted event, which will take up work by twenty-six artists and mark the institution’s reopening, will coincide with", "The next Biennial should take place in the spring of 2021 and will announce the theme for the exhibition in May.Sackie is calling for more than just an extension of the Biennial, but something new to replace the existing concept of the exhibition. She says that the new format will allow the exhibition to engage with issues of contemporary life while providing a platform for deeper reflection on the art world and art history itself. She also wants the exhibition to transition from an “art-present” to an “art-exhibitions” relationship, one that will involve visitors to the museum taking part in a series of activities that are “driven by a desire to understand the world around us.” In the past, the Biennial was only open to the public for a limited time every three months; now that the program is fully operational, Sackie says that the next event will take place in the spring of 2022.\n\n\nThe Chinese painter Chen Dongli, who made his mark in the country through his extravagant mural landscapes, has died at the age of eighty-five. The works, which depict frenetic urban life and the ephemeral and the ephemeral are often a return to China’s rural past and are considered", "The next Biennial should take place in 2021 and will organize a three-man shortlist of artists selected by the juried panel. The nominees will be announced in 2021. Artnews will update this story with more information as it becomes available.\n\n\n\n\n\n\nMadison Square Garden, New York: The $150 million renovation of the iconic venue has unveiled a new exhibition, “Ateliers d’Arts,” that will explore the intersection of art and design in the United States.Launched by a group of curators and designers including London’s Mike Kelley, Petra Guggenheim, and Piet Mondrian Van de Kerkhof, the exhibition will explore the history of art and design in a combination of public and private spaces, including the New York Public Library. The lobby of the building, which was built in 1912, will also host a series of artist shows, including a “Ta-Nehisi Coates” exhibition that will focus on female artists, a “Kyle Nodal” exhibition that will showcase the work of female artists, and a “Jin Hsu” exhibition that will showcase Hsu’s work. The third show, titled “Design and Design", "The next Biennial should take place in the spring of 2022, and will consist of the work of twenty-four artists living in the city. In the interim, the city will host the Biennial in the Exposition Hall in the city, which was constructed in 1924 and opened in 1949. \n\nThe 2018 edition of Art Basel Hong Kong, which was staged in collaboration with Art Basel Hong Kong, was hacked on Thursday and postponed. The event was slated to take place in March, but went into lockdown because of the ongoing global pandemic.Organizers of the fair announced the postponement, which was tied to the outbreak of the novel coronavirus, on Instagram, saying this would be the last edition of the fair. “We wish everyone a safe and enjoyable March, and a very happy March,” the artists who participated in the upcoming event said. “We hope that this outcome will enable the Art Basel Hong Kong team to take full advantage of the exhibition’s March opening, and that the engagement with you and our fans will continue in May, and into June.”The shortlisted artists for the 2019 prize include Kasmin, Aphrodite Dziewior,", "The next Biennial should focus on the history of the exhibition, and the public art in the exhibition space, as well as the installation, reception, and publication of works by artists whose works have been featured in the past.”The 2020 edition will take place in the former Lycée Arti, located in the capital of the French state of Rhône-Alpes, Le Bourget, on the island of Saint-Tropez. The institution plans to make Saint-Tropez a UNESCO World Heritage Site and will invest over one hundred million euros in the renovation of the building.“The new Biennale is a reflection of the openness and ambition of the organizers, and the extraordinary breadth of the collection,” commented François-Xavier Gaillard, the president of the biennial. “The collection represents the history of art in France and Europe, and includes works by the most internationally acclaimed artists in the world, including Mark di Suvero, Agnes Martin, Piet Mondrian, Richard Fung, and Andrei Gaba. This exhibition is not only an opportunity to present the most important collections from around the world, but also a great challenge for the collection to present new work in collaboration with the artists who created these art", "The next Biennial should be held in March 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has hired Helaine Henningsen as its next executive director. Henningsen will be responsible for coordinating the operations of the institution and will take up her new post on January 31.“Helaine is an experienced and ambitious leader with a proven track record of guiding museum-based projects that build on the collection, design, and curatorial goals of the current leadership team,” said MoCA director Joseph S. Kapp. “Her ability to build, sustain, and scale our collection, and her ability to support artists and broader audiences through her support for the Arts will be essential in helping us to meet the challenges and opportunities of our evolving digital and mobile landscape.”Henningsen comes to MoCA from the New York–based nonprofit the Art Institute of Chicago (NAC), where she has served as deputy director of education and public engagement. During her tenure at the institute, she launched the #ArtistMarch, a public art campaign featuring works by artists including Mark di Suvero, Gerhard Richter, and Istvan Rosloff, and launched a new online course that will introduce", "The next Biennial should take place in 2019. The museum has since received a $50,000 donation from an anonymous donor to support the renovation of its existing building.\n\n\nThe European Space Agency (ESA) has released the list of more than 125 artists and cultural workers who will be invited to participate in the twenty-fifth edition of the Berlin Biennale in 2021. The event will be held in the city’s historic Saalfeldischer Kunst, which was approved by the state of North Rhine-Westphalia (NRW) in 2016. The list comprises artists and artists-in-residence from thirty-seven countries, including Belgium, France, Italy, Spain, and the United Kingdom. The 2019 event, titled “Next,” was organized by the German state of North Rhine-Westphalia and kicked off on February 4, 2020 with the theme, “Art in the Age of Trump.” The exhibition took place in the Art Basel exhibition hall and was supported by a €100,000 grant from the Ludwig Foundation.The biennial will run from March 14–March 21, 2021. “The Berlin Biennale is a remarkable and innovative event,” said", "The next Biennial should be held in 2023, and the first in the Canary Islands in 2021. The opening of the exhibition “No More Deaths: Art in the Age of Mass Death” in 1971 marked the first time the institution hosted a major retrospective of contemporary art, and marked the first time that it was in the United States. William Gibson, who had previously advocated for the institution to move to a new location to avoid displacement by the city, was one of the organizers of the move. In a statement, Gibson said: “We are thrilled to open a new chapter at the museum in 2022 with our first exhibition dedicated to the work of the late Dr. Martin Luther King, Jr. and his inspired and indispensable successor, Dr. A. Max Eastman. Our mission is to galvanize and celebrate the work of the extraordinary minds who have shaped the museum’s collection, collections and collections programs. We envision a new day and new vision for the museum, one that is grounded in the visionary and the visionary is grounded in the past.”Following the exhibition, the museum also revealed that it is working on a new partnership with the Los Angeles County Museum of Art (LACMA), which will provide additional programming for", "The next Biennial should be held sometime in the second half of 2021. \n Artforum has learned that the Smithsonian’s new Cultural Affairs Gallery, to be located on the third floor of the National Museum of African Art in Washington, DC, will also house a retrospective of an African American artist’s work in early 2022. The institution has yet to announce a date for the exhibition.Commenting on the series, which is titled “Y2K: An Event in Time” and will take up four of the artist’s most recent works, Adam D. Weinberg, the curator of the exhibition, said: “In the late 1960s and early 1970s, a black American artist named Allan A. Johnson became the first American to win the Prix de l’Amiti & Alexander in Paris. He was followed by his two young sons, Bernard and John, and became a major cultural influence in their lives and art.” \n\n\nThe London-based charitable organization Art Fund has established a new $100,000 Equity for Art and Art History (EFA) awards to support contemporary artists. The awards will be offered in an effort to bolster the international profile of Tate’s London and", "The next Biennial should be held in October 2020. \n\n\nThe Metropolitan Museum of Art in New York has reached an agreement with the heirs of Wolfgang and Agnes Martin. According to the New York Times, the Met has ended its longstanding practice of excluding the couple from public viewing rooms at the museum. The Mausoleum Museum in Naples, Italy, has since confirmed that the Met will resume public exhibitions with the Martin-Hujar family, but only with the consent of the Pope.“We have made the decision to resume the exhibition with the Hujar family as long as this is clearly understood by all parties,” said John Miller, the museum’s director. “We understand that this may be a difficult and delicate situation for the Hujar family, and that we must do all we can to help them.”The museum, which has been closed since June 28 due to the Covid-19 pandemic, had previously given the Hujar brothers two months to respond to the museum’s request to reopen the “Nuh and Hujar” exhibition, which has been on view since March 22. According to the New York Times, the Hujar brothers declined to participate in the exhibition", "The next Biennial should be held in October 2021.This article was first published by the International Association of Art Historians (AHA) in Buenos Aires.\n\n\nArchitects Richard Anagnos, Vito Acconci, and Alexandre Aube-Yves have been awarded the 2019 Pritzker Architecture Prize for their work in the development of architectural communities. The experts, who are based in Paris, were chosen from a shortlist of fifty finalists, which included Willem de Kooning, Markus Langret, Naima J. Keith, and Wolfgang Laib.The architecture category is one of the five awards recognized by the Pritzker architecture prize organizers as well as the Prix d'Art Contemporain, a prestigious award presented by the Pritzker Foundation. The other three awards are the Pritzker Prize for Design and the Pritzker Prize for Art. The 2019 Pritzker Architecture prize jury included Michèle Balsom, Tom McGee, and Wolfgang Rahn; the Pritzker Prize for Art committee included Hans-Ulrich Schlegel, Joachim Schäfer, Wolfgang G. Lehmann, and Wolfgang Wieder; and the Pritzker Architecture Prize jury included Julian Schipper", "The next Biennial should take place at the newly renovated Robert Giard–designed Radisson Blu–ray Theatre in central New York City on December 21-December 26, 2020. The exhibition will be hosted by Mark B. Smith, the director of the Art Institute of Chicago, and will be curated by Ed Moses. The 2018 edition of the show, titled “The Necessity of Form,” featured work by forty-six artists, including Hans-Georg Maier, Aurel Scheibler, and Joachim Neugroschel, and was presented by the New York–based institution as part of its “Art for Seattle 2020” initiative. The biennial will be held in both a historical building and on the city’s waterfront.\n\n\nArtPlace, the new Seattle-based nonprofit that provides direct financial support for artists in the Seattle area, has awarded $10 million in grants to eighty-five artists, including Annie Desai, Jodi Garrity, Rachael Ault, and Kim Gordon. The funds will help them promote photography, cinema, video, performance, and writing, among other mediums, and will come from a pool of donors that includes the Susquehanna Valley; the Carnegie Mellon", "The next Biennial should take place in the Russian city of Tula, now the capital of the newly independent republic of Chechnya, in 2020. \n\n\nThe Museum of Fine Arts (MFA) in New York has appointed Alicia Wiles as its first director. Wiles will assume her post in July and will be responsible for organizing the exhibition “Yaroslav Alexandrovich,” which is being staged in partnership with the artist’s estate, and will begin her role in July.Wiles comes to the institution from the Metropolitan Museum of Art, where she has served as director of contemporary art since 2015. During her tenure, she established the current August/September residency program, promoted the MFA’s programming in the fall, and invested in its academic programs.“We are delighted to appoint Alicia Wiles as our next director,” said Daniel H. Weiss, chair of the museum’s board of trustees. “After more than four decades in the field, she has built a strong reputation as a visionary curator who engages with and challenges the history and theory of contemporary art, and is a strong champion of the MFA’s pedagogic program.”\n\n\nPublic Art Foundation", "The next Biennial should take place in the spring of 2020. Its theme will be “Future Present” and will focus on “What happens now?” The biennial will be hosted at the Museum of Contemporary Art, Houston (MoCA), from May 20 to May 22, 2020 and will run concurrently with the upcoming USO exhibition “The Force Awakens: A Retrospective.”The art of the exhibition will be curated by Loring Randolph-Dyer, curator of contemporary art at the museum. The biennial will be organized as a series of presentations, which will engage with themes that range from current events to themes of the future and the body, including the relationship between art and spirituality, the body and the environment, and art and politics.Commenting on the upcoming biennial, Randolph-Dyer said: “We are excited to deliver an exhibition that explores the ways contemporary art and culture can alter our lifetimes and the meaningfulness of our lives. The exhibition will include the works of twelve artists and will be divided into sixteen tracks that will be organized chronologically. The exhibition will include a selection of works by forty-six artists over the course of fourteen years. In addition, a new collection of art from the", "The next Biennial should take place in Lisbon, in 2021; the next in Paris, in 2022; and the next in London, in 2023. The November exhibition, “Punktron: The Exhibition of Punk in Modern Life” will also be staged in the United States.The organizers are also encouraging the public to support the launch of new cultural initiatives. Among the ways to do so are by visiting a New York gallery every week, subscribing to a local artist newsletter, and purchasing a work by an artist each month. The deadline for artists to submit works is November 29.\n\n\nThe City of Toronto confirmed today that it plans to spend $540 million to repair and expand the city’s transportation infrastructure, including transportation networks, transit systems, and water and wastewater treatment plants. The announcement follows the completion of an extensive $700 million overhaul of the Gardiner Expressway, a major artery that connects the city’s downtown core with the suburbs, and the Scarborough subway, which launched in 2017 and has been ongoing since.“Toronto is in the midst of a transformation, and the Gardiner Expressway and the Scarborough Subway represent a significant milestone in that transformation,” Mayor John Tory said at a press conference. “", "The next Biennial should take place in downtown Los Angeles in 2021. The 2019 iteration of the exhibition, titled “Past Reflections,” was held at the Mondrian Museum in London. The 2016 edition, titled “Telling Stories,” featured works by twenty-three artists who are currently under contract to the museum. The exhibition was curated by Linda Stier, curator of contemporary art at the Los Angeles County Museum of Art, and Lois M Robson, director of the Palazzo Grassi (formerly known as the Duke’s Alamo Drafthouse, formerly known as the Alamo Museum).\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles is working with the Los Angeles County Museum of Art (LACMA) to create a new, non-commercial, public artwork by Gerald and Ira C. Zucker that will highlight the work of women artists in the late twentieth century. “We are thrilled to be working with the LACMA Museum of Art to create a new landmark work by Gerald and Ira Zucker,” said museum director Daniel H. Weiss. “The work will showcase fifty-four women artists who have recently been featured in the exhibition", "The next Biennial should be held in the spring of 2021.\n\n\nThe Institute of Contemporary Art (ICA) in Paris has been awarded the new €60,000 Think Tank Award for its new initiative, which aims to increase the visibility and participation of French artists in the United States. The $60,000 prize will be given to a curator or architect who has made significant contributions to their country’s art and architecture through their exhibition, installation, research, publication, or other activities. The event will coincide with ICA’s upcoming exhibition “Art as a Platform--” at the New York Institute of Technology (NYIT).\n\nThe 2019 ICA Paris Biennial, titled “Art and Architecture as a Platform,” attracted some 5,000 visitors to the prestigious French City, which recently underwent a major expansion, on January 13, 2020. The exhibition showcased work by more than 1,500 artists in Paris, including Michel Lelong, Yinka Shonibare, Joëland Philippe, David Hockney, and Alex Katz, as well as the artist-run space, Botanica, and the Marciano Gallery in Venice. It also featured first-ever works by the artist-run space Urban", "The next Biennial should focus on the exhibition “Ideas and the Territory” (2019), which is currently on view at the Hammer Museum.Associate curator Martin Phillips, the creator of the Bridget Riley/Charles Bronson exhibition “Avant-Garde Feminism in America,” said: “The new year is a critical time to reflect on the past, and to reevaluate the future. The biennial will focus on themes of female empowerment, the subjugation of nature, and the essential unity of woman and nature. It should also reflect the themes of the year as a whole. We envision this as a time to reflect on the complex history of cultural exchange between Europe and the Americas, the twentieth century, and beyond.”\n\n\nThe City of New York has announced it will begin phasing out its contract with the private prison industry by 2022 in order to “protect the health and safety of New Yorkers and our communities’s most vulnerable,” City Attorney Daniel F. Donovan said in a statement. The move means that the contracts will be terminated at the end of the 30-day period following a citywide strike in January 2022.In a statement, the city said: “The", "The next Biennial should be held outside of Taiwan. “I really want to work with other cultures, and see how we can work together,” Miyuki said. “Taiwanese people are very talented and their art is really popular with many countries all over the world, so I am really looking forward to collaborating with them.”\n\n\nThe Royal Academy of Arts (RA) in London has released new guidelines on how a museum should handle a potentially life-threatening situation involving a large group of people, believing that the number of people involved in a riot can be reduced by limiting the number of visitors.The guidelines, released on Wednesday, February 16, and announced by the RA, the Royal Academy of Arts, and the London-based think tank the Art Fund, order the building of temporary barriers to separate the crowd so that the rioters can't enter the museum.The guidelines state that when groups of twenty or more people gather for a protest, it’s preferable to have the police present so that emergency medical care can be brought to the protesters. The police can then move in to disperse the crowd through force, and the protesters must remain dispersed so that the rest of the rioters—who may be less able", "The next Biennial should be held at the new museum’s new location on the campus of the University of Applied Arts in Barcelona in 2020. The institution will also enter a transitional phase through the integration of the museum into the campus' new, four-building complex. The museum will remain in the southern part of the city of Barcelona, and will remain open during construction of the construction site, which is being built in the city’s Pasarinas district.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the temporary closure of some landmark buildings and institutions as part of Mayor Bill de Blasio’s plan to reduce the city’s number of homicides by 80 percent by 2026.The guidelines outline several actions that can lead to the temporary closure of an institution, such as the Big Apple’s Central Park, the Museum of Modern Art, the Museum of the City, and the Bronx Museum of the Arts. The city has already begun phasing out some of the more prominent reminders of New York’s criminal justice system, including its Rikers, and is working on reducing the number of its inmates, which is expected to take up to three weeks, and is evaluating how to shut down the", "The next Biennial should take place in the autumn of 2020, and the first exhibition in the autumn of 2021.\n\nThe news comes amid a global health crisis caused by the novel coronavirus, which has sickened more than 11,500 people in the Philippines and has killed at least 512 people since it was first reported in December 2017. Since then, the country has witnessed a massive effort to contain the virus, which is spread mainly from person to person through the air, and has seen a resurgence in cases.The Philippines has been working with international partners to contain the virus, which is spread mainly from person to person through the air, and has seen a resurgence in cases.\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it is planning to open a new year with an exhibition dedicated to the postwar years. Titled “After,” the show will be a collaboration between the institution and the nonprofit arts organization the Center for Art, Technology, and the Arts (CATSA), which is based in New York. Titled “After the Fall,” the show will focus on the design and installation of new works that are made from materials such as wood, paper, and metal, and will introduce", "The next Biennial should focus on adapting the exhibition to the needs of different artistic spaces and the city. We are open to any suggestions as to how to improve the exhibition. ” \n\nThe Bechdel Test, a simple yet powerful tool that has been used by the ACLU and other civil liberties groups to encourage the United States to adopt new gender-neutral bathroom policies, has been rebranded the Biennial Lesbian and Gay Task Force. Titled “A Lesbian and Gay History of the United States” and curated by artist and historian Cathleen Fletcher, the biennial was established in 1997 to commemorate the lesbian, gay, bisexual, and transgender (LGBT) movement. The show, which focused on themes such as the Black Lives Matter movement and gender politics, was nominated for a Pulitzer, but was ultimately axed after the organizers received a petition from a group of artists and activists led by the National Coalition for Lesbian Rights (NCLR). The petition argued that the act of a biennial exhibition was akin to censuring a United States politician.In 2017, a new version of the biennial was presented by the Los Angeles–based nonprofit Center for Lesbian and Trans Cultures. The 2015 event was staged by artist and filmmaker Mike Kelley,", "The next Biennial should take place in 2021 and is scheduled for the city’s Art Museum in 2021 and the Museum of Contemporary Art in the Czech Republic in 2021. The third iteration of the festival will take place in the autumn of 2022 and will be held at Carl Zeiss Stuttgart.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has scheduled an exhibition devoted to the art of the African diaspora and its impact on the art world. Titled “Africa in Art: From the Art of Monet to Matisse” and curated by Carol E. Robinson, the exhibition will explore the ways in which art, including design, architecture, and sculpture, has been influenced by African art.“Throughout its history, MoMA has been a strong supporter of artistic experimentation, a strong proponent of the arts as a vehicle for social change,” said Maire Scharfenberg, director of the museum. “We are honored to partner with MoMA to make this year’s ‘Africa in Art’ as exciting and transformative as possible.”The exhibit will include works created by more than seventy artists, bequeathed to the museum by African diaspora", "The next Biennial should be held at the end of 2021, but the organizers have yet to set a date for the event.\n\n\nThe Florida Museum of Art (Faulkner) has received a gift of more than five hundred works by prominent twentieth-century American artists in its facility in Jacksonville, Florida. Established in 1912, the museum is the only institution in the world to hold a permanent collection of these works and their associated materials. The gift includes works by artists such as Robert Irwin, Robert Irwin Jr., and Robert Irwin’s wife, Diana; works by George A. Lucas, David H. Russell, and Robert Irwin’s son, David; pieces by artists such as Robert Irwin, Ed Ruscha, Mark Rothko, and Paul Gauguin; and a collection of works by American painter Frank Stella.“The Florida Museum of Art serves as an important nexus in the ongoing connections between the world of art and contemporary life,” said museum director and CEO Christopher Bentley. “The gift of these works is a perfect example of the museum’s commitment to the history and the legacy of Roberto Bernadet, and of our ongoing partnership with the artist community. It is a time of great celebration for", "The next Biennial should be set up immediately and will be led by a collective of twenty-six artists\u0097including Ruba Jomaa and Salah Al Khoury\u0097and will showcase the work of seventy-five artists in thirty-eight countries and regions. Inaugurating the 2020 edition will be a special exhibition of sculptural works by twenty-six artists and their families\u0097including Maud-I or Suleiman, Ibrahim, and Abu Hamza. The biennial will be inaugurated by a presentation of works by ten artists and their families from the UAE in Abu Dhabi.Ahead of the event, the twenty-four artists represented in this year’s edition of the Dubai Biennial have announced an open call for nominations. The biennial, which was first held in 2008, opened with a performance by the Lebanese artist Hisham Al Saadi. The show was followed by an exhibition of work by the Swiss artist Anne-Charlotte Baden and a presentation of works by the Italian painter Piet Mondrian. The biennial’s Rome-based organizing committee, Tarek Altay, said “We are grateful to our collaborators for their understanding and diligence in selecting the artists for this edition, which", "The next Biennial should be released in 2021.  The museum has yet to say when it will reopen.\n\n\nCanadian artist Gwyneth Paltrow has been selected as the 2020 winner of the $10,000 Doris Duke Charitable Award. Paltrow, a Canadian citizen and American artist, was chosen from a shortlist of ten by Duke, who made the announcement at a gala at the Doris Duke Foundation in Manhattan on Sunday night. The prize, which honors Canadian–born, American–based artists whose practice is centred around the concept of self-portraits and their creations are visually and politically charged, was established by Duke in recognition of her contributions to art.Paltrow’s work, which focuses on concepts such as home and interior, light and shadow, and the body and the environment, is currently on display in the exhibition “Home, Interior, and Other Dimensions,” which runs through April 27, 2020. The show will also feature work by British artist Jenny Holzer and American artist John Kenrick. The winner will be announced at a ceremony at the Doris Duke Foundation on March 30. “Gwyneth Paltrow is a creative force, a living artist, and", "The next Biennial should take place in 2021 at the Museum of Modern Art, which opened in 1968. The museum’s collection of more than two hundred works, including works by Pablo Picasso, Antoine-Louis Jehanet, and Pierre-Auguste Renoir, is also on display in its new home.The institution, which is located in the former Borthwick Plantation in Ipswich, Massachusetts, has been plagued by financial woes in recent years. The financial meltdown saw the Museum of Modern Art move several times, including its former home in the Borthwick Triangle, and the building of the museum. While the building was temporarily shut down in December 2014, the museum was forced to move the work of art that year, Breathe Me, the classic image of a human breath playing against a black background.\n\n\nThe Museum of Modern Art (MoMA) in New York has come under fire for charging a free college student $150 for attendance at a museum-sponsored art lecture. The student—whose parents donated $125,000 to the institution last year in support of a documentary film by filmmaker Maya Alighman, “The Perfect Storm,” which premiered at the museum last week—claimed that she was never", "The next Biennial should be held in 2020, the same year the exhibition is slated to launch.\n\n\nThe Royal Academy of Arts (RA) in London announced today that it will hold its tenth edition, “Away From the Sun,” in March 2021. The event will include thirty-one works by thirty-nine artists, including Rachel Whiteread, Lewis Lohman, and Tanya Bonakdar. The exhibition will be on view until March 23 and will be followed by “The Silver Chair: Art in the Age of Empire,” which will be on view until March 25, 2020. The exhibition will include works that examine the intersection of art and politics in the 1960s and 1970s, and will be held in conjunction with the exhibition “Painting in New York: the American Experience,” which will open on the CAFA’s campus on March 7, 2021.Inaugurating the exhibition are works by forty-eight artists, including Longfellow, Lalande, and Bartlett, who represent the United States, including muralists like Ellsworth Kelly, Georgia O’Keeffe, and Edward Hopper, who made the first trip to New York twenty years ago", "The next Biennial should be held in the near future.”The institution will prepare for a possible shutdown with a new nine-month, 365-day-a-year exhibition, “Theatre of Peril,” which will also delve into the theory and practice of the “Art of War,” and will extend its hours by an hour on weeknights from 9 PM to 2 AM on Fridays.The full list of participating artists is as follows:Alejandra Alves (Spain)Torstein Bremner (Germany)Erika Blum (Germany)Christopher Brown (US)Gina Cipolletta (US)Mikkel Bojdzic (US)Gregory Canales (US) Leliana Lopes (US)John David Matthews (US)John David Macgregor (US)Ethan Mathes (US)José Maria Mendieta (US)José Ramírez (US)José Mourinho (US)José Martin Guarani (US)Andrea María Martínez (US)Anselm Maier (US)Alfonso María Sánchez (US)Sébastian", "The next Biennial should take place in the city and will be hosted by the Museu de Arte Contemporáneo, Madrid; the Museo de Arte Contemporáneo-Frente, Valencia; and the Museu do Marfa, Mexico City.In 2017, the prestigious Apertura fair in Milan was a success, with the exhibition “Young Art,” featuring an exhibition of the work of young artists, and the Amsterdam Biennale, which was also organized by the Apertura fair, was nominated for its twenty-first century edition. The 2019 edition of the Venice Biennale, titled “Avant-Garde in Venice,” was also selected for its future editions at the Venice Architecture Biennale and the Venice Biennale des Resorts, and the 2020 edition of the Venice Architecture Biennale will be held in the city of Venice.The organizers of the upcoming exhibition, which will be held at the Museo di Arte Contemporáneo in Venice from February 5 to February 8, 2020, will assume the role of co-representatives of the artist-work and the museum. They will be responsible for the design and construction of the pav", "The next Biennial should be held in 2021.The award ceremony will take place in London in October.\n\n\nThe Institute of Contemporary Arts (ICA) in London has released the list of thirty-six artists who will participate in its upcoming edition. Titled “The Empty Places of the Body,” the exhibition will feature works by forty-eight artists, including Ai Weiwei, Mark di Suvero, Jules St-Denis, Hsu Chi Mai, Maren Malsey, and John Baldessari. The event will be held at the National Portrait Gallery in London in September 2020. “The semester will also introduce a new exhibition, ‘Cinematic Effect’, which will offer a new and immersive mode of exhibition creation by engaging with the bodies of critically acclaimed artists, and ‘The Millennium Workshop” will showcase the work of seventy-four artists selected from a shortlist of ten finalists. The 2020 edition will also include eighteen new works by artist-in-residence Bela Rodolfo, twenty-six works by artists from the Twin Cities, and three new pieces by artists working in the Far East.“The film-set is an essential vehicle for the artist-in-", "The next Biennial should be held in mid-March, with an exhibition of new works by the artists who have recently contributed to a special exhibition organized by the director of the museum, Asgeir Gudjohnsson, in conjunction with the institution. The event will be relocated from its current location on the third floor of the building, and the exhibition hall will be moved to the space where the museum is currently located, in the building that will be renamed the Biennial.The Biennial, which has been organized since 2010 and is nearing its seventy-fifth edition, features works in its collection that are not currently exhibited. The exhibition will showcase a selection of works by forty artists under the direction of director Harald Szeemann. The exhibition will also include an exhibition of the works of artists whose works were previously featured in a special exhibition in the 1920s. The works are also being organized in accordance with the newly established International Council for the Reconstruction of Modern Art (ICRA), a professional organization that represents twenty-six artists. The publication of the exhibition is also being organized in partnership with the Swedish Foundation for Modern Art, the Swedish Academy of Art, the Swedish National Museum, the Swedish Museum of Fine Arts, the Swedish Museum of History, and the Museum", "The next Biennial should be held in the spring of 2020. The biennial will highlight the adventures of three artists, combining new and traditional mediums, and will draw from and showcase the work of more than fifty artists.\n\n\nThe HarperCollins publishing house in New York has announced that it is planning to merge the twenty-third edition of the Art Newspaper, which is currently on display at the Whitney Museum of American Art in New York, into a single, digital edition, which will be published by the end of 2020. The digital edition will feature a new theme each year, called Art for Tomorrow, and will follow the same format as the current issue, with one exception: The Digital Image Gallery. The digital edition will be organized in two parts: first, a special section on digital art, the Digital Image Gallery, and then the Art Newspaper.“HarperCollins is delighted to continue publishing Art for Tomorrow with its full editorial team, our talented editorial staff and our loyal readers, as well as the Art Newspaper artmaking team, who have been instrumental in our success and the success of many a fine artist,” said James Stewart, president of HarperCollins. The new digital edition will be released in April 2021.“This year’s", "The next Biennial should be held in 2021. \n\n\nThe southern California biennial Art in America, which has been held in Los Angeles County since 1988, has announced that it will move to a new venue in the city next month. The forty-fifth edition, which will kick off on March 16, 2020, will also feature new works by thirty-nine artists, including Andrew Kreps, Yuki Kimura, and Guy McKenna, as well as works by more than two hundred lesser-known and established artists.“The new venue will provide a unique space for Art in America’s important programming, including the hundreds of exhibitions that have been held here since its founding, and will offer the opportunity for the public to experience the breadth of contemporary art,” said Mark Mastracchio, director of the California Pavilion. “We are excited to announce the artists and the new venue and to continue to present critically important programming, both in Los Angeles and internationally.”The California Fair of Arts, which was originally scheduled for March 14–March 16, 2020, was pushed back to March 17, 2020, and has been pushed back again to March 21, 2020. In the coming months, the fair will host its first exhibition of work", "The next Biennial should be in 2025.  After the show, a new exhibition of the works of the Biennial will be inaugurated.\n\n\nLos Angeles’s Discovery Museum has released an overview of its inaugural season, “The Farm,” which ran from March 12 through March 28 and examined the global impact of the United States’s domestication of animals, and the museum’s transformation into a major art collector. The museum revealed that it sold more than 3,000 works in the inaugural year.The museum said that it expanded its collection by 10,000 works and spent $3 million on renovations and acquisitions. In the first episode, the museum opened a new section on livestock and animal husbandry, which explores the role of cattle, sheep, goats, and other livestock in the American diet. The exhibition also revealed that the museum will include an exhibition of work by twenty-six artists in 2020.One of the highlights of the exhibition, curated by Heidi Brown, is “Cowspiracy: Art and the Politics of Meat.” The show will include works by forty-four artists, including Carol Jeffries, John Davey, Adam Dior, and Hans New in the sixth and final part of", "The next Biennial should establish a new commission for the exhibition “Where Art Lies.” The exhibition will focus on the social, political, and aesthetic issues raised by the power, institutional, and symbolic relationships between art and politics.The invitation to extend the theme to a new territory is a response to the US presidency’s rhetoric on race, and its apparent reluctance to address systemic racism and police violence. “This is an opportunity to reexamine the distinction between art and politics,” said Michael Hauptman, the director of the Metropolitan Museum of Art and the artist’s husband. “The Cultural Center is an important laboratory for the creative process in America. Using its artistic resources, we hope to use them to raise awareness and action about the many pressing issues of our times.” Inaugurating the center on March 3 will be a two-hour performance by the New Orleans–based troupe the Pussy Riot, whose acts included a protest against Vladimir Putin at a rally held by the US president in Moscow last week and a performance by the Russian contemporary artist Marina Abramović in which she confronts the legacy of Stalin.Both the Met and the Pussy Riot artists were arrested and charged with criminal tresp", "The next Biennial should take place in 2020 and will be held at the new Olympic Stadium, across the straits from Port Elizabeth, in London, from March 23 to March 27. The venue will host sixteen artists, including Nia Farah, John Akomfrah, and Charles Alton, and will be inaugurated by a performance by the British Contemporary artist John Akomfrah. It will also comprise the first-ever exhibitions of work by female artists in the United Kingdom. The 2020 theme is Passion, and the art of Passion. “I was inspired by the power of art and its ability to bring people together and inspire them,” Krystle Campbell, a curator at Tate Britain and curator at the gallery that houses the Biennial, told The Guardian. The artist and artist-in-residence, British-born Katerina Bochere, will also be commissioned to create a new work for the event. “The exhibition will introduce a new collaborative approach to contemporary art,” Campbell said. “With the exhibition, the artist in me will be able to return to my roots, to my roots as a curator, to what I think is the very", "The next Biennial should be held in 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA) is planning to raise $3.5 million for the construction of a new, privately financed museum that will showcase the work of thirty-five artists.The institution anticipates that the project will take six years, but says that it is confident that it will be completed by the 2020–21 season. The new museum will be located in the former site of the former Crystal City complex and will undergo a multimillion-dollar expansion as part of a $75 million gift from the philanthropist and billionaire Richard Diebenkorn.LACMA is one of several major arts institutions in California that are scrambling to address declining revenues and declining membership as they grapple with the repercussions of Southern California’s devastating coronavirus. In March, the Association of Art Museum Directors (AAMD) announced that it plans to postpone its next meeting until July, in an attempt to lessen the spread of Covid-19.Meanwhile, the number of people infected with Covid-19 in the United States has risen to 6,071. According to the New York Times, the number of cases in California has more than doubled since April, when the virus first erupted", "The next Biennial should be held in 2022, in order to coincide with the International Biennial for the Arts (IBVA), New Delhi, which will be held at the same location in 2021. The 2019 edition, titled “Going Native” and curated by Papakonas, was one of the first exhibitions to use a new digital platform to engage directly with the work of painters and sculptors.\n\n\nThe National Gallery in London has announced that it is planning to close its doors permanently in March 2019. The National Poetry Slam, which ran from March 23 to March 26, 2020, had already been canceled due to Covid-19. Instead of facing the imminent loss of income, the National Poetry Slam Fellowships will be offered “as is,” a savings program that will offer financial aid of up to $5,000 to individuals pursuing a degree at the National Gallery.The program is part of a yearlong initiative announced by the National Gallery in March 2020 that aims to engage with the themes of poetry in a more personal way. “Our Fellows will be asked to create a poem about their own lives, their passions, or a theme from a poem or poem-reading group,�", "The next Biennial should take place in the autumn of 2020. Starting on February 18, the exhibition will be divided into three sections: 'The Art of the Deserts, The Landscape of Nature, and The Body of Nature.”  Pace Gallery will also introduce a new quarterly platform that will bring together artists and collectors. The first edition, The Landscape/The Landscape of Nature, will inaugurate in October, 2020; the second The Landscape/The Landscape of Nature, will take up the theme in March, 2021; and the third, The Landscape/The Landscape of Nature, will be held in December, 2021. “We are thrilled that the design and construction teams led by James Levey can deliver on the many artist expectations set by Marc and Chiara,” Jane and Doug Prothero, and Tanya and Thomas Bidwell, Jr. The foundations will each receive $5,000.“We celebrate the engagement of the partners and their respective teams in this year’s exhibition, and look forward to their next stages of development,” said Cullen Wilson, president of the Pace Gallery. The new platform will be co", "The next Biennial should be announced sometime in 2020. The exhibition will then resume with a new assembly of the community.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, announced today the appointment of Risa Jakobsson as its next director. Jakobsson comes to the Hirshhorn from the Metropolitan Museum of Art in New York, where she has served as deputy director of curatorial affairs since 2015. Previously, she has held positions at the Institute of Contemporary Arts, Chicago (ICA Chicago), and the Museum of Modern Art, New York.“Over the last decade, Risa has helped build the Met’s collection and exhibited work at the forefront of the contemporary art movement. In 2018, she was chosen as the winner of the Tate’s Tate Artist’s Award, a $75,000 prize that honors outstanding curatorial practice, and has also received a number of awards, including the Guggenheim’s Treble, in 2019 and the Prix d’Art Contemporain in 2020,” said David Felsenthal, chair of the Hirshhorn’s board of trustees. Julia Ortega is retiring from the Metropolitan Museum of Art after", "The next Biennial should take place at the newly constructed Art Institute of Chicago (AIC). Its grand opening ceremony will take place on June 16. The biennial will focus on “intersection of art and design,” a theme that will be revisited in the biennial’s fifth edition, which will take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has unveiled plans to redevelop its campus with a new 8,000-square-foot art museum designed by the same team that designed the Museum of Modern Art, which opened in 1999 and closed in 2005. The former studios of the Museum of Modern Art (MoMA) have been renamed the Museum of Design, and the museum’s new location will be situated in the former studios of the Los Angeles County Museum of Art (LACMA), the city’s largest arts and culture institution.“This is a moment of profound change for Los Angeles, and for the city of LA,” said Mark C. Stern, director of the Los Angeles County Museum of Art (LACMA), in a statement. “When we began the search for a new home for the museum in 2008, it was", "The next Biennial should take place in 2020, but the current plans for the 30th don't line up with the 2020 date. Artnews wrote about the current state of the museum in a September 2018 issue: “At an art event that celebrates the progressive, the optimistic, and the human spirit, the Flemish pavilion will also take a new direction in 2020. The collection and exhibition will be based on the current exhibition program. The question of what will replace it will be addressed by the director, Margot. The selection panel will rotate between a selection of works and a variety of topics.”  The pavilion will be housed in an undertaking that was established by the Flemish state in the early 1950s. The building will be divided into three areas, the curator’s studios, which will be hosted by the museum in the center, the audience’s rooms, which will have a unique museum-like atmosphere, and an auditorium. The Flemish Design Museum will also continue to operate as an institution, as it has for the last forty-eight years, in the Mez: the museum is currently planning to open a new museum in the Mez on the other side of the capital.", "The next Biennial should be held in the fall of 2020. Founder and director Christopher Atkins told American Ballet Theatre in New York that the 2020 event will not feature an original work, but will feature works that address topics related to the themes of the year and “will do things that we have never done before.”The biennial will be held at the Metropolitan Museum of Art, the Library of Congress, and the Smithsonian American Art Museum. The 2020 edition will run from January 23 to January 25, 2020.The 2019 edition of the biennial, entitled “Beyond the Globe,” was curated by Alison Feather and featured works by a selection of artists including Adam McArthur, Kandinsky, and Martha Graham.\n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has added three new members to its board of trustees: James Paul Giamatti, a former president of the United States; Andrew Kastner, a retired general and a vice chair of the board; and Michael Osterloh, a director of the Los Angeles County Museum of Art.Giamatti, who served on the board from 2017 to 2017, said: “James Giamatti is a seasoned board member with deep experience in overseeing a", "The next Biennial should be held in 2022; the first in 2019. \n“The art of the future is staring us in the face, and we are powerless to stop it,” said Annie Dorsen, chair of the exhibition. “The third biennial will present a new and radical interpretation of the Biennial, exploring the question how we might change our own lives, and how we might change the world.” The new exhibition, “What Is Art?” will be curated by Rasmea Agha, chair of the exhibition program; Ruth Bremer, the curator of the show; and Thomas Chiu, director of the San Francisco Museum of Modern Art. The trial runs of the exhibition will run from March 16 to March 29. The event will be held as part of the 2017 IAC/BIC trial program, which ran from October 3 to October 6. “It is a moment of great joy and uncertainty for me to welcome Wolfgang Boccher to the San Francisco Museum of Modern Art,” said Hans von Tripps, director of the Museum of Modern Art. “His museum will become a beacon of", "The next Biennial should take place in the summer of 2021. The museum has also invested in a new exhibition space and a digital archive. The institution hopes to send some of the works in its collection to the New Museum in the fall of 2020, but this is still an early date and the works are currently on display in the newly renovated gallery.\n\n\nThe British artist Mark Rothko, whose work was influenced by both his childhood and the depths of his own experience, died on Saturday at the age of eighty-two.Born in London in 1940, Rothko began painting at age twelve, drawing and painting at thirteen, and photography at fifteen. His career began with a series of drawings published in a 1950 issue of Art Newspaper, which was edited by Richard Avedon. Rothko began his first solo exhibition at Tate Britain in 1953, and his first major retrospective at the museum in 1965. After the London-based artist founded his own eponymous practice in 1976, it has since expanded to include solo exhibitions at the Tate Modern in London, the Serpentine Galleries, and the National Portrait Gallery in London, as well as a series of anthologies, including Mark Rothko: Homage to Life (2011), and Mark Rothko", "The next Biennial should take place in 2021, following the biennial’s 2023 opening. \n\nThe Museum of Art in New York has received a gift of twenty-six works by ten artists whose works have previously been on display in the museum. The gift included works by Richard Avedon, Kathleen Cleaver, and Edward H. Weinberg. The works were originally on display in the exhibition “Avant-Garde Women” (2014–15), which was organized by the Avant-Garde Foundation and the Whitney Museum of American Art. The exhibition was closed to the public in March 2019 following the death of artist Rosemarie De Sousa, who was eighty-two years old at the time.During the exhibition, the works were displayed in conjunction with works by the other participating artists. The exhibition “Me/theater/Art” was also briefly closed to the public in June 2019 following the reopening of the museum as part of a renovation of the building in 2021.The MAs’ exhibition is one of several ongoing scholarship efforts that seek to celebrate the contributions of women artists of the twentieth century. Other notable scholarship projects include the exhibition “The Women Artists of French Modernism", "The next Biennial should be held in 2022 in the form of a three-year online program. In response, the government has launched a crowdfunding campaign for the first exhibition, which will be hosted on the WEB. The programme will be organized globally, with the first show celebrating the theme 'The Coming Storms: The Fifth Element, a New World Order.”The project will be centered around the theme “Art and the Storms,” which was selected by a jury comprising Alistair Bevan, director of Tate Britain, and Ada Lovelace, director of the Tate. The exhibition will open on September 9 and will run for three weeks.“The use of the term Storms is an important moment in the modern history of art,” Bevan said. “The hashtag Storms2018 provides a new and timely way to engage with the current political and social moment, and to create a platform for dialogue around complex issues.”The new exhibition will focus on the “tactics of political violence,” with the theme, “Theology, Politics and Violence” being one of the themes that will be introduced throughout the biennial, which will feature seventy-five contemporary artworks by twenty", "The next Biennial should take place in 2020. The announcement came a day after the US president signed an executive order that outlines his plans to aggressively reduce the size of the federal government and its spending. The states will lose one-half of their federal funding through furloughs and furloughs and the National Endowment for the Arts (NEA) will lose another $1.2 billion.Trump made the historic move to reduce the size of the federal government in a 2015 statement that said: “I’m going to restructure the way we do business in a way that makes it much less politically susceptible and gives us the flexibility to grow the economy and create jobs for hard-working Americans.” As part of the restructuring, the NEA will lose more than $1 billion and the National Endowment for the Arts (NEA) will lose nearly $900 million.The changes were made in order to “use our business as a laboratory, a prototype, to see what kind of impact small government can have,” Trump said in a statement. “After careful consideration, I’ve come to the conclusion that the best way to promote job creation and economic growth is to be more", "The next Biennial should be held in the spring of 2021. While organisers are working to finalize a site in the city for the exhibition, they did not rule out the possibility of holding an exhibition in the area in the future. In support of the arts, the museum also announced that it is creating two new positions in the collection. One of these positions will be a consulting curator and the other will be a full-time museum administrator. The new roles will be funded by the Science Museum, which is also responsible for the acquisition and display of works by a number of artists, including Frederic Remington, Jean-Michel Basquiat, and Gérard Manet. Remington’s work will be featured in a special exhibition at the museum this fall.\n\n\nThe Museum of Fine Arts, Boston (MFA) is in discussions with New York and London galleries about possibly opening a new exhibition venue in the city. The London-based dealer Artforum reports that the MFA is currently evaluating the feasibility of opening a new venue, which would host three million items of art annually, in a building currently occupied by the Hartford Museum of Art.“I don’t think we’re going to have an exhibition in", "The next Biennial should take place in 2020 and ‘the future of art’s relation to the environment will again be the subject of two extraordinary exhibitions. The first, curated by Wolfgang Kopp and featuring artworks by Kopp’s daughter and her husband, will be at the Museum of Fine Arts in Hamburg in 2020 and will be open by invitation only. The second, curated by Kopp’s son Wolfgang Kopp, will be at the Museum of Modern Art in New York in 2020 and will be open by invitation only.Kopp’s work is currently on display in the space “Unstoppable: Art and the Environment” at the Museum of Modern Art in New York. The institution will stage a reopening exhibition of Kopp’s work on the premises of the Museum of Modern Art on February 25, 2021, and a new exhibition of Kopp’s work will open by invitation only on March 5, 2021. The sculpture-maker’s son Wolfgang Kopp will direct the exhibition at the Museum of Modern Art in 2020.\n\n\nThe Sackler family has agreed to pay $1.5 billion to settle a class-action lawsuit brought by hundreds of former", "The next Biennial should be held annually in the second half of the year. The future of the exhibition is unknown.\n\n\nThe Art Newspaper reported that the jury in the Art Basel Hong Kong exhibition “Kunsthaus Beijing,” which opened in March 2019, has announced that the event will not go ahead as planned, citing the potential loss of the event’s $37,500 budget. The Artforum reports that the venue had been planning to put on “Kunsthaus Beijing” but was forced to cancel the event after it was informed that it had been awarded the $1.3 billion Hong Kong Art Museum (HAMP), which had been held up for months as the venue for events including the Ma Art Museum in Beijing, the Hong Kong Center for Art, and Hong Kong Contemporary Art Fair.Kunsthaus Beijing is scheduled to run from August 25 to September 16. The event, which had been postponed several times, was supposed to take place at the Kunsthaus in Frankfurt in July. However, in a move that has outraged some art dealers, the Kunsthaus in Frankfurt was forced to cancel the event. Their contract with the city of Frankfurt had been extended through 2024 and would have run", "The next Biennial should be held in 2021. “We are currently collaborating with local and international artists and artists-in-residence in order to foster their visions and their creative practices,” said Louise Blouin, director of the Biennale de Lyon. “The hope is that this project will become a long-term model for exhibition design in the future.”The Biennial will also employ a Guggenheim-designed site for the 2020 edition, which will open in May of 2020 and be hosted by the museum until December of 2020. The project was first announced in the spring of 2017.\n\n\nThe National Gallery, the Metropolitan Museum of Art, the Museum of Modern Art, and the Whitney Museum of American Art have launched online viewing rooms for the first edition of the Whitney Biennial, which will run from May 25 to May 30, 2020. The online viewing rooms will allow visitors to experience the exhibition as it will be shown in New York on May 31, 2020, and at the Met through September 7, 2020. The first viewing room will be open on May 31, 2020; the second online viewing room will open on May 29.“This is a historic exhibition, a retouched version of the exhibition", "The next Biennial should take place in 2019. “It’s been a great ride,” said cofounder and CEO of the New York–based firm eLife.   “The last few years have been remarkable. We’ve had great success in building and operating our platforms, but we still had a lot of work to do in raising the funds to help develop the exhibition and the digital platform. We’ve had a lot of help from our investors and partners as we expanded the exhibition and the online platform. We’ve had great success in meeting our fundraising goals, and we’re confident that the next iteration will be even better.”\n\n\nThe Museum of Modern Art in New York has appointed Jamie Campbell as its next president and CEO. Campbell will be responsible for overseeing the museum’s expansion into a new cultural space designed by the same groundbreaking architects who designed the institution’s previous home, the Third Reich’s Olympic Stadium, and will assume his post in the coming months.“Jamie has been instrumental in the museum’s transformation from an isolated collection of one architect’s designs into an integrated and highly visible cultural institution,” said Michael", "The next Biennial should be held at the Art Institute of Chicago in the fall of 2022. \n\n\nThe Smithsonian’s American Art Museum (SAAM) in Kansas City and the Metropolitan Museum of Art in New York have announced that they will cancel their spring 2020 events, which were scheduled to take place in April and May, respectively. The postponement is made at least in part due to concerns about the coronavirus, which the Centers for Disease Control and Prevention (CDC) has already estimated to be responsible for approximately one hundred thousand deaths in the United States. The first episode of the pandemic, which began in Wuhan, China, in December 2015 and brought the virus to thirty-six countries before it was contained in December of last year, has been blamed for triggering a global resurgence in the disease.The Smithsonian announced the postponement of its March 22 event “The Great American Dream”\u0097the first in a series of three biennial presentations that would have addressed themes of American art from March 19–March 22\u0097on March 23 and March 29, respectively. The March 26 event “The Art of Being: Pushing the Limits”\u0097comprising works by thirty-six artists\u0097was also canceled", "The next Biennial should take place in Tokyo in the first half of 2019 and be a retrospective of the work of Murasaki Shiga, a Japanese artist who lived and worked in Japan from 1930 to 1944.Shiga, who studied under the legendary artist Nara Ozawa, created works that often incorporate everyday materials such as fabric, metal, paper, and rubber, and often depicted objects such as umbrellas, cars, food, and flowers. The exhibition will also feature works by members of the Nara Ozawa collective, including a collaboration with artist Auguste Rodin entitled 'III: SPACE/I: THE SHADOW, 1929–1936,” which will open at the Biennial in June. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is removing three thousand works by artists and collectors whose works were acquired through nepotism, abuse, and other ills. The museum said that sales representatives pressured the artists into making payments, resulting in collections that were never properly analyzed.The exhibition, “The Collection and Market of Art,” will close on November 21. The first part of the exhibition will examine the ways in which art has been marketed and reexamined over the years. Pieces from", "The next Biennial should take place in 2019 (when the exhibition will be the last to run in the venue).\n\n\nThe Bechdel Test, an initiative of the New York International Biennial, has released the results of its fourth annual survey of artistic achievement, which began on September 9 and runs through November 2. The biennial, titled “Becoming,” and will air on the Biennial Stage at the Whitney Museum of American Art in New York, and will feature works by seventy-five artists.The biennial, which was organized by the Brooklyn-based organization Bechdel Test, tallied more than 4,500 entries from forty-two artists representing forty-eight states and the District of Columbia. Among the works that were chosen for the biennial are The Unseen, a series of paintings that included only the artist’s own photographs; Endless Light, a series of drawings that were not accompanied by photographs; and the Autobiography, which was constructed from photographs of the artist’s life. The exhibition will highlight the work of thirteen artists whose works were selected from the Biennial Series.Since its inception in 1994, the biennial has been billed as the “gold standard” for the", "The next Biennial should take place at an outdoor space in downtown San Francisco. This is a critical time for San Francisco, as it heads into its second year of a $3 billion bond cycle, and the city is facing a severe financial crisis. The event should be a platform for the city’s artists to present their work. The institution’s director, Julia Salter, said: “The Biennial has long distinguished itself as a premier platform for artists and has been a driving force in encouraging more experimentation with digital media and new media. We are thrilled to continue to serve our artists by creating an inviting and accessible environment for their work to be exhibited.”\n\n\nThe Middlebury College Art Museum in Vermont has received a $10 million donation from the Hathaway-Friedman family, which owns the company that owns and operates the world’s largest privately held art museum, the Tate. The gift, which comes on the heels of a $8 million donation from the Morgan and Morgan Walton foundation, also includes a $7 million gift from Warren and Lois Walton, the former owners of the fossil-fuel and tobacco companies Philip Morris and Imperial Oil. According to the New York Times, the William and Mary Museum in Virginia received", "The next Biennial should be held in the coming years. \n\n\nA memorial for the victims of the Chernobyl nuclear disaster has been unveiled in the Ukrainian city of Priyanka in the capital of Belarus. Named after the city of the Chernobyl nuclear catastrophe and designed by the famed Georgian architect Frank Gehry, the sculpture, named after the city of the Chernobyl nuclear disaster, was inaugurated by President Alexander Lukashenko.The memorial, titled Białystok,’s Concert Hall, commemorates the victims of the Chernobyl nuclear disaster and was built in the city of Białystok, Belarus, on the site of the former site of the Chernobyl Nuclear Power Plant. The memorial was created by sculptor Tgacheva Sviatoslavko. It depicts the victims of the Chernobyl nuclear disaster in their homes, in their yards, and on their balconies. It also features a large silver statue of a woman, wearing a pink dress and holding a bouquet of flowers, who is identified as the mother of V.A. Kalashnikov, a prominent art dealer and art collector who was one of the owners of the artworks that were shipped to Russia in an attempt by Belarus to", "The next Biennial should take place in 2020-21, at a venue to be decided by the Board of Directors of the Arts Biennials. The proposed 2020 theme for the event is “In Praise of Life.” The board added that this year’s event will not be “an ‘event,” but will “speak of ‘life and the world.’”\n\n\nThe Museum of Modern Art (MoMA) in New York has unveiled its 2020 lineup of artists who will participate in its annual Art Basel fair. Titled “Art for Life,” the exhibition will take up themes such as ecology, the environment, and reproduction, and will run from September 11 through September 14, 2020.“After a decade of organizing, we are thrilled to announce our 2020 artists that will represent the United States at Art Basel,” said Marc Spiegler, head of the US-based independent organization. “By incorporating themes and contemporary art practices from the year 2020 into a fair year around the exhibition will foster a year-round experience for collectors and dealers. As an international museum, we are confident that this year’s event will be a great success", "The next Biennial should take place in 2021. \n For many years, the biennial was a platform for artists to express their artistic ideas and for students to experience and appreciate their work. In recent years, however, it has become increasingly problematic for small and mid-size galleries to have a fair here in the United States.  The biennial has had numerous financial and logistical setbacks. Last year, the New York–based artist Ana Mendieta—who was invited to the event by the New York City Department of Cultural Affairs as part of a pilot program that aims to engage and promote artists who have made significant contributions to American culture—was forced to cancel her show in order to be at the fair. Citing concerns over the current state of the biennial, the city of New York has since stopped issuing citywide passes and instead will offer them to affiliates for a fee.In an attempt to mitigate the financial impact of the biennial on smaller galleries, the fair is charging galleries $50 per day for online viewing rooms. The event is also donating $10,000 to the New York City Alliance of Museums, a nonprofit that supports arts education, and is planning to hold an additional", "The next Biennial should be held at St. Stephens, London, in 2021. \n       \n\n\nPioneer Works, the London nonprofit that assists artists and small to mid-size galleries in the United Kingdom, announced today that it has received a gift of ninety-nine works by seventy-five artists from the collection of the award-winning British artist Ian Cheng. The works, which were donated by Cheng, include works by Painter-in-Residence, David Hockney, Tadao Ando, and John Akomfrah, among others, and were acquired as part of the organization’s new $1 billion partnership with the National Galleries of Scotland.“This is a truly historic year for the National Galleries of Scotland, and a very exciting time for the artists that come together to make this country such a wonderful and accessible place for everyone,” said Charles Mackay, the director of the National Galleries of Scotland. The partnership also marks the first time the National Galleries of Scotland has collaborated with the artist, who is best known for his sculptures and paintings, and will mark the institution’s centenary in 2021. The National Galleries of Scotland, which has", "The next Biennial should include the work of Shawila Farsi and Pamela C. Brown, as well as the work of Kamala Harris, Jamal Husain, and Jennifer Pinheiro, and is planning to present a selection of new works in 2021. \n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is expanding its involvement in the ongoing struggle for racial justice. In a statement, the institution said it is planning to stage a series of events, including memorials and talks, in the coming months that will address issues of community and community trust.“We have been following the work of Black Lives Matter NYC and its organizers for more than a year now, and have been following their lead closely,” said museum director Daniel H. Weiss. “Over the years, we have collaborated with activists, scholars, artists, and organizations to address issues of community empowerment, community control, and community healing. We hope that these upcoming events will help us to continue to shape the future of Black art, activism, and our institutions. We are committed to empowersing communities to shape their own futures through the art they create.”The upcoming exhibitions include “", "The next Biennial should be held in late June or early July. • Jann Wennerwill, director of the Museum of Contemporary Art in New York, has announced that the museum will postpone its June 25–June 28 exhibition and reopening dates as a result of the coronavirus. Speaking to Artnet, Wennerwill said, “We were not prepared for the response from the public. The last exhibition was a disaster, and the last show was on the verge of being canceled. This means we will not be able to commission new works, and we still do not know when the show will reopen. We are still assessing the long-term effects of the Covid-19 outbreak. We will see.”He continued: “Our artists are exhausted. We still have a year to go before we open in March. We want to be open by June 30. We are not able to predict how long this year will last—it could be five years or ten years. We are still analyzing the international coronavirus outbreak and its possible impact on our artists. We are still assessing all the necessary steps to take to minimize the risk of further spread. We cannot predict the future. We will see.” The inaugural", "The next Biennial should take place in 2019. His plans to return to the United States have been disrupted by the Covid-19 outbreak.  The artist’s next show will be held at the Museo de Arte Contemporáneo in Santiago, Chile, in October 2022.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has received a major gift of works by the late artist and educator Günther Huyghe, known for his pioneering use of the four-dimensional representation, the art of black and white, in his works and installations. The Met, which has been working on a project to re-create the landmark 1965 sculpture, called the gift a “significant step toward realizing Günther Huyghe’s dream of organizing contemporary art in a way that would be accessible to the public.”The gift includes three new works by the artist, a large-scale installation at the Met and the restored Kirchmann Bust, which was displayed in the museum’s collection for more than fifty years, as well as a collection of works from the Günther Huyghe collection that were previously on display in", "The next Biennial should be held in 2021. The recent defeat of the Islamist insurgency in the Sinai Peninsula in an Egyptian military operation in June, and the subsequent fall of the Islamist government, has led many to believe that the event will be canceled. The Museum’s director, Raed Salah, defended the institution’s decision not to hold the event, saying that it was not an “ideological excuse” to reject film-makers who are “not interested in stirring up trouble.” Salah went on to say that the museum is “not against the arts.” He also said that the decision was not related to the fall of the government; rather, he said, the museum supports the “progressive vision” of the upcoming exhibition “A Song of Two Cities,” which will be curated by Mehdi Pitti, who was appointed as the interim director of the Sudan Museum in February 2018. \n\n\nThe Museum of Fine Arts (MFA) in Miami is working hard to avoid a costly and disruptive closure as a result of Tropical Storm Dorian. It announced on Thursday that it has modified its plans to reopen in the coming weeks and will instead be opening gradually in phases", "The next Biennial should take the form of a group show featuring work by fifty artists, including Aaron Sarna, Trisha Brown, Linda Coleman, and Kiki Smith, inaugurated at the Fourteenth Venice Biennale in 2007. The group show will feature works by sixty artists, including Cécile B. Evans, Nada Ferber, and Suellen Sánchez, in addition to a selection of works on paper by twenty-three artists from the United States and Europe.The biennial will also include a new line of photography, a new writing and photography program, and a new box that will present microformats of MFA’s works, which will be displayed on a wall in the exhibition space. The exhibition is scheduled to run from March 3 to March 5. For a full list of changes, see the artworldwire.com. \n\nKatherine McCain’s work has been recognized internationally for its artistic excellence by the Lambda Literary and the Philadelphia Museum of Art. In 1981, the Odessa-born, New York–based filmmaker was awarded the Prix de l'Orangerie, a prestigious award that is given by the Lambda Literary and the Philadelphia Museum of Art each year to", "The next Biennial should be held in Geneva in the second half of December, and the third in October 2021, according to the organizers. The biennial will also include a special exhibition of works by notable non-Canon artists, and will be hosted by the Institute for Contemporary Art in the Center of Geneva, the Grand-Duc Jean, and the Central Library of Geneva.An exhibition of works by the Swiss-born, New York–based artist, whose work focuses on the interaction of art and nature, will also be staged at the Museum Bern.The biennial, called “Between the Specter of Creation and the Specter of Degeneration” and curated by Florence-based artist-producer Maria Bickel, will decide the fate of the historical building in the center of Geneva, which has served as the focal point for people from all over the world to gather and view works by European and American artists. The main venue of the exhibition will be the Guggenheim Museum, which will also be re-created in a new exhibition space called the “Histori-Archiv” and will enable the museum to present more exhibitions.Sara Ziffer, the chief curator of the Biennial de Lyon, France,", "The next Biennial should be held in the autumn of 2020.\n\n\nThe Art Newspaper reports that the Museum of Modern Art (MoMA) in New York has canceled a presentation of the work of the Portuguese artist Peisisto Herculano in 2015 following a dispute over a painting by the artist that was on display in the institution. The exhibition was slated to be part of the residency program, but was postponed due to the Covid-19 pandemic.After the exhibition was rescheduled for the fall of 2020, the museum confirmed that it is once again postponing the show. “The show is still on track for 2020,” a spokesperson for the institution said. “We are always evaluating our exhibitions and our exhibitions are always on track for 2020.” The exhibition will still be held, but will be moved to a different venue, and will be presented by alternate artists.The move was made in order to avoid disrupting the residency program. The exhibition is currently being curated by Joan Mitchell, who has previously presented the work of Herculano and Velázquez. The show will now be presented by the artist Andrew Klimchuk, who is currently working on a solo exhibition at the museum. The other artists represented in the", "The next Biennial should be in the summer of 2022, so that the festival can continue to grow in worldwide recognition. \n\nThe Seattle Art Museum (SAM) and the Seattle Art Museum (SAM) are offering every year four artists from the United Kingdom by popular demand. The artists are Rebecca Blackwell, Hannah Bell, Jay-on, and William Hudson. “We are so proud to have these four outstanding artists to join us on our journey to reclaim the art of British Columbia from the political and corporate board games of our time, and work for a more just, just, and just society,” Martin Lee, director of the Seattle Art Museum, said in a statement.Artforum recently spoke to Blackwell, whose work will be included in “A Better Future: British Art and the Essential American Art of the Modern Era” at the Met, about how art has been politicized and distorted in the service of white supremacy since the British Empire was founded in 1643. She explained: “In a world of mass surveillance and mass incarceration, where the state terrorizes and tortures Black and indigenous people at an unimaginable pace, it has never been more important than now to reclaim the art of British Columbia.” ", "The next Biennial should be held in 2020. The first edition, entitled “HELMUT BIRTHDAY,” was staged at the Museum of Contemporary Art, Los Angeles, in December 2018 and was nominated for a Hugo in 2019. The first edition of “HELMUT BIRTHDAY,” was followed by three reprints, the most recent of which was published by the International Committee of Museums in Paris in November 2020.“Irene Menotti’s art has never been so sharply and revealingly alive and complexly articulated,” said Mary Zollner, chair of the board of trustees of the American Alliance of Museums. “It will be impossible to overstate the impact of her powerful and moving work on the art world, and on the world at large.”The biennial will be held simultaneously on television and in person. The first edition was broadcast on PBS in the United States on October 23, 2019, and will premiere on PBS in the United Kingdom on February 12, 2020. The London-based organization will then organize a biennial for Spain, where it plans to stage the first show in the Venice Biennale in March 2020. The exhibition will be", "The next Biennial should focus on the development of a new and next-generation institution for the study of the city’s art and the contemporary Hong Kong art scene. “The development of a new venue for the exhibition of art is essential for the future of Hong Kong,” said Hong Kong’s deputy minister of cultural development, Yoon Young-koo, who also pointed to the museum’s ongoing exhibition program as one of the best ways to support the city’s art scene.\n\n\nAs part of a long-term collaboration between the Museum of Fine Arts (MFA), Philadelphia, and the Chicago-based nonprofit Artadia, the five-decade-old institution will reopen to the public and the public at large next year. The reopening of the eighteen-acre facility will coincide with the annual Artadia Open, which will take place at the museum from January 6 to February 10.The first show of the exhibition, “The Infinite Dialogues: Contemporary Art in the Age of Black Power” (2019), will be on view until March 6 and will include works by seventy-seven artists from twenty-five countries and include works by artists such as Basquiat, Marc Chagall,", "The next Biennial should be held in 2020. \n\n\nThe National Arts Council (NAC) in Washington, DC, has issued a moratorium on new arts center construction in anticipation of a global pandemic. The council made the announcement in a statement on Monday, November 16, after a meeting that drew more than 200 representatives from fifty-eight countries.The global health crisis has prompted more than twenty-five thousand people to emigrate to northern Europe, Africa, and the United States in order to avoid travel restrictions. While the United Kingdom, which recently announced that it would begin welcoming visitors again, has yet to announce whether it will welcome large-scale events, celebrations, and celebrations, and other major events are being canceled.France, Germany, and Austria have also announced that they will suspend new arts center construction in an effort to reduce the number of visitors to France from the onset of the crisis. On Monday, chancellor Angela Merkel said: “I cannot overstate how important it is to build new artistic and cultural infrastructure to support our creative professionals, and to be able to keep people together in a globalized world.”In response to the NAC’s announcement, a spokesperson for the arts said: “The NAC is evaluating the", "The next Biennial should have been held at the Museum of Contemporary Art in London. The other major arts institution, the British Museum, cancelled its next edition in October and said it would move the exhibition to a different location.As the London-based Artforum reported on Wednesday, a group of artists and activists are petitioning the government to create a new body to oversee the redevelopment of Tate Britain and the British Museum. While the government has acknowledged the need to create a new statutory body to oversee the cultural institutions, it isn't currently planning to do so.Instead, Culture Secretary Maria Balshaw is proposing that an autonomous governing body, made up of a select group of arts and cultural workers, would oversee the restoration of the two cultural institutions in partnership with the public. “We must ensure that the cultural sector creates the social and economic change for which the British Museum and the British Museum Legacy Fund were founded,” she said. The artists and cultural workers who are spearheading the campaign to save the institutions are questioning the government’s handling of the Covid-19 pandemic and questioning whether it is actively trying to downplay the importance of the cultural sector in helping the cultural sector recover from the pandemic. They are also", "The next Biennial should be on the theme of materials: “Architectures make up life\u0097life is a language,” said David Lewis at the contemporary art fair. “We must question how we make sense of the world.”In an attempt to push back against the “structural realism” of the exhibition, which portrays large and intimate structures as if they were mass-produced objects, the biennial will host a number of around-the-world exhibitions, including one exploring the philosophical and spiritual aspects of architecture, with exhibitions of work by Brazil, Japan, Korea, and Tehran.Other programming in the new exhibition schedule will include a retrospective of the work of the late British architect and theorist John Graham, who explored the role of architecture in the development of the concept of architecture, and “The Stanford Ergonomic Foundation,” which will feature work by fifteen contemporary artists, including Renzo Piano, John Akomfrah, and Thomas Krensi, and will run from March 13 to March 17.The opening of the exhibition will be marked with the theme “New Perspectives: Architecture and Design” and will bring together ninety artworks by thirty-five artists\u0097including Thomas Dolby and", "The next Biennial should be held at the Museum of Modern Art or the Museum of Modern Art, New York (MoMA). The theme of this year’s edition is “Up Close: Biennialism and the Pacific,” and the exhibition will consist of thirty-four works by thirty-six artists. The artists selected for the exhibition are: Adrián del Rio, Laura De Cotto, Tanya Mendiola, Gisèle H. Pérez, Juliana Serrano, Tyron Cowper-Mosley, Agustín Sepúlveda, Rirkrit Tiravanija, and Valentino Trescan.The audience for the exhibition will be selected by a selection of the artists and will be announced in an open letter on December 23. The artists chosen to represent Chile at the Venice Biennale include Xaviera Báez, Jorge Benítez, Mira Cipolletta, Lourdes Fuentes, Ângela Núñez, Ondine Pires, Kana Gould, and Roberto Rizal. The Australian pavilion will be comprised of Julia Bruce, the Australian artist-in-residence at the", "The next Biennial should be held at the Museum of Contemporary Art in New York in 2021. \n\n\nThe 2018–19 season brought twenty-seven new exhibitions, including thirteen that were not previously on view, at the New York Museum of Modern Art, the BALTIC Center for Contemporary Art (BCCA); and the New Museum in New York. Among the works that will be displayed in the 2020 iteration of the Art of the Party is the first show to be dedicated to the film and television series The Sopranos. The series, which chronicles the rise and fall of a drug-trafficking empire, will also feature the work of more than seventy artists, including Hans Hof, Olga Gabler, Robert Irwin, and Paul Graham, as well as the Brazilian artist Aline Sousa, an early pioneer of Brazilian drawing.“The show opens with a new, forty-five-foot-long installation, part sculpture and part installation, that charts the various relationships between the two worlds of the artist: art and the movies. The work’s first installation is a print that uses a combination of 240 high-school students and a video game called the Bomberman to create an abstract, surrealistic art installation that resembles", "The next Biennial should take place in the spring of 2021, and will include works by forty-six artists, including Masahiro Nara, Tanya Bonakarn, Xavier Hufkens, Hsin-Chien Huang, and Hiroshi Kawakami. The exhibition will also include a biennial-long retrospective of work by Marc-Antoine Lebeau, a Paris-born and New York–based artist whose oeuvre spans paintings, photographs, video, sculpture, performance, and performance-based art.\n\n\nThe Guadalajara-born, New York–based artist Ana Mendieta, whose lifelike sculptures fused graphic realism and the sculptural work of Matisse, Gauguin, and others, has died at age seventy-five. Born Ana María Pérez in Puerto Rico in 1962, Mendieta moved to New York City when she was six. She began using art as a tool for social change, challenging the norms of her childhood and joining the LGBTQ community. Her drawings and paintings have been exhibited at the San Francisco Museum of Modern Art, the Hammer Museum, the Museum of Modern Art, the Metropolitan Museum of Art, and the Los Angeles County Museum of Art. A selection", "The next Biennial should take place in 2022, and the next in 2023.\n\nThe board of the museum’s student-run organization, Biennale Los Angeles, is proposing a change to the Museum’s founding principles. The group is proposing a new set of exhibition guidelines that would shift the focus of the institution away from “art” and toward “the history of ideas.”The proposed changes were outlined in a statement by the board of directors of the school, which is affiliated with the Museum of Contemporary Art, Los Angeles, in an email sent to students on Thursday.The university said that the board’s recommendations will “help us to define future activities and the future of the school.” The school’s next board meeting is scheduled for July 23.\n\n\nThe Museum of Contemporary Art (MoCA) Los Angeles is closing its doors for a fourth year. The announcement comes after a tumultuous four years for the institution, which has been plagued by a series of closures and financial woes. When the institution reopened in March 2018, it was already making inroads into the major arts and culture tourism sector, with new initiatives such as the new $10 million Cultural Arts & Culture Fund and the", "The next Biennial should take place in 2021, with the showpiece being the first Toronto Opera House production in the iconic building since it closed in 1967. The theme, “Das Leben,” will explore the relationship between the Canadian landscape and the city’s history, with the goal of raising awareness of the city’s ecological crisis.London’s Royal Shakespeare Company, which is staging a production of Julius Caesar at the Royal Festival Hall next month, reworked its 2019 schedule to focus more on ensemble casts, revival-style, and a more intimate, multi-person stage. The company also announced that it will stage a new series of world-premiere productions of Charles Dickens’s A Tale of Two Cities at the Palace Theatre from March 26 to April 16.The Royal Shakespeare Company will also stage a new production of Hamlet at the Theatre of the Oppressed in May 2020. The curtain-raiser for the event will be the Royal Shakespeare Company at Lincoln Center, in New York, on May 25.The Royal Shakespeare Company is celebrating its fiftieth Anniversary this year with the release of Julius Caesar, featuring Richard Overy as Julius Caesar, as well as four new introductions and three re-cre", "The next Biennial should include a new collection of the work of Danish artist Tine Grågård, curator Henrik Nygaard, and art historian Berit Paagstrup, whose new exhibition “From the Past and the Present: Art, Politics, and the Struggle for Human Rights” will open in September.\n\n\nThe Public Theater has announced its representation of the work of contemporary artist William Eggleston as part of a new campaign to raise awareness of the international crisis. The artist will stage a show, “The Watermelon Crisis,” at the Public Theater’s new space at 501 W. Twenty-six thousand square feet of exhibition space in the former Dodge plant in the Kensington neighborhood of Chicago. Eggseston’s new installation, which will be staged in collaboration with the German nonprofit S.K.G.E.N., will tour the facilities of the Dodge Dodge Chrysler, which is currently undergoing a $1 billion expansion, and the Chrysler Museum of Art.Commenting on the new partnership, the Public Theater said: “The performances of Eggleston’s work will tell the story of his lifetime and the role cultural production plays in structuring our collective self-image. This is", "The next Biennial should be scheduled to take place in August 2021.\n\n\nThe South Korean artist, who makes drawings, paintings, prints, and sculptures, is being sued by the family of a man who was killed by a police baton charge in Seoul in April 2019. The case has been referred to the Seoul High Court.In the lawsuit, which was filed by Lee Soo-hyun and Lee Eun-guk, the plaintiff claims that the defendant, a doctor who worked at the Seoul Jimgong University Hospital, violated his rights by removing the body of 45-year-old Lee Seo-kyung, a Korean-American citizen of Chinese descent, from his home on March 28 in order to cover up a criminal case of battery.Lee Seo-kyung had been involved in a dispute with the hospital over alleged fraudulently denying a disability check for a client in April 2019. The case was settled in September 2019, but the family has since accused the defendant of trying to extort money from the family by claiming that the check was canceled because of the lawsuit. The lawsuit has been filed in the Seoul District Court, but the court has yet to rule on the lawsuit.The South Korean government is currently investigating whether the defendant", "The next Biennial should also be held in 2021, but the exact date has yet to be decided. The artist-run museum has a space in the former Kuk-Mee Gallery in the Hong Kong district of Kowloon, which opened in 1960, and plans to build a new museum, which will be located near the former Kuk-Mee building, on the site. It will also have an area for educational activities and an auditorium.\n\n\nBaltimore-based artist Kiki Smith is suing the city of Baltimore and the Baltimore Museum of Art (BMA) for violating her constitutional right to due process by removing her work from public view in an effort to promote racial justice. Smith’s attorney, Michael Spalter, told the Art Newspaper that the case stems from his client’s frustration with the museum’s handling of the unrest that took place following George Floyd’s death in police custody.According to the Art Newspaper, a spokesperson for the Maryland attorney general’s office told the publication that “the office does not comment on pending litigation.” However, a spokesperson for the state said that law enforcement officials “have every right to enforce their own policies and to lay claim to sovereign rights.�", "The next Biennial should be held in the port city of Miami Beach in August 2020. \n\n\nThe Marfa Museum of Art in California has announced that it is donating more than 250 works by thirty-nine artists to the Alamo Drafthouse in Texas. The donation—more than three hundred works by artists ranging in age from thirty-five to ninety-five—was made by the Marfa Museum of Art in conjunction with the Alamo Drafthouse’s exhibition “The Dreamer in the Night.” The exhibition was inaugurated by filmmaker Wes Anderson and premiered its first chapter on the subject, which was written by Anderson and illustrator Paul Mpagi Sepuya and shot in the Alamo in 1983.The work is currently on display in the exhibition “The Dreamer in the Night.” In this chapter, the artists recount their experiences of dream­like states of consciousness during dreams and their relationship with their bodily bodies in the context of the Alamo and the Drafthouse, respectively.The MFA Alamo Drafthouse is currently closed due to the Covid-19 pandemic, and the Drafthouse has been working with the museum to reschedule the event. In a statement, the", "The next Biennial should be held in 2022 and will focus on the history of the new museum. The institution is currently planning to construct a new building to house the collection and display the works of more than three hundred artists, and is working with architects to consider the best site for the exhibition, which will take place in the city’s Château Mernita.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is working with the Los Angeles County Museum of Art (LACMA) on the renovation of its former grounds, which were transformed into a major arts and culture destination by the building of its new home in the city. The installation of the new building will include the largest collection of work by the Los Angeles–based photographer Warren Grice, who lived and worked in the building’s former space for almost twenty years.“We are delighted to work with LACMA to restore the LACMA collection,” said Steven DeBode, senior director and chief curator of the new museum. “This is an exceptional collection and one of the most difficult collections in the world\u0097one that has suffered greatly from neglect. In order to restore it, we have partnered with Warren Grice,", "The next Biennial should take place in 2020. Commenting on the biennial, Art Director Carlos Garaizu and Director Sergio Canavero said: “We are determined to continue the legacy of the Biennales, which has been established by the collaboration of many esteemed and talented artists. We are convinced that the new design of the exhibition will offer a new and exciting experience for visitors and will be inviting an eclectic range of artists to create new works for the event.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of artworks in designated cultural institutions. Titled “Bureaucracy, Politics and the State,” the document outlines five steps that can be taken by cultural institutions to avoid censuring or sanctioning individuals or businesses for distributing materials that could be construed as “offensive” in the eyes of the government, including bylaw violations, creating an “unacceptable level of disruption” to visitors, and demonstrating a “substantial and adverse threat of harm to the community.”The guidelines are part of a cultural anti-discrimination campaign launched by Mayor Bill de Blasio in February after a wave of protests against political figures and institutions following the November 8 election", "The next Biennial should be held in January 2021. The selection committee will be chaired by Jean-Michel Molina, president of the B-D Foundation; Anna Wintour; and Mary Mattingly, director of the New Yorker.\n\n\nThe American Ballet Theater (ABT) in New York has ordered that all seventy-one seasons of the company’s current season of A Ballet of His Own, originally titled A Ballet of One’s Souls, be reinstated as scheduled. This marks the first time the show has been canceled since 2017. When the show was canceled, a statement issued by the company said that the cancellation of A Ballet of His Own is not connected to the development of the new Nirvana, which will most likely be staged in New York City in the spring of 2022.The statement continued: “The decision to cancel this season in favor of the new show was both a personal and professional one. I have been working on this for some eighteen months now. The show was made possible through the collaboration and vision of a group of extraordinary artists whose work I admired and who I had worked with for years. I would like to dedicate this season", "The next Biennial should include a discussion group on the history of art in the Americas with an overview of the history of art from the Americas and the Americas and the evolution of art in general, and a performance by the artist Juan Carlos Pérez Jascuanta. The exhibition will also include micro-museum tours in Santiago, Mexico City, and Santo Domingo.The museum has reworked its facade and interior in an attempt to create a more welcoming environment for visitors. The renovation, which began last fall, included the scrapping of thirty-five works by the artist, who was born in the Dominican Republic in 1957, and the creation of the new museum at Monte de Oro, in Cali, Los Angeles.The renovation also added two buildings for the collection of the artist’s works, including the Guggenheim, which opened on the campus of the University of California, Los Angeles, in 2018 and the Museo del Barrio in Santa Fe, New Mexico, in 2020, and added two new galleries to the museum. It also added more than two thousand square feet of exhibition space and opened a new lobby on the second floor, which is now surrounded by three old buildings.“It’s been a real", "The next Biennial should be presented by the New Museum in New York in 2020. \n\n\nThe Contemporary Art Museum Sarasota (CAMM) has received a $130,000 donation from the Walton-Dorsch Family Foundation. The gift, which came in the form of a gift certificate for $75,000, allows CAMM to rename a former railroad yard in downtown Sarasota. The new space will be named the Contemporary Arts Center, and will be located on the grounds of the old stately museum.“The Walton-Dorsch Family Foundation has long supported CAMM as a major supporter of contemporary art,” said Jennifer Deutsch, director of CAMM. “CAMM’s history of championing artists who have defined the course of contemporary art, its ability to continue that legacy through the 2022 edition of the Biennial, and its commitment to advancing the art of the future is invaluable to our future generations. We are grateful for the gift and look forward to the exhibition of the Contemporary Arts Center’s first exhibition, ‘Roland & Eileen’s’s ‘Esther & Ericka’s Art of the Future,” in January 2021.The gift was", "The next Biennial should be held in 2023, the same year the museum’s upcoming exhibition “Strange Days: Art and Life in the Late 1960s” will open. The new location for the museum, which is currently housed in a former French munitions factory in the city of Nantes, will be inaugurated by a public exhibition of work by Jean-Michel Basquiat, “The Search for a New Society.” The show will be organized as a platform for reflection on contemporary art and will serve as a platform for the exchange of views and ideas.\n\n\nManifestations of violence and corruption in the modern-day art world are nothing new. But the scale and scale of the crisis gripping the art world has been made all the more acute by the rapid growth of the illicit market for art and art-related goods. While the art world has been forced to grapple with the social fallout from the coronavirus pandemic—the trade in art is valued at an estimated $5 billion and the industry is suffering—the illicit market has expanded at an alarming rate, driven by the financial crisis and recession.According to the Art Newspaper, by 2020 the illicit market is predicted to be worth $18 billion and that thirty", "The next Biennial should be in the Spring of 2020. \n\n\nThe Bops, a contemporary arts venue located in the heart of Tokyo, has announced that it will soon open a new location in the city. Toppled by the Tohoku region and built in a former government factory in the city center, the new venue will boast of more than 1,500 square feet of exhibition space, a café, a retail space, and a restaurant.The venue will remain open during the construction of the Kiyomizawa nuclear plant, which is scheduled to begin generating electricity in 2022, and will be able to become a focal point for visitors from Tokyo, Osaka, and other major arts and cultural hubs. “The modern setting of the institution will provide visitors with a new and interesting experience, especially during construction,” said Tokyo Metropolitan Government (MMG), the agency responsible for planning the project.The institution will be located in the former Nipponbashi government complex, a former government complex designed by the Japanese architect Tadao Ando in 1970 and completed in 1972. The museum will host more than seventy exhibitions, including an exhibition of drawings from the artist’s “Tatsuya Terada” series,", "The next Biennial should include all works by established and emerging artists that have exhibited in the Biennial in the past twelve months. “The museum is committed to supporting the local, regional, and national arts communities and the biennial is one of the most important projects we can do to support and to promote the arts in Manchester,” the museum’s director, Maria Balshaw, said in a statement. 'As we look to the future, I am optimistic that our work to present the next Biennial will be one of the few opportunities for young artists to make a meaningful contribution to the physical and cultural heritage of Greater Manchester.”\n\nThe Metropolitan Museum of Art (the museum) in New York has appointed Sarah Schechter as its next president and CEO. She succeeds Jodi Throckmorton, who has been the museum’s director of public relations and artistic affairs since 2016.“Sarah is a seasoned leader and has led organizations at both large and small scales for more than seven years,” said director Polly Trotman. “She will bring a wealth of experience and knowledge to the Met, and continue to drive its growth as the museum’s go-to organization for", "The next Biennial should aim to draw the attention of the international audience to the contribution of African art to the development of contemporary art in the Americas, especially by presenting a selection of works by artists of African descent. The museum’s master curator, Naima J. Keith, who has curated the exhibition space the Accra Biennial for the past ten years, said: “One of the greatest challenges facing the curator is to participate in such a critical exhibition. The Biennial has been experiencing extraordinary growth in the last decade and is now poised to achieve new heights. I am particularly proud to see how the exhibition has benefited from the exceptional work of the talented artists who have participated.”The exhibition will be the second made in the United States with work by twelve African American artists. The exhibition, “From the Upside Down: Black Art and Representation in American Art” will open at the Museum of Fine Arts, Boston on October 27. The biennial’s exhibition “Spirit of '68,” a selection of works by fifty artists, will run at the Museum of Fine Arts, Boston through December 21. To view a selection of these works, click here.\n\n\nThe sculptor and landscape painter", "The next Biennial should assemble the full body of the collection, and incorporate the work of more than 500 contemporary artists. “We are looking forward to supporting the World Biennial’s artists in their self-directed way,” said Art and Architecture critic Rebecca Schatz, who supported the reopening of the Biennial in 2011. “The sale of the collection represents a new era for the World Biennial. It is an exciting moment to accept that the next edition will be truly special.”\n\n\nThe Michigan Institute of Art (MI) has received a $75 million donation from the Steven and Edythe Collick Foundation for the Arts. The gift comprises a series of grants totaling $68 million, which will establish the Steven and Edythe Collick Foundation, a new, supplemental arts program for Michigan residents; an endowment for the arts; and a new $30 million endowment for the museum.The Steven and Edythe Collick Foundation has awarded $62 million to the institute during the Steven and Edythe Collick Memorial Fund, and $50 million to the Steven and Edythe Collick Endowment during the Edythe Collick Memorial Fund. The Steven and Edythe Collick", "The next Biennial should be held at the Centro de Cultura Contemporáneo in Barcelona on February 15–March 7, 2020. The possibility of a second event has not been ruled out. “The next Biennial will not be a luxury event, but one that will explore the interconnectivity between life and culture,” said Adriana El Santo, director of The Pimps, a contemporary art center in Santa Cruz, California.\n\n\nSince the 2015 terrorist attack in Paris that killed 130 people, France and Germany have been working together to introduce new counterterrorism measures and strengthen immigration and customs checks. The country also expanded its border controls and introduced new fines for noncompliance, and trains and places people in transit through an app.The two countries were even able to welcome three hundred people from North Africa in January. On Friday, German Chancellor Angela Merkel said that the country will now be able to accommodate at least one thousand refugees. According to AFP, the number of people arriving by boat remains high. In March, the German state of North Rhine-Westphalia said it would take in around one thousand refugees by the end of the year. “After a thorough review of the situation, we are", "The next Biennial should be on the Rijksmuseum in Amsterdam, which will stage the next edition of the Hopper Biennial (2019); and next year will host the next edition of the Berlin Biennale, which was canceled due to the Covid-19 pandemic. Next year’s edition of the Holland pavilion, which aims to capture the engrossing moods and vibrant colors of Holland, will be staged in June.The exhibition is organized as follows: Artist Statement: The Hopper Collection presents Art for Tomorrow, an exhibition that returns to the Hopper Collection to highlight the growing frustration and fear that many artists have experienced recently as a result of government inaction. The exhibition, which will feature work by thirty-five artists—all of whom were selected for inclusion based on their work being exhibited at the upcoming exhibition—is organized in response to the recent wave of protests against governments inaction in Europe and the United States. The show will be organized in a way that engages with current issues that address the current moment, such as climate justice and indigenous rights. The fifty-third Biennale will be held at the Künstlerhaus in Kassel in March 2021. It will mark the first time", "The next Biennial should be held in 2021.  An exhibition of works by artists such as Louise Nevelson, Gerald K. Stein, and Jacques-Louis XVI will be presented by the city of New York in 2022. The new Brooklyn Museum is currently working on a redesign that will include a new public experience that will allow visitors to enter through the museum.\n\n\nThe Whitney Museum of American Art in New York (MoA) has appointed Chris Derrick as its next director. Since joining the museum in 2011, Derrick has served as a board member and has advised artists including Peter Hujar, Naama Tsabar, and Thomas Paine. He is also a cofounder of the architectural design firm HOK Architects and has advised a number of cultural organizations, including the Metropolitan Museum of Art, the Brooklyn Museum, and the Whitney Museum of American Art.“Chris is someone who has had a great impact on my career trajectory, giving me the training I needed to succeed as a curator and champion art as a way to get a better sense of what art means to me as a curator,” said museum director Max Hollein. “From the moment he accepted the job, he has shown tremendous leadership, developing the institution’s new", "The next Biennial should focus on the art of creativity, with the aim of stimulating and articulating the ever-changing public discourse around creativity and the possibility of creativity in the contemporary world.”The reform of the 2018 edition, titled “Theorem and Formulae,” was announced by artist-in-residence João Paulista and curator Anita Alfonso, whose work bridges the worlds of abstraction and sculpture. The museum will build upon the themes of “Theorem and Formulae”\u0097a 2013 exhibition of this work by Alfonso and the contemporary Brazilian artist Ricardo Barcia\u0097by presenting the first exhibition devoted to “formulae” in Brazil. The exhibition will feature work by thirty-eight artists, including the Tereza brothers, Roberto and Anton, in collaboration with the Brazilian Academy of Sciences and the Tereza Architecture Museum.“When we talk about art, we talk about gesture, about gestureuality, about the balance between form and content,” said Alfonso, who is also director of the NGO the National Foundation for Cultural Research. “This is the time when we need to re-think the concept of art, to re-evaluate what art is and what art", "The next Biennial should be held sometime between November and March 2021. The event’s director, James‐Cooper, said: “We are very excited to work with the local team, the visiting gallery, and the community to create something that will make a meaningful statement about the work of our time. We hope that you will join us as we embark on this new journey.”\n\n\nThe Museum of Modern Art (MoMA) in New York has hired Dorota Bichu, who previously worked in finance and human resources at the New York City Human Resources Department, to be its next executive director. Bichu, who will assume her post on November 6, succeeds Caroline Ross, who departed the institution on August 31 to head the Scripps Institution of Oceanography in Newport Beach, California.“The appointment of Dorota Bichu reflects MoMA’s continued commitment and commitment to being an institution that is both innovative and forward thinking in its leadership, selection, and philanthropy,” said MoMA director Christopher Campbell. “Her leadership qualities, background, and vision to grow MoMA’s landscape as a destination for contemporary art make her a strong fit for this role. We are proud to support", "The next Biennial should take place in 2020.\n\n\nThe Royal Academy of Arts (RA) in London has commissioned the exhibition “Suzanne Frank’s Last Picture Show,” which is scheduled to open at the Tate until 2021, to the institution next year. The show will focus on the life and death of the recently exiled sculptor Jean-Luc Godard, whose iconic film Aida (1949) includes a scene in which the titular character, played by Christoph Waltz, is shown sitting at a long table surrounded by paintings by key figures in the history of cinema, including Roger Corman, Ingmar Bergman, Ingmar Østgaard Nilsen, Ingmar Oost and Peter Sellars.Rosa Diamand Gallery, which represents the artist, has announced it has received a $54.9 million gift from the Katherina and Robert Kulnoff Foundation. The gift includes a series of works by the Belgian artist that will be included in an exhibition at the Katherina Kübler-Kuhn Gallery in New York on September 22. The Kübler-Kuhn Foundation was established by the wealthy couple after the death of their daughter, Petra, and the foundation partnered with", "The next Biennial should take place in May 2020 and is expected to cost around $2.5 million. A final design for the exhibition was also unveiled at the 2019 edition of the Venice Biennale, which took place at the city’s Palazzo delle Papesse.\n\n\nDue to the ongoing health crisis caused by Covid-19, the Metropolitan Museum of Art (MoMA) in New York has postponed its June 25 launch of its new triennial of works by artists. There has been some confusion over when the twenty-sixth edition of the Metropolitan Museum of Art Biennial will debut. The institution previously said that it would host the exhibition in early July, but it has since explained that the event will now begin in March 2020 and will run through August 21.“This is an unprecedented year for us,” MoMA director Christopher Campbell said. “We are acutely aware of the challenges posed by Covid-19 and the impact that the coronavirus has on our community, and we are fully committed to continuing to offer our audiences the most compelling contemporary art.”\n\n\nThe Metropolitan Museum of Art in New York is continuing to operate as normal following the coronavirus pandemic, but has", "The next Biennial should focus on: ‘Humanity and the Environment: Historical, Current, and Contemporary’s Art and the Present,” said Dana Beyer, director of the Museums Association in New York. It will also consider the ways in which curators are re-creating and reimagining the museum experience through new media.In the next three years, the panel will publish a book on the exhibition, which will explore the history of the exhibition and the exhibition in question; conduct a survey symposium and a biannual exhibition at the museum; and hold symposia, readings, and lectures. In the twenty-second edition of the exhibition, “Art and the Present: A Retrospective,” curated by art historian, curator, and curator Yinka Shonibare, the exhibit will be shown for the first time at the Museum of Modern Art (MoMA). The eighty-six-th Venice Biennale, titled “Art of the Future,” will open in the Italian city on January 5, 2021, and will run through February 28, 2021.\n\n\nAfter the controversial sale of the Canadian national anthem, the Toronto District School Board voted to establish an annual $7", "The next Biennial should be held in the spring of 2021.The biennial’s founding architect, Ma Habashi, said: “The opening of our new space will allow us to introduce the exhibition at a new level. We have created a new platform which will allow visitors to explore the exhibition through a new collection of works, which will be visible to the public.” The exhibit will also receive a new multimedia platform, the “Shiroi Galerie,” which will be free to the public from March 28 to March 31. The exhibition will be hosted by Takashi Noguchi, a former curator of contemporary art, and will draw from the works of eighty artists. The work of Joseph Beuys, a painter who came to prominence in the 1970s following a shift in institutional practice, will be presented as well. The biennial will also include a book.\n\n\nThe Los Angeles County Museum of Art (LACMA) has named Kate Crawford as its next director. Crawford comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as interim director since July 2018. She succeeds Karen DeCrow, who became LACMA’s first director in February 2019", "The next Biennial should be held in 2020; if the event is delayed for any reason, the fifth and final stage of the triennial will remain cancelled.The decision to cancel the event came after French President Emmanuel Macron met with the heads of the French and Italian governments in Paris on June 9. Macron expressed his outrage at the decision to cancel the exhibition, which was organized by the funding agency the Fundación de Investigação Pública (Fundão), which was founded by the old partners of Beppe Grillo, the anti-austerity populist who became Italy’s new prime minister in June. The decision to hold the event in September and fall 2019 underlined the new political climate in Europe, where Macron is trying to push through his controversial 'société nationale,' or 'Europe of nations,” plan, and center-right leader Matteo Renzi’s planned retreat from the EU.In a statement, the Fundão said: “The decision to cancel the 'Autobiennale de Lyon' is not an easy one for us, especially since we have had the exhibition in September 2019 and the reopening of the Centro de Investigação Públic", "The next Biennial should be organized in the Chinese city of Xiamen. The five-day event will open on September 16 and run through September 19. The 2019 edition will be the first for the artist-owned exhibition space the Broad, which has been operating out of the Euler Gallery in London since the late 1980s. The 2019 event will feature twenty-one works by sixty artists.\n\nThe Toronto Museum of Fine Arts (TMA) has revealed that it is planning to release the seventy-second edition of Exposition New York, which was postponed from March to September due to Covid-19, in September. The exhibition, which was originally slated to take place in October 2019, was kicked off by director Marc Glimcher and curators Judson Mitchell and Richard Prus in a letter addressed to the MFA board last month.“While we have been following the closely-watched developments in the US and Europe, we were unable to make any predictions on the future of the entire exhibition,” Glimcher wrote. “At this point, we believe that we will be able to release the second half of the exhibition in October, with the exhibition at the MFA in October September 2020.”The", "The next Biennial should take place in October 2020, with the exhibition currently on view in the United States, Germany, and England. The 2020 edition will be a collaboration between artist-activists Nancy Jordan and David Kula, and will feature works by seventy artists, including Apoorva Naik, Brett Eastman, Glyn Moody, and J. Paul Getty. The 2019 edition was organized by the Los Angeles–based nonprofit Artspace, and was curated by Andrew Kreps, who directed the exhibition from 1998 to 2001. The 2020 edition is being co-organized by David Kula and the biennial organizers with the support of the Los Angeles–based Foundation for Contemporary Art (CAFA), and will take place at the LAXART Headquarters in Downtown Los Angeles.The 2020 edition is revised by artist-activists Elizabeth A. Mitchell and Jack Shainman and will be hosted by CAFA. Its opening reception will be held on October 29.\n\n\nThe Bessie Museum in New York has become the latest institution to welcome four new members to the collection: a group of twelve Chinese collectors who arrived in May from Shanghai and are currently working on a project in the collection, and a group of twenty-three collectors who arrived in March", "The next Biennial should take place at the Golden Lion, Tokyo, in October 2020. \n Next year, the museum will host the sixteenth edition of the Grainger Art and Design Biennial at the Museum of Modern Art in New York. \n\n\nThe Metropolitan Museum of Art (the museum) in New York has announced that it is planning to shutter its regular exhibitions in March 2019 but continue to present new international shows. The March show, titled “Beyond the Frame,” will open on April 7, 2020 and will feature work by ten artists. The exhibition will be followed by a reopening of the museum in March 2021.The decision to shutter the museum has led to a number of complaints from artists and collectors, who believe the museum should have made more of a concerted effort to engage with collectors through projects such as the annual MAMCO (Master of Arts) event, which was meant to coincide with the show, and Sasha Gessen’s new exhibition “The Art of Amelia Earhart,” which will open on November 6, 2020. The artists who have signed the letter are:Abigail Zrenin, Rosalind Nash, and Billie Tsien, among others, have since", "The next Biennial should be held next year, and the first exhibition will open in the summer of 2022.\n\n\nThe New York artist Kai Hoang has won the 2019 Direct Line Award, which is given annually to a contemporary artist who has demonstrated exceptional artistic excellence in their respective medium. Hoang was selected for his installation The Line, 2019, which features the work of nine artists at the Incheon Art and Design Biennial. The work is part of the exhibition “Back to the Future,” which will run until April 29 and will be inaugurated by artist-in-residence Thomas Newson, who achieved fame in the 1990s as the founder of the experimental art program CTCI in Manhattan, and will be on view in the exhibition “All of the Lights Are on,” which opens April 21.Award recipients are selected by a jury comprising artists and cultural writers such as Eric Fischl, Victor Han, and Lee Camp; director of the Center for Contemporary Art Art H. Rafaela; and William F. Buckley Jr., president and CEO of the National Association of Independent Visual Artists. The winner will be announced at a later date.2018 Awards Winners\n\n\nThe Museum of Fine Arts (MFA) has"]