["The next Biennial should take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Rine Dijkstra as the next director of the institution. Dijkstra was selected for her leadership qualities, strategic vision, and ability to prioritize the collection and museum.“Rine is a gifted curator, a passionate advocate for the arts, and a champion for education and research,” said Mary Anne Hufkens, chair of the board of trustees. “Over the last six years, she has given us an incredible collection of works, curated both critically acclaimed exhibitions, and broadened our understanding of what a contemporary art museum looks and feels like. I am excited to work with her to further expand and strengthen the museum’s international reputation and to create new and exciting experiences for visitors.”Dijkstra joins MoCA from the Metropolitan Museum of Art, where she has served as chief curator since 2016, and will assume her new post in January 2020. During her tenure, she developed and expanded the museum’s collection, expanded the museum’s reach, and introduced new programs and tours. During her tenure, she also oversaw the transition of the Met’s collection from a more traditional", "The next Biennial should take place in 2020.\n\n\nBrazilian artist, architect, and filmmaker Beppe Grillo, who has led the country since 1990 and is currently seeking re-election for a second term, resigned from his position this week. Grillo, who was elected in September and will be re-elected in 2020, was arrested last September for inciting racial violence following months of protests against the construction of a new jail.The Art Newspaper reports that Grillo was detained for more than two hours after a group of around five hundred people gathered outside the Federal District Court in São Paulo on August 25 to protest the construction of the facility, the prison for juvenile offenders, and were dispersed by the police. The incident is one of several demonstrations against the prison, which has been criticized for pushing for political repression and human rights violations.Grillo created the EPFL’s “Landscape for Art” series in 2005, which is available in book and sculpture formats, and the “Final Moments” series in 2009, which was also inspired by the imprisonment of Oscar Cesar, the leader of the 2004 protests against the dictatorship of Jair Bolsonaro. In 2006, the two artists were invited to participate in a Brazilian exhibition at", "The next Biennial should be presented by the French director Yves Saint Laurent in 2020. \n\n\nThe University of Pennsylvania Museum of Art (UPenn) has appointed Lauren Strahan as its next director. Strahan comes to the institution from the artist-run nonprofit the Hartsfield-Jackson Atlanta, which she helmed from 2014 to 2017.In her new role, which will begin in October, the Pennsylvania native will oversee the development and execution of the institution’s new two-story, 225-seat flagship building, which will be completed in the spring of 2022. Inaugurating the complex will be an exhibition dedicated to the work of American artists.Located at 875 Fifth Avenue in downtown Atlanta, the building will include 135,000 square feet of gallery space, an auditorium, a public plaza, and a museum. The project’s design, which is inspired by the Hudson Yards developer’s planned expansion of the site, incorporates an urban forest that will host experimental works, such as a series of woodcuts by D. H. Lawrence, in a space that will be located on the second floor.“Leah has been a leader and visionary visionary of contemporary art at UPenn. She instilled a sense", "The next Biennial should take place in the spring of 2022. This year’s exhibition, titled The Disinterment, will be held at the Haus der Kunst, in the city of Munich. In the spring of 2022, the exhibition will be staged entirely by women and will feature the work of around fifty artists.The new scheme, dubbed The Diagrams of Life, will consist of fifteen concentric rings of five hundred individual spheres. The Diagrams will be arranged in a triangular grid and will comprise of five hundred individual spheres. The exhibition will be divided into three sections: The Performance, The Theater, and The Postscript.“We are very excited to present The Diagrams of Life at the Kunsthalle München in the spring of 2022,” said Michael Malsheimer, director of the Kunsthalle München. “We are beyond the completion stage of the installation, but we are all very much looking forward to the opening of an exhibition like this in 2019.” The Diagrams of Life will be joined by the second exhibition of the exhibition, “The Performing Universe,” at the Kunsthalle München in May 2020.\n\n", "The next Biennial should be announced by the end of the month. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that the museum’s inaugural biennial of women’s photography will include thirty-six works by sixty-four artists, including Nell Dorr, Judith Aaronson, and Barbara Gladstone, as well as a selection of photographs from the Marshall Project, the California Women’s Peace Museum, and the Alameda County Museum of Art. Titled “Pax Americana,” the exhibition will be on view until October 28.In addition, the museum has added twenty-six works of contemporary art from the Blue Mountains of Southern California, including four works by artists related to the Blue Ribbon Family, including the Sargent’s Daughters, the Lisa Card, and the Vittorio Cotta.“The exhibition is part of a larger project by MoCA to present new perspectives on contemporary art through the collection of works from the Marshall Fund, the California Women’s Peace Museum, the Alameda County Museum of Art, and the Blue Mountains, and is an extension of the MoCA Women’s Center’s commitment to the collection of", "The next Biennial should look to “harness contemporary Indigenous perspectives” to “explore the practices, ideas, and knowledge of Indigenous peoples of Australia through a global context of Indigenous art, culture, and ideas,” Laliberte told the Art Newspaper. “I’m excited to welcome the diverse artistic and cultural disciplines of Australia to my exhibition.”\n\n\nArtsCenter, the Boston-based nonprofit that supports artistic projects in underserved communities, has announced that it will donate $25 million in grants to Boston-based artists. Each year, the arts nonprofit distributes $20 million to approximately 200 Boston-based artists. The grants will be targeted at Boston-based creatives working in the arts. In celebration of the biennial’s twentieth anniversary, the organization will provide $15 million in unrestricted grants, and the artists will receive another $10 million in unrestricted grants. Nominated by artists Nari Ward and Nari Sadeghi, the grants will be awarded in stages over the next two years, culminating with the artists’ first grant cycle in 2021. The Boston-based artists were nominated by a group of artists, including Adam Davenport, Jocelyn Rosenblum", "The next Biennial should be held in 2021. Further plans to stage several other exhibitions, including an exhibition about the history of art in Japan, a biennial about the ways in which art and architecture are touched by people, and a gala to celebrate the hundredth anniversary of the outbreak of the disease, have yet to be developed. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has commissioned artist Vinnie Bagwell to create a new work for the museum in the coming months. The commission is one of several collaborations between MoCA and the artist. The other works included in the commission are “Forever Blue,” 2018, which is a performance comprised of video installations, live performance, and installation, and “Sensates of Light,” 2018, which is a series of photographs that involve painting, sculpture, installation, and photography.“The museum is absolutely thrilled that Vinnie has chosen to return and present the work of her life to our museum,” said MoCA director Christopher Rilett. “Her work embodies the vitality and spirit of Southern California. Her work is a representative of the heart and soul of our region, and is an extension of our mission to present the best modern", "The next Biennial should be held in 2021. The first exhibition, “How to Get Away with Murder,” was staged in 2018 at the Museum of Modern Art in New York. The second, “The Birth of a Nation,” will open at the Smithsonian American Art Museum in 2021.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Amy Holmes as its next director. Holmes comes to the museum from the Smithsonian American Art Museum, where she has led the Museums Association (MA), for twenty-four years. Under her leadership, the museum has significantly increased its collection, digitization, exhibition and public programming, and collection outreach. She also oversaw the expansion of the museum’s collection of American art in Europe, the United Kingdom, and Asia.“Amy has built a strong reputation for bringing together extraordinary teams to solve challenging and complex problems on a global level,” said museum director Daniel H. Weiss. “As she prepares to assume her new role, we are confident that she has the talent, vision, and ability to make the Met one of the most important cultural institutions in America.” During her tenure, Holmes helped the museum raise more than $125 million for its", "The next Biennial should be held in 2019. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Laura DeWitt as the upcoming director of its new public art collection, which will be housed on site in the former UMass Amherst campus. DeWitt comes to the institution from the Boston Museum of Art (BMA), where she has served as associate curator since 2010. She succeeds Leslie Thornton, who has helmed the collection since 1988, and will assume her responsibilities on August 1.“Laura has been instrumental in helping shape the collection since she joined the BMA in 2008 as senior curator and has been instrumental in transforming the museum into one of the most recognized and admired public art institutions in the country,” said Patrick Meehan, director of the museum. “It is an honor to welcome Laura to the MFA, and I am confident that she will continue to innovate and drive the museum’s mission in service to the public.”DeWitt’s curatorial projects for the collection include “Abandon Your Frame,” 2017, a three-part exhibition, curated by Nicoletta Cantu-Hill, that took a 360-degree view of the collection", "The next Biennial should be held in the same location in 2022. The venue will be moved to a new facility in the former site of the Soviet Museum of Art in Moscow in the years between 2020 and 2022. The institution will spend around $2.5 million on the renovation of the former museum, which opened in 1988. The new thirty-six-thousand-square-foot museum will be situated in the former Tangerashchenskoe plant in central Moscow and will be inaugurated by the artist Mikhail Gromov.\n\n\nCameron Hurst, an American photographer who was based in London since 1972 , has died at age sixty-nine in Los Angeles, where he lived and worked in New York for the last decade. “His photographs and monographic works have been influential in establishing the visual language of the postwar American art in an international context,” Richard Wright, curator at large at the Art Institute of Chicago and the Art Gallery of Ontario, told the New York Times.In the late 1960s, Hurst began to experiment with forming abstract conceptual works, both pictorial and lithographic, with the help of his wife and collaborator, Annie Dore. These images are now considered his first works with the term “postmodern", "The next Biennial should see the work of sixty artists in New York City, curated by Marcelo Bienni and curated by Zomby.Curated by Jim Cotter and directed by Jeremy Podeswa, the event will run from March 27 to March 31, 2020. The exhibition will also feature work by artists such as Shih Chieh-Wei, Mahibol Gaya, and Hsu Jie-Yi. The inaugural show will also feature work by some of the most innovative and difficult-to-place artists working today. “I’m thrilled that our dedicated team of curators is finally able to bring you the incredible exhibition The Best of Expected,” said Craig Jenkins, president of the Biennial. “I’m delighted that our dedicated team of curators is finally able to bring you the incredible exhibition The Best of Expected,” said Craig Jenkins, president of the Biennial. “Museumgoers and scholars will find work unequalled by any other institution in the world.”\n\n\nThe National Gallery of Art (NGA) in Washington, DC, has welcomed a forty-nine-year-old director to its staff and has named", "The next Biennial should be held in 2021. In a statement, the Museum of Modern Art said that the decision to cancel the event was not related to the coronavirus. The museum also said that the decision was made after the museum received information from “several governments and stakeholders across the world, including the United States, China, Japan, and Europe, that the virus was becoming more widespread, and so we’ve been working closely with them to understand best how we could best be a global leader in fighting the coronavirus and how we’ll best be able to care for the many.” \n\n\nThe Philadelphia Museum of Art (PMA) announced today that it will begin welcoming visitors back to the institution for a second consecutive year, effective September 18. Over the course of the next three weeks, visitors will be able to visit the museum through a series of temporary exhibitions and events. The first exhibition, “Blue,” will use the museum’s permanent collection and expand on the themes of the exhibition during the nineteenth century. The second exhibition, “Justice in Pictures,” will examine the legacy of the American artist John Aksel, who was one of the earliest pioneers of the installation art", "The next Biennial should take place in 2020 and will be staged in São Paulo, Brazil; the city of Sao Paulo, Brazil; and the city of São Paulo, Brazil. The 2024 edition will be held at the Museu de Arte de São Paulo (MASP), which has yet to announce a date for the event.\n\n\nA proposed $1 trillion overhaul of the United States health care system is set to go before the American people in November. Advocacy groups such as the American Hospital Association (AHA) and the American Medical Students Association (AMA) have launched campaigns and lawsuits to stop the bill from becoming law, and lawmakers are now attempting to include patient safety and affordability measures in the bill.The American Health Care Act (AHCA), which will be introduced by Republican Congressman Tom Price of Georgia, and Democratic Senator Patty Murray of Washington, would overhaul the United States' health care system by increasing funding for state-based and nonprofit health insurance markets, expanding Medicaid eligibility, and lowering the eligibility age. The legislation would also introduce tax credits and allow insurance companies to sell policies across state lines. The legislation has been dubbed the \"Obamacare for Food and Shelter\" and would be implemented by the Department of Health and Human Services (HHS", "The next Biennial should be held in the spring of 2020. The festival will be hosted at the Museo de Cultura by the Maracayans in the city of Maricá in Maricá, Guanajuato, Mexico.\n\n\nThe Art Newspaper in Paris has revealed that the thirty-second edition of the annual exhibit, titled “Arts in the City,” will be held in the French capital in 2021. The initiative, which was founded by Renaud Léger and Mina Maglo, was started in 1987 to foster more dialogue between Parisian art and the French capital, and has been organized by the city’s museums since 1998. “Since the exhibition was founded, a great deal has been achieved: it has grown to include an international community of artists, exhibitions, books, films, performances, and other programs, and has become a major source of inspiration and inspiration for young artists,” said Jean-Christophe Rochette, president of the French Federation of Arts. The redevelopment of the city’s Museum of Modern Art (MoMA) will also benefit from the work of the local architects and curators Hubert and Sabine Dubois, as well as", "The next Biennial should be held at the New Museum in New York, which has announced plans to open in the fall of 2020. Biennial organizers are currently negotiating an opening date and are waiting for the city of New York to confirm its participation. The 2020 event will take place at Rockefeller Center, where the Museum of Modern Art and the Metropolitan Museum of Art are currently undergoing massive expansions. The New Museum will also introduce a new platform in which visitors can experience works by artists such as Pierre-Auguste Renoir, Robert Irwin, and Laura Aguilar.The 2020 event will be organized as a series of closed exhibitions that will run concurrently and will run throughout the week of June 28-June 30. The first exhibition will be titled “Themes of Fashion” and will focus on the relationship between fashion, politics, and fashion accessories. The project will be organized as a hybrid of a retrospective, a solo exhibition, and a public gathering. The second exhibition will be titled “The Modernists” and will be organized as a “curatorial collaboration” and will feature work by twenty-eight artists who were selected by a special group of curators.“We are thrilled to be able to open the new boundaries of our museum by", "The next Biennial should be in 2022.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York is planning to move the exhibition “A Study in Black,” from its current location in the Center for Italian Art in the Arts to the New Museum in the city. The move has been made in response to the ongoing protests over the exhibition’s inclusion of the work by Hittite artist Pia Camil. According to the Art Newspaper, the show, which aims to “explore the vast and curious worlds of color,” has been conceived as a “compendium of the world’s most important modernists” and will be inaugurated by a new work by Camil, “The Universe Particle” (2017–18), which will be on view until January 20, 2020. During the protests, several leaders of the Italian Art Museum, including Joaquin Monteforti, the president of the Chamber of Deputies, and Claudio Canali, the secretary of the Chamber of Deputies, staged performances of “The Body and the Environment” and “Roots of Black,” respectively. The institution had originally presented the work", "The next Biennial should focus on the history of the contemporary art world and its interaction with contemporary ideas. We believe that this must be a forum for the exchange of ideas and experiences that have been suppressed or denied by the current system. ” The \"Capital Issue\" section of the biennial will focus on the history of art in the capital, while the rest of the program will focus on issues that affect the whole of London.Artforum will keep you updated with more details about the biennial and its upcoming editions.\n\n\nThe organizers of this year’s Venice Biennale have announced that the event will be postponed until at least March 2021. The announcement follows a delay of the event, which was originally slated to run from May to August, due to concerns over the coronavirus. “I want to emphasize that the postponement of the Venice Biennale is not related to the recent events in the United States,” said Arts writer Eli Benai. “It is a consequence of the fact that this is the third edition of the Venice Architecture Biennale, and we have always considered it as an extension of the entire architecture and design field.” The rescheduled event is the latest", "The next Biennial should be held in the city in 2022. The original biennial was organized by architect Sidney Joost, who died in 2014, and a committee of fellow architects led by architect Alan Marquardt. A new exhibit of work by the entire history of American architecture is also slated to open at the Brooklyn Museum in 2020.\n\n\n\n\n\n\nWangechi Mutu, the African head of the United Nations, has canceled the upcoming edition of the United Nations General Assembly in New York, citing the coronavirus as a reason. In a statement on Wednesday, the African head of the United Nations, Nairobi, declared that the United States was no longer able to handle the global health crisis and called for the United States to pull its troops and its diplomats from the United Nations.He said: “Dr. Kim [Netherlands] and I shared a profound sense of resignation that we were no longer able to lead the way of the nations. We judged that diplomatically and informally. We wanted to show the world that the United States truly stands for justice and equality. We were wrong. We are not the right people for the job. We are not fit to take on the challenge.”A number of states have", "The next Biennial should be up by July 25.\n\n\nThe British Museum in London announced today that it is preparing to welcome visitors back to the institution as soon as spring 2020. While the museum currently has no plans for a reopening, director Maria Balshaw said that the institution will continue to monitor the situation and will make further comment when the institution is ready to reopen. The announcement follows a museum tour of the institution, titled The Future is Present, that was given by director Maria Balshaw and Prime Minister Boris Johnson in December of last year. The tour, titled On the Edge, takes visitors through the exhibition space, the museum, and the Department for Culture, Media and Sport (CMS), before the museum and the Department for Communities, Local Government, and Sport (DCMS), one mile away. The tour is part of a yearlong project in collaboration with the museum to commemorate the centenary of the founding of the Department for Communities, Local Government, and Sport, which was established under the First and Second World Wars to provide help to local authorities to improve their local communities.“This is a moment of great change for many communities across the country, and the museum is proud to be able", "The next Biennial should take place in the United States in 2021.\n\n\nThe Art Newspaper has welcomed Simone Brugotti to its team. Brugotti will have her first solo show in the New York City gallery’s history at the Newark Museum on January 22, 2020.“Ruth Ann Brugotti has been the core of the New York City gallery scene since its founding in 1994, when she helped shape the direction of the space by establishing her own studio space in the building. Her captivating performance art, which draws from her own life and draws from the California dream, is a singular presentation of work in the gallery, and as a result her work often finds its way into the public imagination,” Mark Lutz, the Art Newspaper’s founder and director, said in a statement. Brugotti’s work has been featured in exhibitions at the Museum of Modern Art, the Metropolitan Museum of Art, the Whitney Museum of American Art, and the Brooklyn Museum, and is currently on display in “Simone Brugotti: Art and the Life of the Body.” She is also represented by David Koehn Gallery in New York, and is represented by Marian Goodman Gallery in New York", "The next Biennial should take place in 2022. The exhibition, titled “For a Single Night,” will feature the work of more than forty artists, including Richard Anuszkiewicz (1970–1975), Roger Ols (1975–1983), and Elizabeth Peyton (1983–1987). Reviews of the biennial are expected to begin in the spring.\n\n\nThe Art Newspaper in New York has announced that the next edition of its New York fair will be held at Rockefeller Center. The event, titled “Beyond Borders,” will take place at the space from March 17 to March 21, 2020 and will feature twenty-four artist collaborations. The exhibition will feature work by twenty-four artists, including Adam Dziewior (Los Angeles), David C. Driskell (New York), Elis Maria Artola (New York), and Ola Narkhand (New Delhi).“We are incredibly excited to bring the next iteration of the Art Newspaper to Rockefeller Center in New York,” said Ellen Ashery, director of Arts in NYC. “With all of the changes that have taken place in the last few years, and the exhibition’s first focus on African American artists in a quarter", "The next Biennial should be held at the National Museum of Scotland, and a new exhibition should be inaugurated by Salah Abdeslam, whose acts of terrorism inspired countless Muslims around the world.  Abdeslam and the terrorists behind the attacks in Paris last January have been identified, and the authorities are now looking to extradite them to France. “We are committed to working with our international partners, including the French, Belgian, British, German, Italian, Spanish, and Italian and Spanish and French governments, to ensure that any individuals or groups behind the attacks in Paris are identified and dealt with swiftly,” said Deputy Director Kit Brownlee. “This is a global threat, and we will do all that we can to stop it.” \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Cynthia M. Brown as its new executive director. Brown comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served in various roles, including director of education and public programs and chief operating officer. Under her leadership, Brown has increased the museum’s direct engagement with the communities it serves by introducing new programming and by expanding its online presence.“C", "The next Biennial should take place in London in 2022, and the exhibition will also feature works by artists such as Jane Birkin and Simon Dodgson.The biennial is part of a wider initiative that aims to redefine the relationship between artists and governments. The initiative, titled “Foundations of Modern Art” and organized by the Royal Academy of Arts, aims to create a new kind of national museum dedicated to the history of the art.The Royal Academy of Arts (RA) in London established its new flagship institution in 1997, a space dedicated to the history of art in the city, “The Royal Academy of Arts’s newest public museum, The Royal Academy of Arts, The National Museum of Modern Art,” which is currently opening in the city’s Tate Britain, and is slated to open in 2020. The new museum will also focus on preservation of historical works and will incorporate new cultural programming designed to engage with the city.The museum will be inaugurated by an exhibition of the work of five future­-­-­-thriving artists: Janice Rogers Nelson, Jane Birkin, David Cone, and Peter Cook. Sometime between the two of them, they collaborated on the exhibition “The", "The next Biennial should be held in 2020. \n\n\nToday the Museum of Fine Arts (MFA) in Boston announced its selections for its twenty-eighth edition, “My Own Story,” which will run March 21–March 23. The event will also present a wide-ranging collection of works by artists that have lived or are still living in Boston, including Audrey Busch, Alan Menken, and Ruth Rendles, and will focus on issues of gender and gender politics.“The museum has long grappled with the relationship between art and politics in the United States and in the world,” said director Matthew Kull. “When it comes to politics, we're always thinking about how art can be levers for change. We are always thinking about what art can do for us. We are always thinking about what art can accomplish for the creative community. And so I’m very excited about the prospect of collaborating with you and these artists, and to finally be able to share this exhibition with you and to engage with you.”During the exhibition “My Own Story,” the MFA will display work by seventy-seven artists and collectives that have lived or are still living in Boston, and", "The next Biennial should be held at the Art Institute of Chicago in 2021. The exhibition will also present programs and exhibitions that examine issues such as ethics, politics, and technology and will send a representative collection of the exhibition to the US. The biennial will also feature the work of sixty artists from twenty-six countries. The full list of participating artists is as follows:Alex Gernsbacher, Frankfurt, GermanyAnish Kapoor, New Delhi, IndiaChris Jacobs, New York, NYKlaus Biesenbach, New York, NYMichael Hahn, Berlin, GermanyKlaus Biesenbach, Berlin, Germany, Katja Beck, New York, NYSam Clarendon, New York, NY, Sara Cwynar, London, UK, Colleen Gallagher, New York, NY, Christopher Clarke, New York, NY, Jill Grant, New York, NY, Paul García-Maestri, Los Angeles, CAGEO-ELMENDIERAS, Spain, Paulo César, New York, NYWilliam Gibson, New York, NY, Rory Johnston, New York, NY, Sophie Harsha, New York", "The next Biennial should be held in 2022, and the first in the ATLANTIC. “The inaugural exhibition ‘A State of Trance: Contemporary Art in the Age of Black Power’ was devoted to the history of black art in the United States and Mexico,” American and Mexican artist-historians Harun Osman and Jose Maria La Corte wrote in a letter to the organizers of the exhibition. “The New York art world is a world of inequities, and the performances of explorations of a ‘nation of strangers’ imagination and the behavior of an ‘indigenous nation.” In a letter to the artists who participated in the exhibition, the playwright Patrice Comte and the artist Mierle Collège-LeBlanc wrote: “The show was a real world where all the world’s subjects are the indigenous peoples, and where the audience is the indigenous peoples themselves. The performance was a real world where the art was, in effect, made visible by the indigenous people themselves.”Since the exhibition closed out in 1972, the institution has hosted performances by artists such as Alice Aymaras, Carlos Castaneda, and Arturo Miranda, among others. The", "The next Biennial should be held at the museum in five years. To facilitate this event, a new collaborative platform called openmuseum.com will host the biennial.The exhibition will also include conceptual presentations of new works by women artists including Silvia Conti (Milano), Susana Dosto (Edinburgh) and Victoria Meade (New York) and will include a special exhibition of paintings by Margaret Mitchell. “We are very excited to have such a strong and ambitious collection of contemporary art in the United Kingdom,” said Mark Sawyer, the director of the Museums Association. The exhibition will also include a selection of works from the collection previously exhibited in the museum in the form of a virtual tour, curated by Alison Rees, the executive director of the British Contemporary Artists’ Association. This first exhibition, titled The Art of Bénédicte Savoy–Bicocca, was organized by the artist and won the 2019 São Paulo Bienal. In this exhibition, printed copies of paintings by Savoy’s family and her contemporaries as well as paintings that were previously on display in the gallery will be shown in three different locations: the museum, the", "The next Biennial should be held in the spring of 2021. The 41st won't open until at least 2021, but the timeline will be altered for the new exhibition, which will be curated by Alicia Garza, and will take place at the Biennial, not the museum. The thirty-second will open in the spring of 2022, and for the twenty-eighth, in the spring of 2022. For the twenty-fifth, the exhibition will be held at the Museum of Contemporary Art Boston.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released a public health advisory for the middleweight grand prix, which takes place annually at the Metropolitan Museum of Art in Manhattan. The guidelines, which were drafted by the agency and follow a six-month public review period, outline three general strategies for coping with the coronavirus, which has spread to more than 1,800 states and territories in the United States since it was first reported in December, and are meant to be a guide for visitors to the city’s museums.The guidelines—filled with colorful footnotes and citations—recommend using hand sanitizer, washing hands frequently, and social distancing. They also recommend limiting large gatherings and suggest talking through questions", "The next Biennial should be held in December 2020.\n\n\nHotel, gallery, and restaurant owner George FitzGerald has agreed to sell his business to the Los Angeles–based real estate developer L.A. Reid. The auction house estimates the venue will be closed for the next eighteen months and anticipates a December 2020 reopening.FitzGerald had been negotiating with Reid for seven months, the Los Angeles Times reports. While the auction house is not disclosing the terms of the sale, it has made it clear that the sale is not related to the ongoing investigation into the death of George Floyd, who was killed by his girlfriend, Diamond Reynolds, on May 3, 2016, at the hands of Los Angeles County sheriff's deputies.FitzGerald first approached Reid about the property in 2008. Four years later, the auction house moved into a three-story, 280,000-square-foot space in the former Pacific Standard Time building, which was completed in 1993 and named in his honor. The first exhibition by the private entity in its new home was “George FitzGerald: Hollywood,” which was staged at the space in 2016.The auction house previously held a number of major sales in the area. In 2006, FitzG", "The next Biennial should include a presentation of the work of the biennial’s Creative Commons and Creative Commons Attribution 3.0 work, which will be curated by the biennial’s director, Roz Schiller. The exhibition will be hosted in the same building as the museum, in the same space as the biennial, and will be led by the same curators. The theme of the fourth Biennial is “Life After Life” and its exhibition, titled “Life After Life: Painting as a Lake,” will be curated by Joëlle Vidal and Laura Parker. The fifth Biennial will be “Landscape and Life in the Paleolithic” and will be held at Oolite Square in Paris. The sixth biennial, “The Future of Life,” will be presented by the same team behind the popular exhibition series “The Future of Art” at the Museo María de Artesia and the biennial’s largest event, “The Release,” will be at the Pompeu Fabra.\n\n\nThe Australian Museum of Fine Arts (AusMFA) in Adelaide has launched an online searchable database of more than 4,900", "The next Biennial should be held in the autumn of 2020. \nJiang Wei, director of the Shanghai Art Museum, told the Art Newspaper that the institution is currently working on a series of exhibitions that will showcase the work of young artists. Originally scheduled to open in November, the exhibition, titled After­Life” will now open on September 27. The event will feature works by twenty-seven artists and will be held at the Shanghai Art Museum from September 27 to September 30.\n\n\nYale Union, an independent contemporary art center in Portland, Oregon, has received a gift of ten works by forty-four artists from the collection of the late art collector and philanthropist Ann Whitney. Located in the same building as the venerable Whitney Museum of American Art, the museum is planning to donate the works to the forthcoming season of “Polar Express: The Art of Polarization,” an international event that will take up the themes of climate change and shared experience. Whitney’s estate also recently announced the appointment of Robert, Steven, and Norma Tanner as directors.In a statement, the museum said the gift is both significant and unprecedented. Whitney’s daughter, Marlena Whitney, plans to work with her parents�", "The next Biennial should aim to bring the many works that are currently on display together into a single exhibition. The theme should also be “Latinx Arts,” which is a reference to the term “Latinx” in reference to the diverse communities of Latinx artists. The exhibition should begin with an introduction of the title, “Latinos,” and will run through March. The exhibition will include the work of fifty artists, including Jean-Michel Basquiat, Erick Aloia, and Henry Luce.\n\nThe National Gallery of Art (NGA) in Washington, DC, is expanding its funding of free public programming through the Endowment for American Art (AFA), the institution’s charitable arm. Since 2016, the NGA has given more than $500,000 to the AFA, which primarily supports programs that address social justice and racial justice in America.  This year’s cycle, which was launched in partnership with the nonprofit Women’s March, featured over seventy works by fifty-nine artists, including Alex Alvarez, Aristo Campos, Yara Cohen, and Luke Evans, as well as Jill Hennessy,", "The next Biennial should be held sometime this year. The exhibition will undoubtedly be a success, with the International Association of Art Museum Directors unveiling its design for the exhibition in March. The winner of the award will also receive a significant monetary donation from the artist. Art-news reports: The artist is listed as a winner of a special $38,000 Prize awarded by the International Association of Art Museum Directors (AAMD) in honor of the work “(1) that marks the culmination of a very long and rich career, (2) that combines the greatest artistic and intellectual interests of the artist with a strong sense of humor and a sense of humor about both things.”\n\n\nThe Whitney Museum of American Art in New York has received a $14 million donation from the Alex and Edythe Broad Foundation, which was established in 2018 with $12 million from the Broad Family, which donated $8 million in support of the foundation’s charitable work. The gift also includes $5 million for the acquisition of more than one hundred works.The donation is the institution’s largest gift to date and comprises four works by Whitney artist John Lindsay: The Fifth Element, 1971, a painting by Lindsay; The F", "The next Biennial should take place later this month.\n\n\nThe Bridgeman Museum in London has added three new works to its collection since it opened in the city’s Hyde Park in 1937. The museum has announced that Nora Birnbaum’s The Black Tree’s (1937–38) will open at the museum next month, and Reem Akram’s Cairo: The City of Dreams will debut in March. The works were acquired by the museum from the estate of Paul and Anne Birnbaum, who passed away in November 2019.“Paul and Anne’s enthusiasm and passion for art has been tremendous,” said curator and director Tristram Hunt. “They were instrumental in bringing many of the works in our collection to us, and we are so grateful to them for that. After having the opportunity to work with Paul and Anne as part of our yearlong program, I’m excited to see how these works will be received by the vast audiences for which they will soon be commissioned.”Other works added to the museum’s collection include Joan Miró’s No Place to Hide, 1984, in the exhibition “", "The next Biennial should be held in the fall of 2020. That would make for a great exhibition.”\n\n\n\n\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Andrew Schiller as its next director. In the new position, Schiller will assume the helm of the institution from chairing curator of Modern Art and Design (MAD) Garen Richard, who is currently director of the Los Angeles County Museum of Art.“Andrew brings with him a record of extraordinary leadership and a proven ability to build institutional relationships,” said Richard. “He is the perfect person to lead the Museum of Contemporary Art at its crucial moment in its history. The Museum of Contemporary Art is a major cultural asset to the region and the country, and Andrew will make all the necessary and urgent connections across the board to draw the world’s attention to our mission and our work through all mediums.”In his new role, Schiller will lead the museum from the comfort of his home in Los Angeles and will continue to serve as director as part of the Los Angeles County Museum of Art’s cultural and visitor engagement, education, and research, as well as curatorial programs. He will begin his new role", "The next Biennial should be dedicated to the labour of the earth as expressed in the human spirit. The theme should be “Manifestation.” “The future of art is the future of humanity,” said Jewell Blum, director of the Art Institute of Chicago. “We are experiencing a crisis of consciousness, an existential crisis.”The biennial is part of a long-term plan by the museum to reevaluate its relationship with the earth. The museum has been working with scientists to understand how the fossil fuel and industrial complex works, and how these relationships will impact the biennial’s programming, exhibitions, and educational endeavors. The museum’s current exhibition “The Fossil Fuel Scavenger” is part of a larger project to reconceive the biennial, which was initiated by architect John Lissoni and photographer Rupak Desai in the 1980s.Lissoni, who first proposed the event in a 1977 essay in Artforum, followed up with a revised South by Southwest (SXSW) in Atlanta in 1988. The next iteration of the event, “The Fossil Fuel Spectator,” was staged in 1991, the same year that the museum received a", "The next Biennial should be held in 2020, according to the organizers.\n\n\nThe heirs of the late Greek conductor Anton Chekhov are suing the University of Pennsylvania over a potentially controversial painting, depicting the early stages of Vladimir Ilyich Lenin’s famous march to power in 1917, the New York Times reports.The lawsuit, filed last week in U.S. District Court in the Eastern District of Pennsylvania, is one of several against the university over the controversy surrounding a painting by the late American painter Robert Irwin that was hung in the university’s auditorium for more than four decades.The painting, which was part of a series called “Trotskyism” that began in the 1990s, was dedicated to the late Soviet artist Leonid Kozlov, who, like Lenin, became a leader in the Bolshevik party.In the lawsuit, which has a maximum value of $25 million, the heirs allege that the university withheld information about the work’s exhibition at the Museum of Modern Art in 2007 and failed to inform the public about an upcoming exhibition of the work in 2020. The suit also claims the university failed to protect the art by not allowing the museum to sell the work after it was stolen in 2006.The work,", "The next Biennial should take place in 2020. The Museum of Fine Arts (MFA) in Boston and the Whitney Museum of American Art are currently researching whether to move their 2020 events, which have already been rescheduled twice due to the pandemic. Gabriel Baumgartner, the director of the Whitney, said: “We are experiencing a crisis of leadership from a number of organizations, including the National Endowment for the Arts, and the National Council to the Arts. The best way forward for the Whitney and the National Gallery of Art is to remain focused on our core mission of representing the art of the American experience.”\n\n\nA group of artists and collectors in New York are pushing back against New York Governor Andrew Cuomo’s plan to hold a major retrospective of work by Pablo Picasso and Georges Goss in the city’s public spaces this fall. The exhibition, titled “Pablo Picasso: His Life and Times,” will be held in the artist’s hometown of Kassel at the Kassel-based nonprofit artist-in-residence space the Bauhaus, located in a former dairy barn in a former industrial zone on Long Island, and will feature works by thirty", "The next Biennial should take place in the spring of 2020, with a view of its architecture, its composition, its interconnection and its inter-relationship with the rest of the world.” The Biennial of Visual Art is currently taking place at the museum in partnership with the Public Art Fund. Recognizing the cultural and historical significance of the city, the Public Art Fund has committed $7 million to the future of the Biennial.\n\n\nBillionaire collector François Pinault, who amassed an estimated $106 billion fortune by reselling artworks through a network of high-priced resellers at an average of $2,500 a pop, has died at age eighty-one.The French collector was indicted last year by French and international authorities for allegedly cheating the French government out of around $15 billion by hiding the whereabouts of works in an attempt to evade taxes and fines, reports the Art Newspaper. He was found guilty of one count of tax fraud and one count of complicity in tax fraud, but the verdict was later overturned on appeal, and he was sentenced to twelve months and four months in prison. Meanwhile, the director of the Louvre, Anne-Marie Guéhenna, has announced that the institution will welcome", "The next Biennial should be held at the San Francisco Museum of Modern Art (SFMoMA) in the summer of 2021.  A second exhibition is scheduled for the same venue this December. The exhibition will examine the history of dance and its relationship to art, and will feature works by fifty-three artists representing twenty-eight countries and territories. The biennial will also feature a selection of work by artists represented in the first exhibition, which was curated by Alyson Ahuja. “With our new position, we are energetically pursuing this partnership, with the Museum of Modern Art and the San Francisco Museum of Modern Art, with the hope of incorporating the best representative art of each institution in our new space,” said LoGiorno director Ando Pappas. \n\n\nThe British Council has announced the twenty-nine artists who will receive the 2019 Screen Actors Guild (SAg) Award, which honors the best work in cinema created by British artists. The fellowships are given annually to established and emerging artists. “We are thrilled to welcome the twenty-nine artists who have made up the Screen Actors Guild,” said Screen Actors Guild director Paul Mpagi Sepuya, who is also", "The next Biennial should focus on “Sex and Art: An Essay in the Body” (2019), which is curated by Sarah Lawry-Ferguson and will be on view from September 15 to September 19. The exhibition will feature more than 60 works by twenty-nine artists. In a statement, Artadia stated: “We hope that this exhibition will be a significant step forward in bringing together the most relevant contemporary artists in the UK and Europe to reflect on the themes and stories of the exhibition.”Special exhibitions of the biennial include “Dreams from the Body: Reframing the Body,” an exhibition of new works by thirty-five artists and a performance in the exhibition “Dreams – in the Body: The Black Arts” (2019), which is currently on view until September 23.In addition, the biennial will feature the first solo exhibitions of Brodsky, the contemporary artist known for his elaborate sculptures that are created with a combination of pigment, plaster, and clay, and was built to accommodate more than 2,000 artworks by forty-five artists and designers.\n\n\nThe Eugene Arsht Foundation has announced that it will award $2.5 million in grants and scholarships to", "The next Biennial should take place in the West Bank city of Bethlehem from January 26 – January 28, 2020, and should include the first surveys of the exhibition “Microscope ” and “New Light.” The exhibition will be organized according to a theme‐based format that will incorporate 'institutional, institutional, and global relationships,” according to the organizers.The sixty-ninth edition of Documenta Biennale, which will take place in Berlin in June 2020, will focus on the role of photography in the history of art and will include a selection of photographs belonging to the exhibition. Representatives of the Bibliothèques Louvre (BAM), the Fondazione Mario Bickel Gallery (FMG), the Fondazione Salvatore Cercie (CERCO), the Galerie Jules and Marlene Fischer Gallery (GALFE), and the Fondazione Giovan Battista (GBC) will present the first solo exhibitions of the work.Commenting on the Biennale, the organizers said: “In the contemporary art world, biennales are beginning to shift from a monolithic, corporate-centric image to an open-ended and participatory art-making", "The next Biennial should be held in the spring of 2021.  The new site for the 2020 event, the New York Public Library, will host the exhibition from March 18 to March 21. The 2019 event, titled Harder, Better, Ever: The Art and Science of Efficacy, was held at the Museum of Modern Art in New York from February 3 to February 23 and consisted of a retrospective of work by ten artists, including Robert Irwin, Rirkrit Tiravanija, and Nari Ward. \n\n\nThe European Court of Human Rights has ruled that the Austrian Ministry of Culture is violating the international human rights law when it arbitrarily closed down a public art exhibition in support of the ongoing investigation into the country’s deportation policy, reports the Art Newspaper. The group of artists and writers who were participating in the exhibition, “Before the Fall of Vienna”—which was held in the city of Vienna—were only given two weeks to make submissions for a final exhibition. According to the New York Times, the government is planning to hold the exhibition in September 2021, but decided to hold it behind closed doors since the official end date of the investigation is September 23.Government officials cited security concerns as the reason for the closure", "The next Biennial should take place in 2020 and will focus on “the relationship between art and health and how art and health are interrelated. The stage should be massive and include a total of fifteen galleries and institutions. The theme should be ‘Art and the Body’ and the themes should be chosen from a wide range of cultural and social practices and the body as a whole. The pavilion should be a platform for the exchange of art and health information and a place for the gathering of visitors.”The Biennial was established in 1988 by the Tokyo Metropolitan Government and the Osaka Prefectural Government in order to strengthen the cultural and social link between the city and the surrounding area. It aims to reinvigorate the local arts and crafts and create a renewed sense of identity. The Tokyo Metropolitan Government will set the pavilion’s theme and will host the exhibition.The Tokyo Metropolitan Government is also financing the redevelopment of the Ogimo Museum, which was founded in 1889 and comprises a collection of more than 4,500 artworks. The project is being led by the Tokyo Metropolitan Museum of Art and the Tokyo Metropolitan Institute of Art. The museum will receive $10 million from the Tokyo Metropolitan Government’s Infrastructure and Economy, Culture, Sports", "The next Biennial should commence in the spring of 2021.\n\nIn a letter sent to the commission on March 7, Carruth Jenkins, chair of the exhibition, said that the 2020 edition was primarily a re-creation of the exhibition “from the first exhibition in 1972, and a reconstruction of the contemporary world.” The exhibition will also focus on “JFK” (2019), “Art and Identity” (2019), and “Politics and the Body” (2019). The 2020 edition will be curated by the artist-in-residence Loa Seino, whose practice includes commissions such as “Self-Portrait” (2018) and “Feminism and the Body” (2019).\n\n\nThe Royal Academy of Arts has appointed Penny Marshall as its new deputy director for collections and exhibitions. Marshall, who has served as the academy’s deputy director since 2017, succeeds Karen Leong, who retired in October 2019 after eighteen years at the helm of the academy.“Penny brings with her extensive experience and knowledge of art, art history, and collections, and is well positioned to play an important role in ensuring our collection and exhibition programs are equitable and reflect the breadth", "The next Biennial should be held at a location near you.We are eager to hear from you. Please feel free to email me at [email protected].\n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to expand its online viewing rooms by adding two new platforms to the museum’s digital experience. The development follows the announcement of the MFA Digital Arts Center, a new partnership between the museum and the Boston-based digital arts organization the Massachusetts Arts Council, which will invest more than $100 million in the construction of new viewing rooms for the institution.According to a press release, the expansion will allow the museum to present more exhibitions and activities, promote more events, and incorporate more digital platforms. This will also allow the MFA to expand its collection online and offer more opportunities for educational outreach.“As the Museum of Fine Arts (MFA) works to reimagine our future through a more collaborative, interdisciplinary, and interdisciplinary way, we are delighted to announce an ambitious new $100 million expansion for the MFA’s online experience,” said seapony. The  extension will also allow the MFA to introduce new programs and events such as the inaugural Biennial of Modern Art this fall and", "The next Biennial should be held in 2019.\n\n\nTwo years after the London-based charity the Biennial Fund was created in an attempt to reduce the excesses of the art world, a new law was passed that aims to protect the arts in the UK and introduce new protections for museums and galleries that haven't already implemented them.The Prohibitions (Prohibitions and Restrictions) Bill 2016, which was passed by Parliament on Thursday, introduces a number of new protections for museums and galleries. Among the many new measures are a period of six months for museums to reopening following a temporary closure under the country’s new anti-terrorism legislation, and a maximum sentence of seven years for anyone who attacks a museum or a major works of art in the UK.Museums will also be allowed to appeal a terrorism-related court conviction to the Supreme Court—a move that could limit the ability of attackers to receive sentences below two years—and will also have their cases reviewed by a three-person panel that will hear appeals from the public.While the legislation will protect some institutions, such as the British Museum and the National Portrait Gallery, it does not address the many smaller and independent cultural institutions that are not affiliated with large institutions. For many", "The next Biennial should take place in 2022. In an interview with the Art Newspaper in 2010, he said: “I can say that we are not thinking about the future, we are only thinking about the present.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the reopening of three public cultural spaces in the city\u0097the Hudson Yards development project, the Flatiron Building, and the Brooklyn Museum\u0097on February 16.Among the six guidelines are a call for preservation of the elements of the sites\u0097the Flatiron Building, the Museum of the City, and the Museum of Modern Art\u0097in the best preservation practices outlined by the city. The department also recommends that the buildings’ exterior walls be treated with the care and attention that an institution should be accorded in a construction site.A statement from the DCLA said: “The building and interior surfaces of these iconic sites have played a central role in the City’s cultural life for more than a century, and the city is committed to making their revitalization possible for future generations. The cultural heritage of these sites is vital to New Yorkers and their communities, and we must ensure that this history is preserved in the best", "The next Biennial should take place in the Mezzei District of Kiev in 2022.\n\n\nThe Toronto–based artist Ockham, a retired professor of art history and architecture at the University of Toronto, has won the $50,000 Sculpture atelier prize for his work “Amber Waves,” which was included in the thirty-fifth edition of the competition, which brought together more than 1,500 international artists, curators, and art collectors, and will be presented in the city of New York on May 7. The prize jury approved the work’s installation at the end of its deliberations.The exhibition took place in the former factory district of downtown Toronto, which has recently been revitalized by the construction of the $5.5-billion redevelopment of the former Exhibition and Convention Centre site, as well as a $3-billion expansion of the Gardiner Expressway. In the exhibition’s introduction section, the artist wrote: “Amber Waves is an ongoing project of the Toronto-born, New York–based artist Ockham, who is also the founder of the conceptual design firm Voorhees, which designs, constructs, and maintains works by international artists in the United States and", "The next Biennial should be held in 2021.\n\n\nThe majority of artists participating in the fourth edition of the San Francisco Art Talks (SFAAT) “The Future Is Present” have withdrawn their works from the event, which was canceled due to the Covid-19 pandemic. On Friday, September 13, the deadline for submissions was extended from September 11 to September 13. The deadline for works in the exhibition’s Italian pavilion was also increased from September 11 to September 13.According to Artnet, the move has forced the artists to present works that were originally scheduled to be exhibited at the second edition of the fair. “As we work towards healing our communities through the sharing of resources and knowledge, we must also work to heal the world,” said Alexis Sy, a curator and the artist-in-residence at the fair. “This is an urgent time for everyone, and I’m grateful to the talented and dedicated teams at SFAAT who have worked together to create a fair that reflects the vitality of our city and the diversity of our communities.”Artnews reports that the artists withdrawing their works from the 2018 event are Miranda Harrison, Domenick Ensola, Hern", "The next Biennial should be held in 2020.\n\n\nThe Venice Architecture Biennale is shutting down due to the coronavirus. While the Art Newspaper reports that the event, which was slated to run from March 13 through March 19, will still go on as planned, the exhibition’s executive director, Enrico Colantoni, announced that the exhibition’s March 2019 edition will not return for another four years.“In the interests of transparency and with respect to an ongoing project that has been a great success over the last three years, we decided to postpone the show until the end of the third year, and the show should return in 2020,” Colantoni said in a statement. The move has forced a change of plans for many artists who were hoping to participate in the show, which was organized as part of a complex of thirty-three buildings in the Italian city of Venice, and has led some exhibitors to cancel shows and others to move their events online.Among those who will no longer be able to present at the show next year are Francesco del Val, Paolo Gabrielli, and Henrique Medeiros. The artists who have announced their withdrawal from the festival are Nada C", "The next Biennial should be held at the Stadio Olimpico in Milan, Italy, in March 2020. The next Art Miami Beach, Miami Beach Art Museum, and Miami Beach Art Museum will be held in the fall of 2020. The 2019 exhibition “Art in Motion” at Miami Beach’s Art Dubai was shuttered on December 30, citing poor ticket sales. The biennial, organized by the Dubai-based organization Art Dubai, was supposed to focus on the art of motion and was to take place on March 24–March 31. However, after the opening of Dubai’s first exhibition dedicated to contemporary art in February 2020, the organizers decided against rescheduling the event.Dubai’s Art Dubai pavilion, which took place in a fifty-five-meter-long steel cage, was meant to celebrate the opening of the company’s first museum. The opening event, titled “818,” was set to take place on March 9–March 11. However, the show was pushed back to March 20–March 22 and was rescheduled for June 9–June 12.The art center’s director, Mohamed al-Qasimi, said:", "The next Biennial should take place in the city in 2021. “The Biennial is an important document in the integration of art and culture in Lisbon,” said Facundo Oliveira, Director of the Biennial. “I believe that this future architecture will be the most personally meaningful to Lisbon, as it will celebrate the spatial and material diversity of its city. That is why we have chosen to hold this exhibition in the city. The city is central to the future development of Art and Culture, and it will remain so.”\n\n\nThe Whitney Museum of American Art in New York has received a gift of nearly three hundred works by fifty-six artists from a collection founded by artist and philanthropist Doris Duke. The donation includes paintings, drawings, photographs, prints, and lithographs by Damien Hirst, Pierre-Auguste Renoir, Willem de Kooning, and Ed Ruscha, as well as new works by artists from the African continent.The gift includes works by forty-four recent artists and is part of a larger program of work by Duke that she launched in 2017, a year before she died, to support artists working in Africa and the Americas. Spearheaded by her husband, David Duke,", "The next Biennial should be held at a location not distant from the Museum of Contemporary Art Chicago’s campus in 2020. The exhibition will be accompanied by a new book, “A History of the People,” and a new exhibition. “This is the most important year in the museum’s history,” MCA director Anne-Marie Olszt-Bickel said in a statement. “We are creating new opportunities for people to experience the museum together and we hope that by playing a part in this mission, you will be able to.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced the release of a series of guidelines for the disposition of cultural artifacts in state custody. The guidelines, which were developed after the reinstallation of New York’s public artworks in 2016, address the storage, display, display, and transportation of objects in custodial settings, and outline the ways in which artworks can be rehabilitated or redistributed. “The guidelines are a step in that process, but they are not a substitute for the facts and circumstances of each case,” said Catherine Howard, director of the DCLA. “As we", "The next Biennial should focus on \"how the ongoing transformation of our world is reshaping our public space, accelerating the spread of infectious diseases, and threatening the existence of large and complex social structures.”The show will be hosted by historian Lucie Bourgeau, curator and curator of contemporary art at the Museu de Arte de São Paulo; Cristina de Sousa, director of the Museu de Arte de São Paulo; and Cristina Briho, director of the Museu de Arte de São Paulo; and will arrive in the Brazilian city of Porto Alegre, in the state of Pernambuco, on August 31.The Biennial will be inaugurated by a retrospective of the work of the same name organized by Museum of Contemporary Art (MCA) in New York, which will take place at the New Museum in New York City, the Solomon R. Guggenheim Museum in New York, and the Henry Luce Museum in New York, and will feature a selection of work by artists, including Leigh Bick, Anna Atkins, and Gordon-McCoy, among others, in addition to its own exhibition. The show will be followed by a group exhibition at the Museum of", "The next Biennial should be held in 2020 and will be guided by a new theme, “Art and the Narratives,” according to the New York Times. The show will be hosted by Nick Hornby and will focus on the history of photography, with a particular focus on the evolution of the medium since its invention. The exhibition will also include the revival of the exhibition as a curated event, curated by a single curator.“The Biennial is proud to validate and extend what was once an important concept,” said biennial director Doris B. Taggart. “We look forward to continuing to present the exhibition in a way that reaches as many people as possible, in an exhibition that gives them a new sense of belonging.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Julie Deutch, who has served as interim director of the museum for the past two and a half years, as its next director. In her new role, Deutch will assume her post in January 2021 and will begin her tenure in the new year with a retrospective of the artist-in-residence, Mark di Suvero, which is currently on view until January 10, 2021.“I", "The next Biennial should take place in the spring of 2020, with the exhibition opening on September 9. The first edition, “The Unseen Gallery,” will include a retrospective of the work of artists such as El Lissitzky, Mary Rose Carpenter, Lauren Antonoff, and Elyn Zimmerman.The forty-fifth iteration of the Biennial, “The Dilemma of the Mind,” will be held in the fall of 2020. The event will be curated by Simon Laplace and will feature work by artists such as Sean Kelly, Olu Oli, and Alex Tabor.The twenty-sixth edition of the Biannual Arts Biennial, “An Intimate History,” will be held in the fall of 2021. The exhibit will highlight the work of twelve artists whose works have been collected by the museum. The show will address the history of art, science, and the humanities and will showcase works by artists such as Jean-Luc Moulène, Rudy Ozzaro, and Ellis Calder.The artist-run gallery Space for the Arts, which encompasses two spaces in downtown Manhattan, will hold its first artist-in-residence event, a weeklong residency, at the Contemporary Art", "The next Biennial should take place in 2019, and on the occasion of its opening, the festival has committed to publishing a statement on the role of art in the life of a city in 2020. The statement will also present a number of expert reviews of works by Gillian Wearing, Darlington Davis, and Oscar Murillo. The first part of the exhibition will be open on October 30; the second part will open on November 6.The event will also host a number of performances, including one for the children of the city, entitled The City of Ghosts, a collaborative project between six arts and design organizations, including the MCH Group, the Nara Group, and the MCA Group. The event will be held in the city and will inaugurate a new park in the city. The other participating organizations will be: From the MCA Group, which will present a performance for the public on December 4; from the Nara Group and the MCA Group, which will stage a retrospective for the public in collaboration with Mau-Wen Chen and the Bauhaus Museum in Berlin on December 29; and from the Bauhaus Museum and the MCA Group, which will stage a performance for the public on January 6", "The next Biennial should take place in the city in 2020.\n\nThe New York State Department of Cultural Affairs will open a fifty-five-year commemoration of the city’s founding in December 2020, when it will be sixty years old. The event will come amid the ongoing fallout from the coronavirus pandemic, which has killed more than 5,000 people in the US and Europe and caused a staggering number of new cases.The event, titled “Fifteen Years of Biennial,” will be hosted at the New Museum in Harlem and will run through March 23, 2021. The city will dedicate half of the biennial to the history of the city, with the remainder devoted to the history of the boroughs. The city’s cultural institutions will receive twenty-five percent of the gross proceeds from the event.  The announcement of the theme was made during a ceremony at the city’s City Hall, where it was announced that Peter Galbraith, the curator of modern and contemporary art and a founding member of the Museum of Modern Art in New York, would curate the twentieth-century celebration.The twenty-six artists who will be featured in the biennial’s twenty-second edition", "The next Biennial should be held in the spring of 2021. The designer awarded the prize for his work for a new public art installation, called The Process, which was installed on the roof of the Tonkoland Museum, in the city of Kursk, Russia. ADVERTISEMENT Thanks for watching! Visit Website\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to break ground this fall on a $500 million expansion to its David-and-Goliath building, the David-and-Goliath, which occupies a former coal-electric plant in the Bronx. The $1.2 billion expansion will add a sixth floor and a roof designed by the renowned Italian architect Fabio Castellani, who is best known for creating the Greenwich Village landmark the J. Paul Getty Building (GWB), which comprises an environmentally-conscious glass-enclosed pavilion and a rooftop sculpture garden.MoMA has been working on the renovation of the building since 2016, when it opened in 2001 as an extension of its David-and-Goliath, the David-and-Goliath, Memorial Building. In addition to the expansion, MoMA is also constructing a new visitor experience, a digital site for the museum and a café.", "The next Biennial should be held in 2020 and will comprise the following:· A selection of contemporary works by artists from Africa and the African diaspora;· The exhibition of a collection of biennial projects by young and emerging African artists;· A presentation of work by young African artists in collaboration with the Surround Gallery of the University of the Arts, Cape Town, South Africa;· An exchange of lectures and presentations between Adrienne Edwards and Bertha Robichaud, both artists, curators, and scholars; and An introduction to the work of Damien Hirst, Carol Cloake, and Kiki Smith, all curators and scholars.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that Margaret C. Thomas has been appointed as its new chief executive and director. Thomas joined the ICA in 2017 as director of the Leslie-Lohman Museum of Art in Manhattan, where she has worked since 2011. She will assume her responsibilities on July 1.“Immediately, Margaret brings the breadth and depth of experience and intellectual rigor we have enjoyed for many years to bear on the forthcoming years and the work of our great team,” said director Christopher Le Brun. “We are", "The next Biennial should take place in 2021. We anticipate that the event will draw a large audience of over two thousand, and will be able to present an exhibition that retains the unique and impressive masterpieces of its predecessor. The theme for the 2021 edition is Memory, and the biennial will mark the eighty-fifth anniversary of the event. The work of the artist will be organized in a way that allows the audience a distinct space to experience his paintings as an inseparable whole, a diverse and yet connected whole. The program will be divided into two parts. Part I will explore the processes that are inherent in painting and will begin with the painter, with a special emphasis on the central role of memory in painting. Part II will bring together the artists and will cover the performance and performance-making that takes place in the space between painting and the painting.The 2020 Biennial, titled Centre assemblage, was organized by the Museum of Contemporary Art Paris and premiered at the gallery. The exhibition, which includes work by seven artists who are currently represented by the museum, will be on view for fifteen days after the exhibition closes at the museum. Artists: Claude Auger, Anselm Altenmäe,", "The next Biennial should be held in 2021. The official announcement of the biennial will be made at an event organized by the Secretary of Culture, Art, and Sport in Paris on September 21, 2020.\n\n\nThe Art Newspaper reports that the San Francisco Museum of Modern Art (SFMoMA) is looking to move the exhibition “A Million Years of Solitude,” which opened on September 19, 2019, to a different event. Its new date is December 17, 2020. “The exhibition was selected for its historical importance and its exhibition of painterly drawings of the body,” curator and president Peter Matthiessen told the publication. “The museum has moved its exploration of human experience and otherworldly beauty and ideas into the future, and for that I am very excited.”Previously, the museum has staged the exhibition “Between the World and Me,” which opened in February 2019. The show explored the concept of time and the journey of a traveller between worlds, and featured work by two dozen contemporary artists.\n\n\nThe museum’s collection of more than 2,500 works by American painter Frank Stella has been sold by the estate of the American artist. In a London auction held on Monday, the", "The next Biennial should be ready in 2021, and organizers are currently reviewing the 2018–19 season for its 2019 iteration. The theme is “Responding with Resilience,” a reference to the historic first exhibition of art by the Norwegian curator Lars-Erik Olsen.During the 2020 edition, which will have a ninety-day run, the exhibition will feature work by thirty-three artists, including Marcel Prouvé, Stephen Stras, Karla Hill-Page, and Janet Halper, and will also include a documentary about the first artist trials to be housed at the Biennial, and the two-year-long exhibition “The Nineteen-Sixties.” “We are delighted to be collaborating with the South African art community and are looking forward to the 2019 season,”said artist-activists Ola and Pedramala. “The new exhibition will highlight the work of the curators and artists who have worked to make the Biennial unique and will be a great platform for the exhibition of their work on the South African stage.”\n\n\nThe Museum of Contemporary Art (MoCA) in New York has agreed to buy four works by Moroccan artist Walid Raad for its new headquarters", "The next Biennial should begin with a singular event, one that can bring together the most important figures from the cultural and artistic world.”\n\n\nThe Metropolitan Museum of Art in New York has appointed Karolina Pindell as its new deputy director for exhibitions. Pindell comes to the institution from the Museum of Modern Art, which it replaced following a controversy following the death of painter Charles Turner. After a New York judge found that the Museum of Modern Art mishandled the artist’s estate, the institution reinstated the lawsuit but only after it settled for $2.5 million, including $1.5 million in legal fees.“We are pleased with the decision and feel it is the right thing to do,” said Mike Masi, the museum’s director and chief curator. “Karolina’s record of innovation and dedication to the Met’s relationships with artists and patrons is unparalleled. She is an excellent fit for our team and has the ability to bring new ideas and a new level of engagement to the museum.”Pindell succeeds Alison Glynn, who was hired as the museum’s director and chief curator last June, but she began her new role with the Met in January,", "The next Biennial should be held in the autumn of 2021.  Gillian Wearing has also launched a petition for the event to be cancelled, which has over ten thousand signatories. The petition reads: We demand that the 2021 London Biennial be cancelled and that the 2020 edition be rescheduled. We demand a new exhibition that reflects the diversity and breadth of the contemporary British visual arts. We demand that the UK remain a world leader in the production of contemporary art. We demand that the UK not cancel future editions of the Biennals based on the London Biennial, but that they be given a new platform to reflect the diversity and breadth of the contemporary British visual arts. We demand that the UK continue to release and invest in artists and creative workers from all parts of the UK and to continue to welcome new artists from outside the UK. We demand that the UK continue to make the most of its substantial resources and continue to attract and support the most talented and innovative artists from across the globe.We demand that the UK continue to be an international leader in the arts. We demand that the UK not cancel future editions of the Biennals based on the London Biennial, but that they be given a new platform to reflect the diversity", "The next Biennial should be the first given by the Artist’s Union, and it will welcome twenty-three artists, including Adam Dziewior, Osei Taro, and Jiwon Park, who will converge in Seoul in early April. The event will be hosted by the Korean Art Museum, which is currently closed on March 30, and will include a residency program for young professionals.The fourth Biennial will take place in the city of Gyeonggi Province in North Gyeongsang Province, South Korea, in April 2020. The biennial will be hosted by the Gyeonggi Museum of Art and the Yonsei Museum, in Seoul. It will also include a book launch party for the National Museum of Modern and Contemporary Art, which has recently opened in Gyeonggi, and will be led by actress Park Eung-sung. The theme of the fifth and final biennial will be “Innovation and Design.”\n\n\nNew York’s Metropolitan Museum of Art is moving five years of work by the American painter and sculptor Jerome Robbins to digital storage units so that he might have a more secure digital future. The institution confirmed on Wednesday that it is currently working with a company to create", "The next Biennial should be held at the Stedelijk Museum in Amsterdam.In a statement on September 13, the Biennale Foundation said it was concerned over the development of the exhibition, which opens September 10, and its ongoing negotiations with the Dutch government. The statement continued: “The Biennale Foundation expects a positive decision from the Dutch government by the end of the year. If not, then a new exhibition of the Biennale Foundation’s art will open in 2020.”The institution originally announced the date of the exhibition as September 19. However, in an attempt to avoid any disruption to the festival\u0097which is held annually in March\u0097the museums have postponed the exhibition. The one-day event will now be held at the MAMCOklassen gallery from March 14 to March 16, 2021. “We are extremely disappointed by the Dutch government’s decision to pull the plug on the 2019 edition of Art Basel,” said MAMCO founder and director André van de Wijngaert. “The decision has serious consequences for the future of the event. Since 2019, the Biennale Foundation has been working towards securing the future of Art", "The next Biennial should focus on the history of the museum from an indigenous perspective, reflecting the spirit of the region, and will aim to create a series of interrelated works, each addressing a specific event or theme from the museum’s collection.”“We are excited to present the next Biennial to the community of the Palais de Tokyo in Paris,” said Paris’s mayor Anne Hidalgo. “This exhibition has become a part of the city’s DNA, a means to advance the city’s vision for the future. It is a reflection of the city’s history of diversity and inclusivity, a quest for a better future for Paris, and a way for the city to recommence its relationship with the city of Rome.” \n\n\nThe Museums Association (MA), an international advocacy organization based in New York, has issued a statement condemning the dismantling of the National Archives of Scotland and the National Gallery of Art in Washington DC, which were formed in 1863 as the successor to the British Museum. The institutions were dismantled by the Scottish National Party (SNP) in a September 2017 general election, and new arrangements for their operation have yet to be agreed.Since their", "The next Biennial should be in December 2020. While organizers are still finalizing a date for the 2020 edition, some locations will be moved and some will be closed.“The New York Museum of Modern Art (NYMO) is reopening on Monday, December 8, with New Yorkers in their thousands, united by a common experience of beauty, food, and art,” a statement said. NYMO will carry out a major redesign, led by architect André Breton-Jones; the redesign will include the addition of new facilities and services that will draw visitors to the institution. The reopening of the institution will coincide with the Venice Architecture Biennale, which will run from March 18 to March 21, 2021.The upcoming edition of the Venice Architecture Biennale will be held at the Venice Town Hall from March 19 to March 21, 2021. The event will mark the fourth edition of the fair, which will take up the theme 'Creative Destruction,” and will include an exhibition of works that address issues of sustainability and the environment. The theme for the third edition was “Resources and Cultures,” and the work of the creative profession. The work by Yinka Shonibare, Rina Watkins", "The next Biennial should take place in 2020 at the Stedelijk Museum in Amsterdam.\n\nAdvertisement\n\nThe Bechtel Foundation, the London-based nonprofit that supports contemporary art, has named Colin Campbell as its next president. Campbell, who has served as president since 2016, will assume the role of chief executive officer of the organization on September 5. He succeeds Kate Spillman, who has served as vice president for the past ten years, and will assume his responsibilities on September 7.“Colin is a deeply respected global leader of contemporary art and has been a strong advocate of the Bechtel Foundation’s mission for many years,” said Kate Spillman. “I’m delighted that he will continue to lead the Bechtel Foundation and its many partners through this extraordinary global year. His vision and passion for art and for the arts are exceptional. He has been instrumental in securing important works by Matisse, Rembrandt, and Vermeer, and in helping to transform the museum into an international research center and gallery for contemporary art. I’m confident that through his leadership, the Bechtel Foundation will continue to flourish as an essential voice in the global dialogue.”\n\n\n", "The next Biennial should be held at least twice a year. It is proposed that the South Korean pavilion, which celebrated its thirtieth anniversary this year, be relocated to a contemporary art museum in Seoul, and that the museum be supported as a space for exchange.The Future History Museum is a new institution that aims to present contemporary art together with a history of the past that is rooted in Korea. Inaugurating this year’s theme “The Future Is Present,” the institution will present more than 150 works by contemporary artists in exchange for an undisclosed sum. The Future History Museum has also issued an invitation to Japanese artist Takaaki Ochiai, who was chosen to represent Japan at the 2018 Venice Biennale, to participate in the biennial. Ochiai has also expressed an interest in participating in a future edition of the exhibition.The biennial will feature work by more than 200 artists and artists-in-residence. The selections for the exhibition will be based on a theme by the institution. The theme will be “Art and the Past,” and the works will be curated by the biennial’s curatorial team and curated by Japanese artist Norio Terada.The", "The next Biennial should be held in the fall of 2020. This year will include three of the country’s major works, which were selected from a shortlist of twenty-one artists. The winner will receive a prize of $18,000.  Museum Director Erik Berthold said: “We are delighted to be hosting the next Biennial in Dresden. The upcoming exhibition will present a remarkable array of works by a distinguished group of contemporary artists who exemplify the best of modern and contemporary art. The presentation of the work from the exhibition ‘Placemaker’s’s’s collection is a powerful reminder of our history and our future.” The exhibition will be serialized in the weekly newspaper Berliner Zeitung and will be followed by a book tour, supported by Olympia and the Berlin Foundation for Contemporary Art, from January 29 to March 1, 2020.\n\n\nThe Chicago Art Writers’ Association (CWA) announced today that it has established a new $50,000 prize, which honors the excellence of short-form writing in the Chicago metropolitan area. The award will be presented at a ceremony at the Palais de Tokyo in Paris on March 1. The biennial will be hosted by", "The next Biennial should consider how to create a new model for public art that is responsive to the needs of contemporary life, not just in space, but also in relation to the physical environment. The next Biennial should be a platform for a critical engagement with contemporary art. Art, after all, is life: it is what makes us what we are. The future of art is, and will continue to be, up in the air.\n\n\nThe Trinity Museum of Art in New York has appointed Elaine Sacco as its next executive director. In the newly created position, which has been made vacant since the death of director Daniel H. Weiss on February 24, Sacco will assume the role of convener and direct the institution's upcoming exhibition “Theater of Operations: The Gulf Wars” (2019) and will oversee programming across the museum. She succeeds Jeff Rosen, who retired in the spring of 2020 after more than twenty years at the helm of the institution.The announcement of the appointment came amid a crisis for the museum, which recently announced its plans to close another six locations and lay off 30 percent of its staff. The museum’s board chair, John Thomas, told the New York Times that its staff has been “sy", "The next Biennial should be held in Tokyo in the fourth quarter of 2020. The theme of the thirty-first Biennial will be “The future of the earth and its inhabitants. Our role is not to consider the past, but to act in the future.” The programme will be organized as follows. Tokyo: September 2019 – December 2020.Aichi Prefecture: The first half of 2020. Bakarta/Republic of Indonesia: March 2019 – April 2019. Bali: March 2019 – March 2020.Bohusu, Indonesia: March 2019 – May 2019. Bolivia: March 2019 – March 2020. Brazil: March 2019 – March 2020. Burma: March 2019 – March 2020. Cameroon: March 2019 – March 2020. Canada: March 2019 – March 2020. Chile: March 2019 – March 2020. China: March 2019 – March 2020. Colombia: March 2019 – March 2020. Comoros: March 2019 – March 2020. Congo: March 2019 - March 2020. Cuba: March 2019 – March 2020. Democratic Republic of Congo: March 2019 - March", "The next Biennial should be held in November 2020. The committee comprises Dr. David Lebovitz, director of the Diller Scofidio + Renfro, Italy; New York–based architect, urban designer, and proponent of sustainable urban design; Frank Gehry; Professor Carlo Cossu, director of the Pirelli Architecture Museum; and architect-architecture historian Bénédicte Savoy.\n\n\nThe Museum of Fine Arts (MFA) Boston announced today that it has received a gift of more than four thousand works by African American artists between its two locations. Its acquisition includes works by artists such as James A. Garfield, Richard Avedon, Robert Irwin, and Gerald Henry Ford. The fourteenth-century Yancey, Massachusetts, native, who was a passenger in the same train as Martin Luther King Jr., was added to the collection in the days following the March on Washington for Jobs and Freedom, which drew thousands.Alfred W. Koons, the New York–based creator of the balloon animals Tumbi and Tigger, was also added to the collection. Other works to be acquired are Alexander Calder, 1919, a sculpture that examines the relationship between history and art in", "The next Biennial should be held at the Museum of Modern Art (MoMA) in New York in 2021. A decision on whether to follow the example of the Chinese art world in instituting a major retrospective of works from the 1930s to the 1970s is expected this fall. The announcement marks the first time a major American art institution has commissioned a Chinese artist for a retrospective. Sa-ling Yang, who is best known for his work The Golden Horse (1965), was chosen to represent China at the Venice Biennale in 2007 and 2012.\n\n\nThe Roe & Uffner Art Museum in New York has appointed Jennifer Palfrey as its new senior curator of twentieth-century American art. According to the New York Times, Palfrey is the first to head the institution in more than twenty years. She succeeds Sarah Montross, who was hired to lead the institution for a second year in a row, and will begin her tenure in January 2021. “Jennifer is a gifted curator whose tenure at the Roe & Uffner Art Museum has been exceptionally successful, producing some of the most important exhibitions in the museum’s history, including ‘The Borders of a Model,’ ‘The Imitation of Christ,�", "The next Biennial should be held in 2020.\n\n\nThe National Gallery of Art (NGA) in Washington, DC, has released a new set of guidelines on the display of art in public space designed to help the organization better serve the public by facilitating more interaction and greater understanding. The document, which addresses issues such as the display of art within a museum, public gathering, or museum, and is divided into twenty-two sections, including “Visitors,” “Behavior,” and “Awareness.”The guidelines outline three stages at which institutions can display art: “Visitors” (explaining why visitors will see art within a museum), “Behavior,” and “Awareness.” The steps outlined in each stage are as follows: “Visitors: Visitors enter a museum through an open window, and the museum is not physically closed to prevent visitors from entering. The museum will be open to the public from 7 AM to 7 PM by appointment only. The museum will be open by appointment only on weekdays and on Saturdays. Visitors: When the visitor enters the museum, they will see the artwork within the museum. They will", "The next Biennial should be held in 2020. \n\n\nA sixteenth edition of the Edinburgh International Biennial, titled “The Last of the British Isles,” will be staged in the United Kingdom in 2021. The event will be hosted by the Scottish National Gallery, the National Galleries of Scotland, and the National Museum of Scotland in Edinburgh. The exhibition is one of a number of collaborative efforts between the institutions to promote Britishness through new art through “digital colonialism” and will also feature artworks by artists such as Alexander Calder, Jim Watkins, and Anna Atkins.The event will also include the exhibition “Roman Britain,” an exploration into how images of the British Isles have been appropriated by those seeking to embrace cultural nationalism and nationalist narratives, and will present works by artists such as Edward Hopper, John Galliano, and Lee Bonney.In addition, the event will include a biennial of photography, featuring work by the international collective The Roles, which will exhibit a selection of works from its collection in the autumn of 2021. Among the works that will be on display are “Melissa Benham” (1948), a photo series by Mary Boone, “Ishikawa” (", "The next Biennial should have been the one with the greatest number of works, the greatest number of works by the most distinguished artists, and the greatest number of works by the most distinguished composers. ‘The next Biennial’s program should have been a work of art.”\n\n\nIn a new survey commissioned by the National Museum of Scotland, which has been granted the initiative to stage the institution’s first exhibition of contemporary art, the institution unveiled its selection of work by thirty-two emerging and established artists. The twenty-fourth thorough survey, “The Future Is Present,” was given a retrospective at the museum in October and was chosen by a jury of the museum’s curatorial staff.Described as “landscapes,” “intersection,” and “experimental” works, “The Future Is Present” was selected by museum director Elizabeth Curran as a “strong statement of the National’s commitment to the arts.” Curran praised the jury for their strong work in fact-finding and as well as their work in researching works and making recommendations for the upcoming exhibition.“The Future Is Present” is currently on view in", "The next Biennial should be held at least once every two years. The theme of this year’s edition will be “Sustainability and Utopias.”Organizers are also considering the theme “Post-Scarcity” and the exhibition of works by Sara Myles, a curator and artist based in New York, and Matisse Villalobos, a Chilean sculptor, in the exhibition “Ateliers Danssens.”According to the New York Times, the prestigious Berlin Biennale has already faced problems during the construction of the new exhibition space. The project was halted in 2007, when the exhibition was forced to return to Santiago, Chile, from a trip to the United Arab Emirates, and was restarted in 2009\u0097just seven years after the exhibition’s departure for Madrid.While the biennial will be able to welcome more than 1.2 million visitors from twenty-three countries, the exhibition will be closed until October 27. The biennial’s organizers are urging the public to come back to the island for the event. According to the New York Times, the island will welcome visitors again in October.\n\n\nThe Éditions du Monde (designed by Thier", "The next Biennial should be held in 2020. The first was held in 2007, and the last was held in 1987. The 2019 winner was Alexander Caldera, who took the title for his native Argentina.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that William Wegman, director of the Los Angeles County Museum of Art (LACMA), has been appointed its next director. He succeeds Kathryn Finney, who retired after seventeen years at the helm of the LACMA in February 2019.“William Wegman’s background and provenance as a curator, educator, and philanthropist places him at the perfect time to lead LACMA through the restructuring of its collections and the expansion of the Museum of Contemporary Art,” said museum director and CEO Lynne Povich. “This is an incredibly exciting time to be a board member of the LACMA board and appreciative of all the work that has been done by volunteers and donors in the years since we established the board in 2013.”A longtime educator and scholar, Wegman began his career as a curatorial assistant at the Los Angeles County Museum of Art (LACMA) in 1997. He then moved to the", "The next Biennial should be held in 2020, and within a decade it could have a new exhibition dedicated entirely to the Immortals.  \n\n\nThe National Gallery in London is preparing to welcome visitors back to the institution next month following a temporary closure due to the Covid-19 pandemic. The opening of thirty-two new exhibitions and a number of reopening events will take place over the course of the month.Among the major new projects that will be staged in the first week of March are “Tit Dating: Art and Purity” (March 17–March 19), “The Future of Art: Contemporary Immortals” (March 14–March 19), and “Carbon Dating: Art and Carbon” (March 12–March 19). The second week of March will feature “Earth and Ocean: A New Concept,” “Oyster and the Ocean: A Plethora of Colors,” and “Plants and Trees: Calamity and Triumph” (March 13–March 19).The National Galleries of Scotland, which began reopening on March 14, will also welcome visitors to the community gallery spaces across the country on March 15. On March 16, the National", "The next Biennial should be the de facto 'official' show of the global art world in 2020. The project will incorporate a unique ­public platform, curated by a select group of artists, alongside nine exhibitions that have never been staged before and will be powered by a new and innovative platform, the Biennial Portal, that will provide visitors with a direct link to the works in the exhibition.Inaugurating the event will be a 'grand tour' of the Biennial Gate, an interactive display of new works in the exhibition. The exhibition will run from March 12 to March 16, 2020 at the Minneapolis Institute of Arts. Viewing the works will be free for the public from March 14 to March 16. The first exhibition, “The Catalyst,” will be presented by artist and teacher Annie Pape, who has worked with the Biennial Gate for more than ten years, and will open on March 12. The exhibition will showcase work by twenty-six artists, including David H. Kennic, Gerald Nes, Kiki Smith, Paul van den Driessche, and Jerome van den Driessche, among others, and will run for three weeks. The show will have a direct line to the Minneapolis Institute of Art", "The next Biennial should include a statement by anthropologist and curator Jurijus Muijs, chair of the department of art history of the University of Amsterdam, as well as a selection of works by thirty-seven curators from twenty-six countries. The exhibition will be held at the University of the Arts, in partnership with the Dutch Ministry of Foreign Affairs (MoFA).“The exhibition will be organized in the same way as the Biennial First, but with the addition of a new exhibition series with the aim of integrating the art from different eras into one exhibition,” said David Jan van der Vorst. “This exhibition is not just an exhibition, but a new way of studying art, a certain balance of politics and economy, art and culture. In order to make the exhibition work, I need the support of the MoFA. I am optimistic that this will happen. We all need to work together to make the collection and exhibition possible.”The Biennial’s inaugural edition, “30 Years of Painting,” was held in 2015 and showcased more than two hundred paintings over a thirty-year period. The exhibition’s most recent iteration, “60 Years of Photography,” was held in", "The next Biennial should take place in the city in 2021. Carrier’s next iteration will take place in 2022. \n\n\nThe Museum of Contemporary Art (MoCA,) Los Angeles, has appointed Elizabeth Delahanty as its next executive director. Delahanty will succeed Susan Ehrlich, who assumed the helm of the museum in April 2018, when her contract expired.“Elizabeth is a seasoned leadership talent with deep experience and a proven track record of guiding important and influential projects,” said Mark B. Rush, the director of the museum. “She has built the MoCA board into a powerful institution and carefully integrated its collection and programming to advance critical and contemporary art. She has been instrumental in helping the museum become a leading arts institution in Los Angeles and is dedicated to helping it continue to grow and flourish in a more sustainable and inclusive way.”Delahanty will begin her new role on July 1. She succeeds Michael McCaul, who left the arts institution in April to become the next chair of the Metropolitan Museum of Art in New York, and will succeed David K. Galloway, who departed in March 2019 to head the Museum of Modern Art in New York. “Elizabeth brings an excellent record of", "The next Biennial should take place in 2018.  The 2018 Exhibition “Kano: The Palazzo della Pavia” will be held in 2016.  The exhibition will debut at the Westphalischer Kunstverein München from September 5 to September 8, 2020.\n\n\nThe National Museum of Fine Arts (MoFA) in Washington, DC, has received a gift of more than five hundred works by three dozen American artists\u0097including John Edmonds, Lawrence Abu Hamdan, and Simon Callaway\u0097from a group that was founded in 1986. The donation includes works by artists such as George Sargent, John Carlos, John Henry, and Martin Luther King Jr.The group, which often presents works on the museum’s holdings, donated works by artists who have been selected by the museum to coincide with the museum’s centennial in 2021. The works will be on display in the museum’s exhibition “Away from the Mall: American Art in the 20th Century” and will be restored by the institution when the museum reopens in 2022.“The works in this exhibition are a reflection of the different approaches that MoFA has taken in the thirty-two", "The next Biennial should be held in the spring of 2020, after a three-month hiatus. In the meantime, the Royal Academy of Fine Arts (RAFA, London) and the Museum of Modern Art (MoMA) in New York have postponed their upcoming biennial editions, and the Museum of Contemporary Art (MoCA) in New York has temporarily suspended its 2020 event. While the arts sector is generally considered to be resilient and resiliently resilient, the impact of Covid-19 has been felt for months and months, and currently is felt most acutely in the creative arts.According to Artnet, the Covid-19 pandemic has already caused a dire financial impact for the more than 2,300 arts organizations that have shut down or are trying to shut down. According to the New York Times, the number of artists working without a contract is now greater than the total number employed by major American corporations. While some businesses have begun reopening, others are refusing to pay workers or will not comply with government orders to reduce overtime or restructure working conditions.While the arts sector is resilient, it is not immune from the ravages of Covid-19. According to the New York Times, seventy-six percent of those who lost their jobs are", "The next Biennial should take place in 2019. The 2020 edition will be staged at the Sursock Institute, London, in October. The museum will also hold a symposium on the theme 'History, Theory and Experience: The Uncertain and the Unseen', which will be hosted by Sophie van der Kolk, in September.\n\n\nThe Metropolitan Museum of Art in New York has awarded the William Henry Miller Foundation (MWF) $10 million in support of the construction of a monument commemorating William Henry Miller, the American journalist and scholar whose pioneering work on racial justice led to the development of the concept of the 'New Jim Crow'. The $3 million grant was made in support of a $5 million project to add a monument to Miller, who was killed by a white supremacist in New York on Saturday, February 14. Twelve people\u0097including several civil rights and activists\u0097signed a statement of intent to create the monument. The statement of intent, titled William Henry Miller: A Progressive Biennial, addresses the legacy of the American journalist and scholar as well as questions the role of social justice warriors in advancing Miller’s legacy. “Miller was a central and inspiring voice for a generation of activists, scholars", "The next Biennial should be held in 2022. The idea of a series of exhibitions based on the same theme has been around since the 1970s, when the British artist Robert Irwin organized a series in London. The first exhibition, titled The Future Is Now, featured work by American artists such as Richard Diebenkorn, Francis Perron, and Adam Merwin; the first biennial, The Right Shape for a Woman’s Heart, was held in 1977. The theme of the second, Smooth Over the Edge, was inspired by a dream I had about a woman from the future who is caressing my hand in an ancient forest and what it would be like to have sex with her. The third, My Body Is an Assembly Line, is about my experience with pain and how it can be used to create new visions of pain and how pain can be experienced and experienced together. \n\nThe New York Philharmonic, which was forced to cancel a series of concerts in December due to the coronavirus, has announced that it plans to resume the performances of March and May this year, with a view to reopening in late spring or early summer of 2022. The reinstalled orchestra has also revised its 2019 schedule", "The next Biennial should take place on the first Wednesday of the month in the month of March, 2020, at the dell’s headquarters in Rome. It will be hosted by the university from March 13 to March 14, and will take place at the Institut für Kunstkarte und Kunstwerk in Cologne.\n\n\nThe Italian artist Carlo Calandari, who created works such as his famous baby coral sculptures, has died at age eighty-four. The son of a milliner in Cagli, in the province of Lombardy, the son of a barber in Florence, Calandari was a passionate artist who often described his process as “painting on paper.” Born in Savona in 1922, the son of a devout Catholic father and a Jewish mother, Calandari went to the school of the artist Paolo Calandari in Rome, where he studied under Giacomo Cipolletta, the Italian prime minister from 1943 to 1946. He moved to Turin in 1947, where he studied under Christian Mazzei, the director of the iconic Forum di Tricolore, and worked with the Bechmann Museum, the Villa Marta, and the Palazzo Epe", "The next Biennial should be in 2019. The museum will then invite the public to join the exhibition for a tour of the new galleries, which are designed to encourage an open and active exhibition experience. The exhibition “will introduce new and interesting works and will address some of the themes that are most relevant for our society today.”\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is preparing to welcome visitors back to the institution, which was forced to evacuate its staff and its visitors after the highly contagious coronavirus was identified in New York state on Sunday, March 13. All thirty-three of the institution’s fifty-four galleries have been updated with new safety guidelines, and MoMA is encouraging visitors to wear masks during the exhibition.The exhibition, “Avant Garde: The Untold Story,” will feature work by twenty-six artists, including Scott-David Mitchell, Martine Eyles, and Elliot Norvig, and will run from March 17 through March 19, 2020. The exhibit was inspired by an article written by José Pérez-Villar, a critical observer of the forty-three-hour workweek and an early proponent of the hourly wage, who", "The next Biennial should take place in Vancouver in 2021 and will include a selection of new contemporary art exhibitions organized in partnership with the BC Museum of Fine Arts and the Vancouver Art Museum.\n\n\nArt critic Benjamin K. Fletcher, whose critically acclaimed scholarly research and strategic writing drew attention to the intersections between art and culture and established and established art institutions, including the Museum of Modern Art and the Museum of Modern Art in New York, has died at age eighty-four. Fletcher, who wrote extensively about the history of art and its impact on American art and society, was born in 1941 in New York City. After receiving his undergraduate degree from the University of Chicago in 1948, he returned to his hometown to finish his master’s degree at the University of California. He then moved to his parents’ house in suburban North Hollywood, California, where he remained when the war ended. In 1951, Fletcher married his wife, Susan, and they went on to have three children. In addition to his scholarly work, Fletcher lent his name to a number of works, including a show at the MCA in 1957 and ’58 and a 1978 exhibition at the National Gallery of Art in Washington, DC.In 2018, Kohn Gallery in New York staged its first", "The next Biennial should be held in 2020. 2035 is the best date.I am very interested in the next ten years, and the future of art. I believe that we are at a turning point in our history in that there is a new beginning, a new beginning from which we can expect always greater things—not only art but society.My vision for the future extends beyond the next ten years. In the next ten years it will be open to many and will be accessible to everyone. It will be free and it will be diverse and it will be beautiful. It will be a reflection of our times. The president of the biennial has said that it will be the most important exhibition of the year. My hope is that it will be a catalyst for change.”\n\n\nThe Museum of Contemporary Art (MoCA), San Francisco, announced today that it is expanding its curatorial team by bringing on five new curators: Molly Crockett, David Kober, Loring Randolph, and Larry Stier. In addition to overseeing the museum’s exhibitions, among its areas of focus for the 2020 and 2021 years, the curators will work with MoCA’s collection of over five thousand works and the extensive collection of", "The next Biennial should be held in 2022.\n\n\nFrance will soon reintroduce a bust of Philippe de Servet to the capital city of Lyon. The sculpture, titled Les Demoiselles di famille (The Family Dances) and created in 1895, was a monument to the French revolutionary Condorcet. Dubbed the \"Mother of all spritzers,\" the piece made its debut in the city of Lyon in the summer of 1897 and gained popularity in the 1930s.The sculpture, which is part of the city’s collection of eighteenth-century French painter Jean-Luc Godard, was restored in 2016 and is currently on display in a new exhibition, “Jean-Luc Godard: A Retrospective,” at the city’s Institute of Arts. The French government approved the reinstallation of the sculpture in 2017. The exhibition will run from March 13 to March 16 in 2020.\n\n\nThe MoMA PS1 in New York has announced that it is working with the Museum of Modern Art (MoMA) and the Metropolitan Museum of Art (MoMA) in New York to open a new public art collection in the Jewish Museum’s former location on East Seventy-Third Street in Manhattan.The", "The next Biennial should take place in 2020 to coincide with the seventy-fifth Cannes Film Festival. Artforum has reached out to the Biennial to see what will happen next. Artforum will update this story with further information as we have it. The full list of participating artists is as follows: 1. Joël & Edouard Cibelle Fotostasi, France - Photographing a woman in reverse, 2017~2019. 2. Alejandro Campanale, Italy - Belonging to the other, not to the other. 3. María Berrío, Colombia - Expressing herself in different ways, with great affection, in both images and words, 2017~2019. 4. Bénédicte Chedid, France - The searing of a girl, the woman and the daughter in this case a daughter of the Pope. 5. Asya Kawamura, Japan - Grammatically precise, a man and a woman on the brink of love. 6. Shigeru Ieda, Japan - Beautiful girls with big hearts. 7. Andrew Kreps, USA - The first-ever solo exhibition featuring the work of", "The next Biennial should include a survey of its collection and its exhibitions. The biennial is not paying tribute to the biennial, but honoring it. The exhibition was not hosted by the institution. The institution is planning to move the exhibition from the museum to a new home in a residential neighborhood of Atlanta, and will create a new platform for biennial exhibitions in the future.\n\n\nThe Institute of Contemporary Art (ICA) in San Francisco has appointed Marytte Abraham-Reinstein as its next director. The appointee is a veteran curator who has worked at the institute for more than twenty years.“We’ve had a great partnership with Marytte over the years, and I am excited to see where she takes the ICA,” said ICA board president Eric Spero. “At the same time, we feel it’s essential to our mission, and our future, that she continues to be a strong advocate for the ICA, and takes the ICA forward with her.”Abraham-Reinstein comes to the ICA from the Metropolitan Museum of Art, where she has served as a curator of modern and contemporary art since 1989. Previously, she served as the inaugural curator of French", "The next Biennial should be held at the new venue in the spring of 2021. It should be accompanied by an exhibition of the first half of the artist’s works, which will be organized as a retrospective. This exhibition will run approximately three hundred meters, and will be the first commissioned by the artist.The works in the exhibition are as follows:1. The Catacharacters: Selected Works from the collection of José Luis Peña2. The sculptor’s concept of the artist’s body as a living organism\u0097and the physical presence of the body\u0097will be revisited in the exhibition “The Human Body,” which is scheduled to open in the fall of 2021. The exhibition will also include an exhibition of works by the artist’s children\u0097Barbara, Diandra, and Chris\u0097whose practice is influenced by elements of nature. The exhibition will run for one month.\n\n\nA group of artists, designers, writers, and other cultural workers in the Philippines are demanding an end to the arrest and detention of people who are suspected of protesting the reopening of a British colonial-era brownfield site on the city’s southern island of Mindanao.They are", "The next Biennial should take place in 2020.\n\n\nThe Museum of Puerto Rican Art in San Juan, Puerto Rico, has appointed Paula Pérez-Cortés as its next director. Pérez-Cortés comes to the institution from the Museum of Contemporary Art (MCA), Mexico City, where she has served as the director of exhibitions since 2015, 1Y7. She succeeds Tina Pérez, who was hired as director of MCA in 2017, and will assume her responsibilities on August 9.“We are thrilled to welcome Paula to the MCA,” said MCA director, Terri Burke. “Her appointment is testament to her ability and passion for the museum, her ability to prioritize and drive innovative and challenging projects, and her vision for the future of the institution.”During her tenure at the museum, Pérez-Cortés developed and executed the museum’s third unique exhibition, “This Is Not an Art,” (2019–20), a program of solo presentations that engage with issues of art, philosophy, history, and society in a time-based and temporally relevant way. She also organized numerous exhibitions and trainings, including “Girard", "The next Biennial should be in January 2020. The first edition of the new exhibition, titled The Body, was held at the New Museum in New York from November 2012 to November 2016. The following year, the institution staged a retrospective of biennial artist Paul Gauguin’s work The Body and the Soul (T.A.S.S.), a work that was created on the basis of a body that was taken from the artist and returned to his studio to be painted over. “I believe the question of creating a memorial exhibition for the Biennial is a question which can be answered not only by the work of artists but by the work of society as a whole.”\n\n\nThe University of California, Berkeley, will begin welcoming visitors to the campus on September 10 with an exhibition of works by artists from the Pacific Northwest. The event will be followed by two lectures by curator and art historian Peter Levenda, a curator and educator and the founder of the eponymous nonprofit organization Artforum, and an audience with Michael Rosenblum, a senior scholar in Art History at the University of California, Los Angeles.“The series is an extension of a longstanding goal of UBC’s Film and Television", "The next Biennial should be held in the spring of 2020, and the first event should take place in the fall of 2020. The first exhibition in the Fall of 2020 will comprise work by four artists: Anish Kapoor, Agnes Martin, Charles-Marie Leclerc and Guy Debussy. The second exhibition in the Spring of 2020 will consist of works by three artists: Helène Atget, Aline Leclerc, and Édouard Vuillard. The Biennial has announced that it is working with a consortium comprising the Museo de Cultura de Artes Plásticas (AC), the Museo de Cultura de Arte Contemporáneas (MIC), and the organizers of the 2014 edition of the Event. “We are delighted to announce that the next Biennial will feature four of the most important contemporary artists, including the new group of Bénédicte de Montmarnagn, Karina Berenger, and Chloe Donoghue. In addition, we have adjusted the format of the biennial to better reflect the current global situation and the current global discourse\u0097this year’s theme is ‘Empowering Art,’ a collaborative", "The next Biennial should be held at the School of the Art Institute of Chicago (SAIC). The art museum is currently working on its plan to open a new location in the fall of 2020. The Museum of Modern Art in New York has requested a new exhibition for the twenty-fifth edition of the festival, which will be held at the Museum of Modern Art, from the School of the Art Institute of Chicago (SAIC), which is currently overhauling its campus. The proposals for the event have been featured in various media outlets since the announcement of the institution’s intent to organize the event. In an attempt to clarify the status of the institution, SAIC president L. Rafaela Villar said in a statement: “The School of the Art Institute of Chicago (SAIC) has not changed its position on the future of the pavilion. We believe that the development of more dialogue between scholars and the public is critical to fostering a shared appreciation and a sense of history that is at the heart of the pavilion.”\n\n\nThe Institute of Contemporary Art (ICA) in Paris has appointed Kirsten Barlow as its new deputy director. She will take the helm of the prestigious French institution", "The next Biennial should be held in May 2020 and will be hosted by the National Gallery of Australia.  The exhibition will feature work by forty-three artists and will reach a total of nine hundred works. The theme, “Sensuality and the Emotions,” encompasses the body and the mind, the body and the emotions, and the body and feelings. The exhibition will also feature work by twelve artists who will be selected by a new ten-person panel to represent Australia.  \n\n\nThe Museum of Contemporary Art (MoCA), Boston, has announced that it is transitioning from a museum-based model to a more community-centered one. In a statement, director Michael Rosenfeld said that the museum is “already reeling from the impact of the pandemic, and now we face a more complex and difficult year ahead.” “This is a challenging time to reevaluate your mission, to reexamine institutional practices, and to reimagine what it means to be an institution,” he said.The museum rebranded in April from Boston Art Museums (BAM), which is led by Daniel H. Pink, to MoCA. The move helped the institution avoid the fate of two previous incarnations", "The next Biennial should be next March. The next Artforum will be held in May. The next Guggenheim Biennial will be held in October. The next Museum Galerie is planned for July. The next British Museum will hold its first general exhibition in November. The next Royal Academy of Arts will be held in February. The next Tate is currently scheduled for March. The next Somerset Biennial will be held in May. The next Royal Shakespeare Company is currently underway. The next Royal Opera House is currently undergoing a major expansion, and will be on view in April. The next Royal Shakespeare Company will not begin its first season of productions until September. The next Royal Shakespeare Company production will be titled The Taming of the Shrew, and will be staged at the National Shakespeare Company, London, on August 24. The next Royal Shakespeare Company production, titled The Dark, will be staged at the National Theatre in London, in April. The next Royal Shakespeare Company is currently working on arranging a show for the festival of the Royal Shakespeare Company. The next Royal Shakespeare Company performance will be the third part of its series entitled King Lear. The next Royal Shakespeare Company engagement will be the third part of", "The next Biennial should be held in 2021 and will be held in the exhibition hall of the building of the Museum of Modern Art, which was built in the former stone-works factory district of Milan, in the capital of Italy. Reykjavík will be the setting for the exhibition, which will include work by twenty-four artists, including Diego Rivera, Coachella De Cardenas, Fada Kát, Henrique Almeida, Laura Owens, and Alice A. Milsap, and will be presented by director Reykjavík Kaupa.The grand prize will be awarded to the Filippa B. Bjerggaart-Sørensen Prize for Contemporary Art (BBSD), which was established by the Icelandic artist Bjerggaart-Sørensen. The Bjerggaart-Sørensen Prize (also known as the Bjerggaart-Sørensen Prize) is an annual award recognizing a contemporary artist for their best work in the exhibition category. The Bjerggaart-Sørensen Prize is the fiftieth anniversary award of the Bjerggaart-Sørensen Prize.This year’s prize jury comprised", "The next Biennial should be held in 2024. The first will be an “open-air” exhibition of works by the artists featured in the “Presentations” series, which is organized by Sakow and Nakadu. The second will be an “urban ecology” exhibition, which is organized by Nepal Arts and Culture. The exhibition will be held at the Koyamhasara Art Museum in the city of Koyamata, on the shores of the Bay of Bengal, in northeastern India. The Biennial will be a collaboration between Nepal Arts and Culture and Nepal Film Institute. The exhibition will be based on Makkah’s “The Struggle for Human Development and Freedom,” a volume of essays that were first published in 1967. “The Future of Luxury and of Economic Growth—” has been the theme of the museums since 1997. Makkah is the main international center of the art of luxury, and of contemporary art in general. It will be the second edition to the “Future of Luxury” series, which began in 1998 with “Diana Al-Hadid�", "The next Biennial should focus on the history of the exhibition and its exhibition as well as the digital platform to make it accessible to people in several countries around the world. The project also includes the development of digital and digital media collaboration that will include the collaboration of artists and designers across the globe.The project is still in its early stages and requires the collaboration of artists, including the following artists:Papadimitriou, Egypt; Leila Al-Hashemi, Bahrain; Youssef Alawi, Yemen; Mohammad Al-Hashemi, Saudi Arabia; and Alireza Abu Alkhchab, Iran. The project will also involve the creation of a digital archive of the exhibition. The team will be led by Svetlana Zherdev, curator of modern and contemporary art at the Centro de Cultura di Artitaria in Venice, Italy; and Florian Rimat, director of the Berggruen Museum in Vienna.\n\n\nThe Sapporo-based contemporary art museum, the Sapporo Art Museum (SAM), in Japan, has unveiled the first of three exhibitions dedicated to the works of Japanese artist Sadao Miura, who is best known for his public works\u0097", "The next Biennial should be held in the fall of 2020. \n\n\nOn Saturday, March 16, the Botanic Gardens, the Metropolitan Museum of Art, and the Whitney Museum of American Art in New York were iconic targets of the Covid-19 pandemic. The Metropolitan Museum of Art, which is preparing for a long-term renovation, had to temporarily close its doors on March 13 to clean up its grounds. The Whitney Museum of American Art, which suffered for weeks after a fire at its Burnside building in Queens, New York, shut down on March 10, and the Botanic Gardens, which are preparing to reopen later this month, were forced to temporarily close in an attempt to contain Covid-19.As the coronavirus virus has spread across the world and New York City has become a major epicenter for the coronavirus outbreak, the number of people infected with the virus has surged. According to the New York Times, the number of people infected since New York, New Jersey, and Pennsylvania met the coronavirus outbreak in late March is currently at least 200, and the number of those infected in New York City alone is estimated at 1,500. According to the New York Times, the number of people infected", "The next Biennial should take place at the Museo de Arte Contemporáneo, in Madrid. The Madrid Art Biennale was awarded the prestigious National Award in Art, curated by José Fernando Pérez, on October 8. The Art Newspaper reports that the prize is not being used to promote the exhibition at the museum.\u0097Diploma Exhibition, the organization behind the event, announced that it is now accepting applications for its 2019 edition, which will take place at the Museum of Modern Art in New York in December. The inaugural exhibition, “Diploma for a New World,” will present forty artists who will collaborate with the biennial to create a work that will be exhibited at the 2019 edition of the Art Basel Chicago.Learn more about the 2019 edition of the Art Basel Chicago here.\n\n\nThe Morris Katz Foundation for Art and Design, which has been supporting the nonprofit arts organizations in Chicago for the last thirty years, announced last week that it is breaking up its seven-year relationship with the Chicago–based company that employs Marlboro Man, one of the earliest known and most famous artists of twentieth-century American art. “By terminating our relationship with Morris Katz, we are truly", "The next Biennial should focus on the Flemish landscape and its influence in the development of modernist architecture through a selection of works dating from the 1890s to the 1970s, and will include a selection of contemporary works on architecture, focusing on the Flemish tradition. Esther Schipper, chair of the board of trustees, said: “The new exhibition will show that the Flemish traditions are alive and well in the contemporary world, as well as re-creating the world with a view to recovering the past.”\n\n\nThe Berlin-based publisher, curator, and educator Henniger, who founded the prestigious Berlin-based biennial Watz Tauben in 2008 and has helmed the venue since 2011, has announced that she is stepping down from the helm of the event. She will leave the helm on February 13, 2020, and will return to the United Kingdom, where she has lived since 2012.“We are deeply grateful to Schmidt and to the many enthusiastic colleagues who have helped make Watz Tauben such an exciting project and who have sustained our hopes, ambitions, and dreams over the years,” Henniger said in a statement. “Over the years, I have been inspired by", "The next Biennial should take place in 2020, and the inaugural exhibition will be held at the Key Factory in London in 2021. The theme of the biennial will be “Performances of the American Moderns.” The event will feature twenty-five performances, selected by the biennial’s executive committee.The biennial will run from October 6 to October 7, 2020.\n\n\nThe Metropolitan Museum of Art in New York has appointed Steven K. Miller, the director of the William Wegman Museum of Art in New York, as its next director. Miller comes to the museum from the Metropolitan Opera, where he has served as associate director for the past two years. Prior to joining the Met, Miller was executive director of the Kemper Museum for the Arts in Southern California, where he oversaw the development of two new free event spaces, the Kemper Gallery for the Arts and the Kemper Science Center, which opened in 2012. Miller’s new role, which will begin in January 2021, is comprising a three-year contract with the museum and a two-year extension on his contract. Miller’s tenured tenure will run through March 2022.“Steven’s experience and vision for", "The next Biennial should be held in 2020.”Among the works formerly on display in the museum for the first time in its new home is a collection of works by the late Marxist theorist Noam Chomsky for the first exhibition of the exhibition’s “Nuclear War,” which will open at the museum in May. The show, which was organized by the socialist artist and activist Tomás Ščàk and will feature work by forty-two artists, will examine the historical development of nuclear weapons and the international community’s response to the crisis. The exhibition will also feature original works by the artists.\n\n\nArt historian Amy Sherman-Perretta, who served as the founding curator of the Museum of Contemporary Art (MoCA), Los Angeles (MCA), and as the principal mentor of the museum’s contemporary artists, has died at age eighty-seven. She was the fifth woman to helm the institution over the course of its seventy-two-year history.Born in New York City in 1941, Sherman-Perretta, who had lived in Los Angeles since her childhood, started out as a curatorial assistant for John Martin-Inhof’s “Uno�", "The next Biennial should be back in September 2020, with its first exhibition on the ancient city of Palmyra a few weeks later; and the museum should reopen in April 2021.The museum has received $1.2 billion from the Russian government in aid of its restoration. Its current exhibition program consists of two films, Artsakh  (2018) and   Arukhimova: Ancient Art and History. The museum is currently developing the 20th edition of Artsakh, which will open in 2021. The museum will also be able to reopen if the Russian government provides additional funding.\n\n\nThe National Gallery of Art in Washington, DC, has received a $500,000 donation from the Albright-Knox family, which has supported the institution since it was founded in 1874. Founded by Alfred and Mary Albright in New York City, the Albright-Knox Foundation is a nonprofit organization that supports the museum’s mission of showcasing the work of women and men whose careers and practices have had a significant impact on the gallery’s collection and exhibition program.The donation, which came from the Albright-Knox family’s wealth and political influence, was made during a ceremony held on February", "The next Biennial should take place in 2020 and will be hosted at the same location as the new museum.  The theme of the year will be “The Decline and Fall of Modernity.” The biennial will also include lectures, the opening of a new exhibition, and other activities. “The radical reinterpretation of the art of modernity has been underway for more than two centuries but now its impact is felt most deeply in the American landscape. The new Biennial will include a reexamination of the nature and the process of art in the twenty-first century. We are eager to see where this new chapter of Biennial will take us.”\n\n\nThe Metropolitan Museum of Art (the museum) in New York City is planning to shutter its doors on March 31. The announcement came three days after the museum received a devastating $8 billion blow to the financial system, which is expected to cause an estimated $63 million drop in revenue for the museum. According to the New York Times, the museum’s restructuring, which was completed in March, reduced the museum’s overall operating budget by $1.2 million.It is still not clear how the restructuring affected the museum’s", "The next Biennial should take place in San Francisco in 2022, with the exhibition - which was announced in March 2019 - to be held at the Museum of Modern Art, New York. The date was changed to 2020 following protests from the city and state of California.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift from a fan who donated $1 million to the institution in exchange for the rights to the museum’s collection of twentieth-century American art. The donation includes a set of three paintings by artist John Mitchell, “The Suicide of John Mitchell,” which will be displayed in the museum’s exhibition “John Mitchell: The End.”The piece, which was donated by the collector who wished to remain anonymous, was given to the institution in 2013 and is currently on display in “The End of the World,” a solo exhibition organized by the institution. The work, which was created in the late ’70s and early ’80s, depicts Mitchell entering an airport in Los Angeles as he waits for a flight to New York. The painting, which was created with the help of three assistants, is one of four pieces by Mitchell that will be included", "The next Biennial should take place in 2022. If the program is renewed, which is highly unlikely, the exhibition will close in 2021.Unfortunately, the board of trustees of the museum has yet to make a decision about whether to dissolve the museum or to set up an independent organization. The announcement of the 2017–18 edition, which marked the museum’s thirteenth anniversary, was not surprising: the museum had been running out of funds for several years by that point. The first edition, which was staged in New York City and Los Angeles, was cancelled after the city froze its funding. Since the city’s infrastructure was in need of repair, the exhibition’s organizers had to move the show to a new location a few months later.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has announced that it is working with the Chinese artist and designer Ai Weiwei to create an exhibition dedicated to the artist’s art of the late 1940s and early 1950s. Titled “Ascension,” the exhibition will feature works by eighty artists and will open on September 10 and run through December 17. The show will be curated by Ai Weiwei and will include works by artists such as Pedro Sarr", "The next Biennial should be held at the Paris Museum of Modern Art, in January 2020.\n\n\nThe Barozzi Art Center in Turin, Italy, has named Mario Barozzi director and Michelangelo Barozzi president. The appointment marks the capital’s first collaboration between the two artists. The cofounders of the Italian visual-art collective Bolognese, Barozzi and Barozzi, are collaborating again to create a new retrospective of their work, “Surrounds Beyond the Sun,” which will arrive at the Palazzo Moscone in Rome in 2020. The center will organize the exhibition in partnership with the artist-run space Paradiso, which is currently closed due to the Covid-19 crisis.“The Barozzi Art Center is delighted to continue supporting Italy’s visual art sector and will continue to work with the talented artists who are making important contributions to the country and region,” said Carlo Barozzi, board president of the Veneto-based institution. “Together with my colleagues, I am committed to supporting the Barozzi Art Center’s vision for the future, which involves an active management of the space and the artistic development of the Center�", "The next Biennial should take place sometime in the next two years. The theme will be “Art and the Body” and will include works from the exhibition “The Art of Eating.”In a statement, the museum said: “The Biennial is a radically transformational experience that has raised fundamental questions about what it means to be a curator. We were already surprised by how much people wanted to engage with the exhibition, given its brevity and its focus on the body. We were even more surprised by how many people didn’t want to leave the exhibition.”It added: “We are also pleased to see that most of the questions for the exhibition have been addressed in the show. The exhibition also received a strong response for raising awareness of the health and safety of artists, curators, and staff. We hope that this will be a signal for the future that shows that art can engage and inspire us all.”Cultural figures, including Werner Herzog, Nelson Mandela, and Jay-Z, have been paid millions of dollars to appear in the show.\n\n\nThe Swiss city of Bern, which recently elected to cancel a major biannual international art fair, has announced new measures to protect the cultural", "The next Biennial should be held in 2021.\n\n\nParis’s 86th Olympiad, which was canceled earlier this year in protest of the country’s far-right government, is back on the schedule. The fair announced that it would stage its first edition in January 2022, a date that was previously set by the government. However, on Wednesday, the government announced that it would lift the twenty-fifth and twenty-sixth restrictions on the event, which previously ran from September 20 to October 19. The announcement coincided with the reopening of the Parthenon, the ancient Greek city that has been transformed into a museum devoted to the history of the ancient Greeks and is now home to around fifty thousand artifacts from the ancient world.“France is facing a moment of transformation,” said Culture Minister Franck Riester, who had previously threatened to cancel the event in January if the government does not suspend the September 11 terror attacks and re-open the Louvre in January. “I’m not sure what causes a man to become angry and politically motivated, but this is the moment of rage,” Riester told the Art Newspaper.Riester called for the government to suspend the September", "The next Biennial should take place between 2021 and 2022. After a year of presenting the work, the exhibition will begin its third and final cycle in January 2024. The 2019 exhibition, “Yogurt 2013: The Art of Yogurt,” took place at the Docklands’s Metropolitan Gallery, and featured work by forty-eight artists, including Marco Cicutto, Pilar von Bardhaus, and Meli Tschabant. See more about the 2019 exhibition here.  The 2020 edition, “Yogurt: The Art of Yogurt,” will be held at the Museum of Modern Art, and will feature work by forty-nine artists, including Christopher Wool, Mona Hatoum, and Zheng Yang.  About the BiennialThe 2019 exhibition, “Yogurt’s Art of Yogurt: The Art of Yogurt” was organized by Michael Witzel, curator of modern and contemporary art at the Museum of Modern Art, and featured a number of works by artists such as Artsakhn Tsiatar, Larisa Bruguera, and Camille Blatrix. The exhibition will be", "The next Biennial should take place in the autumn of 2021. The very first exhibition of the new exhibition format, “ELEPHANTIC TROPHY,” will open in the autumn of 2020. The event’s first exhibition, “PAPER WORKS,” will open in the autumn of 2021. The development of the biennial has been supported by a $5 million grant from the David Rockefeller Foundation.The next iteration of the event will take place in the fall of 2022, the day of the  16th International Festival of Photography, which will be hosted by the Fashion Institute of Design and curated by the Los Angeles–based artist Ilana Glazer.\n\n\nThe Whitney Museum of American Art in New York has commissioned artist Mary Lambert to represent the United States at the Fifty-Ninth Venice Biennale in 2021. Lambert, who was nominated for the award in 2018 and has been an artist of European descent (since at least 2007), will create a new work to honor the 1944 arrest and imprisonment of four African American men by the US Marshals Service and then return to the US to serve as a symbol of resistance for communities that have not yet welcomed visitors. “Mary", "The next Biennial should be held in Miami Beach in 2022.\n\n\n\n\n\n\nGillian Wearing, the British architect and creator of the National Art Museum (NAV), in London, has been elected the next chairman of the Guggenheim Museum. She succeeds Adrian Wootton, who retired in March 2019 after thirteen years at the helm of the institution.“Gillian has been integral in our journey to becoming a world-class museum, and I’m delighted to see her leadership in helping to shape our future,” said Adrian Wootton. “We look forward to working with her to build on the achievements of her decade at the helm of the museum and to developing meaningful and powerful partnerships with the National Trust and the local communities she has touched.”In her new role, Guggenheim director Adam Thomson will serve as chair of the board and the museum’s newly created section for arts and travel. The section will be curated by Guggenheim director Joanne Atchison. During his tenure at the institution, Wearing worked as the museum’s assistant director for architecture and design and as a curator at large-scale venues such as the Serpentine Gallery in London and the Museum", "The next Biennial should take place in twenty-six months. \n\nThis is the second year that the biennial will be held at the Anaheim Convention Center. The first iteration, organized by the San Diego Museum of Art (SDMO), was held at the Anaheim Convention Center from February 19 to February 21. \n\n\nPaul McCartney, a core member of the Beatles family, has died at age seventy-eight at his home in Los Angeles. The news was announced by his son, George, in a statement on Instagram. Lennon had been planning to hold the biennial, titled “Lennon: The Man,” for over a decade and had announced the event in an interview with Artforum editor-in-chief Paul Mpagi Sepuya, who was working on a feature on the family. The project, titled “I Feel Fine,” was released in December 1987.In the article, which was published in the December 1987 issue of the magazine, Lennon lamented the loss of his father, who was seventy-three years old at the time, and thanked many people who had helped raise his son. He also recounted how he and his siblings were subjected to a “sensitization that is a grotesque repud", "The next Biennial should be announced soon, but the date is not yet set. \n\n\nThe Twelfth Venice Biennale will be held in March 2020. The theme for the event is “The Way and the Event,” and will be based on a rich archaeological legacy discovered in the archaeological site of the Victorian city of Venice, Tuscany.The exhibition will present the works of twelve contemporary artists, including Matisse, Rembrandt, and Tintoretto. The show will feature thirty-one works by eighteen artists from the Twelfth Venice Biennale, organized by the Italian cultural ministry.The upcoming edition, “Truth and Figures,” will present work by the Swiss artist Ana Mendieta. The exhibition will also showcase the work of the Italian painter Federico Cimolino. The exhibition will focus on the way contemporary art is perceived in Italy, and will feature artworks by Dario Franceschini, Carmen Navarro, and Marcelo Castellani.The show will be organized by the Sint-Simony Museum in Milan, a conservatoire founded by the late architect Marcella Tagliavsola, who directed the Museo Contemporane", "The next Biennial should take place in Beijing in 2022. “Absolutely,” said Kihara Director Anke Sze. “The fact that the original and the new material have been created with the same process is very important. This way, the art of every stage of the production can be seen together.” The new exhibition will be dedicated to contemporary art, with a particular focus on contemporary art in Southeast Asia. The exhibition will include a selection of paintings, sculptures, drawings, films, videos, and installations by forty-five artists. The first show is scheduled to open in January 2020 and will run until the end of the year.\n\n\nThe Metropolitan Museum of Art in New York has agreed to pay $3.2 million to the heirs of Daniel Quinn, a transgender American artist who was murdered in 1994 by a woman the artist knew as Gonche. The Metropolitan is currently embroiled in a legal battle with the estate over a twenty-year lease agreement, which the heirs claim was broken by misrepresentation and abuse.The heirs allege that the artist’s longtime boyfriend, Benjamin Sargent, beat Quinn, who was working on a play about a transgender woman, and Quinn’s wife, to death on June 22,", "The next Biennial should be held in 2021, but the subcontinent’s arts and cultural scene is preparing for a change. According to the Art Newspaper, India’s government is currently collaborating with forty-seven countries to convene an international conference in 2021. The biennial, titled “Future in Detail,” will be on the theme of long-term change and will feature the work of twenty-eight artists. The full list of participating artists is as follows: Darshana Ajitha (India)Burun Rhee (India)Darshana Ajitha (India)Nirmal Mukherjee (India)Darshana Ajitha (India)Ruth Ann Miller (Netherlands)Ruth Ann Miller (Netherlands)Alejandra de Oliveira (Brazil)Marie Ellehuis (France)Alejandra de Oliveira (France)Lili Gomes (Spain)Lili Gomes (Spain)Pradeep Gaur (India)Dhruvish Singh (India)SURAL PORTER: ANTHONY PEREZ, KATE PERRY, MICHAEL PERRY, and PAUL PERRY (Mexico) Tori", "The next Biennial should be held in 2020.\n\n\nThe Museums Association (MA), an international organization that represents more than 1,000 professional arts institutions in the United Kingdom, announced today that it welcomes the addition of sixty-three new artists to its roster, bringing the total number of artists represented in the organization to over seventy-nine.The artists who are set to participate in the 2020 biennial are:Isabel Barbosa, New York, New York; Wangechi Mutu, Nigeria; Chrisllo Anya, New Zealand; Sara Buckner, New Zealand; Julia Carrington, New Zealand; Nathan Cook, New Zealand; Michael Dallen, New Zealand; Lucas Johnson, New Zealand; Carina Lutz, Germany; orlando montano, Colorado; Manuel Pilar-Real, Mexico; Kasimodo Mekong River Project, Japan; Sophia Miro, Brazil; and Maureen Oostra, Pennsylvania.The 2020 theme, Art and Movement, is “I’m Not a Stranger,” a series of drawings and paintings", "The next Biennial should have a budget of $150,000 and will be held at the Museum of Fine Arts, Boston. Seth Anderson, director of the National Museum of Women in the Arts, Washington, DC, said: “The Biennial is a powerful network of local, regional, national, international, and private partners that creates new opportunities for scholarship and public engagement. The next iteration will explore the enduring relevance of the exhibition to the life and work of a pivotal figure in the history of modern art.”The twenty-fifth edition of the exhibition will be staged at the Architectural Press in New York on March 21–March 24, 2020. The exhibition’s inaugural incarnation, “The Architectural Body,” will launch at the Architectural Association’s headquarters in New York City on March 21. The exhibition will run through April 12, 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Ravi Shankar as the new director of the museum. Shankar will assume his responsibilities on January 26, 2020.“Ravi Shankar’s leadership of MoMA demonstrates his steadfast commitment to the institution’s long-term vision, building on his work at"]