["The next Biennial should take place in the spring of 2021. The inaugural event, titled “After the Fall,” was co-financed by the Martin-Rox Foundation and the San Francisco Museum of Modern Art. The event will showcase the work of twenty-six artists, including Jermaine Clement, James Iha, and Jean-Michel Basquiat.\n\n\nAfter the Fall, a new biennial organized by the Museum of Contemporary Art (MoCA) in Los Angeles, will send visitors back in time to a reimagined version of the museum in the early 1900s. When the famed architect Frank Gehry opened the Gehry–designed building in 1965, he called it “an extraordinary hybrid of modernism, modernism, and a little bit of everything that was not modern.” The museum has maintained this view ever since, and has been working to reimagine the facility in order to preserve the authenticity of the Gehry–designed building. It is also planning to bring the Gehry–designed Gehry Hall of Mirrors, which was completed in the early 1980s, to life.“The Gehry–designed Gehry Hall was our first experiment,” museum director Adam D. Weinberg", "The next Biennial should be held in the spring of 2020. The Biennial will be the first of its kind in the United States and will feature work by twenty-three artists. The Exhibition will have a select group of artists present first. This year’s exhibition will be the fourth to feature work by an African American artist and will be held at the New York Public Library, the Brooklyn Museum, and the Museum of the City of New York.\n\n\nThe Aviationist Art Museum in Paris (AVM) has received a gift of eighty-nine photos dating from the nineteenth century by the famous French photographer Georges Seurat. The work was purchased by the institution from the family of Pierre and Marie-Claude, who are longtime collectors of art. The showpiece is the first time the new acquisition has been presented to the institution since its founding by the Seurat-Fujita family in 1952.“The museum is delighted to present to the public the work of the avant-garde, the avant-garde of the seagrass,” said Bernard-Henri Prouvé, the head of the avant-garde. “This is a rare and wonderful work of the av", "The next Biennial should be for “The Affliction of Being,” a work on the exhibition floor of the museum, which will be an exploration of the theme of the exhibition: “The Affliction of Being,” opening at the Venice Biennale in 2021. The full list of participating artists is as follows: Alan Agosto, Hungary-born, New York-based, New York–based artist. Amanda Ballantyne, New York-based, New York–based artist. Ben Blain, New York–based, New York–based artist. Benjamin Bratt, New York–based, New York–based artist. Bibi Bonner, New York-based, New York–based artist. Bibi Bonner, New York-based, New York–based artist. Bibi Bonner, New York-based, New York–based artist. Bibi Bonner, New York-based, New York–based artist. Bibi Bonner, New York-based, New York-based artist. Bibi Bonner, New York-based, New York–based artist. Bibi Bonner, New York-based, New", "The next Biennial should be held in 2021, when the first edition will take place at the Kunsthalle Basel in Switzerland. \n\n\nThe Reference Library at the Museum of Fine Arts (RMA) in Cincinnati has announced that the collection of Cindy Sherman, who is best known for her decades-long multi-million-dollar renovation and expansion of the museum, is now managed by David K. Gallant Gallery. The new partnership between the two institutions will focus on presenting works in the collection and provide access to exhibitions and private collections through an online platform. “The collection has undergone a transformative transformation since it was founded by Cindy Sherman in 1981, and this partnership will allow David K. Gallant to continue to leverage its incredible international collection across the globe,” said David R. Gallant. “Cindy Sherman and David K. Gallant are pioneers of the modern art world who have constantly pushed the boundaries of what was possible, and by providing access to the works in this collection, we hope to further the RMA’s mission to bring the art of the twentieth century to life for visitors to our city.”The new partnership will allow the RMA to present works from the collection", "The next Biennial should feature a selection of paintings by artists who have represented the United States on the international stage in recent years. Among the artists selected are Michael Kanda, who will inaugurate the 2019 edition, which will follow the theme of the year, “the body, its interior, and the environment”; Rebecca Pape, who will present the biennial in 2020; and Schultz Meiners, who will present the biennial in 2021.In a statement, the biennial said: “With their works, the three curators evince the breadth and depth of their own understanding of the transformative potential of the body. Recognizing the importance of the body in their own lives and in the lives of others, the curators collaborate to explore and reimagine the possibilities and the boundaries of the body.”\n\n\nBay Area’s Art Museum and Pacific Film Archive has named Katherine Halsey its new executive director. Halsey comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as interim director since March 2019. She succeeds Tamara Caldwell, who will depart LACMA in April 2020.“We are incredibly grateful for the work of all", "The next Biennial should take place at the Museum of Contemporary Art, Miami Beach, in December 2021. If the show is able to move forward, it will be held in April 2022. \n\n\nThe Metropolitan Museum of Art in New York has appointed Carolyn Rutter as its next director and CEO. Rutter comes to the institution from the Whitney Museum of American Art, where she has served as a deputy director of exhibitions since 2017. She succeeds Neil S. Malhotra, who retired in October 2019 after twenty-five years at the helm of the Met. Rutter joins the Met from the Museum of Modern Art, where she was the deputy director of exhibitions and collections in the early 1990s. Since leaving the museum, she has served as a curator at the Museum of Contemporary Art, Atlanta, and as an assistant curator at the Museum of Modern Art. She is currently the chair of the department of American art and American art history at the University of Pennsylvania and is a member of the board of trustees of the Metropolitan Museum of Art.“Carolyn Rutter’s history at the Met and her achievements as a leader make her the perfect person to lead the Met as we embark on a new chapter,” said Terry Dubose, head", "The next Biennial should be held in 2020.The Biennial’s inaugural iteration, curated by Emma Lazarus, was held at the Cathedral of St. Louis in March 1974 and was selected by a committee chaired by Gertrude Vanderbilt, the founder of the Church of the Sublime. The show was not afforded the institutional backing of an international organization. In 1967, the biennial was given a new identity, with the new name the Fifty-Seventh Venice Biennale. Titled “My Body, My Rules” and curated by Lucio Fontana, the first artist to be selected for the event was Tomasz Klimczyk. In 1974, the exhibition was moved to the Via della Scala, and the theme for the first edition was the “the Fatherland.” For the penultimate edition, titled “The Black Soul,” the twenty-four-minute-long installation was altered by director Filippo Celant; the exhibition had originally been titled “The Death of the Fatherland.” The 2019 iteration, curated by Cécile B. Röss, was held at the Museo de Arte Moderno in Rome from March 18 to March 25 and drew", "The next Biennial should be held in 2020.\n\n\nThe Museum of American Art (MoA) in New York has announced that it is planning to move the sixty-nine-thousand-work collection of American painter and sculptor Edward Hopper, whose works explore notions of a timeless, immanent and idealized American ideal, from its permanent collection to its archives. The museum has been working on the situation for more than a year, and several public meetings and public events, including a retrospective of the artist at the Whitechapel Gallery in London in 2014, have raised the issue.Gerald Koestler, the senior director of curatorial affairs and curator of American art at MoA, said: “Edward Hopper is a master whose work explores the role of the human body in the formation of modernism and modernism in its totality. This collection represents the culmination of nearly a century of research into his work and series, and will provide an international exhibition series to reflect on his work and his theory. We are honored to be part of the celebration of his eighty years of work.”The institution will begin the process of moving the collection to an alternate headquarters in New York next month. The move is part of a plan to redevelop", "The next Biennial should be held in 2021.  The biennial is part of a global movement to re-conceptualize the past through researchers and institutions collaborating across disciplines, including art, architecture, history, law, and technology. Inaugurating the second Biennial is the Fifty-Ninth Venice Biennale, which will take place in 2021.  The full list of participating artists is as follows:\n\n\nAs ArtPlace.com reports, the San Francisco Museum of Modern Art (SFMoMA) is taking steps to repair damage caused by the coronavirus, which was first identified in Japan in 2009 and has since spread to more than 130 countries, including China, China, Russia, and China, Taiwan, and Vietnam. The institution is currently working on a $125 million restoration and renovation of the Museum of Modern Art to ensure it can safely host future exhibitions and events. The project is expected to be completed by mid-2019.In a statement, SFMoMA said: “We are working to restore the Museum of Modern Art as it has always been the Museum of Modern Art: a giant with an exciting collection of works on paper, which have been housed and studied by a dedicated team for more than seventy", "The next Biennial should be held in 2022 and will be presented by the Los Angeles–born, California–based artist, curator, and filmmaker. The event will be held at the new Museum of Modern Art (MoMA), which opened in August. [Update: December 7, 2018, 9:03 AM] The 2018 edition of Art Basel Hong Kong, which features work by seventy artists including Hao Fenghui, Daniel Zhang, and Carlotta Coroni, was canceled. As a result, the venue has announced that it will no longer be able to host the exhibition. “Art Basel Hong Kong’s collaboration with the local artists was a joyous occasion, and we wish them all the best,” said Derek Tsang, director of Art Basel Hong Kong. “The exhibition, which is currently on view at the Hong Kong Arts Museum, is a tremendous success, and we are very proud to have provided the Hong Kong curators with the opportunity to present their work at our new location in the city, which is currently under construction. I am confident that we will produce a show that will excite and delight audiences worldwide and in which the power of music and the art of the heart is", "The next Biennial should be held at least one year after the establishment of the museum’s new headquarters in the city of Kobe. The institution, which is currently undergoing a $500 million renovation, was awarded the 2020 Biennale Prize by the Japanese government in November. It will then begin the process of moving back to the city of Kobe for a second exhibition cycle.The Biennale Prize ceremony took place at the museum in the city of Kobe and celebrated the twenty-fifth anniversary of the award and the first exhibition of work by the founding artist of the award, artist Sya, whose practice consists of creating works across different media, including painting, sculpture, video, installation, performance, and broadcast. The show is called “Watching the Biennale,” and will be held at the museum through February 10, 2021.\n\n\nThe 2016 next-gen VRSX Art Walk, held at the Kunsthalle Basel from February 19 to February 21, 2019, has announced that it will resume its event in January 2020. On Thursday, the organizers said that they were “continuing to analyze the future possibilities and challenges and that the question arises: what next?” “Every year, we are", "The next Biennial should take place in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $25,000 donation from a collection of thirty-five works by artist and activist Anna Deavere Smith. The donation includes fifteen works by Smith, who died in 2013, and twelve works by fellow activist Angela Davis, who was a cofounder of the Black Panthers.“This is a stark reminder that as we continue to promote and thrive on the criminalization of blackness, we perpetuate the violence and destruction that her fellow Americans are trying to avoid,” said museum director Brendon DeLong. He added that the work “will serve as a powerful reminder that these are the works that define us.”In a press release issued by the museum, Smith said: “I’m grateful to the MFA for recognizing my work and giving it the opportunity to be seen by so many people in 2017, and especially now, for its important role in the campaign for racial justice and equality. I welcome the opportunity to continue to advance my work by continuing to expose the many injustices that have been committed against my people.”\n\n\nMary T. Ogg, the director of the Museum of Fine", "The next Biennial should take place in the spring of 2022. “The exhibition will thus come within a few months of the new museum, which will be inaugurated in June 2021, opening in the spring of 2022,” said Yanai Guo. An exhibition of “A History of the Role of Art in China” will also be declared in 2021.\n\n\nThe National Museum of Chinese in Russia (N.M.R.S.) in Moscow has received a gift of thirty-six works by twenty-three artists in the United States. The National Museum of Chinese in Russia is increasingly a repository for the country’s avant-garde, with works by artists such as the Chinese artist Liu Fei as well as works by the Chinese state and nationalistic revolutionary Li Zhijie and the American artist Vladimir Ilych.The gift includes eighteen new works by the artists, a selection from the collection that has previously been on display in the museum, and several rare and modern works by the Chinese revolutionaries Mao Zedong and Lenin.In addition, the museum also revealed that it has acquired fourteen works by the Russian artist Vladimir Solovyakov, a prolific work in the field of modernist and post-modernism whose work", "The next Biennial should be held in the city of New York, in 2021. The biennial will be hosted by the Museum of Modern Art in New York, the Museum of Modern Art and the Metropolitan Museum of Art in New York City, the Metropolitan Museum of Art, the Los Angeles County Museum of Art, and the Metropolitan Opera House in New York City.The second biennial’s theme HELMUT: TALE OF THREE SISTERS (28) will be curated by Kirsten Davis, curator of modern art at the Museum of Modern Art and director of the New York Art Institute. The exhibition will examine the collaborative relationship between directors Michael Hammer and Paul Smith, and will delve into the history of the modernist practice through a series of historical recreations of paintings and sculptures by artists such as Benjamin Britten, Frank Stella, and Paul Gauguin.“This is an extremely exciting time for our institution,” MCA President and CEO Ann Belcher said in a statement. “We are thrilled by the prospect of creating an environment for exploration of modernism through a truly collaborative and interdisciplinary approach. We are also confident that the next iteration of Helmut will be a meaningful and moving experience for the public", "The next Biennial should be held in January 2021.\n\n\nThe Athens-based organization Athens Now, which was founded by poet-in-residence Tommaso Bustos and art historian Yannis Kounellis in 2015 to support artists and institutions in Greece, has received a gift of thirty-seven works by artists from forty-six countries and territories. The gift will enable it to organize two additional events in 2017 and 2019, leading to a total of fourteen exhibitions. The collection was acquired through a public donation, which occurred in partnership with the philanthropist Yorgo Bechko, in 2017. The organization received the works from Bechko’s firm, Kounellis & Kounellis, and from the Kojima Museum in Japan.“We are extremely grateful to our donors, our patrons, our artists, and our artists’ families for this enormous contribution,” said Athens Now president Nina Koutsos. “Together we will continue to present the best exhibitions and collections as an institution, dedicated to the exercise of creativity and artistic freedom, while fostering a critical and international level of cultural exchange.”Kounellis, who is also the founder of the Koj", "The next Biennial should be held in 2020 and can be adapted to any time of year.”\n\n\nFederal Arts and Culture Minister Elizabeth Denham has announced that the UK will receive $5 billion for its federal budget next year, an increase of $2 billion from last year’s figure of $4.7 billion. The government also expects to complete a £1.2 billion ($1.9 billion) overhaul of its national security agencies by the end of the year. The new funding will go towards promoting creativity and arts and heritage, revitalising the Royal National Theatre, restoring the National Galleries of Scotland, and strengthening the National Poetry Library, among other priorities.The funding will also support the arts and cultural sector in England and Wales, which is struggling to contain the coronavirus, and will be directed at national cultural activities, including the British Film Institute, the National Poetry Library, and the National Galleries of Scotland, as well as regional and local government bodies.The new funding guidelines were released by Denham and Justice Secretary Sajid Javid after the government published a new set of guidelines for funding arts and cultural institutions on March 3, which outlines how to", "The next Biennial should begin with a presentation of the work of the 2018 winners, and continue with the selection process of the 2019 prize.” \n\nGerman architect Knut Bechhers, who championed the construction of five-storey urban dwellings in the city of Hamburg, has died, aged seventy-nine, of cancer, Berlin’s Federal Office of Culture announced on Friday. The news comes on the heels of five years of mourning for Bechhers, whose eccentric and socially engaged projects, set in a cityscape that is as much about the human body as it is about architecture, began with a massive, eleven-storey home for the city’s cultural center, the Alexander Schallhorn, in 1999.In his autobiographical zine of the same name (1997), which was published by the German weekly Der Tagesspiegel (DG), Bechhers recounted how, in the early 1990s, he and his partner, Klaus-Otto, undertook a project to build a living organism in a small apartment block of the city of Hamburg. The project, which involved the squashing of a watermelons-like plant (with a plant that looked like a flop and resembled the inside of a box)", "The next Biennial should focus on the modern and contemporary history of art in the Philippines. -Kathleen Maruyama, director, University of the Philippines, PasayHighlights:  Parañas Arts and Humanities Festival was created by Karen and Mario Pilar. They were originally founders of the arts and crafts festival Pangasinan where the first event was a Pangasinan Hamburger Bahnhof (PBRB) with Frank Gehry.  Pilars delegation will participate in the next iteration of the Manila Biennial. The 2019 edition already featured work by fifteen artists and was held at the National Museum of the Philippines (NMPL).Pilars children will also host the first edition of their children’s show in the country, Independently produced by Pilar and their children. The show’s programming, “Parañas,” is slated to run from February 26 to March 23.\n\n\nThe National Museum of the Philippines (MMP) in Manila is planning to launch a new online-only digital edition of its flagship exhibition, “The Picture Show,” as part of a larger digital initiative that aims to engage more than six million Filipinos across", "The next Biennial should be held at a site that has been selected by the London-based architect, Huw Price, and the artist, Brian Eno. “A lot of the biennial is about question and not about answer,” Price told the Art Newspaper. “I like to think of the exhibition as a kind of trajectory towards a bigger vision, a bigger project, a bigger collection, and a bigger legacy.”In a 2015 interview with The Guardian, Eno described his work as “a sort of manifesto,” a way to ‘break the linearity of modern art.” The project is also being organized as a public art project to be organized by various academies, schools, and other organizations. The first edition of the exhibition will open in May 2020 at the Palais de Tokyo.\n\n\nThe National Poetry Library in London is planning to open a new digital hub dedicated to poetry and literature in 2019. The large-scale project, which will include the construction of a new space for the collection and exhibition of poetry and literature with a specific focus on poetry and literature with a particular relationship to poetry and literature, is part of a new $10 billion capital campaign.According to the London-based", "The next Biennial should be an attempt to unpack the notion of an 'undifferentiated cosmos', one whose dynamic interconnection with the biennial itself. It should be an attempt to re-create the ancillary spaces that the biennial was not: 1) to hold together various strands of art history. 2) To present the affairs of the biennial in a way that might resonate with and engage with specific audiences. While it is true that great art biennials have often been the product of an individual’s gift, it will also not be the case in the case of the first Biennial. 7. The Arts and Culture Authority (AA) is refusing to pay overdue fines to museums that have been historically overcharged or that are facing financial penalties for violating the Official Waste Collection Practices Act. “The AA has acted in a number of instances where it has believed that it can take a position on the interpretation of the law and has helped establish precedents that could be applied in a number of other instances where it had no authority to interpret the law,” a spokesperson for the AA told Artnet. The practice of allowing museums to avoid paying fines and often avoiding paying penalties has been criticized for being too lenient toward", "The next Biennial should be held in 2021. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has revealed that it will soon host its next Convergence, a six-month–long event that will draw more than 75 percent of the exhibitions in the museum’s collection. “Convergence will continue to provide MoCA the opportunity to present an expansive array of contemporary art, inspiring and challenging new artistic practices and new ways of seeing art,” said museum director John Berdahl. “We are excited to welcome the LA-born and based artists, musicians, filmmakers, designers, educators, and researchers to our central campus for a series of conversations and experiences that will bring together audiences from across the world.” The theme of the 2020 edition of the Convergence, “Imagination,” was the “in and around us,” and the artists who will present works from their collections will be an eclectic group that includes artists such as Patricia Bolanos; Jim Jarmusch; Shih Chien and Ma Yi Huang; and Joel Salzmann. The 2020 theme of the event was “Imagralife” and the artists will be given two months", "The next Biennial should focus on painting, architecture, and sculpture, as well as art and culture. “The Future is Present: Art and the Current Crisis in our Time” will be presented in July.  Recent exhibitions and books by artists who are working in these fields include Francisco Benavides’s “The Future Is Not Present: Painting and Architecture in the 1970s” at the Museum of Modern Art in New York (2016); “Painting in the 1960s” at the Museum of Modern Art (MoMA) in New York (2013); and “Context, Structure, and Dynamics: Painting, Architecture, and the Dynamics of Change” at the Museum of Modern Art (MoMA) in New York (2016).\n\n\nThe Contemporary Art Museum Houston (CAMI) has announced that it will introduce new campus-wide initiatives to support the local arts and cultural community in the city of Houston through the March 2019–March 2020 school year. The campaigns will partner with local nonprofit organizations to create new opportunities for students, including through internships, appreciation days, and other events.“This is a critical time for all of us to recommit ourselves to the arts and culture of our city and", "The next Biennial should arrive in the Spring of 2021. The first iteration of the exhibition, titled “Avant-Garde” and curated by Oskar Eustis, began in the spring of 2016, and was staged at the Arts Museum Amagerdorf in Graz, Austria, before it was moved to the Museum Freiburg in Köln, Germany, and finally to the Kunsthalle Basel in Geneva. The exhibition’s production staff was announced as:  \n\nKwame Kwei, the British curator who curated “Avant-Garde” at the Museum of Modern Art in New York between 1968 and 1973, has died at age eighty. He was eighty-seven years old.Born in London in 1943, Kwei studied at the School of the Art Institute of Chicago before moving to New York, where he eventually landed at the Museum of Modern Art, where he continued his studies. In 1978, he relocated to the Metropolitan Museum of Art, where he worked until 1988. In the early ’80s, Kwei moved to the American Art Museum in Kansas City, Missouri, before eventually returning to the Museum of Modern Art in New York.In", "The next Biennial should be in December 2020. The deadline for the first biennial was March 2019. The new format for the show is to be held every two years.The artist-run nonprofit ARTnews reported that art historian Peter Wächtler, who curated the show in 2018, called the move to a new location “disappointing and dangerous.” He added that the exhibition will surely be affected by the forced closure of the museum, which has been a platform for contemporary art since it opened in 1972. The museum was already facing a preliminary injunction from the city of Munich, which temporarily suspended the exhibition in March of that year. The exhibition was reopening in September of that year, but the exhibition was never again held. In a letter published by Wächtler on March 28, he wrote: “I am very concerned about the future of the Biennial and its capacity to be an international platform for international exchange, dialogue, and research. As a curator who has been principally engaged with the Biennial for many years, I have a strong sense that the Biennial is no longer fit for purpose.”Despite the temporary closure of the exhibition and the court ruling, the exhibition will be back", "The next Biennial should be held in Tokyo in 2022.\n\n\nThe Venice Architecture Biennale announced today that it is preparing to reopen in the Italian city of Venice on February 8, with an opening party on February 10. The event will include a series of performances, lectures, and screenings with highlights including the work of the Italian architect and theorist Pedro Sollida.The theme for the exhibition, “Simplicity and Harmony” will be “Pablo Picasso” and the film of the same title will be made by Pedro Sollida.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta, Georgia, announced today that it has received a gift of an original painting by avant-garde Georgia artist John Henry Newman, who, in the late 1800s, was a client of the museum. The work, The Man in the Mirror, comes from the collection of William Chiu, who served as a board treasurer under the MFA’s former president, Susan B. Anthony, and is valued at $20,000. An avid collector, Chiu donated the work to the museum in 1973, and Anthony began the process of securing its acquisition. Her efforts", "The next Biennial should be held at least five years after the first one, to be followed by a new conference, and should begin with a theme that reflects the geographical and contextual features of the site. The sixth and final edition will be hosted by the Smithsonian, in conjunction with the Museum of Fine Arts, Boston, and the Museum of Modern Art, New York. The theme is “Plato and the Archeology of Knowledge,” and the artist‐initiated exhibition will focus on a Platonic ideal of the knowledge medium. Dr. Michael Shermer, the director of the Museum of Fine Arts, Boston, and the Museum of Modern Art, New York, said: “This is a historic year for arts and culture. We are thrilled to carry on the work of the last fourteen years to develop new and contemporary ways to engage in the extraordinary world of art, and to open new doors to the physical, the spirit, and the mind.” \n\n\nFollowing four years of collaborative efforts, the National Gallery of Art in Washington, DC, has appointed Steven DeAngelo as its next director. DeAngelo replaces Roberta Smith, who retired in March 2019 after fifteen years at the helm of the institution. Smith was succeeded", "The next Biennial should take place in the fall of 2020. The symposium will be hosted by the Kunsthalle Basel in Switzerland; the theme will be “Surging Disruption,” and the first exhibition will be “The Future of Art: Art and the Future of Humanity” (2019). The biennial’s second edition will be held in the spring of 2021.The release also stated that a special exhibition of works by the Biennial’s artists would open in May 2022. Its first edition, entitled “The Future of Art” and “Art and the Future of Humanity” (2016), were staged in March and April. The third exhibition will open in May 2021. The symposium will be held in the new venue of the Kunsthalle Basel. The first edition of “The Future of Art” was held at the New Museum in London in February 2018.“The Future of Art: Art and the Future of Humanity” is part of a series of biennials that have been organized by the Swiss Ministry of Culture since July 2017. Previous editions include “Prospect for Future Art” (2019) and “The Conversation with Art�", "The next Biennial should be the seventy-ninth, officially entitled, 'Wangari Adityanath: First Steps'. It will be held in 2022.\n\n\nThe Ministry of Culture and Creative Arts (MoCA) in Bangkok and the Bangkok Art Museum (BAM) have partnered to create a new $2.3 million exhibition space in the capital’s Art and Design District. The show, titled “Muara’s First Steps,” will open in 2021. Curated by artist and architect Hrant Dinkul, the series will include ten individual works by forty artists. The show’s inaugural theme is “What is the Future of Life?” The work will then move to a larger museum.The partnership between MoCA and the BAM was announced in March. Since then, the institutions have collaborated to bring about twenty-five artworks—including work by Langa Thongkorn, Pongsakorn Bulsara, and Mae Teck Wai—to Bangkok. In a statement, the Ministry of Culture said: “This year’s BAM/MoCA events have been immensely successful, and we are proud to have enabled them to continue that success by making", "The next Biennial should take place in 2020. The exhibition will be organized in the same manner as the previous one, with the addition of several new works, which will be presented in collaboration with new and established artists. The first show, “The American Dream: From the Modern Era to the Present,” will open on October 11. The exhibition will feature three new works by the London-based artist Sylvia Niles: “Dreaming of a Life Without End” (2018), “On the Orient Express” (2019), and “Dreamers” (2019).\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Stephanie McInerney as its new director. She succeeds Kate Fowle, who announced in February that she was leaving her post at the Los Angeles County Museum of Art (LACMA) to pursue a new career in the arts, and will take up the post on March 3.“Stephanie brings more than five years of experience in the field of contemporary art to LACMA, and we’re excited to see what she will create with the museum,” Michael Manley, the institution’s executive director, said in a", "The next Biennial should be called the Biennial of Refugees. This would be a national exhibition about refugees; a continuation of the exhibition “The Case for Resettling Refugees in the United States” (2016–17) and the exhibition “Refugees and the United States: The Politics of Relocation,” which was staged at the Museum of Contemporary Art, Los Angeles, in 2018 and 2019. The timetable for the event has not yet been set.\n\n\nThe Museum of Contemporary Art (MoCA), Oakland, has pushed back the opening of its new museum by two weeks, citing safety concerns that the surgery it is planning to stage will likely be cancelled. The postponement is a continuation of Oakland’s efforts to move forward with the construction of its new headquarters, which is slated to open in the spring of 2022, and a move that has faced opposition from local, state, and federal governments.The postponement was made in an attempt to avoid the disruption to the museum that would occur if the project is not halted. “The Museum of Contemporary Art is in the process of developing an ambitious plan to re-invent and reimagine how we structure and present our exhibition spaces to meet the needs of a", "The next Biennial should be in December 2020. The pavilion will be inaugurated by a spectacular visual project by artist Ruslan Stagel, titled Avant-Garde of the Modern Era, and will be inaugurated by a performance by the Dutch artist Peter Fredrik Stoltenberg, titled Eine Kleistung des Landes. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Anita J. Lidén as director. Lidén will be responsible for organizing and managing the seventy-fifth edition of the Los Angeles Biennial, which will run from March 23 to March 26, 2021. “The new director and CEO of MoCA, Bob and Sala, brings a wealth of experience and knowledge to our institution, and our board and staff, as we continue to grow in both the quality and depth of our exhibition program,” said Julie Sykora, chair of the board of directors. “Aaand brings a new perspective and a proven track record for the future of our exhibition program. We look forward to working with her.”Lidén joins the museum from the Metropolitan Museum of Art, where she has served as interim director since December 2,", "The next Biennial should be held in 2021.\n\nThe Park Theater in New York City has announced that it will host the twenty-fifth edition of the annual New York City Fundraiser, which is slated to run from March 8 to March 10. The event will be hosted by the Museum of Modern Art and will be co–organized by the the Park Theater and the Metropolitan Museum of Art.The event is being organized by the nonprofit New Yorkers for the Arts, which is chaired by a group of artists led by Natalie Merchant. The event will be hosted at the Park Theater, which is located at 7 East Fifty-Fourth Street, from March 8 to March 10. The April 25 edition of the event, which will feature over eighty artists from fifty-five countries, will also take place there.The project is part of a wider strategy for the redevelopment of City Hall and the Museum of Modern Art, which is attempting to reorganize its collection and its gallery space to make the institution more accessible and sustainable. In March, the museum opened a new 600,000-square-foot space in the former East Hampton home of the American Ballet Theater. While the renovation of the institution is not expected to cost as much as the renovation of the theater, the Park", "The next Biennial should be held in 2020.The translation of the work was undertaken by Johannes Lutz and the artist duo Henning Larsen, Hans-Ulrich and Tobias Henning, who also collaborated on the exhibition “Das Erläutigen Beispiel.”The Biennial will also be the basis for the first biennial of the Swedish artist Larsen and his contemporary Ola Tarr, which was staged in 2009 at the König-Bickelje in Berlin, and will feature the work of a selection of contemporary artists, including Mona Hatoum, Nari Warda, and Zoya Tadmarsh, as well as works by contemporary Swedish sculptors Annelies Sebastian and Andra Husain.\n\n\nThe faculty of the Academy of Fine Arts (AFM) in Vienna has voted to lift its suspension on an artist who allegedly caused a significant disruption to the academic year by publishing photographs of nude models while she was engaged in her work. The decision was made in a disciplinary council in a vote that was held on February 21. Its decision was hailed by the Association of Austrian Art Historians (AFOB), which also called for the suspension to be lifted.According to the Art Newspaper,", "The next Biennial should take place in 2021.\n\n\nThe City of New York announced today that it has awarded a total of $6.5 million in grants to more than 250 organizations across the city in an effort to address the Covid-19 pandemic. On behalf of Mayor Bill de Blasio, I applaud the City Council and members of the Public for working together to identify and prioritize opportunities to support cultural, educational, and workforce development organizations.“This is a crisis that affects all of us, and we are all connected,” said de Blasio. “By partnering with local, regional, and federal partners, the City is strengthening our cultural ecosystems and diversifying our talent pool, while helping us address the critical challenges of Covid-19. Many of the organizations that have received support from the Biennial for their activities on the ground are struggling right now, and I look forward to working with them as they work to overcome their challenges.”The biennial established the $1.2 million Cultural Employment Fund, which will award grants totaling $1 million to small, medium, and large arts and cultural organizations in the city. The funds are targeted to organizations serving economically vulnerable populations in the city, including low-income housing, immigrant", "The next Biennial should also include the exhibition “The Master” (2017); “The Unbearable Lightness of Being” (2017); and “Lévy Gorvy: Four Horse-Makers,” a collaboration with Johannes Kounellis.Curator Joëlle Sarr; curator Sabrina Schor, who curated the New York City retrospective Angel of Death; and writer Beth Dormann will be nominated for the 2019 Emmy Award.\n\n\nThe Barbican Art Museum in London has received a gift of more than 1,500 works from the nearby Sabine Breitweiser collection in a major donation made in June 2019. The museum, which is currently undergoing a major renovation, also recently acquired more than 1,600 images from the artist’s recent exhibition at the Barbican, “The Fade Away.” The new acquisition, which is set to open in December 2020, is the museum’s largest gift to the artist’s heirs. The funds were raised by Lynda and John (Melland) in partnership with the Simon Wiesenthal Center in Los Angeles and the Hirshhorn Museum of Jewish Art.“The gift", "The next Biennial should take place in 2022. “This is an unprecedented situation,” said Agustín Pérez-Vega, director of the Museo de Cultura y Artes. “To have a project of this scale and this complexity come to a city in the center of Madrid in the middle of the season is a great achievement. The project is still in its early stages, but we hope that it will become a template for how we can organize exhibitions at the country’s most prestigious cultural institutions in the future.”\n\n\nThe British pavilion at the Fifty-Ninth Venice Biennale will be replaced by an exhibition featuring a collection of original works by a group that consists of five artists: Benedict Cumberbatch, Tom Erving, Adam Hench, and Richard Harrow. The announcement was made by British Culture Secretary Oliver Dowden, who was given the final word on the pavilion’s fate by Prime Minister Boris Johnson, who had previously called for the pavilion to be sold.“I’ve long been a fan of the team’s work,” Johnson said. “Together they have created a show that is simply spectacular and that", "The next Biennial should take place in 2021, and the first in 2022. The event will be hosted at Rockefeller Center from May 16 to May 19 and will be co-organized by the Center for Art and Design and QVC. The 2019 edition, “Made in LA,” featured 120 works by forty-six artists, including Alice Aycock, Annaleigh Greenfield, John Haslett, and Kathryn Knapp.\n\n\nThe Museum of Modern Art (MoMA) in New York has named Alexandra Oxtoby as its new curator of contemporary art. Oxtoby will be responsible for developing curatorial strategies and developing curatorial projects for the museum for a period of twelve months. She will assume her responsibilities on January 6, 2020.“Alexandra is one of the most accomplished curators we have worked with in our forty-five-year history and is ideally suited to lead MoMA’s curatorial team as she navigates the complexities of contemporary art practice in the United States, the United Kingdom, and beyond,” said director Matthew Teitelbaum. “It’s a rare combination: an American and an Italian born designer with a strong international outlook and a deep knowledge of the global contemporary art community.", "The next Biennial should be held in 2021, according to the organizers, and the tour will resume with a preview of the exhibition in 2022.\n\n\nThe Australian Archeology and Anthropology Museum (A.A.M.) in Melbourne has revealed that it is preparing to welcome visitors back to the institution this weekend following a temporary closure due to the coronavirus pandemic. The institution was forced to relocate and expand its exhibition hall in the museum in January after a fire broke out in the building, which houses an exhibition space for the field, a café, and a library. The building was also transformed into a temporary home for Australian Aboriginal art, which was on display in the exhibition space.The institution has since been made aware of the unusual disease and is working with the Australian Centre for Disease Control (ACDC) and the Australian Institute of Health and Welfare (A.I.H.W.), which are collaborating on a plan to keep visitors safely indoors through the pandemic. The institution is also consulting with stakeholders including local councils, and is monitoring the developments closely.“After careful consideration, we have decided to reopen as soon as possible,” said museum director Elizabeth Ann Macgregor. “The A.A.M. has always been", "The next Biennial should be a celebration of the '60s, in a year long celebration of the fifty-two-year history of the museum. This year’s theme is “The Future of Art.” The seventy-third edition of the show will take place in March 2020, and the seventy-fourth in June 2020.\n\n\nThe University of California, Los Angeles (UCLA), has received a $30 million donation from the James and Ethel Rosenberg Foundation in support of its new $68 million biennial, “Radical Women,” which will open on October 5 and run until November 30. The gift is the largest gift the foundation has ever made to the institution.“The gift is a great example of the generosity of the Rosenberg Foundation. We are thrilled that the gift will help UCLA further its radical feminist mission, and appreciate the support of our campus and community,” said UCLA president Gordon Gee. “Radical Women will celebrate the work of courageous women for whom radical feminist principles and practices are deeply embedded, but will also confront—in a time of crisis—the questions of how to live radical feminist ideals in a patriarchal world.”The biennial, which is being led by the", "The next Biennial should be held in 2021.  One of the main objectives of the 15-member committee that selected the seventy-two artists who will participate in the exhibition is to foster a more interdisciplinary and intercultural image of North Korea. \n\n\nFour Baltimore-based artists have won the $400,000 Brightline Emerging Artist Grant, which supports emerging artists between the ages of eighteen and thirty-four years old. The grantees hail from the Inner East and Brooklyn, and will each receive $10,000.“The 2020 Brightline Grantees provide a singular vision and set of skills to directly address the themes of ‘Our Future Is Now,’ and ‘Forgiveness.”“They embody the essence of the next-generation artist.” The artists are Sonya Janus, Zoya Daborn, Tilda Swinton, Amira El Fadl, and Tanya Guarani. January 15, 2020Grant Deadline: March 18, 2020Grant Amount: $400,000Artists:William (William) Corbett, Alex C. Carney, Amy ElSargent, Luke (Luke) ElSargent, Elizabeth (Elizabeth) Edwards, Will (", "The next Biennial should take place in 2021 at the Basel Biennale in Switzerland.  The works that were selected through this exhibition will be included in a special exhibition, entitled “The future is here,” at the Art Museum Zurich and the Museum of Fine Arts in Boston.  Originally scheduled to run on March 20–March 22, the event will now be held in the autumn.  “The future is here,” said Maaike Altmeyer, head of the Frieze New York edition.  The first exhibition of the new partnership, “The Future Is Present: Remaking Contemporary Art” (2017), was held at the museum in September. The exhibition, which featured work by twenty-one artists, was organized by the New Museum, with funding from the Rockefeller Brothers Fund and the Smith and Van Dyke family, and will be on view until November 11 of this year.\n\n\nThe Museum of the City of New York (MoCA) has completed construction of its nearly $100 million David K. Guggenheim Collection, a new three-building, twenty-thousand-work museum that will house the institution’s original collection, as well as work by the G", "The next Biennial should be held in the spring of 2021.  This is to be followed by a new collection of paintings and sculptures by Hiromasa Yonezaki, scheduled for December 2022.\n\n\nThe Museum of the Fine Arts (MoFA) in New York is removing fifteen works by twenty-four artists from its permanent collection in an attempt to shift its focus away from the collection’s focus on African American art and toward newer, more contemporary works by women and people of color.The museum has been working with the artist-run nonprofit the Twelve Years Project (TWP) on restoring the works, which were acquired by the museum in 2011 when the institution opened to the public. The work of female artists is especially important to the institution, which has been working to update its collection since 1999. The works, which comprise a series titled Women of Color, have yet to be seen by the public.“It is important for us to be aware that the works in this exhibition will no doubt be the first to reflect much-needed attention to the fantastic breadth of American painting,” said museum director Marc Glimcher. “By now, with the exhibition ‘The Lincoln-Douglas Art Museum�", "The next Biennial should take place in 2019.\n\n\nThe California-based nonprofit Center for the Arts (CFA) in Oakland has received a gift of more than six thousand works from the artist Mark Bagwell. The Bechtel Collection announced this week that the group show, which will be held in his hometown of Danbury, Connecticut, will include works by artists ranging from Kathleen Hanna to John Edmonds, as well as works from his own collection.The charity made the announcement in collaboration with the Danbury Museum of Art, which has also welcomed the artist to be a permanent part of its collection. In addition to presenting his works in its permanent collection, the museum will present 'The Showtime Experience: Art in the Age of Television' in its new collection, which will be inaugurated by a retrospective of the artist’s work at the museum in 2020.The gift, which was made in support of CFA’s 'Now or Never” campaign, arrived in the form of a Chevrolet Volt, which Bagwell had purchased for the exhibition, which will run from September 5 to September 7, 2020. The work was created with a series of charcoal drawings and paintings by Bagwell that were created in the late 1970s and early 1980", "The next Biennial should take place in 2020.The institution hopes to have the first exhibition dedicated to the work of the late public artist, artist and educator, and the third dedicated to the late conceptualist, writer, and educator, David Adjay. \n\n\nThe United Kingdom is preparing to leave the European Union, but only after it takes a hard line against those who are not part of the new regime. Prime minister Boris Johnson announced that the country is planning to leave the European Economic Area (EEA), which allows 24 EU member states access to the single market, and will begin negotiating Brexit. However, a report published by the UK’s independent Office for Budget Responsibility (OBR) on Wednesday paints a different picture.“We are leaving the EU in a way that lets the British people and businesses know that we mean business,” Johnson told reporters. “We are not leaving the customs union, we are not leaving the single market, and we’re not leaving the European Court of Justice and the European Court of Human Rights.”In an attempt to clarify the government’s position, OBR released a report on Monday that states that the government is negotiating a deal that will preserve benefits for businesses that leave the", "The next Biennial should take place in 2021. The 2019 edition, which was supported by a $1 million donation from the J. Paul Getty Trust, included work by eighty-four artists\u0097and the first show was organized by two-dozen artists.\n\n\nThe fourth edition of the Shanghai Biennale, titled “Beyond the Horizon,” which opened on February 23, 2019, has announced that it will now run from March 21 to March 29. The event will be the largest global celebration of contemporary art in the city, which is home to the Jingart Foundation and the Museum of Chinese Art, and will draw an estimated 4 million visitors.“We are thrilled that the 38th Shanghai Biennale will now be able to welcome people from March 21 to March 29, 2019,” said Shanghai’s deputy director, Sophie Zhang. “The theme is Beyond the Horizon, and we have been working for months to develop a strategy to present the exhibition in a way that will challenge the viewer to think of the future in a way that is new and exciting.”The theme of the exhibition is ‘The Future of Emotions.’ We wanted to create a space for", "The next Biennial should be held in the spring of 2020. It will consist of eight exhibitions, each revolving around a specific theme from the theme of the diary. The exhibition will be led by a Japan-based artist, a curator, and a curator of photography. The biennial will be completed by the end of the year and will be broadcasted on NTV Japan.\n\n\nThe Alexandrian Orthodox Church in Asia (CNA) has decided to suspend its annual celebration of the Greek Orthodox Church in Jerusalem, which has been held annually since 2003, until at least March 7. The Fourteenth Ecumenical Council of the Church of the Holy Sepulchre may also postpone the commemoration, which is considered a milestone in the Christian calendar, in order to allow the restoration of the Church’s historic site in Jerusalem.In a letter published on March 14, the CNA’s executive board of directors, Piers Tsakal, Imre Oli, and Mihail Gendoulakis, wrote: “The decision to suspend the celebration of the Feast of the Nativity in March is a pastoral one and is made in order to compose a new calendar year in which Christians will no longer have to travel", "The next Biennial should be held in the spring of 2021. The exhibition will consist of a programme of talks, performances, exhibitions, lectures, and other events that will comprise a new collection of works by the preceding thirty-seven years. Its opening will coincide with the centenary of the founding of the Institute of Contemporary Arts in St Petersburg, and will be followed by a reception in the autumn.Cecilia Metzger, director of the Biennial, described the project as “an effort to create a legacy for the Institute of Contemporary Arts in St Petersburg and its contemporary collections, both as museums and institutions.”\n\n\nThe Barcelona Biennial is returning to the city of Barcelona for a second edition in 2020, this time with an extra three weeks of programming. The event, titled Barca 3, will be staged in various venues throughout the city from February 21 to February 23.The event, curated by the Spanish artist Carlos Vergara, was founded in 2011 as part of the Centro de Cultura Nacional in Barcelona. The organization commissioned the Italian architect Domenico Catellani to design a new space for the exhibition, which was originally scheduled to run from March 6 to March 22.The construction of", "The next Biennial should take place in the spring of 2021. The twenty-second and twenty-third editions of the Biennial will be held in the same place next year, and the twenty-eighth and twenty-ninth editions will be held in the same locations.The event will be hosted, as usual, by the city of Paris and the French Ministry of Culture. Its first exhibition, “Bianca Varejão” (Beyond the Frame), was organized by the Museum of Modern Art in New York. The second exhibition, “The 1995–Present – An Exhibition of Contemporary Art in Paris” will be curated by the Pérez Technología and will open on February 21. The exhibition will be followed by a “2015: Mémoires” retrospective of art from the collection of the Pérez Museum of Art.\n\n\nThe New York–based nonprofit the Foundation for Modern Art (FMA) has been awarded $2.5 million by the Andy Warhol Foundation for the Arts in recognition of its work in supporting early work by American artists. The Andy Warhol Foundation for the Arts will share the $2 million with the Los Angeles County Museum of Art (LACMA), the National", "The next Biennial should focus on an inventory of the contemporary artworks or exhibitions currently on display at the museum. The program could also include a selection of works that are currently on loan to the museum. The Biennial’s program presentation will be the theme of a two-day exhibition that will showcase the work of forty artists, selected from a pool of seventeen artists, including Danish landscape painter Lars-Erik Bjerggaard, British artist R. J. Haldane, French painter Claude Monet, and artist Charlotte Pankhurst.The three-day event will be held on Saturday, September 8, 10, and 11. The first day will feature a selection of eleven works by forty-seven artists, selected from a pool of seventy-three artists. The second day will include twelve works by thirty-two artists, selected from a pool of forty-three artists. The third day will present eleven works by twenty-eight artists, selected from a pool of forty-two artists, and the final day will feature sixty-three works by twenty-six artists. The Biennial’s director, Roman J. Cuno, said: “This is an unprecedented year for the museum. The exhibition of the work of", "The next Biennial should focus on the legacy of women artists, and on the ways in which they continue to shape the current international art canon in the western hemisphere. Themes that address themes that have historically been overlooked, overlooked, and neglected.”\n\n\nThe National Guild of Art Historians (NGA) announced today that it is planning to merge with the Association of American Publishers (AAP) to form a new organization, the National Association of Art Historians (NAAHA). The move follows a year of organizing that saw more than 1,700 scholars, curators, and art historians meet in New York to discuss the future of art history and its relationship to contemporary life. The meeting—originally dubbed the Future of Art in America Summit—decided to merge with the AAP to form the new organization, the Association of American Publishers, which will consist of sixty-five bodies, including the Association of American Art Historians, the Association of Art Historians of North America, Art Historians of the American South, Art Historians of the Pacific, and the National Association of Art Historians.“The merger is a result of the AAP’s ongoing commitment to providing an annual platform to foster dialogue about contemporary art, its", "The next Biennial should take place in 2020.The exhibition will also be hosted by the Museum of Modern Art in New York and the CNE in Paris.\n\n\nWith the launch of the new digital platform Artforum, the New York–based artist-run news and artforum site ran an open call for a new digital magazine with an original, experimental title. The inaugural issue, titled Artforum: A Futuristic History, will be published in September, 2020.“We felt it was a critical time to reissue an internationally-recognized art magazine that signaled a new kind of future for New York art,” said founder Adrian Chen. “In 2017, the magazine signaled its commitment to a future in which art was not only essential but essential for the future as well.” Chen and John Williams, the publisher of Artforum, had previously decided to take the first issue of the new digital platform out of its collection, so that it could focus on a broader, more ambitious project. The magazine will now be guided by a new curatorial team led by curator Sean M. Cain.“At its best, Artforum will engage and challenge our assumptions about art, the world, and the art world,�", "The next Biennial should be held in 2020 and will organize a series of exhibitions. The show will also include a symposium dedicated to the history of art and design and will take place in a special exhibition space in the Museum. The biennial will be followed by a new exhibition, “Going Clear: The Secret History of the Dakota’s Art and Artifacts,” in the spring of 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced that it is teaming up with the Wikimedia Foundation to create a new free, satellite, online exhibition to mark the centenary of the United States’ entry into World War I. Called “The Stanford of Art” and curated by William S. Burroughs scholar Mary Roach, the exhibition will debut in 2022 and will be free for everyone to view in 2022.The show will be organized as a series of immersive multimedia experiences on the Stanford campus. The first exhibition will examine the history of humanism through the work of contemporary artists such as Roger Ailes, Joan Miró, and René Magritte. After a virtual reality installation of the first two works by Dame Judson Phillips, the artist’s first solo show in the United", "The next Biennial should take place in 2021, and the art to be exhibited should be selected by the twenty-third Biennial, which will include works by seventy-six artists with the next edition scheduled to take place in 2021.The 2018 edition, “Art of the Century,” marked the first time the museum’s collection of over two hundred works was assembled and presented by a single institution. The exhibition was curated by Olivier Messina, the director of the Musée d’Art Moderne in Paris; the artist whose work is included in the exhibition; and new commissions by Jaime Pérez-Perez and Wolfgang Remiber. The exhibition remained closed throughout the Holidays, and the biennial was inaugurated by a performance by Juan Carlos Sierra, Zendaya, and Diego Rivera.The biennial’s next edition, “Guardians of the Universe,” will be held at the Palacio de Cultura, the museum’s main building, in the autumn of 2020 and will draw from the same collection as the inaugural edition. The theme of the exhibition will be “Self-Creation and the Arts” and will feature works by forty-eight artists, including the aforementioned Diego Rivera", "The next Biennial should be held in 2020. \n\n\nAmerican painter and sculptor Robert Irwin has died at seventy years old.Born in New York in 1924, Irwin moved to Philadelphia at age fourteen to study under the legendary sculptor Carl Barks at the University of Pennsylvania. Following a stint in the art department of the University of Chicago in the early 1940s, the artist began his multi-year campaign of installations, drawings, and paintings that are now recognized as defining pieces of his career.At the time of his death, Irwin was working on a work for his first solo exhibition at the New York Museum of Modern Art (NYMoMA) in 1953. Later that same year, Barks commissioned his first painting, a solo for the 1967 issue of Artforum, and a series of paintings, many of which address personal histories and the ways in which people relate to their surroundings.The artist was also involved in a long-overdue rethinking of the American landscape, one that laid the groundwork for the watershed 1977 exhibition “The Turtle and the Nations,” at the Museum of Contemporary Art (MoCA) in Los Angeles. The show, which featured works by forty-eight artists, included Richard Avedon, David Salle, John", "The next Biennial should be held in November 2021. The date of the exhibition has also been announced, and will be the twelfth edition. At the same time, the museum has announced that it will give $10 million to Emanuela’s collaboration with partners, the Tokyo and San Francisco art-lovers’ association, and the San Francisco Museum of Modern Art to further its work in this area. It will also create a new grant program that will focus on the art of photography. “We are deeply grateful to the teams, artists and organizations who have contributed to this exhibition,” said Mark Siegel, executive director.  The exhibition was curated by Dario Catellani, director of the Museo de Arte Contemporáneo in Buenos Aires; Gianluigi Battista, director of the Museo di Architettura di Milano, Milan; Jean-Michel Fouché, director of the OREO project in New York; and Hiroshi Takeda, director of the Ergümichestven Museum in Nagoya, Japan.\n\n\nThe National Museum of Fine Arts (NMA) in Washington", "The next Biennial should be the 2019 edition, which will take place at the museum in September.\n\n\nThe Toronto Museum of Fine Arts (TMAFA) in Canada has received a $10 million donation from the estate of Charles and Edwidge Dore, the pioneering collectors who owned the British painter John Galliano and the iconic Levi’s wares. The gift includes the Dore Collection’s holdings of the twentieth-century avant-garde, including new works by artists including Pierre Cardin, Pierre Holle, and Jean-Michel Basquiat.“Galliano and Dore had a special connection with Toronto for more than sixty years,” said Edwidge Dore. “Their legacy will continue to shape our lives and the impact of their art is immeasurable.” The gift comes on the heels of a $10 million gift from the estate of Gregoire Dubois, the founder of the global art community Winemaker International, who established an endowment fund for the museum. Dubois also gave the TMAFA a $6 million donation in recognition of its contribution to the museum’s history.\n\n\nThe Los Angeles County Museum of Art (LAC", "The next Biennial should be held in one-hundred days, in conjunction with the reopening of the Museum of Contemporary Art Tokyo. The first event of its kind in South Korea, the eight-hundred-day biennial will focus on a specific period of Korean history: 1953-1977. The exhibition will include works by twenty-nine artists, including Kim Eun-sook, Kim Kwon-kyeong, Kim Ki-sook, Kim Woo-kyeong, Kim Kwon-kyeong, Kim Kye-kyeong, Kim Kye-kyeong, Kim Jong-kyeong, and Kim Kye-kyeong. The annual event has drawn hundreds of thousands of visitors to Seoul every year.\n\n\nThe Neue Galerie in New York has appointed Laura Aguilar as its new global chief curator. Aguilar will be responsible for the development and curation of exhibitions and programs that will showcase the work of internationally recognized artists and workers, and will assist with the acquisition and management of the artist’s estate.“Laura is an exceptional curator who has been instrumental in shaping Neue Galerie’s contemporary art practice, and has made significant contributions to the", "The next Biennial should be held in Tokyo in 2021.  Art historian and curator  Kihara Miwa, who curated the first Biennial in São Paulo in 2015, said: “The problem with the current exhibition structure is that it leaves the development of the art in a very thin space. It leaves the art in a very uninspiring and vulnerable condition. I would like to see a change of attitude towards the exhibition. I would like to see the exhibition become a kind of cultural counterweight to the exhibition format. I would like to see a change of thinking about the exhibition, a change of attitude towards the exhibition, a change of a new aesthetic.”\n\n\nThe London-based British art historian and poet Paul Mpagi Sepuya, who has been writing and lecturing about art and modernity for nearly sixty years, has died at age seventy-nine. The cause of death was pneumonia.Born in London on November 18, 1940, to Polish Jewish parents, Sepuya studied at the School of the Art Institute of Chicago (SIC), London, before receiving an invitation to join the Polish Academy of Arts in Vienna. His mother was a nurse and his father was a carpenter, and they emigrated to", "The next Biennial should take place in 2021. The organisers have also announced a new exhibition, “Forums,” which will present those who have contributed to the collection in a meaningful way and will be curated by a panel of artist-and-art historians.\n\n\nThe Museum of Contemporary Art (MoCA) Singapore announced today that it is preparing to welcome seven new Asian art visitors to the institution in the coming weeks. The visitors will be from the following regions: China, India, the Middle East, North Africa, South Asia, and the United States.“This is an important moment for MoCA in the history of contemporary art,” said MoCA director and cochairman Simon Houston. “With the recent expansion of our collection to 150 works by thirty-six artists from the region, we have been continuing to work with artists in our exhibition program. The next step will be to welcome them into the museum.”The exhibition, “Asia Art: The Collection of Simon Houston,” will present works by young and established artists from the region. The curator will focus on the histories of the art and will highlight the contributions of contemporary Asian art to shaping the West. “In the past decade,", "The next Biennial should be held in 2021, and the inaugural edition of the exhibition will return to the UK in 2022. The 2019 edition of the event, titled Art of Destruction, was held at an undisclosed location and was organized by Black Cube, a London-based development company including Nick Brown (Vincent van Gogh), Sir Nicholas Hoult (Jane Fonda), and Arthur E. DeMaio (Gerald Golway), and was curated by Kate Fowle (of the British contemporary art organization the National Galleries of Scotland) and Rory Mulligan (of the National Galleries of Scotland). “This means that we will not be able to mark the twentieth anniversary of the exhibition with the same energy and excitement,” said Nusseibehre. “There must be something magical about the twenty-first century about the Art of Destruction, and it is for this reason that I am so privileged to be working with the talented team of curators at Black Cube to bring this exhibition to life. The exhibition will once again focus on the power of art, and how it can transform lives and shape our world.”The exhibition will also introduce a new class of visual artworks known as Influence Arts, which", "The next Biennial should be held in the spring of 2020. The theme for the 2019 edition, “Southern Comfort,” is a reference to a poem written by the artist John McAllister. The biennial will focus on the history of African American art and will receive $50,000 from the Biennial Fund.\n\n\nThe Metropolitan Museum of Art (Met) in New York has released its 2020 edition of “The Met,” which will focus on the history of art in the city and its surrounding environs. The exhibition will feature works by fifty-five artists and will run from February 19 to February 22, 2020. The show will also include music, and will feature new works by artists such as Nari Ward, Tyron Wood, and Adrienne Edwards. The exhibition will be curated by Adam D. Weinberg, director of the Metropolitan Museum of Art, and Yale Guggenheim Museum curator Christina Bennett.“The Met has always been at the forefront of artistic experimentation in New York City, and it is committed to the diverse histories and perspectives of our artists,” Weinberg said. “The Met’s goal in creating new work that is inclusive and challenging, while also reflecting our", "The next Biennial should be held in Spring 2019. The exhibition will include a selection of works by cultural and artistic collaborators based in Oslo, including Hermann Andrianomearis, Birgitta Ingvild and Hannes J. Neukom, and will take place at the Sverre Center for Contemporary Art in Oslo, as well as at the Oslo Museum of Modern Art (OMM) and the Bergen Stadt Museum in Bergen.Commenting on the selection, which will include works by artists such as Maria Cipolletta, Massimo della Carri, Karl Lagerfeld, Vito Acconci and Marc Chagall, the artist said: “This is a moment of great uncertainty for me, as I am currently facing a period of great change, and an uncertain future. Gender reassignment surgery is one of the most difficult surgeries to carry out, and for many people that means the impossibility of having children. But as a transgender person, I have been able to shape the future and bring my children into the world. It is this project that I hope will inspire others to question everything they know and trust and build on their own lives and the lives of their children.”\n\n\nThe Museum", "The next Biennial should take place in 2020, and will be hosted in TriBeCa.\n\n\nThe American artist Naima J. Keith has been awarded the Eighth Venice Architecture Biennale for her monumental project, “Feminine” (1949). The work, which will be on view in the exhibition “Lumière and the landscape,” is comprised of more than 1,200 drawings and paintings, including some that are based on real human experiences. The work is a response to the work of sculptors Leo Godin and Joachim Neugebauer, whose sculptures often feature characters who are genderless and have no identity, but are instead embodiments of the principles of femininity and the environment, respectively. Keith’s work is also an attempt to re-define the concept of femininity and the environment through a fictionalized account of an artist’s journey from the twentieth century to the present.“Naima Keith’s work is a radical reimagining of the landscape and the human being, and of the most basic human needs,” said Heather Connell, the exhibition’s artistic director and curator. “The upcoming biennial will include an exploration and", "The next Biennial should be a celebration of the life and work of Ada Lovelace, and hopefully will be an opportunity to look around the world at how a limited field, a community, can be explored, consumed, mirrored, and advanced. The second biennial should be about the life and work of Sunil Gupta, and should take place in the Spring. The third biennial will focus on the history of the Americas, and will be held in the spring. We hope you will join us. \n\n\nThe Baltimore Museum of Art (BMA) announced today that it has established a $500,000 fund to support the immediate needs of local artists and small-arts institutions as a result of the coronavirus pandemic. Led by curator and activist Mona Hatoum, the fund will distribute $150,000 over three years to support artists, artists, and arts professionals who have experienced financial hardship as a result of the coronavirus. The grantees will be selected by an independent panel made up of artists, local Baltimore-area arts professionals, and city government officials.The fund was established in support of the primary caregivers of artists and their families who are ill and are unable to work or", "The next Biennial should be called the \"Future of Art’s’s First.”\n\nThe Museum of Modern Art (MoMA) in New York is planning to lay off 120 employees after it closed in January due to the Covid-19 pandemic. The news, which comes amid ongoing protests outside the institution over its decision to lease space to a for-profit museum, was made on Thursday, March 13, the same day that MoMA announced that it would begin welcoming visitors again.The move followed months of protests, including a March 16 statement by thirty-six curators and producers from thirteen cities around the world, including New York, Paris, Hong Kong, and London. The letter’s signatories demanded that MoMA alter its lease agreement, which obligates the institution to pay the city of New York up to $1.7 million for any damages to the cultural district caused by the Covid-19 pandemic, and that the public be assured that the museum is following standard operating procedures with regard to infection control and the care of the museum’s collection.“The Museum of Modern Art is taking a proactive, unprecedented approach to controlling Covid-19 by implementing an emergency funding program,�", "The next Biennial should take place at the Ordos Museum in the town of Starys in the province of Fijis, on the island of Bali. “I really look forward to seeing the new works that will be presented at the Ordos Museum in 2020,” said director Dr. Pilar de Albuquerque. The exhibition will include twelve works by forty-four artists and will run until March 20. “The Biennial is a central and cherished resource for many artists, and for the world,” said the governor of Bali, Joko Widodo. “With the first edition just around the corner, we’re confident that the upcoming edition will showcase the best of contemporary art.”The artist-run museum often hosts artists at exhibitions. Last year, Wang Wei, who is known for his creation of Cranium, a monumental wooden installation that stretches across three floors of the museum, was named the winner of the Sirocco Prize. He was also nominated for a Brunei-originated National Prize for Contemporary Art last year, and last year’s Venice Biennale featured work by more than seventy artists, including Johanna Ghebaly, Wolf", "The next Biennial should be announced in the second quarter of the year. The first, in 2001, was staged at the Museum of Modern Art in New York. In the exhibition “The Black and White of Nature” (1999), the artist Lucy Lippard sketched a landscape which was influenced by the work of Henri Baudrillard, an alchemist and inventor who created the experimental glass devices which were sold by the manufacturer, World-Wide Glass Company, in the early 1960s.\n\n\nAn outpouring of support for the workers of the Guyana Museum of Art (GMA) has been sparked by the April 5 death of the museum’s secretary, Emma Kerr. Kerr, who had led the institution for three years, was found dead in her apartment in the capital city of Guyana. “We mourn the passing of an inspiring and innovative secretary who brought GMA and the art world a truly international vision,” said GMA director and CEO Teresa Fontana. “She was beloved by her staff, fellow collectors, and the entire community and will be sorely missed.”Kerr was a trusted advisor and confidante of the museum’s legendary founder, Jacques Tours. For the past three quarters", "The next Biennial should be held in the fall of 2022.  The next edition will feature seventy works by forty artists, and will be presented in partnership with the Museo de Cultura de Artes.  The next edition will be free to the public and will feature a selection of works by forty other artists. The next edition will be organized in collaboration with a local community organization in the city of Córdoba, Mexico. “This year’s exhibition is a reflection of the spirit of community that has characterized the past thirty years of our history,” said Alejandro Martínez, the director of the new Biennial. “This is a celebration of the life and work of the forty-eight artists who were selected by curator João Pérez. The artists chosen for the exhibition are diverse and represent the northern hemisphere\u0097from Brazil to Venezuela. The selection of the artists for the exhibition was also influenced by the artists who have been the subject of their works in the past. The artists who have been selected for the exhibition are chosen by a committee made of representatives of the artists, the collectors, and the curators of the full catalogue.”The forty-eight artists selected for the upcoming", "The next Biennial should be in the form of a 'symposium', and will be divided into sixteen sections. The first , entitled “Sustainability,” will be held in May 2020, and the second and third – which will comprise of a “4th Branch,” and “5th Branch,” respectively – will open in June 2021. The seventh, the “Organic/Inorganic/In-situ,” will take place in October 2021.The theme of this year’s exhibition “Sustainability and Future Present: Building Bridges,” is “Religion, Politics, and the Body.” The wall mural by Porcfestal, which was commissioned by the city of Barcelona and is located in the city’s Puerta del Sol, is one of two works outside of Spain to be included in this year’s exhibition. The other work is a painting by Erick Rodríguez-Ruiz that was created in the town of Almería, in the northwestern province of Cordoba, in 1961. The latter work, titled “Abandon a life,” was created on the walls of a", "The next Biennial should be held in December 2021.\n\nVisitors to the exhibition, which was established in 1996, will be able to re-create the hall of the Museum of Contemporary Art (MoCA) in Los Angeles—the venue for the annual event—by building a replica of the venue and its surrounding neighborhood. According to the Los Angeles Times, the location will be adjacent to the California Institute of Technology in Pasadena, California, and will be situated on a 1.6-acre campus that overlooks the city.The exhibition, called “Modernism from the Egyptian to the Contemporary: From the Egyptian to the Contemporary” (which stands for Modernism from the Egyptian and Contemporary,” is curated by Prentiss Sansouci, director of the museum; Sara Cwynar, curator; David Salle, curator; and Gareth Nesbitt, director of the Biennial.Museum historian and curator Cynthia Brown, who curated the show, said that the building of the exhibition was “a project that was underway before the museum was created.” “Modernism from the Egyptian to the Contemporary: From the Egyptian to the Contemporary” will open at the Museum", "The next Biennial should be held in 2020. \nThe upcoming exhibition “Sochi 2020: Art and Chemistry” was first announced in June 2019. The show will take up the Arctic-20 biennial’s theme “The Chemistry of Life,” which is a reference to the show’s predecessor, “Sochi 1973: Chemistry of Life” (a reference to the show’s third exhibition, “Human Evolution”). The new show will be cohosted by Viktor Shagal and Nari Ward.The Biennial will be held in the city of Sochi from March 27 to March 31, 2020. The opening ceremony will take place at the Okpo Art Museum in Moscow on Friday, March 26. The second leg of the event will take place at the Los Angeles County Museum of Art on Tuesday, March 26. “The Chemistry of Life” is organized as a series of eco-systems that integrate biological, chemical, and physical systems in order to create new and dynamic life on Earth. The show will deploy a range of art materials including tools, plants, and animals throughout the biennial, which will include a virtual reality experience, as well as technologies that", "The next Biennial should be staged in 2022, but there are a number of surprises that need to be worked out. With the assistance of an international committee comprising Lisa Spiridon, director of the Ivanka Walker–designed Villa Artola and Andrea Rossi, artistic director of the Biennale de Lyon, Laurea and Fernando Pérez, chair of the board of trustees of the Art Forum, and others from the Museo de Arte Contemporáneo, the Biennial is working on a number of evolutionary scenarios, including one that involves a cultural village located on a hilltop.  “The event will take place in the Central Province of the Republic of Azores, and will focus on the evolution of art, architecture, and landscapes,” said Ricardo Gago, director of the Museo Arte Contemporáneo, in a statement. “It will be a celebration of creativity, imagination, and hard work in a city that is known for its artistic co-operation.” Since the Biennales of New York and New Orleans in 1988, New York has hosted more than sixty biennials. The city’s celebration of its 150th anniversary with the biennial “Trinity", "The next Biennial should take place in Hong Kong in early 2021. The finalist will be selected by a panel comprising Bao, Kamboui, Lavin, Davids, and Kuzma, which will also include a curator from the United States. The museum will also ask selected artists to create a new exhibition and will hold a public open-studio space in the Museum of Contemporary Art Beijing in May 2020.\n\n\nThe National Gallery of Ireland (NGA) in Belfast has welcomed Tanya F. Coyle, who has served as the director of the institution since 2009, to its staff. Coyle joins the NGA in its second year as director and will take up the post on January 20, 2020. She succeeds Margaret Mulligan, who has served as NGA’s director of conservation and preservation since 1993, and will begin her new position in January 2021.“We are extremely excited by Tanya’s appointment and the opportunities she has created for the NGA as a regional authority,” said director Martino McManus. “We have had a long-standing relationship with Coyle since 1995, and she has been instrumental in developing the NGA’s outdoor spaces", "The next Biennial should be held at the Institut d'Art et d'Histoire, Paris, in 2021, and will take up the themes of the recent recent global crises—from climate change to the democratization of the arts.The 2019 opening of the exhibition was marked by a play, “Radical Women: How French Women in the 1970s and 1980s Inspired Modernism” (the title of the main exhibition), which explored the legacy of French feminist artists of the feminist and anti-racist movements. The show will be followed by a lecture and a performance by the biennial’s inaugural playwright, Zineb Sedira, and the biennial’s director, Naima J. Akram, in the spring of 2021.\n\n\nThe Tate has announced that it is planning to cut more than two hundred jobs at its London, Liverpool, and St. Ives locations in an effort to reduce costs and improve working conditions. The London and Liverpool locations, which have close to 250 employees each, are facing a strike that would see protesters at Tate premises blocked from entering the institution by August 30. The action would also see the Tate move five of the institution’s planned programming, including a major retrospective of", "The next Biennial should be in 2022. In the meantime, the Brown Museum of Art will display new and previously unpublished work.” \n\n\nThe Museum of Fine Arts (MFA) in Boston recently received a $5 million gift from the Eli and Edythe Broad Foundation. The $5 million gift includes $3 million for art and $2.5 million for the museum’s collection, which is comprised of approximately 1,600 works by American artists.The gift comes a little over a year after the Broad Foundation established the Eli and Edythe Broad Charitable Foundation, which gave $2.5 million to the MFA in 2017. The MFA also received a gift of $2 million from the family of the late businessman Henry Dreyfuss, whose fortune was principally made through the art and design industry. The MFA acquired the works from the Broad Foundation in 2016 for its collection, which includes work on display in the museum’s new 6,000-piece building.\n\n\nThe Pulitzer Prize–winning author and editor in chief of the New York Times, Carl Bernstein, died on December 16 at the age of seventy-eight. He had been battling pancreatic", "The next Biennial should be the exhibition “Dandong Necropolis” (Dandong, China) and will resume in May 2020.\n\n\nThe China Museum of Fine Arts in Beijing has released a new set of guidelines for the use of microprocessors in its public projects. The document outlines how museums and other cultural institutions should deal with potential risks posed by equipment made by companies based in China and how they should monitor the growth of their inventories of the products.Museums have traditionally been hesitant to publicly address the safety and manufacturing practices of their equipment, preferring to keep their operations separate from their buildings and their employees’ businesses. The guidelines, issued by the National Development and Reform Commission (NDRC), outline a number of measures to prevent the spread of Covid-19 and how museums must assess how much work they can do to reduce the risk of the disease.The document outlines the following steps:1. Museums that manufacture microprocessors and have physical premises in China (e.g., factories, warehouse, workshops, schools, universities, universities’ laboratories) must report any known cases of Covid-19 within thirty days of the incident.2. Museums that have manufactured microprocessors and have physical premises in", "The next Biennial should be held in 2021 and the twenty-fourth in 2022. The 2019 event was organized by the Los Angeles–based nonprofit the Los Angeles–based nonprofit the Urban Institute. The invitation-only event was originally scheduled for November 17–November 19 and was presented as a workshop run by curator Victoria Miro, curator of contemporary art at LAXART, and artist-in-residence Nyjah Jarrett. The exhibition was initially staged at the Museum of Contemporary Art Los Angeles (LACMA), but was moved there following the riots in Baltimore. The event, titled “Unseen: Art in Motion” and curated by artist-in-residence Anna Wintour, was originally scheduled for May 6–May 8 and was rescheduled for May 9–May 11. Its 2020 edition, “Future Vision: Art in Motion” will be curated by the New York–based curator Artsy Ware.\n\n\nThe Shoshana Jilani Foundation in Queens, New York, has received a $2 million donation from an anonymous benefactor in recognition of its work supporting the medical research and art conservation needs of black and indigenous communities through arts and cultural activities, arts education, and conservation.", "The next Biennial should be a vehicle for the creation of a new cultural identity in the city, the creation of which will not only directly address the current challenges of our time, but will also continue to be a celebration of the city as a whole and the city’s rich and powerful histories.”\n\n\nThe Chinese artist Wang Jianjian, whose groundbreaking painting and sculpture made the contributions of early modern and modern art, died on November 26. His twenty-seven-thousandth birthday was marked by an exhibition at the Museum of Modern Art in New York. Wang Jianjian’s works are housed in the collections of many institutions and institutions in China, and in the collections of the Museum of Modern Art and the National Museum of China in Beijing.“Wang Jianjian is a pioneering artist, a precocious artist, and an artist at the forefront of his field who is considered one of the pioneers in the history of the modern art world,” said Kenneth S. Yang, who has worked with the artist for more than twenty years in his studio in Beijing. “His art forms were evanescent and his techniques his own: it was like he had never experienced any other medium. In fact,", "The next Biennial should take place in Helsinki in the spring of 2021. The exhibition will also feature an exhibition of work by artists from the fourteenth generation: Barbara Florphy, Daniel Gombo, Kaj Kela, and Mikko Hietanen. The seventy-first edition of the Biennial will be held at the National Museum of Contemporary Art in Berlin in the autumn of 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Santa Monica, California, has appointed Adam D. Levine as its next deputy director. Levine, who has served as a curatorial assistant at the museum for nearly two decades, will succeed Jennifer Kelsey, the current deputy director of curatorial affairs.“After extensive discussions, Matt and I have concluded that Adam has the unique ability to bring exceptional curatorial vision and leadership to our institution,” Kelsey said in a statement. “As we look to the future, we want to build on the success of MoCA’s contemporary programs, which are currently strong, and to ensure that our future programs and exhibitions reflect its unique character.” “With his broad experience and deep understanding of contemporary art, Adam will bring a breadth of expertise and experience to MoCA’", "The next Biennial should be announced as early as this month.\n\n\nColumbia Pictures and David K. Porter, the London-based producer of the internationally acclaimed British television series Torchwood, have partnered to produce an edition of the series, titled Torchlight: The Next Generation, for HBO. The series will premiere in the spring of 2020.A production team led by Columbia Pictures will be based at London’s ExCelent Gallery through June 22, 2020. “The Next Generation features a cast of around seventy people in their early thirties and young women and will present a continuation of the journey captivated viewers throughout the series,” said David K. Porter. The series will also follow the lives and careers of twenty-eight individual characters, and the evolutionary journey of a single man and his family. The series will premiere on HBO in the spring of 2020. Already a five-year production, Torchlight: The Next Generation will continue on to 2020 and will be followed by the upcoming sixteenth edition, which will be held at the State Museum of London from November 18 to November 22, 2020.The partnership between the two companies began in 2015, when David K. Porter, a British filmmaker based in Los Angeles, called for", "The next Biennial should be held in the spring of 2021. The first exhibition will be “The Body and the Body Parts,” an exploration of the relationship between the body and its components and how this relationship affects the individual and the world. Through collaborations between artists and scientists, including the Italian artist Vittorio De Sica and the Burmese artist Mo Yan, the exhibition will aim to present a view of the human body from the perspective of multiple disciplines, including sculpture, painting, and the human sciences.The new exhibition will be organized as follows:ThemesToBeDesigned(“Themes”): An exhibition of contemporary works by female artists whose work addresses topics such as the body, gender politics, and the self.ThemesForRightsToBeResolved(“Themes”): A collective exhibition of works by and on behalf of the artists who have championed the rights of artists and other marginalized communities. The exhibit will include a wide range of readings and performances by the artists in an attempt to consider the interdependence between the body and the environment and how art can be used to address these issues. ThemesForSlavesToBeResolved(“Themes”): A series of", "The next Biennial should be at least four years away, and the theme should be ‘I/m/n. It should be about how we change, how we live, how we work, and how we make our worlds.”The 2020 edition of the show will be held in Los Angeles, New York, and Santa Monica. The 2020 theme is “When Change Becomes Ours,” and the theme of the 2020 biennial will be “Change Is Not a Free Thing.”\n\n\nIn a major new exhibition at the Barbican Art Gallery in London, artist-activists including Marina Abramović, Artforum’s editor in chief and chief curator, and Richard Feynman, author of the influential book ​Feynman out of Time, have joined forces to launch a new network of arts organizations dedicated to protecting and sharing digital artworks. The initiative, called the Digital Cabinet, aims to provide a platform for artists, designers, and other cultural workers to collaborate and protect their digital artifacts.“The digital cabinet will first be a resource for artists and will then be a platform for designers and artists to share their experiences and advice with artists and designers,” said the organizers. Founded by", "The next Biennial should be held in the spring of 2021.  The exhibition will include work by a selection of thirty-five artists and will run alongside the upcoming exhibition “Be/longing: Contemporary Asian Art” at the Museum of Modern Art. Inaugurating the exhibition are three new works by senior curator Fumihiko Nogi, which were commissioned by the artist-run nonprofit artist-run cooperative, and her first solo exhibition at the museum since 2010.\n\n\nThe National Geographic Society (NGS) announced today that it is collaborating with the Museum of Contemporary Art (MoCA), London, and the Institute of Contemporary Art (ICA) in the United States on a new series of exhibitions dedicated to the African diaspora. The exhibitions will focus on African art from the African diaspora through the lens of the NGS.“The NGS and ICA are pioneering new approaches to the study of African art, which are both grounded in their own histories and histories of artists, and how they are interwoven with the histories of their audiences,” said Helen Forsyth, director of the National Geographic Society. “Together we are seeing through the complex histories of African art and it is a game chang", "The next Biennial should be held in 2020 and will be part of the 2020 Biennale program.\n\n\nArtforum has received a significant donation of thirty-one works by seven groups: the Los Angeles–based artists Tazio Galland and Pilar Macedo-White, the New York–based artists Malala and Nusrat Ali, the Los Angeles-based artists Max Beckman and Adrian Piper, the Los Angeles–based artists Baria and Hernan Peralta, and the New York-based artists Monir Abbas and Kamiar Bouess. The works will be added to the collection as a way of honoring the activists who were assassinated by US drone strikes in Yemen in January 2017.The donation includes works by:The Black Panthers\u0097originally published by the Black Panthers Party, a revolutionary black political organization founded by George Floyd, Yvonne Rainer, and Adrian Ray Price\u0097posterized by Pilar Macedo-White. The Art Students of Color Against Empire, published under the leadership of Alicia Garza and Jonathan Butler, was penned by Pilar Macedo-White. The Bahrain-born artist Shailja Farsi, a founding member of the Bahrain-based collective Beit", "The next Biennial should be held in 2019. The 2020 event will be at the museum in 2021.  Although a new five-year plan has yet to be released, the 2020 edition of the show will feature a new selection of works. The biennial will also feature new site-specific installations and will feature a retrospective of the 2016 exhibition “Sleeping Beauty.”\n\n\nThe Bechtel Group, the American art-world consortium led by American textile magnate Richard Bechtel and the German industrialist Dietrich Malscheu, has announced that it will jointly create the world’s largest art museum in New York. The Bechtel-Malscheu Art Museum (BAM) will host twenty-four exhibitions annually, beginning with the exhibition “The National: Art in America” (2019) and ending with the exhibition “This Is Not a Game: American Art and Its Allies.”The Bechtel-Malscheu Art Museum will be built in the former steelworks of the Edward J. Bernice Vanderbilt building on West Twenty-Third Street in Manhattan, and will be located on the site of the former Bechtel-Malscheu Steel Company, which", "The next Biennial should be up in the spring of 2020. “The next Biennial should be up in the spring of 2020.” André Breton, president of the Biennale des Beaux-Arts, France, said: “We are currently working hard to make sure that the 2020 edition of the Biennial of Modern Art, which is currently underway, will be released in the spring of 2020 and will present the most ambitious programme of exhibitions and residencies.”The 2018 edition featured works by thirty-seven artists, including Kostas Balabanova, Patricia Lafontaine, Paul Mpagi Sepuya, Barbara Owens, and Mihai Pangaea.\n\n\nThe Fine Arts Museums (FAOM) in London and the City of London are launching a series of collaborative artist-focused initiatives with local residents in an attempt to address overcrowding and air pollution caused by buildings and construction. The first collaborative project, “AirQuality in London,” will involve galleries and arts organizations in fifteen London boroughs and will launch on September 5. The project will collect data and visual artworks from across the United Kingdom through the use of social media and will then present the", "The next Biennial should include a significant exhibition of work by the artists who have shared a platform with the founder of the museum. “The MCAB is committed to creating new and innovative programming that connects and engages with the institution’s legacy, our collection, and our staff,” said director Paul Mpagi Sepuya. “With that in mind, we’ve created a new role within the institution for emerging and established artists. We’re seeking an individual who has a proven track record of outstanding curatorial excellence.”In order to prepare for the forthcoming exhibition, which will be inaugurated by the institution’s reopening ceremony on August 28, the museum will begin by revamping its existing exhibition space, known as the Student Center, which is located in the building’s basement. The interior of the building has been completely remodeled and will undergo a major facelift, which will include the installation of a new glass-enclosed glass-enclosed entrance on the ground floor, a new library, and a reconfigured auditorium.The new spaces will be inaugurated by a new collaborative project between the museum and the Kunsthalle Basel, with a new permanent installation of", "The next Biennial should be a survey of the history of contemporary art, in the form of a group exhibition. The interdisciplinary exhibition will include works from the exhibition catalogue by a variety of artists, including Giacomo Benedetti, El Lissitzky, Carl Andre Deutscher, and Hildegarde Duane. The exhibition will be hosted by the Museo de Cultura Artes y Bebs y Pobre, in Buenos Aires, from November 7 to November 9, 2020.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) is facing a class-action lawsuit from former employees alleging that the museum has been treating its artists and staff unfairly since it closed in December. The suit was filed by employees in the late stages of a union drive, but it only led to a new round of concessions made by the museum, which reopened on Wednesday, March 12, and re-opened on Monday, March 13.Fiona Vassallo, a former SFMoMA employee, told the Washington Post that on March 13, the day the museum reopened, she was asked to leave the premises for bringing a chair to the center of the museum. She alleged that the chair was placed in a locker and that an employee followed her", "The next Biennial should be held in 2022, but the organizers said that there will be further updates on the festival until 2022. \n\n\nThe UCCA Foundation in the United States is suing the state of Arizona to protect the archaeological site of the ancient city of Teotihuacan from the Trump administration’s plan to revoke federal heritage protections. The foundation is asking a federal judge in Tucson to block the Department of the Interior from dismantling the monument, which was created in 1978 to commemorate the site of the Mayan ruins of Teotihuacan, and is also arguing that the move violates the landmark 1898 Treaty of Guadalajara between Mexico and the United States, known as the Compact.The case stems from the Trump administration’s January 20 filing of an official complaint against the United States, which states that the 3,300-year-old monument is “obstructing, obstructing, and dividing us from our historic territory.” The move is part of an attempt by the Trump administration to dismantle the twenty-five-year-old Antiquities Act, which was passed by Congress in 2016 to protect more than eighty thousand artifacts from being removed from public display and removed to private collections. The Antiquities Act was renewed by", "The next Biennial should be held in 2020. However, following an outcry from the local community, Mayor Randall Woodfin declared that it is his decision to move forward with the construction of a new exhibition space for the biennial. He also said that he expects to complete the project by 2021. The new venue will be named after the artist.It will be located in the former location of the Metropolitan Museum of Art, which was converted into a rarefied environment for American artists in 1966. The institution was founded by a group of wealthy Chicago businessmen and will host more than sixty artists from forty countries. The biennial will take place in the summer and will run from November 15 to January 10, 2021.The biennial will also introduce new programming including a retrospective of the artist ’s work “Coffee with a Fist,” which was made in collaboration with artist and educator Jack Schenk, and a public art installation, “Glory to the Fatherland,” that will run for eleven days in the spring of 2021.\n\n\nArtnews reported that the upcoming edition of the Art Delegation, “We Want the Future,” will be held in the French city of Strasbourg from March 19 to March 21", "The next Biennial should be held in 2020. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Lauren Zabel-D'Orazio as its new deputy director of curatorial affairs and chief curator. Zabel-D'Orazio comes to the institution from the Metropolitan Museum of Art, where she has served as a curator since 2002. She will assume her new responsibilities in January 2020.“I’m incredibly excited to welcome Lauren to the museum,” said Stephen M. Ross, director of the museum. “I’ve been a fan of Lauren’s work for years, and her curatorial practice is as varied as her imagination. It’s a real honor to be able to work with her and to have her on board.”In addition to serving as curator, Zabel-D'Orazio focuses on developing and implementing new curatorial approaches to exhibitions, exhibitions, and research. Her curatorial projects include “Monopol: The Art of the Video,” (2017–18), which premiered at the Venice Biennale, and “Feminine Body,” (2018), which was on view at the Museum of", "The next Biennial should be held in the autumn of 2021.The exhibition will feature work from thirty-one artists, as well as reviews, biographies, and conceptual discussions with some of the same individuals who will be featured on the first exhibition. The artist biennial is being organized by the W. M. Kegan Paul Foundation and is supported by the Schaffner Foundation and the Foundation for Contemporary Art, London. The twenty-six artists featured in the exhibition are:Arakawa Satoko (Tokyo), Simone Leigh (New York), Tarek Atoui (New York), Evelyn Leibovitch (New York), Laurens Lim (New York), Claudia Sutch (New York), Joan Walsh (New York), Andrew Wheeler (New York), David Zwirner (New York), David Richards (New York), Kasper Nielsen (New York), Alejandro García-Jara (New York), Amanda Levin (New York), Franz Kala (New York), Yoshitomo Nara (New York), Marianne Neveu (New York), Nikolay Orlov (New York), Cara", "The next Biennial should be held in the autumn of 2021. The full list of participating artists is as follows:\nAnnie Andersson (Denmark)Andy Price (United Kingdom)Akimsa (Denmark)Kjersti Pedersen (Norway)Alexandra Witley (United States)Thomas Mørk (Norway)Arne Gendelman (Austria)Arunanath Pal Singh (India)Franziska Ruprecht (Germany)Marcus Saar (Germany)Anya Stier (Austria)Udo Bauer (Germany)Franziska Bächli (Germany)Lauren Collins (United States)Natalie Clasen (United States)Nominated by artist(s):Luis Berra (Germany),Olivier Bonin (France)Gina Bonilla (Mexico City)Igor Bouman (Brazil)Hannah B. (United States)Elijah Bradley (United States)Bradley Awards (United States)Bradley Bocker (United States)Bradley Bourne (United States)Bradley Campbell (United States)Bradley Cullen (United States)Bradley Dern (Canada)Bradley Engle (New York)Brad", "The next Biennial should take place in the Summer of 2021. The next exhibition should be held at the Museum of Contemporary Art Los Angeles (CAFA) in 2021 and be staged at least once a year. The next exhibition should be staged in the Fall of 2022. The next exhibition should be staged in the Spring of 2022. The next exhibition should be staged in the Fall of 2022. The next exhibition should be staged in the Spring of 2022. The next art event should be an exhibition at the Museum of Contemporary Art Los Angeles (CAFA). The next exhibition should be an exhibition at the CAFA. All of these events are ten years in the making and, in the lead up to them, the Museum of Contemporary Art Los Angeles and the California Institute of Technology (CalArts) have been working tirelessly to bring new kinds of exhibitions to Los Angeles. According to Artnet, the two institutions spent more than twenty-five years developing the new format. The museum also introduced a new event called LAXART, which brings together up-and-coming artists and is modeled after the LAXART festival, which was launched in 2005. The exhibition will be housed at the museum and will run from January 28 to March", "The next Biennial should be held in 2020, it said.\n\n\nThe International Council of Museums (ICOM) in Rome has awarded the 2019 San Giovanni Grand Audiovisuali to Alessandro Cattelan. The Italian curator and writer was selected by the jury from a shortlist of twenty-one artists who had submitted works by the Italian-born, New York–based artist LaToya Red Star, who has lived in Italy for thirty-seven years.“Cattelan’s creations feature urban narratives and reflect his own political and social beliefs as well as the cultural and historical landscape of Italy,” said ICON President Diana Falcone. “We are thrilled to support his vision and to witness his long-term impact on Italian art. This year’s Biennale is full of enduring, powerful, and unexpected artists: a great collection of our time and contemporary art, and an astonishing array of styles and artists who are redefining their own perceptions of how art can be achieved and composed.”The prize jury that selected the seventy-one-year-old artist included Iconsciator and curator Emanuella Cattelan, president of the I", "The next Biennial should be a celebration of the great artist, architect, and painter, Bienal, at the end of his life. It should be a tribute to the men and women who have made the Biennials possible. I look forward to working with all of you, as we continue to support and honor our artists and the Biennials, and to creating an inspiring platform for their work. I am also excited by learning about the challenges and opportunities of being a curator. I have had the privilege to work with some of the best and most gifted artists of our time, and it is my honor to continue that legacy.\n\n\nThe Museum of Modern Art (MoMA) announced today the representation of works by twenty-eight artists, including Yinka Shonibare, Dada and Ennio Armani, Julie Powell, and Sonia Millar. The exhibition, titled “Connections,” is part of the biennial’s debut, “Between Worlds: Artists and the Flesh,” at the Museum of Modern Art, which will reevaluate the relationship between art and life through work by twenty-eight artists, including Shonibare, Powell, and Davis Scott, all of whom", "The next Biennial should take place in Berlin in March 2020. The exhibition, entitled “Feminine, Feminine 2,” will be hosted by Angela Korb and will feature work by more than fifty artists, with work by female artists accounting for less than 3 percent of the total number of works in the exhibition.The exhibition was chosen by curator and curator of contemporary art Ulla and Wolfgang Kämpfer. The couple, who have been working together since the late 1980s, decided to separate following a dispute over an easel-mounted work by artist Helene Hirschfeld—a sculpture that evoked the work of a woman and the work of a man—that was on display in “Feminine, Feminine 2,” and which the curator said was “completely original” and “absolutely beautiful.”The exhibition will be on view until March 23.Visitors to the exhibition will be able to relive the “experimental, speculative, and strange” of the exhibition in a number of ways, including by using Google Glasses, which the museum will begin rolling out in March. The museum will also introduce new interactive experiences, including a science-fiction film by artist Rine", "The next Biennial should be ready by the end of the year. \n\n\nThe Biennale Foundation in London announced today that it is launching an initiative that will help direct the future development of the Biennale, which was founded in 2005 by the British royal family to commemorate the centenary of the end of World War II. The organization will establish a new category of event, the 'biennale vision,' that will bring together work by local and international artists in order to develop a global narrative around the theme. According to the foundation, the new work will be curated by an independent selection committee made up of Berit Hirsch, artistic director of the Biennale Foundation, and Paul Mpagi Sepuya and will be presented by a director of the Biennale Foundation, Laura Mulvey.Commenting on the initiative, Hirsch said: “The future of the Biennale is at risk if we don’t act now. The future of art is at stake. It’s time for art to take up the task of saving the biennale today.”Founded in 1989, the Biennale Foundation is an umbrella organization that comprises the entries of nine artists: Osei Nara", "The next Biennial should take place in the autumn of 2022. The exhibition will be centered around the work of Juergen Teller, who also curated the Hamburg Biennale in the past, and will take up the themes of the exhibition “Imagination and Reality” (2019) and “Nirvana and the Patient.”Set to open in the spring of 2021, the exhibition will be led by Melissa Fadl and features three artists: Charles Martinet, Pedro Reyes, and Rirkrit Tiravanija. The commission of the work\u0097which will be presented in collaboration with the artist who created it\u0097was made possible through a grant from the Rockefeller Foundation.\n\n\nThe Polish Ministry of Culture is working on a decree that would allow the government to restrict the activities of foreign cultural institutions in Poland. On March 31, Culture Minister Milan Ghetto and the Polish Academy of Fine Arts (PiFu) director Petra Wojtas announced that the ministry has received a proposal on the regulation of foreign cultural institutions in Poland. The ministry is now drafting a law to implement the proposed legislation and is working on a response to the proposals. Ghetto and Wojtas said that the ministry received the", "The next Biennial should take place at the San Francisco Museum of Modern Art, which has a rotating roster of artists competing for $10,000. The 2020 edition of the Art in the Streets festival will feature sixty-two works, which will be curated by an assembly of forty-eight artists and organizers\u0097the Art of the Streets program was launched in 2006 as a way to revitalize blighted commercial spaces in Sunset and North Beach\u0097and will run from November 8 to November 11.\n\n\nThe Institute of Contemporary Arts (ICA) in Prague announced that it is launching the Czech Republic’s second edition of the iCArt art fair, which will take place in the city of Posen, from February 9 to March 16. The biennial will include twenty-six works by forty Czech artists on display. The first edition of iCArt in February 2019 featured works by twenty-three artists\u0097Kalig, Škoda, Bálint, Šprajs, and Wojtas\u0097and Škoda became the first artist to win the prize.Wojtek Wojtas has been nominated for the prize for his work The Prince , out in March,", "The next Biennial should take place in Tbilisi in 2020.  The 2020 edition will be hosted by the Georgian Institute of Art and will feature the work of forty artists and will be inaugurated by artists from the Georgian South.\n\n\nThe Houston Museum of Art (HMA) has announced that it will award $500,000 in grants to six artists whose creative practices integrate art and social justice. The New York–based organization will showcase the winners at a reception at the institution in October.One of the five finalists, Leila Alyssa, a Chicago-based artist, was chosen from a shortlist consisting of Paul Mpagi Sepuya and Sebastian Mayhew. She is based in New York and has exhibited at the New Museum in New York, the Museum of Modern Art in New York, and the Brooklyn Museum in Brooklyn. The other semifinalists are Elinor Cardoso, Rachel Chiang, and Alana Herrera. The list of the ten finalists is as follows: Phyllis Deborah, \"The Body in the Making of Modern Life\", 2018South by South American Artists, 2019Runoff from the Panorama Project, 2019South by Southwest, 2019The Body/Everything Project, 2019", "The next Biennial should be held in 2022, but the organisers of the event are considering a delay. “We recognize that the timing is critical, and we have every intention of honoring the mandate of the previous iteration and continuing with the new Masterton Masterpiece for 2018,” said Stefan Koch, artistic director of the Ninth International, in an interview with the Art Newspaper.Koch noted that the venue, which had previously hosted the art of Anna Atkins and El Paso Peña, was meant to reflect the state of contemporary art at that time. “In a world where many exhibitions and international conferences are now impossible to mount, and many international artworks now require the cooperation of close collaborators, the team of Vienna-based architects is at the forefront of a new kind of international.”The next edition of the Masterton Masterpiece will take place at the Biennale in the city of Vienna from October 10 to October 14, 2022, and will be co-curated by Arnulf Kiesewetter, the artistic director of the University of Applied Arts, Vienna; Alexandre Neugroschel, the artistic director of the Museo de Arte Contemporáneo in Barcelona; and Sebastian Rich", "The next Biennial should be held in the fall of 2020. “One of the challenges for the jury was figuring out how to include current cultural practices in a way that was both immersive and inclusive while still remaining rooted in a historical narrative,” said Arne Glimcher, chair of the exhibition’s advisory committee. “The exhibition ‘Signs/Splinters: Modern Art and Global Spectacles” (2018) also incorporated an open-concept avant-garde in the form of a primordial aquatic installation, which was based on a series of animal sculptures. “We strongly feel that this year’s Biennial will be a landmark and a reflection of the continuing vitality of contemporary art in the Americas,” said Krzysztof Wodiczko, chair of the exhibition’s advisory committee. The 2019 edition, “After,” was dedicated to the Brazilian artist Luiz Feliciano. Set in the favela of Rio de Janeiro in the nineteenth century, the work was an abode of Salvador Dali, who brought the pieces to the city to be exhibited. The show, which also featured works by artists such as Naijata P", "The next Biennial should take place in 2021.\n\nThe Peabody-Essex Museum of Art, Massachusetts: The Peabody-Essex Museum of Art has announced that it will move the 2017 exhibition “Odd Kind of Blue,” which examines the relationship between photography and color, to the Essex Museum of Art, the former home of the American Photographers Association. It will also launch a new exhibition of work by artists Tamir Rice and Eric Garner.The move comes two years after the Peabody-Essex Museum of Art, which is located in Salem, Massachusetts, canceled the exhibition “Photographs in Motion”\u0097a three-day event that was scheduled to take place at the museum in September 2015\u0097in protest of the Peabody-Essex’s decision. “We were not consulted in any way regarding this exhibition or its exhibition program,” said William H. Peabody, the museum’s director. “We disavow any responsibility, and disavow the exhibition program. It is the Peabody-Essex Museum of Art and the program that has led to this decision, and that has made the museum a beloved destination for", "The next Biennial should take place in 2021 and will be entitled “LITERATURE: A STUDY.” The artist-run platform will host over twenty-five artists including Arash Balkrishna, Bernardo Cervino, Andrea Dzarnik, Stephen Friedman, María Inés Fernández, Yuri Iriarte, and others from the Digital Millennium Copyright Act (DMCA) work.“We are thrilled to have our artists participate in this exciting year ahead,” said Nanda Kakade, the inaugural artist-in-residence. The women’s biennial will focus on the contemporary art of the Indian subcontinent.Following a recent exhibition at the Museum of Modern Art in New York, which featured work by seventy-six Indian artists, including Anna Dhanārtha, from Kerala, the biennial will also be staged at the New Museum, New Delhi, and the National Gallery in London.\n\n\nThe New Museum in New York is planning to open a new, larger location in Manhattan at the end of the year. The new building, which will sit on the second floor of the Museum of Modern Art, will include a museum-like exhibition space, an auditorium,", "The next Biennial should be held in 2020. \n\n\nThe National Galleries of Scotland has received a donation of fifty thousand reels of film from the Durslade Collection, which comprises more than 10,000 recordings dating from the 1930s to the 1970s. The donation, which comprises 5,500 negatives, was made by art historian and collector Shona Durslade, who also recently gave $3 million to the university to create the Durslade Archives.Dubbed the Durslade Archives, the archive is a new initiative run by the National Galleries Research Council (NGRC) and the University of the Arts. Founded in partnership with the Durslade Foundation, the project will hold fifty years of recordings, making it one of the largest holdings of film in the world. The goal of the project is to unlock the archive’s contents and to create a digital archive of the National Galleries of Scotland.“The archive will be a living research resource for future generations,” said Durslade. “It will provide a permanent home for the millions of film recordings that have been lost or destroyed since the institution was established in 1930. The archive is being organized in partnership with a", "The next Biennial should be held in 2021, the same year as the 50th anniversary of the birth of Joachim Neugroschel, the founder of the company Cannara and the creator of the famous formula for creating Bromoform. Cannara manufactured Bromoform as a way to protect the art of the iconic new work on paper by Franz Kline, which is housed in the museum. The Formula for Bromoform was chosen as the theme for the first exhibition of the new project, “In the Name of the Father,” curated by Alexander Schlegel, director of the Museum Schlegel. “We are very excited by the invitation to participate in this important event, especially since it is an unprecedented event in humanity’s history to have an artist of the greatest stature collaborate with a museum for the first time,” said Bernd Todenhöfer, the founder of the Berlin-based publisher Haus deutsche Garten. “Throughout the series, the artist has explored the implications of visual language, the meaning of shape and the possibilities for art as a tool of social transformation and political struggle. Our collective relationship with the artist is a reflection of the deep and ongoing connections between", "The next Biennial should be held in 2016, and the first show in 2019. It will also mark the centenary of the birth of Dada’s 11th-century French master Auguste Salzmann. The exhibition will inaugurate a series of exhibitions devoted to the artist’s life. The first show will feature selections from the “Vietnamese series” (2019) and “France series” (2020), curated by Julie Anagnos and Dijana Bhattacharya, respectively.Anagnos will be joined by her collaborator, sculptor and painter Anya Haidu, and Panini Architects, which is based in New Delhi. The exhibition will also feature a retrospective of the artist’s work, “Auguste Salzmann: The Beauty of Life,” which is slated to open in Mumbai in October 2020.\n\n\nThe National Gallery of Art (NGA) in Washington, DC, has appointed Liz Special Assistant to the Director, Sarah A. Schroth, as its next director. In an appointment by the National Association of Art Museum Directors (NAAD), Schroth says she is “committed to strategic vision and the agency of the NGA’s", "The next Biennial should be as popular and accessible as possible and will be based on the theme “Be/longing: the Eternal Quest” and will be open to the public from February 28 to March 14. For the past fifteen years, the biennial has featured work by more than 200 artists and has been organized by the London-based group Biennale Foundation within the British Museum. \n\n\nThe Tate’s board of trustees has appointed Caroline Asher-Palmer director of the Tate’s London and Southbank Centre. Previously, she was assistant director of contemporary art at the London museum and is a member of the board of trustees.“Caroline’s new role will be a new start and she will inherit a significant portfolio of works by young and established artists in the Tate,” said Anne-Marie Clark, head of Tate’s board of trustees. “The Tate has a rich and inspiring history. She will bring an exciting perspective to the roles and responsibilities of director and curator and will play a crucial role in supporting the growth and development of our collections and our exhibitions.” The appointment of Ms. Palmer follows a year in which the Tate underwent a strategic", "The next Biennial should take place in 2020.  At the time of the announcement, the museum was working on a new architectural design for its new building as part of a $300 million overhaul of the institution. The renovations included the refurbishment of the building’s main entrance and an expansion of the museum’s galleries. According to the New York Times, the exhibition will continue to include works by artists such as Robert Irwin, Ray Kyncl, and Iris Murdoch, but will debut work by lesser-known artists like Anna Atkins, Rachel Whiteread, and Robin Niles.The Biennial of African Art will also feature works by artists who have lived in Africa for a significant period of time such as Olu Iman, Olu Olejaza, and Rehana Iman, as well as works by some of the most acclaimed contemporary artists in Africa.  The core of the exhibition is comprised of more than seventy artworks by twenty-four artists who have lived in Africa for at least ten years. The artists chosen for this year’s edition include Olu Iman, Carolina O’Leary, Olu Olejaza, Olu Olu, Roumani Olu, Olu O", "The next Biennial should take place in 2020, and the third in 2021. While this will be the seventeenth edition of the Museum’s Horizons, the museum has already announced plans to open another location in the city next year.\n\n\nThe Museum of Contemporary Art (MoCA) is revamping its already-under-construction new headquarters in the Tisch Museum district of Beverly Hills, California. The institution will move its exhibition and education programming online, and will begin to open a new 400,000-square-foot museum in the former OfficeMax space next year.“We are thrilled to open a new MoCA in the former OfficeMax space next year,” said Mark Dimin, director of the Brooklyn-based firm Linder Associates. “The groundswell of interest to our program at MoCA has been overwhelming, and we were able to mobilize the relevant and passionate curators for the new museum.”Museum director John Simon Gramsci, who will depart in December 2019, added: “The new and updated galleries, exhibitions, and education center will be a test for our contemporary curators to see how we can continue to develop our exhibitions and program to present a history of art in the present in", "The next Biennial should be held in 2021.The 2018 Biennial, “Pt. II: The Story of the World,” featured work by twenty-four artists. The first exhibition, “Pt. I: Worlds in Collision” (2019), featured forty-two works by twenty-nine artists. The second, “Pt. III: The Wonder of Life,” (2019), featured forty-nine works by thirty-six artists. The third, “Pt. IV: The Life of a New World,” (2019), showcased twenty-four works by twenty-nine artists. The fourth, “Pt. V: The Creation of Life,” (2019), was curated by Richard Berry.\n\n\nThe American Ballet Theater (ABT) in New York will begin a \"full-scale restoration\" of its iconic RCA Building, the theater’s main staging space, in the city’s Chelsea neighborhood next year. The massive undertaking, which will involve the removal of more than one hundred pieces of the iconic structure\u0097which opened to the public in 1937 and remains a vital landmark in the theater’s central location on Fifty-Third", "The next Biennial should take place in 2020.<|endoftext|>© PA\n\nThe British government is planning to launch a major investigation into how the British Museum acquired the remains of a 150-year-old effigy of Queen Victoria and the rest of the royal family, the British Museum has announced. According to The Guardian, the royal family’s remains will be moved to a museum in the city of Leicester in England, and the remainder of the royal family will be moved to a museum in New York over the course of a decade.The announcement comes a little over a year after the British Museum received a $2 million donation from the Sacklers. The family was asked to donate the royal family’s remains after a long-standing collector, Richard Sack, passed away in 1993 at the age of eighty-five. The donation was made at the end of a lifetime of dedication to collecting and preserving the royal family’s remains. Sackler arrived in the United States in 1956 to head the Smithsonian’s National Museum of American Art in Washington, DC. He was appointed director of the institution in 1970 and became its first chief executive in 1979. He continued to serve as director until 1992, when he was elected chairman of the board of", "The next Biennial should be on June 12–June 16, 2020. \n\n\nThe Tate’s board of trustees has appointed Paul Maffi as the next chair of its board of governors. Maffi will be appointed by the board of directors following an election of twelve members, which was held on March 22. The announcement follows a period of reorganization that saw the Tate’s board of trustees and management team reconvene in London to review the institution’s future plans. The board agreed that Maffi “poses a good and important future for Tate while retaining the flexibility to adapt and innovate in response to changing needs and circumstances.” The board also stated that Maffi “has the right temperament and the talent for the job, and we believe he has the right vision for Tate.”Maffi comes to the museum from the Düsseldorf-based cultural company EXCEL, where he currently serves as director of development and chief marketing officer. During his tenure at the company, he oversaw the launch of its brand new development program, the Düsseldorf Experience, which brings together up-and-coming artists for a series of events and showcases;", "The next Biennial should take place in Mauritius, 2020, and the next in Mauritius, 2021. The 2022 edition, “Bionic,” will be a collaboration between the University of the West Indies and the University of Chicago. The 2022 edition will be hosted at the Barbican Centre in London, the National Gallery in London, the Metropolitan Museum of Art, and the American Museum of Natural History in New York.\n\n\nThe Museum of the Moving Image (MGOI) in San Francisco has received a $50,000 donation from the David and Lucille Stokes Foundation as part of a $100 million gift to museums in 2018. The Stokes Foundation, which supports museum conservation, museum preservation initiatives, and conservation education, grants museum activities, and educational programs, and is one of the largest supporters of the arts in America.“David and Lucille Stokes is an exceptional family and we are deeply honored to support their mission in supporting the arts through this year’s gift cycle,” MGOI president and CEO Marc Glimcher said. “The generosity of the Stokes Foundation is truly inspirational and makes MGOI’s commitment to support the arts in", "The next Biennial should be held in 2020. The theme of the biennial is “Households,” a reference to the museum’s permanent collection.\n\n\nThe Museum of Contemporary Art (MoCA) Los Angeles has partnered with the New Art Project to create a new series of free public artworks by contemporary artists in the city. The free works will be located in a public space in the museum and will include works by a number of artists, including Pablo Picasso, Ad Reinhardt, and Ed Ruscha. “We are thrilled to be working with the New Art Project to create a new series of artist-designed artworks in the museum,” said cochair Deborah Cullinan. “The series will connect with our mission at the museum to create accessible and engaging cultural experiences while enhancing the museum’s collection and offering a unique opportunity for visitors to explore the museum through an artist’s lens.”According to the Los Angeles Times, the partnership between MoCA and the New Art Project was announced in September 2019. The works will be free to the public, and MoCA will furnish the artists with an easel. The project will also include a public lecture series, a free public tour", "The next Biennial should take place in the autumn of 2020, during the winter months. The event will be comprised of eight works, which were selected by the public from a shortlist of fifteen, and will be curated by artist Rindoona.“The art that makes Biennial possible is the community,” said Rindoona. “The theme of the Biennial is community and its relationship with nature. It is a community art which aims to stimulate the imagination and to draw people together. It is an art which is created in a community space. The artists who are selected to represent their communities are open to dialogue with the public and are able to share their thoughts and feelings. This is an opportunity to build bonds and to build trust.”\n\n\nThe Museum of Contemporary Art (MoCA) in New York has received a major gift of over two hundred artworks from the private collection of the late Jocelyn Beasley. The gift includes Nancy Bentley’s New York: A Vision in Bronze (1948) and Nancy Bentley’s New York: A Vision in Bronze II (1952), both of which were on display in the museum’s exhibition “Nancy", "The next Biennial should take place at the Biennial—the first being held in Seoul, in 2004. The next iteration of the Edinburgh Biennial will be held at the Edinburgh Art Gallery in 2021. The seventeenth edition of the Art in Asia Pacific (AIP) will be held in Tokyo and will take place in 2020. The twentieth edition of the Art in Asia Pacific (AIP) will be held at the Art Museum of Nagoya in 2021. The twenty-fifth edition of the Art in Asia Pacific (AIP) will be held in Hong Kong in 2021. The twenty-seventh edition of the Art in Asia Pacific (AIP), which will be staged at the Museum of Contemporary Art in Hong Kong, will be held in Kuala Lumpur, Malaysia, in 2021.  The twenty-eighth edition of the Art in Asia Pacific (AIP) will be held in Singapore in 2021. Launched by the Singapore Art Gallery, the inaugural edition of the Art in Asia Pacific (AIP) will take place in the Marina Bay Sands Expo Centre in Singapore from November 23 to January 2, 2021. The twenty-ninth edition of the Art in Asia Pacific (AIP) will be held at the", "The next Biennial should be held in 2022.\n\n\nThe Philip Johnson Foundation and the New York City Department of Cultural Affairs appointed both Robert Giard and Anna Wintour as honorary trustees of the sixth edition of the Biennale di Biennale. The announcement came on the heels of a statement celebrating the biennial’s twenty-fifth anniversary, which was held last week in Florence.The event, titled “Theatre of Desire,” featured twelve artists, including Michael Glatze, Kayode Mohenjo-di, Pia Camil, Ana Mendieta, and Manfred Oehlen, as well as twenty-six sculptures, including Cosmo, Alighiero Cattelan, and the recently restored Georgian town of Chorlovka. The event was also organized in collaboration with the Stedelijk Museum in Amsterdam, the Stedelijk Cultural Center in London, and the Botanical Gardens of the Houses of Parliament.The theme for the upcoming edition of the festival was “The Future Is Not What You Have Made It.” The exhibition was curated by team members Marcos Groppani, Francesco Ravasi, and Stefano Battista, and was organized through the Giard Foundation", "The next Biennial should take place in the spring of 2020.<|endoftext|>A female police officer has been suspended from the force after she was filmed using her knee to subdue a man who had attempted to push her away from the scene of a fatal shooting. The incident took place on November 23, 2016, at a police station in Bristol, England, when a black man named James Hicks, 21, was convicted of murder after being found guilty of ten counts of attempted murder following a six-week trial.The incident began as Hicks was being processed for a traffic offence. The officer, who has not yet been named, approached the car in an attempt to subdue the man—who was held down by the man for twenty minutes by the police before he was arrested and taken to a nearby police station for questioning. When the officer arrived at the scene, Hicks was already inside, having jumped out of his car in an attempt to hide himself. Being pushed back into his car, the man was able to get out, but not before he was hit with forty-nine rounds from a high-powered rifle.Hicks was found not guilty by a jury of seven men and six women on Monday, and the verdict was returned on Tuesday, when the judge declared that the", "The next Biennial should focus on how to make the Golden Circle a reality for future generations. The building of the Golden Circle will be an integral part of our strategy for sustainability, with a view to putting the Golden Circle at the heart of the city’s future.”\n\n\nThe American Alliance of Museums (AAM) announced today that it has voted to suspend the Missouri–Southwestern Art Museum’s (MoSB) annual fundraising gala until it implements changes to protect vulnerable spaces at the institution. The decision follows the March 22 poisoning of a live rooster at the institution, which has been closed since the incident. The museum has since been forced to cancel the next two events, which were set to take place on March 23 and March 26.“The events of the last few days have put the MoSB in an incredibly difficult situation, with the board of trustees calling for immediate and immediate action, and the staff and I deeply regret it,” said Tom Harmon, chair of the board of trustees. “We have been monitoring the events with the community, with our board of trustees, and we believe that we need to take immediate action.”While the museum initially responded by stating that it was �", "The next Biennial should be announced by the end of the year and should feature twenty-one artists and thirty-seven films from the programme.·\n\n\nDerek Jarman has announced the winners of his two-year residency at the Museum of Modern Art (MoMA) in New York. The inaugural recipients are Zac Moffatt, who will receive a $750,000 prize; and Damien Chazelle. The retrospective will open on September 23 and will run until November 23.Since graduation, Jarman, who was selected for his work “Photography Is Art” by a jury comprising Aaron Kessel, John Brunner, Byron Lippard, and Nancy Segal, has combined his own photography with that of artists such as Robert Irwin, Peter Hujar, and Guy Fieri. Among his many honors are a Lifetime Achievement award from the Royal Academy of Arts, an Order of the British Empire (OBE), and a Royal Institute of Arts (RI) medal.“I want to thank all of the artists who have made the Biennials possible,” Jarman said. “They have given me a tool to explore the worlds of photography and film, and to see a tangible connection between the two.�", "The next Biennial should take place in the town of Umerkot, in the Chinese province of Xinjiang, in February 2020. In an interview with the Art Newspaper, a Chinese newspaper owned by the National People’s Congress, Zhang Xiaolei, a retired deputy director of the China Museum, explained that the decision to exclude the region was not based on the belief that the art would be suitable for exhibition purposes, but rather that it would be too 'tender, aloof, and remote, with an insecure, self-centered and self-absorbed quality.” While the ICA is not expected to host the first exhibition like this, Zhang Xiaolei said that the future exhibition will focus on building on the ashes of the Tiananmen Square disaster, which took place in 1989. \n\n\nThe National Galleries of Scotland (NGA) announced today that the institution will unveil a new set of curatorial guidelines for the sale of works by artists such as Louise Bourgeois and Pierre-Auguste Renoir in a ceremony that will take place at the NGA’s new headquarters in Edinburgh on Wednesday, January 18.According to the Edinburgh Herald, the announcements mark the first steps in a new initiative begun by", "The next Biennial should be held in the spring of 2020, and the last in the spring of 2021. The new format will bring new themes and subjects to the festival each year, and will include a number of performance initiatives that will be organized across various cities over the course of the year. In addition, it will feature a series of exhibitions dedicated to the work of Theosophy and Anthroposophy and will include a series of talks.“We are thrilled to introduce a new service that will bring new meaning and opportunities to the Biennial,” said Palme d’Or Laureate Jean-Jacques Derrida, who is leading the redesign and planning of the 2019 edition. “We want to intensify our interdisciplinary approach to presenting the art of the present, and to cultivate a new way of looking at the future. The combination of these two elements is precisely what the Biennial is about, and we are very much looking forward to the exhibition of this year’s edition. It will provide an incredible platform for our artists, for the public, and for the Biennial to present their work in an unusually rich and vivid way.”The event, which will be organized in collaboration with the museums and archives of the", "The next Biennial should also introduce new exhibitions that deepen the themes of the exhibition, collaborate with other organizations, and address long-standing questions such as the role of art in the development of democracy and human rights, and the themes of the exhibition should reflect the global landscape of contemporary art. The biennial will be inaugurated by an exhibition of work by artist Alighiero Graziani, and will highlight the work of contemporary artists in the country. The biennial is also working on an updated version of the exhibition “That Is Not a Painting: Art in the Twenty-first Century.” The exhibition will launch in 2020 and will run two exhibitions: a retrospective of the artist’s work in the United States at the Museum of Modern Art and a selection of works by the artist in the Biennale di Tere.The Biennial of Indian Art, which will also open at the Smithsonian in Washington, DC, is working to move the show to a new location in Southern California. The move means the event will no longer be held at the museum but will return to the Pacific Palisades. The move was first announced by curator and cofounder Annie Paretsky, who was invited to consider the possibility of moving the exhibition", "The next Biennial should be held in 2020. It will be a major milestone for the museum as it pursues the twenty-fifth iteration of the event. The exhibition will now be divided into three parts, with the first part, “The Digital Lower Class,” due to open on January 17, 2021. The second part, “The Vogue Viewing Room,” will be held from March 21 to March 28, 2021. And the third part, “Welcome to the Biennial,” will be held from March 22 to March 26, 2022.The museum has also announced that the exhibition “The Future Is Present,” will close in 2020, following its next iteration, “The Evolution of the Biennial.” The exhibit will be replaced by a new work, “The Present.” The full list of participating artists is as follows:Yoshitomo Tsurumi (Japan)Yoshitomo Koike (Japan)Emma Lambert (Germany)Imran Ahmad (Australia)Sigrid Armitage (Australia)Kimberly LeCompte (Germany)Kate Mitchell (Australia)Brian Friel (Canada)Maurizio Ferrucci (", "The next Biennial should take place in the spring of 2021. The five-day event will focus on the city’s historical landmarks, with a view to presenting the last works by the late artist and theorist Huyghe Cardoso. The exhibition will also include a series of performances, performances, and films that highlight the work of the artist in various forms.Artforum will soon be hosted by the Los Angeles County Museum of Art. The institution is currently undergoing a $750 million renovation and expansion. The overhaul began in April, with the construction of a new building and a series of new galleries. The project also introduced new exhibitions, courses, and programs, including “Art in the Studio: Making the Modern Studio” (2019–20), “The Making of a Modern Studio” (2018–19), and “The Art of the Modern Studio” (2018).The museum opened to the public in 1971. Its current exhibition, “The Modernist Experience: ‘Early Art’” (2018), is currently on view until March 22. The museum has two current exhibitions on its curatorial team: “Dissolving the World: Painting and the Modern World” (2018) through “", "The next Biennial should take place in 2022.\n\n\nThe B.G. Reid Foundation and the Garden Museum in New York City announced today that Carole Thayer has been named its inaugural recipient of the $25,000 Victoria & Albert Award. The $10,000 prize is one of the most prestigious awards in the award cycle.In recognition of her work as an educator and curator, Thayer was selected for her curatorial practice and *Radical Feminist Art,” a project series that began in 2004 that explores the intersection of feminist, queer, and trans-identity theory and practice in the United States. The project was inspired by the Feminist Art Project, a large-scale feminist exhibition that opened in New York in 1992.“We are so proud of Carole Thayer, who has been instrumental in the development of our program, and who has provided leadership in our way of doing things for decades,” said Elizabeth Reid, curator of the inaugural award, which was established in 2017 to recognize excellence and inclusivity in the field of contemporary art. “In recognition of her work as an educator, she has become an important scholar and a force for progressive scholarship in the field and in the United States, as a"]