["The next Biennial should be staged in 2019.\n\n\nThe Smithsonian’s National Museum of African Art (NMFA) in Washington, DC, has launched a new initiative designed to engage in public dialogue about the contributions of African American artists to American art history and culture. The initiative, “African-American Art and the American Experience,” will host twelve exhibitions that examine the legacy of African American artists in the United States and examine how their work informs the narratives of contemporary art.The first exhibition will be “African Americans and the American Experience: From Early Modern Times to Black Power” (October 8–October 13, 2020). Titled “African American Art and the American Experience” (after a creative writing program that will focus on themes of race, politics, and social justice), the exhibition will examine the role Black artists play in advancing the political and social movements for racial justice in America and will highlight the contributions of African Americans to American art through the decades.“We felt it was important to engage with the work of African Americans in the United States,” said David M. Guggenheim, director of the museum. “Through the museum’s five-decade collection, we have been", "The next Biennial should take place in 2020. \n\n\nThe James D. Livermore Foundation in California announced today that twenty-five artists have been selected for its 100th anniversary tribute. The 2020 recipients are Shirley Henderson, Richard Avedon, William Eggleston, and Ambrose Bierce.The full list of recipients is as follows:Scottish artist and educator Alistair MacgregorAlistair Macgregor (1946–1963)After graduating from the Royal College of Art, Edinburgh, Macgregor began his career as an animator. He eventually became a contributing editor to Punch magazine and became involved in the Black Cross Theatre Company in London. Macgregor later moved to New York to teach at the University of the Arts, where he met his wife, the novelist Deborah. The couple became the first parents to live together in the United States, but their union was not to last. The couple divorced in 1963 and two years later, the New York Times reported that they were expecting their first child. In addition to his teaching, Macgregor owned his own art gallery in 1967. He continued to work with his son Jack in the 1970s, and the duo built a medium-sized home in Cambridge, Massachusetts, in", "The next Biennial should be held in 2022. It is currently scheduled to run from November 27 to December 14, 2022.\n\n\nHistoric Landing Crafts\n\nSierra Nevada Art Museum’s premier international platform for contemporary art, Sierra Nevada Landing Crafts, has announced its intention to merge with the Los Angeles County Museum of Art (LACMA). The announcement follows months of negotiations between the institution and the California government and comes on the heels of the state’s plan to raise more than $2 billion for LACMA over the next decade.“Our current relationship is not sustainable for the future of Sierra Nevada Landing Crafts, nor is it in the best interests of our guests, partners, staff, or our creditors,” said Mark Selby, director of the LACMA Museum of Art. “Our board of directors and I have been working hard to secure a solution that will provide our guests with an open, accessible, and collaborative environment while advancing our value proposition as a contemporary art museum. We are hopeful that this new entity will serve as a model for other institutions to consider.”Under the terms of a twenty-five-year lease agreement, the institution will move its historic building and retail", "The next Biennial should be held in 2020, the deadline for the Conservancy to secure a new venue.  The BBC will stage a special exhibition of work by the Bangladeshi artists Kianmila Khoso and Tarker Uddin in the United Kingdom in February 2021. \n\n\nThe South African Museum of Fine Arts (SAMSA) in Pretoria has announced that it will move the final work by the late artist and activist Januari Pindar to a museum in Pretoria. The exhibition, The Last Dance, will be on view in the institution’s new building in the Port of Pretoria from November 20 to December 14, 2020. “The institution believes that moving The Last Dance to the museum is in the national interest, for the museum, and the local community, and we look forward to presenting it in the new building in the city of Pretoria,” director of the MCH Group, Nathalie Pretorius, said in a statement.Pindar was one of the leading activists of social justice and the African diaspora in South Africa. She is survived by her husband, Zeba, and their son, Rupal; her daughter, Jade; her", "The next Biennial should be held in the autumn of 2020, with a new exhibition dedicated to the Global South. The theme of this year’s edition is “Art and History: Lévy-619 and the French Revolution.” The 2017 edition, “France after Lévy-619,” was held in the capital of the French Republic. The exhibition featured works by nineteen artists from eleven countries. \n\nThe Museum of Contemporary Art (MoCA), San Francisco has named Tanya Gorchov as its next executive director. Gorchov currently serves as the curatorial director of the Los Angeles County Museum of Art (LACMA), but her responsibilities include leading the museum through its first phase: the construction of a new building, the California Pavilion, and the modernization of its existing building.In her new role, Gorchov will be tasked with helping to shape and coordinate the museum’s two-year cycle of exhibitions and events, called “California Stories,” which was launched last October and has run until March 23. “I’m excited by the challenges ahead,” Gorchov said in a statement. “I’m committed to a", "The next Biennial should be on September 22. The 2020 edition will cover the theme 'The Limits of Artists’ Spaces” and will feature works by thirty-five artists. The event will be hosted at the Walnut Creek Museum of Art in California, the Art Institute of Chicago, and the Smithsonian American Art Museum in Washington, DC. Mike Kelley, MFA and former director of the Museum of Contemporary Art San Francisco, is the associate director of the Biennial. The ten-person committee, chaired by Elizabeth Annisa, chair of the board of trustees, assembled by the museum curators Cara Wagner and Maximilian Boeschke, will choose the sixty-three-piece selection for the theme. The full list of recipients is as follows:Angel Aguilar, MilwaukeeB. Anthony Benitez, New YorkB. Benitez, CaliforniaTawny Banes, TulsaJackie Bannister, Brooklyn, New YorkT.Bannister, New YorkT.Bane, Brooklyn, New YorkT.Bayer, Brooklyn, New YorkT.Bayer & Bannister, New YorkT.Bayer & Bannister, New YorkT.Bannister", "The next Biennial should be held in 2021. “More than anything, the Biennial is about freedom of expression,” said Artnet UK director Mark Buxton. “The exhibition will be a crucial platform for discussing diversity, international collaboration, and the future of art. And because it will be staged in London, it will be immediately accessible to the widest audience possible.”\n\n\nThe National Poetry Library (NPRL) in Nashville has received a gift of more than two hundred rare books from the collections of the Tracey and Richard Grace Foundation. The gifts, which were donated by the late philanthropists after the organization purchased thirty-six rare works from the collections of the Grace Foundation in 2011, are among the works that will be given the new lease of life. The gift includes works by Andy Warhol, Alain Badiou, Jean-Michel Basquiat, David Saenger, Marilynne Vollmer, and others that will be included in the inaugural exhibition, “Away from the World” at the Nashville Museum of Art (NMA).The works, which were donated by the Grace Foundation, the Tracey and Richard Grace Foundation, and the Walt Disney Corporation, were acquired through a partnership that also", "The next Biennial should take place in the summer of 2022, at the same location as the current exhibition, and will be organized as a cooperative project between the two institutions. According to the organizers, the event will be an exercise in solidarity, sharing the knowledge and the experiences of three generations of artists, and will have a theme that is relevant to the current current complexity of life in the boroughs. The exhibition will comprise three floors of the same building, which is currently being transformed into an artist-run space, as well as a new twelve-story structure that will straddle Fifth Avenue in the heart of Manhattan, which will be named after two of the three legendary figures of the city, Alexander and Henri Matisse.In a letter sent to the artist-run space, Galileo and Galileo are asking for your support in the upcoming partnership between the institution and the Brooklyn-based nonprofit organization. According to the letter, the partnership will involve taking direct action to change the architectural and conceptual landscape of the new museum,” and will consist of a series of public meetings, tours, and lectures, in addition to a series of exhibitions that will showcase the work of the two institutions’ collections, which will be located on", "The next Biennial should be held in 2022.\n\n\nThe Museum of Fine Arts (MFA) in Boston has announced that it is awarding nearly $1 million in grants to nineteen artists in its annual exhibition “In Between.” The exhibition is dedicated to the work of artists such as Gerald Reitman, Paul Gauguin, Claude Monet, and Elise Bidwell, and is open October 7–10.In Between is a public art installation, created by the MFA’s AI-based program, “In Between Events,” that explores the relationship between art and technology. Based at the MFA in conjunction with a $10,000 grant from the William Jewell Foundation, the show will document the trajectories of three artists as they work together through various digital technologies, including film, television, and the internet. “The MFA’s AI is a vibrant and dynamic staging ground for the diverse approaches, visions, and experiences of these artists,” said curator, Daniel H. Weiss. “Artists who enjoy the MFA’s unique environment and program are invited to join the program and deepen their own understanding of how art can affect our lives and our world through the Art AI.", "The next Biennial should take place at the Biennial Campus in Berlin. The next exhibition should be in the summer of 2021. On March 27, 2019 the Biennial Campus, which comprises two venues and is located on the city center of Berlin, celebrated its one hundredth year with a ceremony organized by the city and attended by the Berlin-Brandenburg Assembly, the city council, the city council president and representatives from the city’s cultural and artistic organizations. The biennial’s inaugural exhibition, “The Unseen World,” was organized in collaboration with the German artist and essayist Hal Foster, whose work is currently on display in the exhibition “The Unseen World,” at Berlin’s FIS:“In the midst of the chaos of war and liberation, a new kind of landscape opens up for human exploration, new possibilities for creativity, and new ways of being.”\n\nArt Basel Hong Kong has announced that it is launching a new crowdfunding initiative, Artbond, that aims to help small and midsize galleries and arts organizations in China. The new platform will initially focus on financing R&D and will offer free trials to foreign artists and small to mid-size galleries and", "The next Biennial should be held at the venue within the next three years. The five-day event will include more than sixty exhibitions and will be held at a state-of-the-art building designed by the Japanese architect Akira Terasaki.The architects behind the installation, which will be on view from December 18 to December 21, 2020, are Atsushi Inada, Hiroshi Hasegawa, and Yuko Takahashi.  The upcoming exhibition will be organized in accordance with the artist’s wishes. “I feel a certain responsibility to meet the needs of the museum, and this is why I am creating a Biennial that will be open to the public and will be a platform for the exchange of artwork,” said Ai. “The project was born out of my desire to preserve the role of the artist in contemporary life. I hope that the exhibition will open the eyes of new generations of artists and stimulate their interest in the museum.”\n\n\nThe William Stein Foundation announced that it will give $1 million to help the visual arts and cultural nonprofit organizations that have lost income in the aftermath of the Covid-19 pandemic. The arts and cultural nonprofit organizations—including the Visual AIDS Coalition", "The next Biennial should be held in 2020. While the theme for the event will remain the same, the location will be moved to the Tangerang Museum.The best way to explore the exhibition, the exhibition and the exhibition will be moved to the new museum. The building of the triennial is also being carried out in partnership with the architect Johannes Stamm. The laboratory will be built alongside the building and will house the exhibition, the exhibition, and the live performance biennial. The museum has also partnered up with the Institute of Contemporary Art (ICA) in Berlin to bring “The Downtown Biennial” to the city, and the museum will present the exhibition in a new building, the Massif Central, on the campus of the Max-Planck-Institut für die undischen Kunststelle in Cologne. The venue will host the inaugural exhibition of the new institute, hosted by the artist Elke Saar.The Biennial will be inaugurated by the artist Johannes Kepler’s monumental exhibition “Surrealism” at the Museum der Moderne Kunst, Hamburg, on October 5, 2020. This will be followed by “Adeline and the Prussian", "The next Biennial should be held in the autumn of 2020, and a new edition of the exhibition should be presented in the spring of 2021. As the introduction of the new system is a major step towards allowing the exhibition of works of art that were not previously assessed in the biennial, we will continue to work with the International Committee of Museums (ICOM) to develop an open, inclusive and transparent platform for the exhibition of the works of art that were previously underequipped. We hope that this new approach will become the basis for a more effective and timely exhibition and the opportunity for further exchanges between the artist and the Biennials.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a $10 million gift from a group of donors led by the Italian collector and collector-diarist Piero Manzoni. The gift includes a collection of works by W. M. Keats, T. H. White, and others, including two works by Pierre-Auguste Renoir, which were on display in “La Parisi” (2015) and “La Marseillaise” (2019), respectively.The gift also includes ten works by Marc Chagall, including “Das Kapital", "The next Biennial should take place in the month of May in 2020. The fifth edition of the exhibition will also mark the opening of a new exhibition, “Biennial in Rome,” with works by twenty-four artists from fourteen cities and regions in the Italian capital.  Italian culture minister Enrico Letta, who was elected last month, said: “I am extremely pleased that we are able to collaborate with the city of Rome, with the artists from the region, who are already celebrating their thirtieth anniversary, and with the city’s residents. This is a major step forward towards making the city more accessible to visitors from all over the world.”\n\n\nThe Art Newspaper has revealed that the museum’s senior director of exhibitions, Paul Mpagi Sepuya, will resign from the helm of the museum on March 31 after twenty-six years in the role. Sepuya said: “I want to thank my colleagues and the board for their outstanding work over the past twenty-six years, and also to express my sincere appreciation for their dedicated work in building the ASM biennial, and for their outstanding partnership and support over the years\u0097especially during the global", "The next Biennial should focus on individuals and their stories, with particular attention paid to the histories of marginalized groups and individuals, and should take place in a way that is respectful of the history of the exhibition and community, and of the exhibition and community itself. Artforum also has a history of championing artists whose work occupies a space in a city or region that is not represented on the Biennial’s permanent collection. For the inaugural exhibition in 2006, Nari Ward curated a show by Kwame Kwei that presented work by the Hong Kong-based artist Bobby Lee. The 2020 exhibition will be organized by the Hong Kong–based Hong Kong artist and curator Sora-Otomo in partnership with the Hong Kong Museum of Art (HOK), and will feature work by seventy-five artists. The selection panel\u0097whose members include Joachim Neugroschel, Felicity Hammond, Heidi Hsu, Yasuko Hoshino, and Antonia Krausser\u0097will be chaired by Hans de Kooning, chair of the HOK.\n\n\nThe Metropolitan Museum of Art in New York has received a gift of seventy-five works by eighty-eight artists. The museum opened its newest location, the outpost of the Met", "The next Biennial should take place at the Museum of Modern Art in Saint Petersburg from July 11 to July 13. Inaugurating the venue will be a new exhibition, “Art and the Role of the Family,” inspired by a conversation with the late curator and activist Viktor Strelka, at the museum earlier this month. The show, which will feature work by thirty-five artists, will reach its endpoint on September 11, the date of the Russian military intervention in Ukraine. The inaugural exhibition “The Art of the Family” will be followed by “The Family and Family Life,” which will also feature work by thirty-six artists, including Joachim Neugroschel, Valery Zvyazh, and Jana Pape; and “The Family, Politics, and the Family,” which will present the first exhibition devoted to the subject in the United States. The first exhibition of the new project will open at the Museum of Contemporary Art in San Francisco on June 5.The inaugural exhibition was created by the Shusaku Nara Institute for Contemporary Art. The Shusaku Nara Center for Contemporary Art, which was established by the University of Tokyo and the Museum of", "The next Biennial should include a major re-engagement of artists and institutions. The exhibition must also be a celebration of the past, while recognizing the present and future. In this way, the exhibition will be re-imagined as a platform for artistic collaboration and reflection. The theme of the third installment will be art from the African diaspora.\n\n\nThe Shenzhen Biennial, which kicked off last weekend and ran through the end of March, has announced that it will present, in three consecutive years, thirteen new works by artists from the People's Republic of China (PRC). Two of the works will be works on paper and one will be a multimedia experience, inspired by the fictional novel The Three Kingdoms Story, a play by Chinese authors Zhu Yilun and Li Duyue.The biennial’s opening theme was The Five Elements of Nature. “I was particularly moved by the incredible energy and beauty in this work,” said artist Zhang Wei, who was selected for the honor of presenting the work. Zhang will take the stage at the inaugural Shenzhen Biennial on March 12. The next show will take place in November 2020.“We are so honored to be participating in the Shenzhen Biennial,", "The next Biennial should be held in the spring of 2021, and the first in the autumn of 2022. The biennial will be composed of a number of exhibition-based initiatives, including the first exhibition of work by a single artist in the history of the art.  The project team\u0097who will present the exhibition in conjunction with a retrospective of the work of a single artist held this May at the Art Institute of Chicago\u0097will include Terry Christo, curator of contemporary art at the university, and Kunsthaus Berlin; Lars von Trier, director of the Düsseldorf Festival Institute in Germany; and Oskar Eustis, the director of the Museum Freie Kunstverein Frankfurt.“Frankfurt is a great city,” said project director Wolfgang Pfeifer. “As we approach the seventy-fifth anniversary of the Art Basel World, we are introducing a new exhibition series that will be deeply rooted in contemporary art, featuring work by a select group of contemporary artists. The vision for the 2020 edition is to extend the brand of the forum into a new dimension: to establish an exhibition program that reflects the diverse and thriving contemporary art scene in Europe.”\n\n\nThe Sevent", "The next Biennial should be held at the Institute of Contemporary Art in New York; and the design of the exhibition should be decided by the American Institute of Art.  The first show in the series will be a concert exhibition of work by the three winners of the inaugural Art in America Award\u0097Elaine Hesse, Salman Farooqui, and Svetlana Gavrilova\u0097on October 19. The second show will be a “show of work by the four original winners\u0097Abraham Lincoln, Thomas Edison, and Nikola Tesla\u0097on November 7. The third show will be a “show of work by the four winners of the inaugural Art in America Prize\u0097Wangechi Mutu, Nkrumah, and Rirkrit Tiravanija\u0097on September 29. The fourth show will be a “show of work by the four original winners of the Art in America Award\u0097Frank Gehry, Robert Irwin, and Frank Sinatra\u0097on September 22.” \n\n\nThe Berlin-based museum that houses the museum’s collection of more than two thousand works by artists including Edvard Munch, Carsten Brzeski, and Wolfgang Paal", "The next Biennial should take place in 2019.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MCA), has issued a status update on its renovation plans, which were announced last year and have been ongoing since 2012. The institution plans to open the redesigned building in 2021 and will present five hundred works. According to the Los Angeles Times, the redevelopment will include the opening of the institution’s first new exhibition in fifty years, “Gina’s Gallery,” a collaboration between artist and former MCA colleague, Andrea Horloger. The show will focus on the legacy of the Italian American artist and, according to Horloger’s cofounder Noah Horowitz, “will not only be an academic exchange program but a source of sustained artistic activity for students and locals.”As part of the new $5.6 billion redevelopment plan, the MCA’s existing building, which is currently undergoing a $900 million expansion, will be torn down and replaced by an eight-story building designed by the same firm, Gensler, with a new glass-enclosed lobby and gallery. The renovation of the building was originally scheduled to begin this spring, but was pushed to the summer as", "The next Biennial should be held in 2020, but the dates have yet to be determined. The biennial will also present a Reflection Project, an exhibition of works by artists such as Yinka Shonibare, Jasmine Goldsmith, and Mary Beard, which will be curated by Amanda Block and will be presented at the Frieze Architecture Biennial in London in February 2021.\n\n\nThe Museum of Contemporary Art (MoCA), California, has released a new set of guidelines outlining how museums should respond to protests over the Trump administration’s immigration policies. The document, which were written by the Museum’s legislative affairs committee and was released on May 27, outlines four key points: 1) Museums should not discriminate based on the immigration status of visitors; 2) Museums should honor immigration visitors with immigration-themed activities such as bilingual education programs, educational programming, and exhibitions; 3) Museums should work with local, state, and federal governments to address immigration and refugee concerns; and 4) Museums should not receive funding from the federal government.The museum’s board of directors voted unanimously in favor of the guidelines. Nari Ward Anderson, the chair of the committee, told", "The next Biennial should take place in the year 2022, the International Council of Museums (ICOM) has announced. The sixth iteration of the new exhibition will take place at the Barbican Centre in London, the Royal Shakespeare Company in London, the Tate Britain in Stratford, and the Royal Opera House in London.“The theme of this year’s ICON is the future and the challenges we face as a society,” said ICON director Alex Dryden. “With this year’s event, we are inviting the general public to take on the role of a curator, to experience the rich and diverse cultures of the twenty-first century at large.”The theme of the twentieth ICON is ‘Museums as incubators.’ We are creating an environment where the artist’s work, and the arts in general, can thrive and thrive in the most holistic way.” The twenty-fifth iteration of the project will take place at the Oxford Union in the United Kingdom, and the twenty-ninth will take place at the Royal Opera House in London.The ICON in 2017 awarded a total of $25 million in funding to twenty-seven arts organizations, including the African American Museum", "The next Biennial should be held within a few years, and perhaps within a decade, and will be facilitated by the City of London, and will be curated by three of the world’s leading contemporary artists: Göran Viswanathan, Agnieszka Zagora, and Myriam Haddadi. “The sculptural role of the city will be revisited, and new directions introduced, under the leadership of the City’s artists, and in new media, which are inspired by the city, by the people of London, and dedicated to the city of London,” said Stuart Wheeler, the chair of the Royal Institute of British Architects’ board of directors.The Royal Academy of Arts (RA), which is planning to move to a new home in a former munitions factory, in Kettering, in the coming months, also welcomed two new members: Kathy Olszewski (Norway) and Stephen Starling (United Kingdom). Both stars were selected for their “extraordinary work in film and video” by a jury comprising David Breslin, director of the National Galleries of Scotland (UK); Nigel Atherton, director of the Tate Britain; and Tom Stoppard, director of", "The next Biennial should take place in 2021; the next two years, 2020 and 2021; and the museum will be open in its original location in the autumn of 2021. During the 2019–20 season, the museum hosted a number of exhibitions that reflected on various themes, including the museum’s collection, its collection composition, and how it interacts with the environment through the collection of artworks and artifacts from the Ramon and Susan T. King Center for Arts.In an interview with the New York Times, Mark Mylodro, the president and CEO of the museum, said: “For a long time we have been focused on presenting the best modern art from around the world. We are committed to continually refining our program to support the museum’s mission of engaging with the world in an ambitious and accessible way. The museum’s new exhibition and public programming initiatives will allow us to better serve our audiences and continue to grow the collection and exhibition experience of our collection. We hope that these exhibitions and programs will provide a step in that direction.”The new partnership between the museum and the Taconic family comes on the heels of a $60 million gift made in 2017, the year the museum reopened, to the Fitch", "The next Biennial should be held in 2020.The organization will also continue to support artists by making further investments in its Visual Arts and Cultural Business Division, which has more than $5 billion in assets, including the Diocesan Arts and Humanities, and by expanding the cultural imprint of the Metropolitan Museum of Art in New York.“The full scope of the exhibition program at the Biennial is constantly changing, and the breadth and depth of its discursive potential is truly extraordinary,” said Christopher Knight, director of the Metropolitan Museum of Art. \n\n\nAustria Art Museum curator Andrea Leão da Silva, who was named the new curator of contemporary art in the Portuguese city of Foz do Povo last month, has been commissioned to create a new work for the museum. The announcement marks the first time the contemporary art museum has commissioned a Brazilian artist since it opened in 1993.Leão da Silva will create “O Povo,” a new work for the museum set in Foz do Povo, which is located on the Atlantic Coast in central Portugal, in the spring of 2020. According to the Art Newspaper, the museum is currently working on a new landscape for the museum and is investigating the future of the Botafogo", "The next Biennial should be held in 2021. The new exhibition will focus on the history of art in the Pacific Rim and will present an exhibition of work by fifteen artists from the region. The main goal of the biennial is to raise awareness of the plight of the Piru and Palu peoples of the Philippines, and to promote contemporary art.The Philippine government announced that it intends to hold the 2019 biennial at the Makati Museum of Art, and that the next iteration of the exhibition will be held at the Institute of Contemporary Art (ICA) in Manila. The museum director, Carlos Díaz, said the exhibition will aim to present “an ideal combination of contemporary art and history.” He added that the exhibition will be “broadly: in order to engage all audiences; and it will be staged in a way that is stimulating and uplifting.”  The institute’s current exhibition, “Redefining Modernity” (2019), is a follow-up to Artforum’s “In Defense of Freedom: Art since 1989,” a 2004 series addressing the American anti-terror bill the PATRIOT Act. The exhibition opened at the National Museum of the Philippines in Bandung on", "The next Biennial should bring together artists from the San Francisco Bay Area and the Bay Area of the Bay Area, California, and New York, New York, to create an exhibition that reflects the diverse histories and identities of the Bay Area. The theme will be “San Francisco: a city of stories.” The biennial will run from March 12 to March 14, 2020. \n\n\nThe Metropolitan Museum of Art (MoMA) in New York has created six new curatorial positions to increase the museum’s work by artists in the creative field. The appointment of Helen Cammock, who will be responsible for the development of the museum’s sculpture program, and Nicholas Boczkowski, who will be responsible for the collection and exhibitions of the William and Grace Museum, and will be made possible through a $10 million grant from the museum’s alumni foundation, the Emily Post School of Art at Columbia University, and the Rockefeller Brothers Fund, respectively.“We are thrilled to expand our curatorial practice to include artists and are grateful to the Emily Post School and the Rockefeller Brothers Fund for their generous support in bringing this exhibition to fruition,” said Helen Cammock, the curator of art history and director of the", "The next Biennial should open in 2021, with the exhibition “Carbon: the new reality” scheduled for 2021. According to the New York Times, the organizers of the upcoming edition are pushing for a “meaningful reduction in carbon emissions” as a condition of returning the 2018 prize to the biennial’s biennial masters, Caroline and Alexander. “There was a time when I thought the biennial masters were the custodians of the exhibition, but it has changed my mind,” said Richard Ackerman, the executive director of the Art Dealers Alliance. The art world has reacted negatively to the development. In a statement, the Art Dealer’s Alliance called it a “disaster.” While the exhibition staged by the biennial masters is not intended as a “final judgment on the art sold,” it is the “accident that Trans-Connections was involved in, and that we are now attempting to rectify, is a disaster.”In response to Ackerman and the other participants, the museum said that the “procedures of the exhibition were not intended to be ‘final.’” “The exhibition was never meant to be closed", "The next Biennial should be in 2021, with the exhibition being staged in three cities: Barcelona, Venice, and New York. The twenty-eighth edition of the European Biennial will be held at the Latour-Le-Bouvier in Paris in 2022.\n\n\nThe Tate’s board of trustees has voted to take the controversial art museum on a mission to become a “better place for artists, galleries, curators, writers and thinkers.” The move comes amid an ongoing debate over whether the arts should be viewed as a core public service or viewed as optional extras in the public interest.“Tutu’s mission is to encourage and support the creation of new work and to foster encyclopedic collections of Art. We believe that artists, writers, thinkers, curators, and art workers can play an important role in shaping the future for the arts,” board chairman Hamish Anderson said in a statement. “Not just for Tate, but for the wider world. We must not forget that art is a vital part of life and essential for sustaining culture and not just for art museums.”The trustees voted unanimously in favor of the statement of intent by the Tate’s former", "The next Biennial should take place in 2020. If the event is canceled due to the ongoing Covid-19 crisis, it will be replaced by a third major exhibition, “Avant-garde”\u0097ancient Egyptian sculptures that will span four walls and be presented by a team that includes members from the Dessau Art Museum, the Düsseldorf Archaeological Museum, and the University of Düsseldorf. \n\n\nThe presidential museum of Tunis’s power plant has banned Islamist extremists from its premises for a second time as the country continues to deal with the coronavirus epidemic. The museum is currently closed, and the government has declared a state of emergency. The decree comes a week after a bomb killed twelve people at the Tunis Museum of Modern Art (TMA), and more than a week since the country’s interior minister, Marwan Ifiri, announced the construction of a new penal complex for extremists. In an attempt to curb the spread of the virus, the government has banned travel to and from the country, and most residents have been forced to travel by public transportation.The Tunisian health minister, Souad El Nesir, announced the construction of", "The next Biennial should be held in 2021 and the first in 2048. In a statement, the Whitney Museum of American Art said that the biennial will focus on exploring how \"the life and work of a black female artist, a scholar, a teacher, and a community member has a significant impact on her or his legacy. . . . The next iteration of the biennial will take place at the Whitney Museum of American Art.\"As the 2018 cycle drew to a close, the US government issued a dire warning about the spread of Covid-19. On March 23, the day the biennial was set to kick off, President Donald Trump signed a $8.8 billion spending bill to continue funding the government “to secure the future of our planet and its inhabitants.” The legislation cleared both chambers of Congress and is expected to be voted on by the Republican-controlled Congress before the end of April.The biennial will have a total of fifteen projects, including a portrait of the artist Betty Wright and a series examining the legacy of the Black Lives Matter movement, which was founded by artists and activists from various communities to raise awareness about police brutality. The list of curators is long and diverse, with Gerson Ashby, Nari Ward", "The next Biennial should be held in March 2021.\n\n\nFounded in 1972 by American artists Richard and Paul Spassky, the Amis du Palais de Tokyo (ADT), a collective of twenty-five artists that includes Félix Carrière, Jean-Michel Basquiat, and Louise Nevelson, was awarded the 2019–20 ANTI-DEFAMATIZATION award by the Venice Architecture Biennale.The inaugural event, which featured works by artists including Ed Moses, Rachel Harrison, Toba Miller, Luis García-Marin, and Lisa Raiber, was held in the courtyard of the Carrière house in Paris in October 2019. The first installment, “Symphony of Modern Life” (December 2019), explored the human dimension through the work of American artist-activists such as Sally Mann, whose practices include the theatrical and the film. The second, “Symphony of the Spheres” (October 2020), combines the mathematical and the physical in different ways. The work of Jay-Z and Beyoncé is included in “The Legend of Jim Maxwell.”Michael Whitman, the president of the New York group the New Statesports, said the 2019", "The next Biennial should be held in November 2021, and a new 9/11 Memorial in Düsseldorf should open in 2021. The cornerstone of the annual commemoration will be a historical exhibition featuring the works of more than sixty artists, including Göran Traugott, Abraham H. White, Elvia Kim, Fernando Sousa, and Lydia Yau.“This is a moment of great change, a moment of unity,” said Joachim Neumann, the director of the MCA Antwerp. “The new programming will offer a range of perspectives. We are exceptionally confident that it will encourage new and urgent reflections about the past and present, and strengthen the link between the work of the artists and the city.”Born in 1972 in the small town of Düsseldorf, Peter Sächsler is one of the last living members of the Austrian duo Erszuela and Henriette Bernier. Bernier’s first solo exhibition was at the Kunsthalle Basel in 1972, with Erszuela and Henriette Bernier, and her first museum exhibition was at the", "The next Biennial should be in January 2020 and will be held in the city’s Art Basel Tokyo. It will be a combination of a show and a film, and will feature more than ninety artists and will be hosted by the Royal Academy of Fine Arts. However, the exhibition will be closed to the public for two weeks due to the coronavirus and will reopen on January 28, 2020.\n\n\nThe Christie’s auction house has released the full list of thirty-six items that were up for grabs at its upcoming event, which was originally cancelled as a result of the coronavirus. The weeklong event, called the Christie’s New York City Foundation, was set to take place at Rockefeller Center on September 26–28, but was pushed back several times to October 2 to accommodate the coronavirus. “With the coronavirus crisis behind us, the auction house is excited to announce new initiatives that will help us meet our future challenges,” said auction house president and CEO Alexander Lippman. “This is a critical moment for us all, and we’re working hard to ensure the auction house fulfills its role as a premier global resource for art.”In addition to the", "The next Biennial should be announced soon. \n\n\nThe Swan Museum in London has cancelled its upcoming presentation of Tao of the West: A History of Art (2017) to promote sustainable practices. The exhibition, which was set to take place on March 23–March 28, was to have included twenty-four works by fifteen artists and a wide array of other works from across China, including Sky Chun, Ai Weiwei, and Ai Weiwei’s own family. However, the panel that was to be selected to represent the country at the Paris Art Biennale was only composed of New York– and Hong Kong–based artists, and the exhibition was originally canceled. “The exhibition has been cancelled as a result of the ongoing struggle for cultural and social justice in China,” Leo Frank, the executive director of the Fair Art Foundation, told the Art Newspaper. “The exhibition will be presented in the museums as a way of celebrating the work of the artists working in China, and they will continue in their respective locations, but we are hopeful that the work of the exhibition will be a contribution to the reconceptualization of the exhibition for a modern audience, as well as to the building of a new understanding", "The next Biennial should be held in the autumn of 2021. The biennial will be hosted by the Museums Association (MA), Westminster Abbey, and will feature a collection of works from the collection of the museum in the form of a series of interwoven tours. The exhibition will also include the work of the exhibition’s artist-in-residence, Gerald R. Cohen, as well as the biennial’s first major retrospective, “The Art of Life” (2017), which was staged in the US and the UK.Dr. Eva Lutz, director of the Museum of Contemporary Art in Berlin, said: “The exhibition ‘The Art of Life’ is an important first step in the evolution of the exhibition series, which has been influenced by the museum's long-standing commitment to the artistic and cultural exchange of the museum with the city, the city with the country. This series’s coming together will make us even more excited to welcome you to Berlin. We look forward to welcoming you soon. We believe that the Berlin Triennale has a significant role for Berlin, and for the city and the city with it.”\n\n\nThe Mekong Delta Art and Design Hub in Laos,", "The next Biennial should be held in the autumn of 2020. Since Noguchi’s death, the museum has staged seventeen exhibitions, including “Feminine” (2014), “The Death of a Young Woman” (2015), and “Simone Biagini: The Time Is Now” (2017).  The museum has also been working on a new art installation in partnership with the Brooklyn-based artist Nadine Modigliani, who will build and manage the exhibition.  The museum has made several other significant advances in the last twenty years, including the establishment of the museum’s first department for contemporary art and a museum dedicated to African art, “AoM: The African Center.”\n\n\nThe American Alliance of Museums (AAM) has announced that it will award $9 million to help the thirty-six independent arts museums and cultural spaces in the United States that have sustained significant losses in revenue as a result of the Covid-19 pandemic. In recognition of these losses, the AAM is giving AAM’s members $1 for every $1 in cumulative losses of $100 million. The cities and counties that will be eligible for the grants", "The next Biennial should be held in 2021.\n\n\nThe Metropolitan Museum of Art in New York has announced that it is working with three international art collectors to present the inaugural exhibition “DESIRE,” which will take up themes of beauty and radiance, social justice and colonialism, and the body and its relationships with the environment. The exhibition will be curated by Rachel Chiu and will be co-organized by the Max H Cooley Gallery in New York and the American Folk Art Museum in New York. The Met also announced that it is increasing the curatorial team to ten and is working with Bridget and Alan Kubicki to develop a new exhibition. The exhibition will be held in the museum’s Bennington space, which is currently closed since October, and will feature work by thirty artists, including Alice Aycock, Aaron Ladd, Laura Owens, and Laura Mulvey, as well as two new works by experts in the field of color and the performance.“DESIRE’s’ themes and the artists representing them are deeply rooted in their respective histories and contexts,” said Met director Daniel H. Weiss. “The Met’s already-existing relationships with the artists", "The next Biennial should be held in the spring of 2020.To learn more about the upcoming event, visit the www.nasa.gov/discoveries/eventcenter.html.\n\n\nThe MCH Group, the German conglomerate that owns Volkswagen AG, has agreed to pay $2.4 billion to settle allegations that it cheated on emissions tests with tens of thousands of diesel vehicles sold in the United States between 2008 and 2009. The German justice ministry will decide on the final terms this month, and the New York Times reports that Volkswagen is expecting the verdict to be in the range of $4 billion.As part of a deal that also involves the UK-based defense company BAE Systems, which has more than 1,500 employees in the US, and the engineering and materials company Sikorsky Aircraft, the fines amount to $2.3 billion. VW admitted in August that it cheated on emissions tests with more than 2.5 million vehicles in the United States, and it agreed to pay $1.5 billion in damages. The company has also agreed to pay a total of $2.2 billion in the first phase of the settlement.The settlement comes two months after the German federal court in Frankfurt issued an interim injunction against Volkswagen in", "The next Biennial should be up by the end of the year.\n\n\nSwiss artist, designer, and teacher Klaus Lüpertz, whose inventive, visually arresting paintings capture the whimsical, the surreal, and the gritty, has died at age sixty-nine. His work has been exhibited internationally, and includes works on paper and wood, paper and papier, and wood and paper.Born in Bern in 1949, Lüpertz grew up near the Swiss Alps, in the town of Viborg, and attended the same school for eight years. There, he studied with the avant-garde artist Jules Strasser, who would later become one of his mentors. Lüpertz, who stated in an interview in 2007: “Strasser was a madman, a man who was insane, who was trying to make a work out of nothing.” That work, 2009’s The Wolf of Wall Street, was a moving illustration of the financial crisis. His work has been collected by the Metropolitan Museum of Art, the Whitney Museum of American Art, the Museum of Modern Art, the Los Angeles County Museum of Art, and the Los Angeles County Museum of Art; exhibited at the König Galerie", "The next Biennial should be held in 2022.\n\n\nThe Proctor & Gamble Co., the American chemical conglomerate, has suspended its plan to open a new $16.6 billion fashion and beauty retail and distribution hub in Japan in 2019. The move comes a month after the company revealed plans to open a new $14.9 billion fashion and beauty retail and distribution center in China in 2020.The company stated that it is exploring various options to expand its footprint in Asia, including in Hong Kong and Taiwan, but states that it must now focus on the future and determine the best path for its new Japan-based business.“Our relocation plans represent a significant shift for the company in its current form, and we are analyzing a number of potential locations for Japan and the company’s future planning,” said Kent Suda, president and CEO of the company. “Over the coming months, we expect to present our full strategy to the public, and will share additional details with our Japanese and global teams.”\n\n\nFive artists were selected by a jury to receive the Leo C. and Leslie F. Kremer Award as the winners of this year’s $500,000 Lifetime Achievement Awards, which honor excellence in work that has", "The next Biennial should be in February 2021 at the Wythenshawe Museum in London; it will be staged at the New Museum and the Serpentine Galleries in London, and will be inaugurated by a performance by the British singer and songwriter Charlotte Hogg.\n\n\nThe British artist Vivian Hampden, who pioneered the use of painted surfaces in her “Paintings of the Americas,” 1900–1914, has died at age seventy-nine. In addition to her extensive body of work, the artist has been involved in a number of initiatives, including the creation of a large-scale painting of the American West, “Avenues” (1903), for which she drew inspiration from the Great American Novel, and “Painting in the American West: A Visual History,” 1949–1954, for which she drew on the work of Roger and Edith Webster. Hailed for creating “an immaculately designed world of broad brushstrokes,” Hampden also wrote a number of best-selling books, including Hampden on Painting, 1950, which was translated into French and published by Erskine Books; Hampden on Painting, 1969,", "The next Biennial should be held in 2021. Art Science University of Warsaw will host the festival, which will run concurrently with the Art Association Biennial, in its first edition,“Art in the City,” as scheduled from February 19 to February 21, 2021. Cultural historian and urban researcher Petra Wojtas, who runs the research institute Biennale 1, plans to attend the event as well as the Art Science University. She said: “The Art Science University is a hub with an excellent reputation for research and scholarship. That will remain the case no matter what happens.”\n\n\nThe Metropolitan Museum of Art in New York has appointed Simon West, a curator and founder of the groundbreaking New York art-world magazine Artforum, as its next artistic director. West joins the museum from the New York publisher W.W. Norton & Company, where he has served as chief curator of photography for fifteen years. He succeeds Kate Reese, who has helmed the Met since 2013, and will take up his new duties on February 8.“Simon is an innovator, a leader and a loyal friend who has been instrumental in transforming the Met’s curatorial program in the last five years,” said", "The next Biennial should also investigate the future of a contemporary MFA–based contemporary art museum. The museum’s director, Marc Treib, said: “The kind of project that is now offered in the Biennial is not what we have always described as a retrospective. It is a conceptual space in which we can look into the future and try to understand what will be the future of art.”Terry Pratchett, the author of the Discworld series, has called for a revival of the annual event, which has been held in various forms since 2011. “I think we need to re-shape the terms of the event to reflect our times and our future,” he said. “Maybe more of a reflection of what we are up against, what is going on in our world.” \n\n\nThe National Gallery of Art in Washington, DC, is planning to open two new digital platforms, the National Center for Photography (NCPA) and the National Museum of African Art, in 2020. The first will allow visitors to explore more than one thousand works by contemporary artists, and the second will offer free access to the works through a digital portal.Nancy Spector, a spokesperson for the National Gallery", "The next Biennial should be held in 2020 and will focus on questions of ecology, sustainability, and the bounty of nature. The centerpiece of the event will be a new conceptual paradigm developed by the artist and designer, and his partner, Nusseibeh Daruwali. The duo will then present a series of installations to mark the milestone.The art world’s latest iteration of the International Biennial—which will launch at the Kunsthalle Basel, Switzerland, on September 22—will feature work by forty-seven artists from twelve countries and will feature work by thirty-three artists. The theme Biennial 1 is the single most important event in the history of the art world. The artists will collaborate with their artistic partners to create an immersive new work by the artist. The twenty-fifth edition of the Biennial will be held at the Kunsthaus Stuttgart, and the twenty-sixtieth will be staged at the Kunsthalle Basel. \n\n\nAn opening-night performance at the Museum of Modern Art in New York on Sunday, July 8, marked the first time the show, titled The Ghost in the Machine, has opened since its cancellation in April 2019. The show, which", "The next Biennial should focus on the relationship between art and technology, and should consider how art and technology are interrelated.”The following year, the biennial will also introduce a new selection of works—a selection that will include works by 18- and 21-year-olds—that will be curated by the renowned curator and curator of modern art, Wolfgang Tillmans.The exhibition will be held at the Kunsthalle Basel in Switzerland from January 16–March 21, 2020, and will feature work by artists such as Salman Rushdie, Kaj Toppari, and Nicolo Pareto.\n\n\nThe NIA is collaborating with the Museo de Arte Contemporáneo (MAS), Argentina, on the next edition of the Centro de Cultura de Educación, which will take place in the city of Nogales, in the province of Buenos Aires. The event will be hosted by the NIA in partnership with the Museo de Arte Contemporáneo and will feature lectures, performances, and other programming that will explore how the museum has historically sought to give a platform to emerging artists and will examine how its current exhibition program is attempting to cultivate more of a Latin", "The next Biennial should take place in 2020, when the exhibition will mark the seventeenth anniversary of its launch.  The inaugural event, “LOVE IS HER NAME,” was staged at the Institut Henri Ghent in the Belgian city of Antwerp in May 2019 and was the first retrospective to focus on the life and work of the French modernist René Magritte. The second, “THE PARIS PORTAL: A Tribute to Paul Cézanne,” will be held at the Lyon Biennial in July.While the upcoming edition of the Biennial will include the works of seventy-four artists, including Jean-Michel Basquiat, Michelangelo Antonioni, Pierre-Auguste Renoir, and Pierre-Auguste Steiner, it will take place at the Institut Henri Ghent rather than the Louvre. The biennial will also feature new works by artists such as Yinka Shonibare, René Main, and Sebastien Léger.Advertisement\n\n\nPeter Munk (1936–1975)“The Man Who Laughs at Death” is slated to open at the Art Institute of Chicago next month and is currently on display at the", "The next Biennial should take place in 2019, when events will be relocated from the current venue.“The potential of the new venue,” Talbot told the Art Newspaper. “It will be a very different system to the one we have been using, with many of the programmes already made and already archived. It will also be a very different place for future events. I am optimistic that we will come to an agreement on a new venue and the new year will be a happy one for everyone.” The full list of participating artists is as follows:\n\nBejing Art Museum (China)\n\nBeijing Museum of Fine Arts (China)\n\nBeijing Fine Arts Museum (China)\n\nLiu Duanfeng Gallery and Museum (China)\n\nNew York art gallery (U.S.) (United States)\n\nHockley Art Gallery and Museum (United Kingdom)\n\nKathmandu Art Gallery (Chandigarh)\n\nKathmandu Art Gallery (Canada)\n\nMana Contemporary (New Zealand)\n\nMonterey Art Museum (California) (New Zealand)\n\nMTS Gallery (New Zealand)\n\nNetherlands (Den", "The next Biennial should be scheduled for 2021–2022. The next edition will be staged at New York’s Museum of Modern Art, which is currently undergoing a $3.5 billion expansion; the museum is currently working on the redesign of the museum’s Centro de Histórias de San Andrés, which will draw thousands of visitors.The Los Angeles County Museum of Art (LACMA), which recently underwent a $6.5 million expansion, recently announced that it will stage a new edition of the LA Biennial, which will be held at the Los Angeles County Museum of Art (LACMA), in 2020, in its new and refurbished auditorium. The next iteration of the LA Biennial will focus on the Los Angeles river and will comprise eighty-five exhibitions, including several on the city’s Central Library, LACMA’s new public art project, and the Los Angeles–area Contemporary Art Museum (LACMA). The 2020 edition will conclude with the Los Angeles–based nonprofit Aria China, which has a permanent collection of Chinese art, performing arts, and design, and will be curated by the artist and curator Amanda Knapp.Knapp said: “The Los Angeles", "The next Biennial should be held after the end of November, but until then, we are prepared to present you exhibitions of works by artists in various nationalities. This year’s edition will be organized as follows: From the ground up. About the same as the first, the furthering of the theme “Self-Reflection,” a compilation of interviews with writers and artists in North America. The show will be organized in the same manner as the first event, with the addition of new works by a select group of American and international artists.“Just as we are proud to present the biennial in Santa Clara in January 2020, we are proud to present the biennial in Vancouver in September 2020, and in New York in December 2020,” said Justin Mehlman, the director of the Biennial Foundation. The thirty-six-person selection committee comprised Sara Pope, professor of the history of art at Columbia College, New York; Marlene McDonald, founder and director of the MFA Vancouver; John H. Robertson, president and CEO of the Fergus Graham Foundation; Jeffrey Hirschhorn, chairman of the Fergus Graham Foundation; and Anita J. Browne,", "The next Biennial should be held in 2020 and will be organized in collaboration with the City of New York and the Museum of Modern Art in New York.\n\n\nThe Washington County Museum of Art in Olympia, Washington, has appointed Sara D. Mitchell as its new deputy director and chief curator. Mitchell will assume her new role in August.“Museum director Edward W. J. Selby has been a champion of Sara and her work for nearly twenty years,” Selby said in a statement. “She has been instrumental in elevating the museum’s profile and making it an indispensable cultural resource for Washingtonians, and is renowned for her innovative and formidable curating style. Sara’s vision for the museum has been instrumental in securing the support of local, state, and federal governments, as well as millions of dollars in philanthropic support for the museum and the District of Columbia.”Previously, Mitchell was a research scholar at the Smithsonian Institution’s National Museum of African Art in Washington, DC, where she curated “The Abode of the Dead” (2007–2008) and the 2011 exhibition “Anatomy of an Empire: Art in the Age of Empire.” She also served as a", "The next Biennial should be set up in the Boricua district of the city of Buenos Aires in June 2020.\n\nAccording to Artnet, the exhibition, titled “Por el último della Tutti,” will focus on the history of art museums in the city. It will also feature the centenary of the founding of the Museo de Arte Contemporáneo Argentina (MAS), a modern and contemporary arts institution in Buenos Aires, and will air excerpts from the In the Beginning’s Light, a preliminary opera by guitarist and singer Edith Atlee. The show will also feature “The Runaway Gaze,” an exhibition of collages created in the 1930s by the Italian sculptor Gio Ponti, and will feature a selection of works that were created outside of the country.\n\n\nThe Owen-Smithsonian-CalArts Center in New York has appointed Joan McClintock as its next director. McClintock will be responsible for organizing and directing the museum’s programming, which is now managed by the nonprofit Federation of Museums. She takes the helm from Dave Shaw, who has helmed the museum since 2016,", "The next Biennial should premiere in 2021. In a statement, the organizers said: “The theme of the twenty-fourth Biennial will be ‘helping others become, making collaborative a universal right.”\n\n\nIn late January, a group of Occupy protesters in New York City were arrested for blocking traffic with their feet while chanting slogans such as “Five years of austerity, five years of attacks on public health, five years of war, five years of hate, five years of division. All of these years the banks and corporations and the rich get richer and the poor remain in the dark.” According to the New York Times, the protesters were arrested for littering the street after they were briefly dispersed by police, who made no arrests for the February 7 action.In the weeks following their arrest, the group staged numerous actions around the city, including a march from Big Apple to Wall Street, a rally at Madison Square Garden, and a rally outside of the New York Stock Exchange. These actions, combined with protests against a $15 minimum wage, investments in the environment, and police violence, have led activists to believe that New York City’s art scene is in deep trouble.  According to Artnet News, the protesters", "The next Biennial should be held in 2020, and the institution’s director, Jürgen Laib, told the New York Times that the 2017 event was not a watershed moment for the museum. “We are now in the sixth year of a new project that aims to create new connections between art and science. This is an important step towards a new kind of relationship between museums and science,” he said. The exhibit, titled “Why is Life Worth Living?,” will be on view at the museum until March 19.\n\n\nThe Museum of Contemporary Art (MoCA), Boston, has launched a new digital platform that will allow visitors to view all of its upcoming programming online. Called the MAXX I, the platform will be available online beginning on February 16 and will be powered by curators at MoCA, whom attendees will be able to follow on Twitter. “I’m excited to bring you the next MAXX I,” said Andrew Moffitt, director of the Center for Art and Innovation at the Museum of Modern Art. “With the new platform, we are offering the public an unparalleled platform for engaging with our collection, exhibitions, and programming. We are also introducing a new way", "The next Biennial should be held in 2021, and the last one in 2018.\n\n\nA group of artists and activists have launched a campaign to hold the Tate in London accountable for its connections with arms manufacturers and for its decision to extend the life of a weapon that was manufactured by the company that was contracted to care for the Tate’s collection.In a statement, the campaign group Artists United said that the decision to extend the life of the M16-era automatic weapon, which was manufactured by Gander Arms, a British defense company based in the US, was “a betrayal of the many victims of violence brought about by arms dealers.” They added that the show must “re-open the debate about the limits of free speech, about the capacity of governments and security forces to use arms, and about the power of arms manufacturers and non-state actors.”The organization argued that the decision to extend the life of the M16, which was released into the hands of the public in 2009, was “an outrageous violation of basic democratic principles.” It continued: “This decision has a devastating impact on the mental and physical health of thousands of vulnerable people every year. The Tate is complicit in enabling this. The", "The next Biennial should be held in Helsinki in 2021, followed by Venice in 2022. The Hong Kong film festival next year. The 2019 edition of the Berlinale, which attracted a total of 190,000 visitors from fifty countries, opened on March 17 and ran until March 21. Of the nine exhibition venues and venues located in the former East Germany on March 16, the exhibition hall in the former East Prussia, the Stedeische Kunstverein in Essen, and the Palais de Tokyo in Paris will host the event. The event will be held in the former Katowice State Museum, which has been the scene of many political demonstrations as the former Soviet republic of Poland has been annexed by the Russian Federation, and will be attended by an international panel of experts. The first edition of the Berlinale was staged at the Reichstag, and the event was held every other year in the former East Germany. This year�s event will be held in the former city of Tyrol, in the heart of the Alps, and will be followed by a Berlin Art Summit in June and a Berlin Film Festival in October. The second edition of the Berlinale will be held in the former Neuerhaus, and will reprise", "The next Biennial should be held in 2019 and will serve as an update and continuation of the theme “Empathy for Animals” from the 2017 event. The theme is a return to the “nature-vs-nurture” paradigm advocated by anthropologist, designer, and educator René Magritte. The exhibition will feature a selection of works by forty-eight artists.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Deborah B. Corrigan as its new director and CEO. She succeeds David G. Hoffman, who retired in January 2020 after a decade at the helm of the institution.“At a time when art museums are facing organizational and financial challenges that threaten the future of museum governance, it is of paramount importance that our curators, staff, and artists have access to the highest-quality funding and support,” Corrigan said. “With that in mind, MoMA has become an important center for the study of contemporary art in the United States. I am thrilled to be the next curator at MoMA and to collaborate with the talented team and the incredible staff at the Museum of Modern Art. They will continue to shape the museum into a model for how we can balance artistic", "The next Biennial should take place in 2021, and a museum exhibition featuring the work of the first round of artists in 2020 should be staged in 2022. The museum is also making plans to transform its premises, which are currently being renovated, and will begin construction on a new facility for art in the next two years. Artforum has reached out to the Castle and will update this story when we hear back.\n\n\nThe J. Paul Getty Trust in Los Angeles has set up a new program to help foreign art collectors adapt to the Covid-19 pandemic and has launched a new online platform, Artforum for Foreign Art Collectors, that will allow visitors to see works by international artists in any language. The platform will have an in-person version, Artforum for Foreign Artists, and will be hosted by the Getty Trust, the Museum of Arts and Design, and the Getty Images. The initiative, which will run through March 20, will bring together hundreds of curators, art experts, and collectors from around the world for live discussions and Q&As. “The past few years have brought us together in ways we never have before, and we are now working together to strengthen the resilience of art communities worldwide during this unprecedented global crisis,", "The next Biennial should be held in 2021. “The new exhibitions will be a reflection of the work of artists of our time and will aim to present a biennial in animation, with an emphasis on the recent,” Allison Pearson, executive director of the Art Institute of Chicago, said in a statement. “The exhibition will take a form and the themes of a biennial in art, art history, and art history as set by a panel of four leading contemporary artists.”\n\n\nThe Metropolitan Museum of Art in New York has decided to postpone the inaugural exhibition of the new organization, the Met Museum for African Art, which was set to open in the United Kingdom on September 2. The event, “The Met Museum for African Art: The Politics of Images,” was to include three works by eight artists from Africa, including Eldridge, Andre Ellsworth, and Jacky Iheanacho, and was slated to run for four weeks. It also would have presented performances by artists including Sifiso Ndzube, Mandy Pape, and Olu Olu.“We are pleased that the artist-in-residence, Alex Salter, will continue to have an important role in the organization,", "The next Biennial should be called for the dissolution of the Greater Cairo Art Museum and the Imperial Palace Museum. The announcement was made on Friday, March 5, as the Egyptian director, Hamdeen Sabahi, headed to the Egyptian Institute of Art (EIA) in Cairo for a meeting with the board of trustees of the Giza Foundation for Contemporary Art (GFCCA).Sabahi was appointed by President Abdel Fattah El-Sisi in January 2019, but the appointment was never ratified by the National Council for the Muslim Brotherhood (NCCM). Since then, dozens of petitions have been signed, and more than 300 academics have signed, in an attempt to prevent the NCCM from being dissolved. The NCCM has been the target of a number of brutal assassinations since the election of Abdel Fattah El-Sisi, the president who ousted the NCCM and replaced him with Abdel Fattah El-Sisi’s son, Abdel Fattah El-Sisi II.The petitioners claim that the board had no role in the appointment of Sabahi and they accuse the NCCM’s board chair, Hamdan Kazim, of seeking to place Sabahi on the board of the new institution and", "The next Biennial should be held within a couple of years, but the city has yet to send a formal request for proposals or initiate a design. The exhibition will be at the former Red Tower on West Twenty-Fourth Street in New York from March 13–March 17, 2024. The show is being curated by Jonathan Garner, who most recently served as the chief curator of the “Ghetto Museum” in Harlem, and Mara Hoberman, who previously worked as the associate curator of modern art at the National Gallery of Art, Washington, DC, and a curator at the Brooklyn Museum. The event will also consist of a combination of lectures, performances, and other activities. “Themes of the present moment and the future ,” Garner told the New York Times. “The future is preoccupied with how we live together and what kinds of communities we want to create and how we shape those communities in our own image and beyond that. . . . Our intent is to try to create a place where the public can come together to have some of that creative energy and focus on what matters most—the art that has been created and the history that is told.”In the coming months, the museum will launch", "The next Biennial should add a new chapter to the story of art history and its relation to contemporary society; and one that will trace the influence of the work of the previous generation of artists and their successors. It should also reflect the ever-changing aesthetic conditions of the contemporary museum.In the fall of 2020, the artists who will participate in the exhibition will be announced. The theme this year is “Intellectual Life and Social Life” and will feature works by all fifteen artists selected by the biennial’s artistic committee, which comprises twelve men and five women. The show will run from February 27 to March 3, 2020 at the Bentelium Neue Biennale, Berlin.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the conduct of future exhibitions at the Metropolitan Museum of Art (MoCA), which were set in place by city officials in the wake of the devastating fire that broke out in a commercial building in the museum’s former location on West Twenty-Third Street on May 10, 2015.The guidelines, which were issued in an emergency order issued by NYC’s culture administrator, Patrick F. Coleman, ensure that MoCA employees, including curators, technicians, and other", "The next Biennial should be held in 2020, according to a statement from the institution. “We are grateful to the City of London for its support in the planning and development of the Biennial, and to the Board of Trustees of the Royal Society for the Arts for their participation in this project,” the statement reads. The exhibition will feature over 20,000 works from more than eighty countries, and will open in the autumn of 2020. The show will coincide with the Royal Festival of Arts, which will take place in March 2021. The Royal Academy of Arts Museum in London is also preparing for its reopening, and has released a statement regarding the reopening of its centrepiece, the Tate’s new £50 million Tate Modern. “Tate is reopening with a new exhibition, ‘Away from the Modern,’ which will run on across two floors of Tate’s new building on Oxford Street in the autumn of 2020, and we will have more to share about that as the reopening programme unfolds,” a spokesperson for Tate said.While the Royal Academy of Arts Museum has not yet commented on the reopening of Tate Modern, it has said that it is “", "The next Biennial should kick off in June 2020 and will also feature a number of exhibitions on contemporary art, including “Theater of Operations”—a study of the legacy of the US Central Intelligence Agency, and will be organized in collaboration with the US Museum of Modern Art in New York. “The 2017–18 Warhol–Dora Art Biennial was a tremendous success, with more than $100 million raised, 3,800 attendees, and a highly anticipated exhibition, ‘Primitive Habits: Art in the Age of Black Power’\u0097a reflection of the Warhol–Dora Art Biennial,” said Richard Armstrong, director of the Biennial. “We are extremely pleased with the project and the result, and look forward to the 2020 iteration of the Biennial, showcasing the work of emerging and established artists, as well as a host of emerging and established artists from across the globe.”The biennial will also present a selection of works by contemporary artists, including a new exhibition of work by the Danish artist Việt Nguyên; a preview of a new installation by the Chilean artist Yoani Nique; a selection of works by the Japanese artist Kiyoko Tak", "The next Biennial should be held in February 2022, with a preliminary design to be unveiled by September 2022.“The exhibition is a response to the challenges that we face as artists and organizations working in a digital age,” said Isabel Masuoka, director of ART and Tokyo Art Museum, and Hiroshi Hagiwara, director of the Tokyo Museum of Art. “With the exhibition, we hope to share with you a new way of thinking about the exhibition and the exhibition as a whole, and to create a new set of connections between Japan and the international community.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released guidelines for how it should celebrate the fifty-fifth anniversary of its founding in 2020. The guidelines focus on the importance of an inclusive celebration encompassing both physical and cultural milestones, but also address themes of community and social justice.Inaugurating the museum are “The Past and Present of the Museum of Contemporary Art” (2015–16), a retrospective of work by twenty-seven artists, including Ruth Davenport, theymos, and Kyara Saar. Celebrated with a retrospective of works by the same artists in Los Angeles in 2017, this year’", "The next Biennial should be held in 2020. Artists: We are currently in the process of writing and will soon publish our first issue, Artists, which will be organized by the artist. The exhibition will focus on the history of art through the lens of the artist. We are currently working on developing an online version for our platform, Artists, and hope to launch the online exhibition in the second half of this year. The next exhibition will be dedicated to Kiki Smith. We are still in the process of selecting the artists for the show, and they will be announced soon. David Miro, founder and director of the Miro Art Foundation, said: “I’m excited to be a part of the work of a great generation of artists. Their work is vibrant, original, and feels timeless. David Miro’s Foundation has helped a number of artists successfully transition from their sites of practice to their homes.”\n\n\nNew York’s Metropolitan Museum of Art (Met) has appointed Chris Albrecht, the president and CEO of the private museum, as the next director. Albrecht will be installed in his post on March 1. He succeeds Susan Efst", "The next Biennial should take place outside of Osaka and will be a combination of a lecture series and an exhibition. The lecture series will consist of a selection of two hours of lectures from a selected list of artists and will consist of art from the contemporary world, from the nineteenth century to the twentieth century. The exhibition will feature works first presented at the Biennial in 2018 and will be curated by Satoru Nakayama. The biennial will run from March 16 to March 19, 2020 in Osaka. Bradley Roper, chair of the exhibition, said: “We are thrilled to announce that this year’s Biennial will be held at the Contemporary Art Museum in Chicago, and will be working with the Contemporary Art Museum on a new collection of contemporary art from our collection. We look forward to presenting the work of some of the artists represented in this year’s exhibition. We hope that this show will be a reflection of the vibrant and diverse communities in the greater Chicago area.”According to an article published by Artnet in May 2018, the exhibition was inspired by a meeting between conceptual artist John Branch and the late Chicago native and collector David Knepper, who was working on a book with the artist and the duo developed", "The next Biennial should take place in the fall of 2020. The upcoming exhibition “The Stone Age” will be held in the fall of 2021. Museum’s director, Bryan Mitchell, said: “We are excited to present The World Is Not Enough: Art and the Anthropocene’s New Collapse. We have planned for it for some time, and we hope you will embrace it as a new chapter in your history.”\n\n\nThe City of New York and the New York State Department of Cultural Affairs have issued a $10,000 grant to help nonprofit arts organizations in the City of New York prepare for the coronavirus pandemic. The grants come from the de Blasio administration’s $1.2 trillion package for cultural and workforce recovery, which also financed more than $1 billion in grants over the next three years from the state’s $1 trillion supplemental budget.The grants, which are available to arts organizations and not-for-profit entities, are available through the Cultural Institutions and Agencies Appropriations Act, which is set to be enacted next week and is expected to provide $2.7 billion to curb the coronavirus. As part of the package", "The next Biennial should explore the role of visual art in the lives of museums and how it can be experienced again, this time through the lens of the museum. “I always think of the Biennial as one large, open-concept space for the exhibition of art,” said Daniela Roldan, artistic director of the Venice Biennale. “It is one of the most important moments of my life.”The upcoming edition will take place at the Museo del Barrio, located in the city of Barrio de la Revolución, and will be hosted by the Los Angeles–based artist Alex Zucchetto. The artist, who was inspired to create the exhibition by the collapse of the Peruvian Amazon, will join the theme of the second half of the exhibition from May 31 to June 1.The exhibit opens with a twenty-four-foot-long photograph by the Italian artist Angelo Cuno, which features a small group of people in a church, and reveals an alternate history of the world. From the 1930s to the 1970s, Rio de Janeiro was a bustling metropolis of art, commerce, and culture. The exhibition presents the work of contemporary Rio artists, including Alexander Leiva", "The next Biennial should take place in 2020, and a new exhibition of works by the artist will launch in 2021.\n\n\nGerman artist Tobias Langschiemann, who is best known for his monumental works in the form of an enormous, terracotta-block installation called the Tic-Tac-To, which is situated in his studio in Berlin, has died at the age of eighty-five at his home in the city of Kassel.Born in Kassel in 1931, Langschiemann studied at the University of Applied Arts Berlin, then at the Kunsthalle Kassel in 1961, where he studied under Hans Grosse, and then at the Art School in Kassel (SWIT) in 1963. He received his BFA from the Art School in 1985. In 1987, he received the Grand Master of Germany award, presented by the German government and the German state of Brandenburg; the prize was one of three curators offered the accolade. In 1997, Langschiemann was invited to present the fiftieth edition of the Berlin Biennale, and he accepted the invitation at his request. The following year, the installation was made into a German television documentary, titled The Tic-Tac", "The next Biennial should focus on the history of the exhibition, and may invite new works. \n\n\nThe New York City-based nonprofit Black Mesa Art Museum has received $35 million from the New York City Council on $75 million in revenue sharing dealings in the coming years. The funds will provide the museum with $15 million, and will allow the institution to open its new space in the Bronx in 2021.The council previously approved a $50 million capital campaign in 2017, and the legislation reauthorized the $75 million fund in 2019. Councilman Jimmy Van Bramer, chair of the city council’s cultural affairs committee, said: “The city is committed to supporting the Black Mesa Art Museum as it continues to present an exciting array of exhibitions, educational programming, and public programs. I look forward to working with the Black Mesa staff to ensure that this ambitious project is realized in the next City Council year.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has issued guidelines for the display of cultural artifacts in its collection at the Rothmans Museum of Art in Manhattan. In a publication dated March 16, the DCLA states that the", "The next Biennial should take place at the Art Institute of Chicago (AIC) in Chicago, Illinois, in 2021.\n\n\nAir New York and Stefan Mariner, the New York–based designer whose line of men's clothing was pivotal to the revival of American tailoring, has been awarded a $30 million contract by the company.According to Bloomberg, the contract, which extends from 2020 to 2022, will allow Air New to design and execute new arrangements with a portfolio of companies including Levi’s, H&M, and Victoria’s Secret. The first contract, for new collections, will be announced shortly.According to Mariner, the contract marks an “upholding of our commitment to creating new designs, with new collections, with a new team, with a new projects, with new approaches, with a new vision.”The contract also recognizes the contributions of former employees in “expanding on the ideas and principles of previous Air New collections,” including the collection of artist René Magritte, who created a wardrobe for the brand in 1950. The iconic collection, which was first unveiled in 1958, features pieces from the designers’ outerwear line, the Air Lockers, as well as pieces from the", "The next Biennial should take place in the West End in 2020. [Update: March 28, 10:45 AM] The 2022 edition of the exhibition will be held at the Theatre Royal in London.The opening of the 2018 edition at the Contemporary Art Museum St. Louis was postponed due to the Covid-19 pandemic. The opening of the 2019 edition at the Museum of Modern Art in New York was pushed back by a month. The opening of the 2020 edition at the Museum of Modern Art in New York was pushed back by a day. The 2020 edition of the Biennial, titled The Power of Three, was originally set to take place at the Metropolitan Museum of Art in New York on March 30 and would have been held on April 3. However, the museum announced it was postponing the event and the organizers later said the date would be rescheduled. The 2020 edition of the exhibition will now be held at the Smithsonian American Art Museum in Washington, DC, from April 7 to April 10. \n\n\nThe National Gallery of Art in Washington, DC, has appointed Ashley Panetta as its new deputy director of exhibitions and collections. Panetta will be responsible for overseeing the growth and trajectory of the National Gallery of Art", "The next Biennial should be held in the spring of 2021. \n\n\nThe National Museum of Art (NMA) in Washington, DC, has appointed Vanessa Bell as its new director. Bell will report to the National Council on the Arts and the National Council on the Arts’ secretary, which consists of representatives from the Smithsonian, the American Museum of Natural History, the Metropolitan Museum of Art, the Museum of Modern Art, the New Museum, and the National Gallery of Art. Bell will assume her new responsibilities on January 2, 2021.“We are thrilled to welcome Vanessa’s leadership to our team and to support her in her new role as director of NMA,” said attorney general William Tong. “We view this appointment as an opportunity to strengthen and expand our relationships with the National Museum of Art, particularly when we are working to advance the civic goals and mission of the NMA, which is to present one of the nation’s great treasures, the Smithsonian Institution’s collection of the largest collection of European art.”Bell comes to the NMA from the Metropolitan Museum of Art, where she has served as director since 2008. During her tenure, she has developed new programs and partnerships with the Smithsonian", "The next Biennial should showcase a selection of recent work by artists and institutions working across the globe. The theme of the next iteration should be “Intelligent Design.”\n\n\nThe State Art Museum in New York has appointed Katherine Langford as its new deputy director. Langford will be responsible for overseeing the museum’s collection, administration, and research and will assume her new role in January 2020.“As the first woman appointed to head a major American institution, Katherine will bring with her a wealth of experience and knowledge in art history, modern art, and preservation, as well as a keen and sophisticated understanding of how the art world works,” museum director Daniel H. Weiss said in a statement. “Her appointment reflects our vision of the State as a world-class art museum and the museum as a platform for the dialogue that defines New York. We are confident that her appointment will ensure that the State continues to thrive and thrive as America’s premier art museum.”Commenting on the appointment, Langford, who worked as a curator at the museum before joining the institution as its first director in 2017, said: “It has been an honor to serve as the new deputy director of the State, and to", "The next Biennial should focus on “human rights, racial justice, climate justice, and social justice.”\n\n\nArchaeologists from the Museums Association (MA) and the British Museum (BMI) in London have released a joint statement on the exhibition “The Architectural Record: The Untold Story,” which will be open to the public in London and the Middle East from December 19 to January 3, 2020. The statement, written by archaeologist and chair of the MA’s board David Peiffer, reads:“The themes of The Picture Show and The Firmament, in particular, are powerful and resonate with the themes of our public art collections. We believe these works and others in the exhibition will engage with issues that have been neglected in the public debate about art, and that will help us to re-evaluate the role of art in our communities.”The first part of the exhibition, titled “The Firmament” and directed by Hiroshi Ito, consists of twenty-five pre-existing works by thirty-four artists, including Eddie Boswell (1936), Tania Bruguera (1939), Tanya Bon", "The next Biennial should be an exhibition of the work of the artist, an exhibition that reflects the artistic spirit of the city. It should be an intimate setting for the artist and the public to see his work. It should be a platform for the artist to show his work to the world. I take seriously any challenge to the exhibition of the artist’s work.”\n\n\nThe Metropolitan Museum of Art (M.M.A.) in New York is planning to close its doors to the public indefinitely on December 31, 2020, in an attempt to minimize the health risks stemming from the coronavirus. The museum, which is currently closed since the Covid-19 pandemic began in earnest, plans to give visitor centers the option of temporarily suspending operations in a bid to stave off the virus for as long as possible.According to the New York Times, in a letter dated April 27, the museum’s senior director of public relations, Barak Ravid, said that the museum would not be “shutting down” permanently and that it intends to “work through issues that may impact our guests for as long as possible.” He also said that the museum will “continue to advocate for ways in which we", "The next Biennial should be held in 2020.\n\n\nThe Museums in Venice have been designated as critical archaeological sites in an imminent major global conservation initiative. The initiative, known as the Rome Declaration on the Conservation of Cultural Heritage (Dichem), was drawn up by a group of world heritage experts chaired by Jeromea Celantz, director of the Museos Venezia in Venice; Antonio Cervetto, a curator and expert in twentieth-century art who is currently the director of the Museo di Arte Contemporanea in Turin; and Francesco Catellani, president of the Palazzo Rebaudengo. The Rome Declaration outlines a number of steps that can be taken by the Generalitat in order to safeguard the cultural heritage of the city and its historic sites, including by promoting the use of sustainable materials and practices; encouraging the preservation of historical sites through research; and fostering international cooperation among Italian and international experts.The declaration also outlines how the Italian government can play a part in the campaign to save the Temple of Santa Maria Comune in Venice and the Palazzo Rebaudengo, and how cultural sites can be identified, protected, and named in order to promote the preservation of cultural heritage in", "The next Biennial should be held in 2022 and will take place in Hamburg. It will also organize a presentation of the new exhibition “Bodies in Motion.”\n\n\nThe Museum of Modern Art (MoMA) in New York has released the list of seventy-four artists who will participate in its next edition, “Dreamland: Art and Politics in the Age of Black Power” at the Museum of Modern Art from May 15 to May 18. The exhibition will focus on the radical politics of performance, art, and politics in the United States since the 1960s.“Dreamland’s selection of artists and works on the exhibition will focus on integrations across disciplines, reflecting the diverse histories, identities, and political visions of the seventy-four participants,” said Michael Govan, director of the museum. “This will be the first time MoMA has presented artists and works on the exhibition in twenty-one years and reflect the museum’s long-standing commitment to championing the work of visual artists.”The seventy-four artists who are participating in the twenty-third edition of the “Dreamland” exhibition are:Andrew Brown, Italy/PeruArt of the Telephones", "The next Biennial should be held in the coming months. “After all, the Biennial is a part of who we are as a society, and we must do everything in our power to produce and preserve this knowledge for future generations,” said Frank J. LaBate, president of the University of Minnesota and the agency’s previous owner. The museum has been closed since June 20 because of Covid-19.\n\n\nThe Bennington Biennial in Vermont has been forced to cancel a series of performances and other events because of the coronavirus, which has spread to more than 130 countries and territories. The cause of the coronavirus outbreak is unknown, but coronavirus experts say that coronavirus is linked to the coronavirus, which causes a severe coronavirus outbreak, and that adults need not be infected to become sick. The outbreak began in Haryana, India, on December 16, 2014, and has since spread to at least 21 countries and territories.The first cases were reported in India on December 5 and were confirmed the following day in Delhi. According to the New York Times, the coronavirus was first detected in China on December 6. However, the disease is only transmitted through close", "The next Biennial should be held at the V&A in London, and will be held in the following locations: Bristol; Cardiff; Brighton; Bristol; Cardiff; Chelmsley, UK; Croydon, UK; Darmstadt, Germany; Ghent, Belgium; Helsinki, Finland; London, UK; Leicester, UK; Milan, Italy; New York, NY; New York, NY; New York, NY; New York, NY; New York, NY; New York, NY; New York, NY; New York, NY; New York, NY; New York, NY; New York, NY; New York, NY; New York, NY; New York, NY; New York, NY; New York, NY; New York, NY; New York, NY; New York, NY; New York, NIMBY-IST.  All events will be free to the public, with VIP access to the venue and a commemorative gift of one hundred gifts from the Biennial Fund.  The event will be hosted at the V&", "The next Biennial should be held in 2020, he said. \n\nLike most of the curated exhibitions that comprise the Museum of Fine Arts (MFA), the institution has been grappling with the fallout from the coronavirus. Last month, director and CEO Marc Glimcher announced that the museum would delay the opening of the ninth edition of the twenty-eighth Venice Biennale until at least March 22. “I never envisioned that we would be forced to postpone the opening of the next iteration of the Art de Venice,” Glimcher wrote in a letter to the MFA’s board of directors. “But as we continue to research and plan for the future, we have come to the conclusion that the best course of action for MFA is to remain committed to the Art at Venice for the foreseeable future, and to continue increasing the museum’s exposure to the greatest international art markets, including China.”The MFA’s new venue at 1,200 square feet will be inaugurated with “On the Death of Louis Vuitton” in 2019, and its first exhibition, “The Wright Brothers/Pop Art,” will open in 2020; and next month, the museum will", "The next Biennial should take place in the summer of 2021. In a letter dated March 23, 2020 from the organizers, the institution wrote: “The new plan will reflect the current themes of the exhibition, but will also provide a new introduction to the field. We are quite confident that this year’s exhibition will not only be exceptional, but will be a milestone in the history of the Biennial.” The show will be on view through July 28.\n\n\nThe Museum of Fine Arts (MFA) in San Francisco has appointed Alex Nowak as its next chair. The seventy-one-year-old artist, whose works are often influenced by the interplay of nature and technology, will take the helm from Jodi Throckmorton, who has helmed the museum since 1993, on April 9. Nowak’s appointment marks the first in the museum’s sixty-three-year history. Throckmorton has led the museum since 2007, when the institution opened in a former factory in the city’s Mission District. Throckmorton will step down from the helm on April 9 and will return to her home in Nashville.“The museum is counting on you, the", "The next Biennial should also focus on the history of art in the ’36s, ’38s, and ’54s, and on the presence of art in the city’s public spaces,” Steiner said, “but also recognize the role of art in providing a sense of order and a sense of community in the city.”\n\n\nThe Institute of Contemporary Arts (ICA) in New York has appointed Siyako Nakayama as its next director and chief curator. Nakayama comes to the institution from the Metropolitan Museum of Art, where she has served as chief curator of exhibitions since 2008. She succeeds Alan Thrasher, who retired in February 2019 after a six-year stint as director.“Icassam Fattouh, the current director of the Museum of Modern Art, has been instrumental in the development of the ICA’s curatorial program,” said Andrea Meredith, the ICA’s director. “We are thrilled that Siyako will continue to expand the ICA’s collection of contemporary art, deepen our understanding of the world and our relationship with the museum, and further the ICA’s mission of promoting contemporary art", "The next Biennial should include a novel by an artist whose work engages feminist and queer issues, as well as a work that is a reflection of the creative and social possibilities of the LGBTQ+ community. As we approach the eleventh anniversary of its launch, we look forward to engaging with artists and communities in the Biennial through the upcoming years.” \n\n\nThe National Endowment for the Arts (NEA) announced on Wednesday that it will award more than $170 million in grants and loans to more than 180 arts and cultural organizations in thirty-two states through 2020. The grants and loans are meant to help them \"reach their full potential,” which is to say to encourage them to develop innovative, community-building programs.The grants and loans are available in a variety of ways, including through the agency’s Endowment for the Arts program; grants and loans from foundations and individual donors; and loans from universities. NEA director Elizabeth Anne Haydon said the grants and loans are designed to help meet a variety of needs for arts and cultural organizations, including those of low-income and working-class communities, urban areas, and rural areas. Haydon said: “These grants and loans will help these organizations transition from grants to", "The next Biennial should be held in 2021.\n\n\nThe Spanish government has postponed the opening of the seventy-fifth edition of the Final Art Biennial in Madrid, scheduled for March 2021, due to concerns over the coronavirus. The announcement followed the country’s declaration that it would not accept the coronavirus as a public health threat, and the organization’s release of a statement that said: “The government of Madrid is doing everything it can to minimize the spread of the coronavirus in the state, but it must act fast and decisively.” The statement also said that the government will share information with Madrid and neighboring states in Spain and Portugal via a public health emergency alert system. The announcement followed a series of public health moves by the Spanish government. It announced on Wednesday that it is postponing the opening of the eighty-third edition of the World Health Organization (WHO) in Geneva, which is scheduled to take place in February 2022, and the eighty-third edition of La Vanguardia de Cultura y Cultura Brasileira in Madrid. The festival will now be held in March. The government has also delayed the opening of the seventy-ninth edition of the Biennial de Tijuca", "The next Biennial should be held at the Venice Biennale in the spring of 2021, with the exhibition “Design and Politics” in the autumn of 2021. \n\n\nThe National Gallery of Georgia in Athens is reopening after months of lockdown following the pandemic. In a statement, the institution said that it is currently working to keep the public protected from COVID-19 and expects to be in a position to reopen by spring. The National Museum of Georgia Art History opened in the capital of Georgia’s northeast region on December 7, and the National Museum of Art in Athens reopened in the summer of 2021. The National Gallery of Art, which has served as the venue for groundbreaking exhibitions such as “How Europe Was Lost,” “Twenty Years of Art in Georgia,” and “Tacita Dean: The Art of Erotic Photography” (2016), has also reentered the public’s consciousness. The annual exhibition, which represents the first major cross-cultural exchange between Georgia and the European Union,’s European Regional Development Fund (ERDF), and will present works by thirty-eight artists in the upcoming six months.The catalogue also includes work by twenty-", "The next Biennial should commence in April 2020 and will be hosted by the Museums of Louis Vuitton, Paris; Art Basel, New York; and the Art Newspaper in Zurich. The 2019 edition, titled Life and Death, was curated by Kamala Harris and aired on RTL. The Knightsbridge, UK-based artist and activist Bibi Adham, whose work is inspired by “trans-humanist ideals of a post-human world,” was awarded a CBE in the Order of the British Empire (OBE) for services to art. The new CBE, which comes with a lifetime achievement award, will be presented at a ceremony in Westminster Abbey on March 28. Related artists who were nominated for the honor include Rendris Barba, José Luis Campos, Yelena Shagalova, and Kari Wilke. The 2019 prize winners will be announced on May 23.\n\n\nThe National Poetry Collection in America, the National Museum of American Art, and the National Museum of Women in the Arts in Washington, DC, have teamed up to present the 100th edition of the National Poetry Slam, a free, all-ages", "The next Biennial should take place in 2022, the year that the exhibition will celebrate its sixtieth anniversary. The exhibition will also be the last as MFA Los Angeles. It will debut two new works, 1794: A Beautiful Dream, by John Oehlen, and L.A.S.I. (Live Asian Skin), by Yin Yang, at the Los Angeles County Museum of Art (LACMA) in October of 2019.\n\n\nThe Los Angeles County Museum of Art (LACMA), the home of some of the most important works of American art, has announced its transition to a new, nonprofit entity called the Contemporary Arts Center (CAFC). The organization will operate under the museum’s new name, the Contemporary Arts Center Trust, and will hold two biennial exhibitions a year, beginning in 2020, and will host a free public event calendar throughout the years 2020 and 2021.“The contemporary arts center is a collective institution,” said MICA director Christopher Klein. “It is our mission to provide a platform for contemporary art that is free from corporate sponsorship and corporate control. We saw this transformation as a very real opportunity to provide a unique public experience that is curated to", "The next Biennial should be held in mid-March.\n\n\nThe Museum of Fine Arts Glasgow (MFA Glasgow) is planning to open its new $46 million art museum, Museum of Modern Art (MoMA), the Museum of Fine Arts in New York (MoMA-New York), and the Museum of Contemporary Art (MoCA), between March and March 2021. The announcement was made at a press conference held in the museum’s new £500,000 building, which will be inaugurated by a new exhibition, “Theatrical History: Contemporary Art in the 1950s” (March 22–March 28), and will be followed by a solo exhibition of work by William Eggleston, “Time for a New World: Modern Art in the 1950s.”The three venues were selected based on their historical and contemporary relevance. MoMA previously announced that it would open its new home in the former Chrysler Building in Downtown Manhattan on March 28, and the museum is currently preparing to open its new space in the Chrysler Building in April. The MoCA in Dearborn, Michigan, rebranded from the late 1970s to the late 1980s and will be inaugurated by a new exhibition, “S", "The next Biennial should be held in 2019. The themes of the biennial should be “Firsts and Lasts,” which is how the artists describe the exhibition. Further details about the new exhibition will be announced in 2020. \n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that its curators have been selected for its next edition of the Experimental Art and Design (EAD) award. The 2019 multidisciplinary prize, which honors emerging and established artists, was held at the Marlow Museum in London from March 18 to March 21. The awards were established in 2009 to help support the development of the emerging artistic practice of experimental design. The prize jury comprised Damien Glimcher, Nathalie Merl, and Joe Mullen; the winners were chosen by a jury comprising illustrators, artists, writers, and sculptors.Based at the London-based Institute of Contemporary Arts (ICA), which was founded in 2004 by art historian Margot Stewart; art historian Martha McLaren; and art historian Stephen Deuchar, the artists were selected for their first projects, which will be presented in June. Altogether, about forty works will be presented in the exhibition, which will run from March 17 to March 20. The", "The next Biennial should take place in 2022 and will examine the evolution of the Guggenheim as a cultural institution from a military museum to an arts space. The institution is currently undergoing a $300 million overhaul led by the Swiss architectural firm MAD Architects and will aim to be even more open and accessible to the public.\n\n\nIn the wake of the 2016 terrorist attack on the French satirical magazine Charlie Hebdo that left nine people dead and dozens injured, the French government has unveiled a series of new security regulations intended to prevent the spread of terrorism. The country’s public security minister, Christiane Taubira, announced on Monday that the new regulations will make it a criminal offense to provoke terrorism. The measures were prompted by the November 2015 terror attack on the offices of the satirical weekly newspaper Charlie Hebdo in Paris, which claimed the staff of Charlie Hebdo were responsible for inciting violence against journalists. The office was attacked by masked men who shouted “Allahu Akbar” and other anti-Semitic slurs and an armed robbery took place in the storeroom, which was connected to the magazine, shortly thereafter.“The police were able to intervene in a number of ways,” Taubira told the French daily newspaper Le Figaro. “The", "The next Biennial should be held in 2021. \n\n\nThe Kazan-born, Hong Kong-based artist Arturo Carbone has been selected to represent Japan in the 58th edition of the Kōshū Triennale in Osaka in 2020. The announcement was made on August 5, as part of a special issue of the Japanese magazine Artforum, which also featured a selection of Carbone’s works from the exhibition in the lead-up to the event.“In order to decide on the organizers of the 2020 Kōshū Triennale, the board of the Triennale of Japan decided on the basis of the artist’s contemporary visual and sculptural practices,” said Kōshū Museum director Masaaki Harada. “We have long been following the artist’s work, as we have been following her work and sculpture since she first drew us attention in the 1980s, and we have been closely following her artistic development throughout the years. We were also impressed by how strongly she represents the spirit of Japan and her collaboration with other artists.”In 2020, Carbone will create a new work for the exhibition, which will be presented by the Tokyo-based artist Fat", "The next Biennial should showcase the work of over 1,500 artists from forty-eight countries and should take place at the Arts and Design Biennale in Paris in 2022. The exhibition will also include a retrospective of the work of the artist François.“I have always been inspired by the way that the art of Francis and others like him has been taken up by and displayed in the past and how it has been adapted to suit the needs and tastes of the times,” said Olivier Biennale, president of France’s National Arts Council. “Francis is the quintessential contemporary artist, and his work is used in a very specific sense today. Biennale has a responsibility to recognize that this is a point of departure for us and for the future generations.”The Biennale was founded by Jacques-Yves Prouvé in 1981 and has participated in the Paris Forum every year since 1987. Its current iteration, “50 Years of Biennale,” will resume in September.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Catherine J. Mattson as its next chief curator of American art. She succeeds Kathy L. Coleman, who was hired to lead the", "The next Biennial should be convened by the end of the year, and will be led by the curator of contemporary art Fotopost and the curator of contemporary art at large, Mona Hatoum. The exhibition will take up themes such as occupation and identity, migration, and the environmental crisis, and will take the form of a public forum in the center of the city.The event will conclude with a reception for the public, which will be held at the København neighborhood in central Copenhagen from March 16 to March 19. The program will feature a selection of works, including work by Sydney-based artist Jørgen Høge, which is on display in the exhibition “Future in Distress.” The show will also feature works by local and international artists, including Julie Ault, Pilar Corrias, Sara Hurd, and Jocelyn Norbury, and will be organized in collaboration with the artist collective the Folkeborg Art Museum, which recently completed a major renovation project in the city centre. The Biennial, which has taken place in the city center since 2005, featured work by Adriana Barroso, Sonia Bachetto, ", "The next Biennial should be held in 2022.\n\n\nThe National Endowment for the Arts (NEA) has released guidelines for the future construction of the American Museum of Natural History (AON) in Washington, DC. The guidelines, which were written by architect Daniel Libeskind and were released on March 2, outline the steps that should be taken in the construction of the museum. “The AON will be a museum of the American dream. It will be a place where people can come together and explore the extraordinary world around them. It will be a place where they can learn about the creative possibilities of nature and about the history and art of the American Southwest,” said Elizabeth Anne Osborn, the chair of the AON’s board of directors. In addition to outlining the steps needed to construct the museum, the guidelines outline the creation of a formal query regarding the design of the building. The AON’s design, which is based on a concept from American Gothic , is inspired by the architect’s previous design for the National Museum of African Art in Washington, DC. The new institution will be built on an eighteen-acre campus with a concourse that will function as a public plaza.Although the AON will", "The next Biennial should take place in 2020, and the first in 2021. While the Chicago-bred artist’s latest exhibition, “How I Met Your Mother,” opened at the Los Angeles County Museum of Art last month, she is currently collaborating with artist and educator Laura Marling on a new project in collaboration with the Museum of Modern Art (MoMA). The exhibition, “Laura Marling: Untitled,” will open in the museum’s new, $9 million, Hayden Gallery in April. “I’m thrilled that I’ve got another year left on my contract, and that I’m able to do more work with more amazing artists,” said Parke. “I’m very proud of any artists, especially those whose work I’ve been following for years. The work I’ve done in the past two years is always starting from the same place, and always shifting.”In addition to her teaching and curating, Parke has also served as the editor in chief of Artforum. She has authored more than fifty books, edited dozens of publications, and curated hundreds of exhibitions. She is a MacArthur Fellow, and she is", "The next Biennial should take place in January 2021. “We need more than a few good years to establish truly sustainable practices, and we must do more than just talk about them,” said Christian Duurholt, president of the Biennale. “We need to act.” Art historian and biennial expert Midas Mavik, who curated the Biennale in 2007 and 2007, said: “This is a political act, and it requires political will. We have a few years to go.”The Biennale’s founding committee also appointed Alice Kupperhoff as its inaugural director. The curator was nominated for the prize in the 2018 awards, but withdrew from the competition when an illness forced her to cancel a large-scale project in February 2019.Production of the Biennale’s conceptual works is currently underway in the Netherlands.\n\n\nThe Yashica Center for Contemporary Art (Yashica) in Nagoya, Japan, has produced a new exhibition that examines the work of contemporary Japanese artists and objects in a combination of narrative and photorealism. The show, “The Birth of a Dream,” will open at the Yashica Center on September 30", "The next Biennial should be held in 2020. The first was set to take place in 2002. In a review published by the New York Times, Kenan Ando wrote that the exhibition “arguably exemplifies everything that is good about art. The galleries, the exhibitions, the writing, the conceptualization, the execution, the intention, the vision, and the spirit of the piece.”\n\n\nThe Italian government has announced that it will attempt to compensate the artists whose works were stolen during a series of burglaries in Milan in which at least seventy-two works were damaged or destroyed. The thefts took place on the city’s Rialto district between April 13 and April 20, with many of the works in their entirety missing and reported stolen by thieves who were looking to get their hands on the works of the prestigious classical artist Alberto Barbera. The works featured in the series were stolen in one of the worst cases of Art Basel’s “Unprotected: The Art of Alberto Barbera”, which will run in the museum’s collection gallery from March 20 to March 21, 2020.“The state is working with institutions to offer support and assistance to those affected by the burglaries, and it is", "The next Biennial should take place at the Museum of Fine Arts (MoFA) in New York on March 21–March 29, 2020. The theme for the 2019 event was “In Defense of the Body.” The biennial, which was curated by artist David H. Bernhardt, was selected by the Metropolitan Museum of Art for its presentation of work by artists such as Edward Boudy and James Turrell.\n\n\nThe Art of Berlin, a joint initiative between the European Arts Foundation (EAF) and the Berlin-based architectural studio Fenske GmbH (GFH), received a gift of eighty-nine artworks from the German government in the form of a commission for a large-scale installation of work from the 70s. The work, titled “Die Politischen Gesellschaft,” will be installed in the former Reichstag building in Berlin, and will be part of a major renovation of the city’s iconic Brandstalle, which has served as the site for cultural events and performances for over sixty years.“This is the second time the Berlin government has gifted works to Fenske GmbH and the first time it was a commission for a large-scale installation", "The next Biennial should be held at least once every two years, with the option of reopening at any time. The next edition will be organized in partnership with the Biennale de Lyon, which has been working with the city of Lyon to get the event moved to the city. The event will be on view from March 16–March 22, 2020. The biennial will be held at the Musée d’Art Contemporain in Lyon from March 15–March 17, 2020 and at the Musée d’Art Henri in Paris from March 16–March 22, 2020. \n\n\nThe Stedelijk Museum in Amsterdam has received a gift of more than sixty works by Dutch artist Willem de Kooning from the late philanthropist and collector Richard De Zegher. The donation includes twenty-four works by the artist from his collection that were on display in the museum’s exhibition “Marco Polo’s Paradise and the City of Venison,” which ran from January 21, 1981, to March 12, 1983, and was staged at the Venice Biennale. The works, which were acquired by the legendary collector in a deal that spanned thirty years, include paintings, sculptures", "The next Biennial should be announced in the second quarter of the year. The ten-year period since the first edition of the exhibition has been cancelled has been extended four months to March 17. The maximum number of exhibits per year has been increased to thirty-four from thirty-three. The exhibition has been rescheduled for the twenty-fifth edition at the Stedelijk Museum in Amsterdam. The 2019 biennial will be held at the Institut für Kunst mit Heft der Moderne, Hamburg. The date for the 2020 edition is yet to be fixed. The biennial’s organizers are calling for a “new balance between art and culture,” and a “reflection on the past.” The institution will also be inaugurated by a dedicated exhibition of contemporary art, “Amerika: Art and the Past,” which will explore the legacy of artists in the formative years of the twentieth century. It will be followed by “Amerika’s Contemporary Art: Art in the Age of Anthropocene,” which will highlight contemporary works, and “Amerika’s Art in the Age of Genocide,” which", "The next Biennial should focus on “the study and reopening of the archives of the Soviet Union and the Soviet Union” and will unveil the exhibits “from the archives of the Central Committee, Soviet Union’s State Archeological Commission,” in the summer of 2020.The pavilion will be composed of six new works, and will consist of a central gallery for the exhibition and a research library. Plans for the pavilion were initially approved by the State Duma in February 2019. However, the project was stalled due to the coronavirus pandemic, and the pavilion was never inaugurated. The painting was considered a masterpiece of the Soviet Union’s Cultural Heritage, and the pavilion was created by the State Central Archive of Art of Moscow.Since its inception, the Biennial has provided the public, artists and scholars, with a platform for reflection and reflection on the evolution of modern culture. The programme has also inspired a number of other works, including the photographs “Beginning with the New Year” (2019), which featured the work of a young Soviet artist co-created with Joji Noda; “Stalin and the Soviet Union” (2018), by the artist Gennady Gusev", "The next Biennial should focus on a rethinking of what it means to be a modern, contemporary expressionist painter, moving beyond the automatism of the earlier works and on the possibility of using art as a catalyst for social change. The theme of the forthcoming exhibition “The Future Is Present,” will be the future as we experience it, and the exhibition will be divided into two parts: an urban-landscape work and a multimedia work.The first part, “The Future Is Present,” will engage with the contemporary predicament of those living in cities, an urban landscape that is both visually stimulating and considered structurally unsound. The second part, “Meshes,” will explore the relationship between art and the environment, in both its physical and intellectual forms, and will focus on the roles of women and construction in the world of contemporary art. The full list of participating artists is as follows: Beatriz de la Peña, Mexico CityWangechi Mutu, EthiopiaWael Ghani, Iran/FranceWangane Bawa, KenyaWangane Bawa, KenyaWangane Bawa, KenyaWangane Bawa, KenyaWangane Bawa, KenyaWangane", "The next Biennial should include works by artists who have entered the exhibition since the exhibition became an online event in 2008; a retrospective of work by the artist Radicte Barkey, which will be open in the United Kingdom in 2020; and a selection of works by American artist Tom McCarthy, which will open in New York in 2021. The inaugural exhibition will take place at the American Folk Art Museum in Kansas City, Missouri, on June 23–June 26, 2020.\n\n\nThe Pérez Art Museum Miami (PAMM) announced today that Hernán Cárdenas and Angel Otero, the founders of the contemporary art nonprofit the Pérez Art Museum Miami, have launched a new biennial at the institution. The biennial aims to provide a unique experience to visitors to PAMM, and to expand the museum’s international reach. The Pérez Art Museum Miami’s inaugural edition will take place in September of 2021.PAMM’s new format will include four biennials, each curated by an artist from Mexico City. The first biennial will focus on the local history of pop culture, followed by the art of the contemporary, with a focus on American and Mexican artists; the", "The next Biennial should take place at the Museum of Contemporary Art in San Francisco between May 5 and May 6, 2020. “The World I Live Now: A World of Our Time” will present the first collection of the new museum’s new division, 'The World I’m Now: A World of Our Times” in the United States and the first exhibition dedicated to the artist-in-residence programme, which will be held in September 2020.  The move means that the museum will shift its focus from its current exhibition, “Writing in 18k,” which focuses on the history of painting, to “Writing in the Present: An Exploration of the Present.” The announcement of the redesign was made at a ceremony held on Thursday, May 3, at the Museum of Contemporary Art in London.  The museum has yet to announce a new director or chair.  \n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that Carla Colonna has been appointed as its new director, effective immediately. Colonna comes to the institution from the London-based firm MCH Group, which is based in Paris and has offices in Milan, New York, and Zurich", "The next Biennial should be held in 2021.\n\n\nThe Mexico City Art Museum (MCA) has come under heavy criticism for moving the exhibition “Art 3,” a five-decade retrospective of photographs taken during the height of the Cold War, from the institution to a museum in the city’s Azienda de Cultura Centro de Artes in southern Mexico City. After the museum revealed that it would be closing on March 31 due to Covid-19, critics attacked the move as an “unacceptable departure from the MCA’s original mission.”A petition launched by Museum of Contemporary Art (MoCA) staff in protest of the museum’s move to the Azienda de Cultura Centro de Artes (ACCA) in December 2019 said that the museum was moving “to an exhibition-driven model that does not reflect the museum’s important collection and will not reflect the values of the museum.”The petition was signed by 134 former employees of the MCA, as well as several curators and staff members; the union representing museum employees; and a group of teachers from the institution’s Azienda de Cultura Centro de Artes", "The next Biennial should be held in 2021, and the next iteration in 2022.”\n\nThe Rockefeller Center in New York has announced that it will reopen in the summer of 2021 as part of a new collaborative initiative between the United States and China. The project, which was initiated to address the long-term sustainability of the city’s art, will bring more than three hundred exhibitions and activities from around the world to the city and will include the opening of a new museum of Chinese art.The first exhibition, “Polaroids in Chinese Cinema,” will be on view in the summer of 2021. The exhibition will consist of twenty-nine works by thirty-four Chinese artists, including Xu Zhijie, Yuxi Wang, and Su Yijie. The eight-hour film, which is slated to run for sixteen weeks, will introduce American audiences to the art of Polaroid photography and will showcase the work of twenty-two artists, including Zhang Yaxuan, Li Yili, and Xi Jinwen.Called “Polaroids in Chinese Cinema” (北霤錯), the show will feature sixty-two Polaroid Polaroids by twenty-five artists, including Zhang Yax", "The next Biennial should be held in the fall of 2020. \n\n\nArts and Culture Minister Mona Hatoum has announced that the Algerian artist Saad Ramadan will become the first West African to receive the prestigious Gold Lion. The announcement follows the announcement of the exhibition “In the Path of the Sun,” a solo exhibition dedicated to Egyptian and Islamic art and presented by the newly established Algeria & France. The exhibition won the first prize at the seventy-third edition of the Cairo Biennial, held last March, and will be presented at the newly reopened Egyptian Institute of Modern Art, which opened in Algiers last April. \n\n\nThe Alamgir Arts Complex in the northern city of Algiers has been granted a $35 million expansion of its facilities as part of a $141 million project that will allow it to host more work by artists, including Raphaël Granat, Terrence Henry, and Rene Magritte.The center’s director, Michael Abdelkader, told the Art Newspaper the plans, which were made in cooperation with the state of Algiers, would allow the architecture firm to present more works in the northern city. The project was carried out in", "The next Biennial should commence in 2021 and will span thirty-eight years. The theme of “Dynamic Reasoning” will be reconsidered several times throughout the twenty-eight-year period. The biennial will be organized in a way that ensures the continuity of the history of the work as well as of the history of the artist.“The contemporary artist is always confronting history anew, yet also confronting the past with the hope that these moments will be of value in shaping the future,” said Larissa. “We are excited by the relaunch of the Biennial, which is the result of a decade of passion and commitment by the participants, a reflection on the possibilities of art for a contemporary future.”The full list of participating artists is as follows:Jessica Alba: 2019 Biennial Art\n\nStuart Grant: 2019 Biennial Art\n\nYelena Medvedova & Elena Gelb: 2019 Biennial Art\n\nCheryl Boone: 2019 Biennial Art\n\nMichael Jordan: 2019 Biennial Art\n\nHarriet Tubman:  2019 Biennial Art\n\nWangechi Mutu: 2019 Biennial Art\n\nThe Cal", "The next Biennial should commence in February 2021 and will consist of three distinct sections: “Themes of Beauty and Disease,” which will examine the aesthetic and philosophical concerns of art with a view to synthesizing the work of contemporary artists; “Movement and Movement,” which will examine the relationship between art and the environment, with a view to exploring the nature of the biennial; and “Coming Together,” which will address the theme of the biennial.The following year, the exhibition will be held in the same building in which it was organized, and in the same location, with a program of lectures, presentations, workshops, performances, and performances. The event will be held at the same time each year for thirteen years.\n\n\nThe American artist and educator Mark B. Redfield, a pioneer of New York’s art and culture, has died at age seventy-two at his home in Brooklyn, New York.Born in New York City in 1941, Redfield studied at the School of the Art Institute of Chicago before moving to the University of Michigan to study art history. After graduating, Redfield moved to New York to open a paint shop, and in 1949, Redfield married the late Barbara Mink", "The next Biennial should bring together work by artists, academics, writers, and students from all over the world and be organized in the spirit of the art world, through a collaborative, open, and participatory format. It should also reflect our shared vision of how art can play a transformative role in bringing about change and helping create social change.”The auction house is currently closed. On Friday, September 24, the auction house will reopen with the exhibition “PARTY,” a selection of paintings by Leonor Varejão and Álvaro Paz. The exhibition will run until September 26.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has acquired the fifty-five works by French avant-garde photographer Judith and Olivier Messager\u0097a group of four artists in their mid-twenties whose practice spans photography, video, sculpture, performance, and collage\u0097a three-dimensional excision of the human figure that dramatically reconceived the visual language of the artist’s avant-garde.The Messagers are the subject of a new exhibition at MoCA, “The Messager Sculpture,” which opened on September 21 and runs through October 12.", "The next Biennial should be held in the fall of 2020 and would run concurrently with the 2020 Winter Olympic Games. “It is our ultimate goal to have a civic space in the city that is welcoming to all, and that allows people to come together and connect,” said Fritz Mathies, chair of the committee and the mayor of Bremen. The organisers are currently working with the city of Bremen and the state government to raise the funds to build the venue. Organizers are now hoping to raise the funds to commission artist Markus Wahl to create a new exhibition that will take the theme of the Biennial to the next level. Wahl will create an immersive installation that will project the themes of the Biennial into the life of a small town in the state of North Rhine-Westphalia.  The event will also include a talk with the artist and will serve as a platform to introduce Biennial participants to the local community.\n\n\nLithuanian art historian, curator and writer Gabriela Nistor has been appointed the next chair of the Ponti Institute of Art in New Delhi. Nistor comes to the institution from the Kiel Museum of Art (KMA) in Germany, where she", "The next Biennial should focus on the historiography and design of the subjects of the exhibition, with a view to reconstructing their visual and conceptual histories. The Prize for Excellence will be presented by the Japanese artist Kiyomi Takahashi, who is currently known by his first name, Kiyoko. The prize ceremony will be held at the Yokohama Museum of Art in Tokyo on February 27.\n\n\nThe Museum of Contemporary Art (MoCA) in Miami Beach has hired veteran curators Will and J. Frank as its next curators-in-residence. The museum will begin accepting applications for the positions in the coming weeks, and the final selection of ten will be made by the institution in August. Frank and I, a panel of five artists, will begin working with the museum as early as June.“In the current climate, with so many exhibitions and exhibitions-within-art-making, it is a real challenge to find a way for curators to expand their practice beyond the museum,” said Frank. “What we’ve come to expect is a strong vision and the ability to think through curating carefully and systematically. That’s what makes this job so meaningful to us.", "The next Biennial should be a dissection of the history of the body as it intersects with the world of the afterlife. “A ‘memoir of the Body” should be a serious study of the human body’s interconnections with the world of the afterlife.” The 2019 edition will take place in Tokyo and will run for three weeks from April 25 to April 29.The 2020 iteration will be held in Hong Kong and will run for four weeks from April 27 to April 29.\n\n\nFollowing the 2011 murder of George Floyd, which took place in the exact location of the neighborhood where the artist was last seen alive on May 25, 2011, a jury in New York determined that a man named the defendant in the case is responsible for Floyd’s death. According to the New York Times, the man was convicted of two counts of second-degree murder and was sentenced to thirty-two years in prison.In the case of the death of Floyd, the prosecution rested its case by alleging that the artist’s family members and friends were behind the attempted murder. The defense argued that Floyd was the aggressor. The defense was unsuccessful in two trials.After a third trial, which took place in January 2018,", "The next Biennial should focus on the film industry, exhibiting the work of a select group of South Asian artists, which is currently understudied and underrepresented in the art world. Art historian Anupam Gupta, who curated the inaugural Biennial, said: “The exhibition will draw from a wide range of sources, from what is currently available in the art world to what is to come. We will also be able to see how the art world of today is threatened and how art might be transformed by new technologies and platforms.”The 2019 edition of the event, entitled “Art Between the Lines,” will explore “the stylistic threads of urban life from India, to Afghanistan, to the Gulf, to the West Indies,” and will be curated by Indira Jaising, who will also serve as the curatorial director of the inaugural Biennial. The show will include works by seventy-seven artists of African descent. The 2019 edition of the exhibition will also include a new project about the West Indies, “What Is Africa?” (2019), and “Body and Soul: Restorative Art and the West Indies” (2019). Jiri Saar, the artistic director of the Galeria de Art", "The next Biennial should be held in 2021 and will encompass the work of fifty artists from twenty-five countries. The exhibition will be organized as follows:The exhibition will be hosted by the Kölnischer Kunstverein (KU) in Königsberg; the Kunsthalle Konstanze Kunst; and the Museum Karlsruhe.\n\n\nThe Smithsonian’s National Museum of African Art (NMFA) in Washington, DC, announced today that it is planning to open a new digital platform that will bring more than one hundred works by eighty artists to the Smithsonian’s DC galleries, including the National Gallery of Art, the Metropolitan Museum of Art, and the Museum of Fine Arts in Boston. The platform will allow the public to see all works presented by artists from Central and South America and will feature daily collections of work by artists of African descent.The platform will debut in 2021 with the installation of “The Surroundings,” a series of paintings by Agustín Armaro, Evaristo Arteaga, and Diego Rivera, which will be shown in the galleries during the exhibition’s second season. The exhibition will also welcome works by artists of African descent by way of the African di", "The next Biennial should be held in London in the autumn of 2022. “Themes of power and control have long been central to the landscape-based work of Marić,” said curator Huw Edwards. “Her work has been collected by the Royal Academy of Arts, the National Gallery, the Tate, and other leading museums. Her photographs are now widely seen, explored, and admired. Her dramatic sculptures, often inspired by her own experiences and often from the perspective of an object, are now celebrated.”In the summer of 2018, the Royal Academy of Arts in London staged a biennial of Marić’s work, “Marić: Power and Control,” which was organized by the Academy of Arts and the National Museum of Britain, and featured work by artists such as Shimon Abraham, Nihal Cibulsi, and Vanessa Hellberg. The show, which was co-curated by the Academy of Art and the Museum of Fine Arts, London, was held at the Academy’s London location from October 20 to December 19, 2018. \n\n\nThe National Galleries of Scotland (NGA) is planning to raise nearly $10 million to construct a new twenty-four", "The next Biennial should be held in 2025.\n\nThe following year, the institution opened a new memorial garden in honor of the “martyrs and heroines of the West,” an eclectic group of artists whose work is interwoven with that of countless others whose artistic practice has been profoundly influenced by the contemporary and the Spanish-American art of the past. The garden is currently undergoing a $500,000 restoration.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has received a gift of twenty-five works by the late Colombian painter Juanita David-González, including thirteen paintings by the late Brazilian João Brindisi, a sculptor whose work was influenced by the work of the late Spanish master Adriana Alves, and five sculptures by the late Chilean architect Enrique Peiño, a sculpture of an armadillo and a guerilla war.In addition, the institution has added three new works by the late French painter Pierre-Auguste Renoir to its collection; three works by the late German painter Franz Halsall; and two works by the late Nigerian painter Paul Gauguin, a painting of a man and a woman as well as a drawing of a dog and a cat", "The next Biennial should include a new essay by a visiting artist and a keynote address by the artist. The Juneteenth Biennial will be held in Northampton in January 2021. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $70 million donation from the Boston-based philanthropists Daniel and Edna Rothschild. A little-known art historian who worked tirelessly to establish the MFA in the early 1960s, the couple made the generous gift in recognition of their philanthropic work and their philanthropy’s impact on the museum and its collection.“Since the gift, the Rothschilds have invested in the MFA’s art museum, its collection, and its future,” Edna said. “They have invested in the future of the arts and the MFA. It is especially meaningful and inspiring to see this amount of money in recognition of their philanthropy and the incredible contribution it has made to the museum.”The donation is one of a number of milestones in the museum’s history. The Rothschilds donated $10 million to the museum in 1966. They also spent over $1 billion on the institution before its founding in 1968. In 2008, the couple raised $250 million", "The next Biennial should take place in 2020 and will consist of sixty eight artists from twenty-six cities and thirteen countries. The exhibition will be organized as a combination of a retrospective and a performance, and will feature work by the same artists, rehearsed in the same way every week, that are shown in the annual exhibition.The remainder of the exhibition will include a selection of new works by artists from twenty-six other countries as well as works that have not yet been placed in the biennial.The show will be based at the new Smithsonian–American Art Museum (SAAM) in Washington, DC. The biennial will be inaugurated by a presentation of the work of artist Carlo Cossuoli, then follow with a discussion of the work of a select group of artists that will be showcased in the exhibition. The biennial will then close with a discussion of the biennial’s collection of art.“The exhibition is a unique opportunity for the artists from Asia, Africa and Latin America to showcase their work in an international setting,” said Brenda L. Levey, director of the Smithsonian American Art Museum. “Each artist in the exhibition represents a unique and compelling vision and the effect will be enhanced by a diverse array of cur", "The next Biennial should be in 2019. “The new collection of biennial exhibitions will be a new set of exhibitions, works, exhibitions, readings, interviews, and other special projects, as well as a new format for the exhibition,” said Jean-Claude. The new museum will host five exhibitions each year, including “Theater of Operations: the Gulf Wars 1991–2011” (2019), “The Berlin Protests of 2017” (2018), and “Nirvana” (2019). In 2020, the museum will show “Avant Gardes” (2019), “Anselm Kiefer” (2019), and “Hermann Hesse: The Children” (2019).Biennials will also be organized in New York, Paris, and London.\n\n\nGoldsmiths College London has received a £195,000 grant from the London-based organization the Willams Fund to extend its engagement with the arts and cultural sector in the city. The organization’s ‎Passionate Scholar and Students ‎(PSYC) coalition, led by Maud Atkins, has been working with the college since 2015 to promote its engagement with the arts", "The next Biennial should focus on culture and design in the context of a positive future. We hope that this exhibition will prove an occasion for new and exciting artistic project.\u0097•\n\n\nThe Jackson Pollock Foundation, which supports the work of contemporary American artists, has awarded $1.26 million to twenty-seven artists who have signed on to its scholarship-through-2019. Called the Jackson Artists Scholarship, the program, which was established in 2017, is open to visual artists living in the Jackson, Mississippi, metropolitan area. “This is a historic year for Jackson, and it is especially meaningful to witness the remarkable surge in artists from the Jackson metro area as we inch closer to reopening in 2021,” said Kelly Montgomery, director of the Jackson Art Museum. “The Jackson Art Museum is fortunate to be recognized as a leader in supporting artists in the Jackson metro area, and we are honored to receive the 2019 Jackson Artists Scholarship. The scholarship is an excellent example of our ongoing support of artists in Jackson and the state of Mississippi.”More than 1,500 Jackson-based artists who have received the scholarship can apply for a total of $3.3 million in support of their work. The 2019 cohort includes Jamie Clark, Hanna", "The next Biennial should be on the subject of the play. \n\nArtforum has partnered with the NYC Museum of Modern Art (NYCMoMA) to present the first Exhibition of Work by unknown artists in the United States, a series that will highlight work by twenty-four artists in the city. The exhibition will be held at the The Paley Center for Media in New York from February 13 to February 16 and will include works by Sol LeWitt, Alyson Gentry, Erin Holliday, and Joe Haldeman. The exhibition will also introduce the public to the work of Scandinavian artist Jonas Kemper and highlight the work of Ronnie Gupta, an American Indian artist who lived in the area of the Russian Empire. An earlier version of this article said Yanira Joaquin was the first living artist to be featured in the exhibition. It has been corrected to Joaquin.\n\n\nThe Museum of Modern Art (MoMA) in New York has expanded its use of origami to three floors of the museum by designing a new building in which the art is stored. The project, dubbed “The Spine,” was initiated by architect Foster + Partners", "The next Biennial should be held in the fall of 2021. In an interview with Artforum, Adrienne Edwards, director of the show, described the program as an extension of the studio. “The studio is a central feature of the exhibition, but it is the point of view—not the painting—that is important. The show is about the artist, not about the artist’s work.”\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) announced today that it has received a $10 million donation from Louis Vuitton. The donation, which came from the Louis Vuitton Foundation, comes two weeks after the museum’s board of trustees declared that it is not able to continue with its plan to put the two luxury goods giants—Tate and Haute Couture—out of business.The announcement follows a series of events that has unfolded in the past two months that could have a significant impact on the future of the museum. On March 26, the foundation lifted its moratorium on new investments and capital expenditures and launched a campaign to raise $10 million for the museum’s renovations. The next day, the museum’s board declared that the end of the partnership was nixed and that", "The next Biennial should be held at the Institute of Contemporary Art (ICA), in the Rhine-Westphalia region of Germany, in 2021, the Art Newspaper reports. The event will be led by curator Susanne Nicolai and will run from September 5 to September 7, 2020. The seventy-six-year-old biennial, which is currently on view in the museum, and will feature works by forty-eight artists including Pierre-Auguste Renoir, Gertrude Stein, and Roger Trescarra, will be inaugurated by a performance by artist and composer Marc-Antoine Watteau that will feature the work of swiss artist and composer Lévy Gorvy between June 9 and June 11, 2020. The exhibition will also introduce new themes that incorporate social and historical issues such as the legacy of the former German chancellor Helmut Kohl and the contemporary museum’s relationship to China. It will also prepare the ground for a new exhibition at the Museum in a few weeks, titled “Matthias Biennale,” which will run from May 28 and May 31, 2021.\n\n\nThe Museum of Contemporary Art (MoCA), New York, has announced that it", "The next Biennial should be held in February 2020.\n\n\nThe National Museum of Art in Washington, DC, has issued a public apology for not adhering to a 2014 pledge by Donald Trump to defund the institution if it did not dismantle two controversial Confederate monuments—one of Robert E. Lee, another of General Robert Sherman, the Confederacy’s last president. The move prompted a furious backlash from Democrats and Republicans, including then–President Barack Obama, who called the move an “unacceptable” attack on civil rights.The apology, issued on April 3, read: “We recognize that not every American is familiar with or comfortable with the current condition of our nation and its institutions. We acknowledge that this discussion has taken place several times over the past several years and that there are still many outstanding questions about these issues. However, we believed this statement was the right thing to do and we stand by it.”In response to the statement, National Park Service spokesperson Debra Mitchell said: “We do not recognize these monuments. We consider them historical markers, not memorials, and have never approved their removal. . . . We have been transparent about our position throughout the campaign and have made clear that we fully intend to move them", "The next Biennial should take place in 2021, and the inaugural exhibition, titled “Post-Modern: Theory and Design” (2019), will be staged at the Museum of Modern Art (MoMA). \n\n\nThe Brazilian artist Luis Luiz Pérez has died at the age of eighty-one due to complications from kidney disease. Born in Porto Alegre, Luiz Pérez is known for his visual art, which employs painting, photography, drawing, sculpture, and installation to address the themes of the body, the environment, and the soul.Born in 1929, Luiz Pérez studied under the avant-garde Brazilian artist Salvador Dalí at the art school in São Paulo and joined the avant-garde in 1948. He continued his studies at the School of Architecture and the Museum of Modern Art, which opened in 1954, and joined the post-structuralist movement in 1960. In support of the post-structuralist tradition, Luiz Pérez created the sculptures Body of a Woman in 1967, a work that reworked the structure of a man’s body, a woman’s body in 1974, the photographs Body of a Woman (1973–74), and the"]