["The next Biennial should be held in 2021 and will consist of sixty artworks by seventy artists and will present a selection of works by artists from all over the world, including artists from the UK, France, Germany, Italy, and Japan. “It’s not just about the art—it’s about the narrative,” said Zhang Yilun, cofounder and director of the Shanghai Art Museum. “Themes such as ecology, education, art, and national identity are central to the Biennial.”\n\n\nThe Metropolitan Museum of Art in New York has appointed Amy Newey as its new deputy director for collections. Newey will be responsible for developing and executing the museum’s collection strategy, and will take up the post on January 6, 2022. She succeeds Kara Crawford, who departed the institution last March to head the Brooklyn Museum, and will begin her tenure in January 2023.“Amy is a trailblazing curator who has transformed the Met’s collection strategy, and her vision for the future of the Met is a game changer for our collection,” said Drew Scott, the museum’s director. “Amy combines superb curatorial and institutional knowledge, a deep", "The next Biennial should reveal its selection of the best contemporary artists from the diaspora, including a selection of more than 2,000 works by young artists who are either currently living or are currently undergoing residence in Hong Kong. While selected by a committee chaired by the Hong Kong mayor, Carrie Lam, the event will be open to the public only from October 15 to October 18.The Biennial, titled “One Hundred Years of Hong Kong Art,” will be held at the Chinese Cultural and Art Festival (CCAF), Beijing; the National Museum of China; the Hangzhou Museum of Art; the National Museum of Modern Art, Beijing; the Museum of Contemporary Art Hong Kong; the Art Museum Guangzhou; and the Art Museum Taipei, Taipei, and Sapporo, Japan.The Hong Kong Art Museum and the State Museum of Fine Arts, Beijing are participating in the exhibition, which was organized by the Hong Kong–based nonprofit organization China Stages. The event will feature the work of artists such as Zhenya Shory, Yuichiro Nakao, Mark Sousa, and Zhenya Tarka.\n\n\nFive men have been sentenced to twenty-eight years in prison and fined $14.5 million", "The next Biennial should be held in 2021 and will feature the work of eighty artists, including Anuj Dutt, Nandini Krishnan, Ajit Gupta, Tuma Ghose, Anupam Gupta, Shilpa Gupta, and Arundhati Bhardwaj. The 2019 event marked the twenty-fifth anniversary of the museum and was held in the Wankapuram village of Thiruvananthapuram.\n\n\nThe Egyptian pavilion at the Fifty-Ninth Venice Biennale has announced the artists who will represent Egypt at the 2019 edition, which will take place in May. The list of participating artists is as follows:Ali Hadef, Cairo, EgyptZaneer Haidara, Cairo, EgyptPia Camil, Rome, ItalyNima Nabavi, Rome, ItalyZineb Estévez, New York, New York, New York, New York/New York, New York, New YorkZineb Kohn, New York, New York, New YorkVincent van Gogh, Amsterdam, The NetherlandsCairo Ashraf, Cairo, EgyptContinental Fund, New York, New York, New York, New York, New York, New YorkPia Camil", "The next Biennial should be in December 2022. The first was in January 2019.\n\n\nArtforum has learned that the artist-run space Patriotic Retreat will be shuttered indefinitely due to the coronavirus, which has declared a state of emergency in all fifty states.The California-based nonprofit—whose name refers to a group of individuals who gather in areas where the coronavirus is circulating—has been struggling to hold its doors open since it was forced to temporarily close in January. “We are devastated and heartbroken that the doors will not be closed to prevent the spread of Covid-19,” reads a statement issued by the organization. “Every day we delay is another day we are not able to care for our animals, our staff, our artists, and our visitors.”The center, which was established by artist Thaddaeus Georgiou and his wife Lourdes in 2012, was one of the first in the United States to announce the closure of its doors as a public health precaution. Prior to the pandemic, the space had announced that it was “working hard to re-open.” “At this point we simply don’t know when the doors will be", "The next Biennial should focus on the histories and contemporary issues of physical change, the interconnectivity of art and life, and the necessity of a moral and political life; should include a reflection on the role of art and health in the contemporary environment. The theme of the third iteration of the biennial is “Life After Death.” The event will take place at the Württembergischer Kunstverein Stuttgart from September 3 to September 6.\n\n\nJerome Bachelier, the Italian director of the Museo d’Arte Moderna (MAS), Florence, has announced that he is suspending his work in the country’s capital, the region of the Italian Alps, from September 27 to 29 and that he will return to Rome in October. According to the Art Newspaper, the eighty-two-year-old director of Württembergischer Kunstverein Stuttgart, who also serves as president of the Bachelier Foundation, received a letter from Italy’s Culture Ministry on August 5 informing him that he was not exempt from paying a fine of $14 million due to his failure to prepare for El País’s May 22 edition in the city of Rome.", "The next Biennial should be in 2022, and the first could be as soon as 2024. The question is whether the art world will still require an exhibition-based model in 2030.\n\n\nThe National Gallery of Art (NGA) in Washington, DC, has received a donation of $6 million from the Kay Jewelers of New York. The gift includes $2.5 million from Kay Jewelers and $3 million from the Kay Foundation, which is dedicated to supporting the artists and organizations that are the core of the New York–based nonprofit organization, Mothership. The donation also includes $2 million from the Kay Foundation in support of the Kay Artists Relief Fund, a grant program that supports artists whose work is in need of financial assistance.The donation is part of a larger gift package totaling $8.5 million that was given to the NGA in 2015 by Kay Jewelers and the Kay Foundation in support of the NGA’s art program. The gift also includes a $1 million gift for the Kay Foundation’s annual art-world conference.The National Gallery of Art previously received $12 million from Kay Jewelers in support of the Museum of Modern Art in Washington, DC; the Metropolitan Museum of Art, the Museum of Modern", "The next Biennial should be held in 2021\u0097the date of Biennale de Lyon\u0097and this year’s edition will focus on the history and future of the United Kingdom and the exhibition will be opened by a combination of traditional artistic and visual elements. “The Diaries: From the Biennial to the Future” will open on October 28.The biennial will be staged in three parts: a biennial history lecture, an exhibition of biennial works, and a special exhibition. The biennial lecture series, which will be presented by the British artist Ruth Anderson, will delve into the history of the exhibition, featuring works by artists such as David Hockney, Robert Irwin, and Thomas Merton. Interviews with key figures in the biennial, including the biennial director, Alice Bailey, and Michael Rosenbaum, the festival’s curator of technology, will explore the threefold history of the exhibition.The exhibition of works and interviews will be divided into three parts: “From the Future to the Past,” a presentation of images by artist Milan Kundera, “From the Past to the Present,” and a discussion about the future of art. The show will run", "The next Biennial should be held in 2022.\n\n\nGeneral Admission: Click here for full-day admission prices.\n\n\nFrieze has announced the artists who will be featured in its upcoming edition, which will be held at the Los Angeles County Museum of Art (LACMA) from March 22 to March 26 and will be held in conjunction with the Los Angeles–New York Film Festival. Titled Art of the Party, the biennial will highlight the work of thirty-eight artists and will feature a selection of new works by twenty-nine artists. “This year’s Frieze New York City Preview is an example of the art world’s commitment to diversity, inclusion, and accessibility,” said Frieze New York director Robert Mapplethorpe. “Frieze has given filmmakers and audiences a show with a powerful message, so that they can engage with and experience art and artmaking. The themes of the biennial are inclusive, connected, and social, and the artists chosen for the project reflect this core theme.”While the biennial will focus on contemporary art, the next edition will include works in the collections of MCA Collections and will include programming that will have a cultural", "The next Biennial should be in 2020. It would be staged in the city of Guadalajara, Mexico City, and Mexico City’s Centro de Cultura Público, and would bring together at least forty artists from the Americas. Followers of Leonardo da Vinci (1569–1630) will be represented by Lumière; Christo, Dario, and Rienzi; Cindy Sherman; and Sylvia Hensley. The theme for 1941’s Biennial of the Americas is “My Body, My Life.” The 2019 edition featured Elizabeth Goodale, Kathryn Biggs, Lionel Blum, and Hans van Doren.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has received a $100 million donation from the International Fund for the Arts (Fundação), a subsidiary of the state-owned São Paulo State University (SPU), in an effort to support the work of Brazilians who are fighting for economic, social, and cultural equality in the country’s modern-day version of Brazil’s Workers’", "The next Biennial should focus on rethinking the history of the urban experience in the city, its means of transport, and its social, political, and economic relations among the regions and with the cities. It should organise exhibitions on the history of art and architecture in the city as well as on its relationship with the rest of the world.”The proposed event, titled “The Global City,” will take place at the New Museum in New York from March 19 to March 21, 2020. The exhibition will feature thirty years of artworks by around two hundred artists, including Gabriele Marcotti, Roger Tarr, and Robert Irwin, among others that were created during the Global South. It will also feature original and selected works by artists whose practices are related to the Global South, including Ma Piaf, Anton Chiguhi, and Mimi Laudel.“We are excited to collaborate with the artists and the city of Beijing to develop an exhibition that elicits the Global City’s spirit and engagement,” said Peter H. Dutton, director of the National Gallery of Canada. The gallery will present its first Lower Ring Road project with the artist and artist-collector, Sam J. Jones, in October", "The next Biennial should be held outside of Seoul, Japan, at an undisclosed location, in mid-November, and will be held in the autumn of 2021. In addition, the next iteration of the next Biennial will focus on indigenous art from the Americas and will focus on congruency with the theme of the festival: the need for visitors to the exhibition to experience the Art of Being in the World. As previously announced, the Biennial will also include the art of Masayoshi Nara, who lived in the city of Nara, in commemoration of the twentieth anniversary of the first event. Since the show will be held in an open-concept setting, the artists will be able to explore their work directly on the exhibition’s walls, which will be a mix of permanent and temporary works. The biennial’s curators hope that the show will inspire people to return to Japan for more art, and to encourage them to think about the world through their own artworks.\n\n\nThe Library of Congress recently approved a $900 million expansion and renovation of the collections at its Washington, DC, location, the National Museum of Fine Arts (MMFA), which will make the construction of the museum a reality.", "The next Biennial should be held in the year 2020. This is just the beginning of our plans to present a significant amount of art in the next ten years. We are committed to providing opportunities for young people to explore and connect with their subjects and to supporting an international community of artists. Last year, we committed to launching a new First World Series exhibition, and we have already started to see the results. I look forward to continuing to work with fellow curators, artists, and colleagues to advance the programme in both directions so that it continues to deliver high-quality art in a contemporary setting.”Hannah Sharpe, chair of Tate’s international department, said: “We are incredibly pleased with the progress of the biennial, which we believe will provide an exciting opportunity to see unprecedented work by our curators, and to the artists who have made such significant contributions to the programme in terms of their own works and the work of their peers. We are confident that the new format will deliver an exciting exhibition for our audiences in 2020.”\n\n\nFollowing a gunman killed ten people at a gay nightclub in Orlando on Sunday, June 12, Florida passed a sweeping anti-discrimination bill prohibiting discrimination based on sexual orientation, and the upcoming legislative session", "The next Biennial should have been held in Seoul in 2018. Unfortunately, the organizers had planned to hold an extra exhibition in the city in 2019. However, due to the pandemic, they decided to cancel the exhibition and move the event to Tokyo.In an email sent to the art historians and the public on Monday, the organizers said that the decision to cancel the exhibition was made in light of the unique circumstances at the exhibition, which was also staged in the United States, Europe, and Asia, and was the only work of the exhibition to be relocated. The invitation to use the venue had been originally received from the American artist and curator George Nolfe, who was in Seoul at the time of the pandemic. The exhibition is scheduled to open at the museum in the spring of 2021, and will be presented by a group of American artists, including Ashley Eckstein, James Ernest, and Amanda Ross-Ho, in the spring of 2022. \n\nNew York’s Metropolitan Museum of Art, which recently laid off or furloughed more than one hundred employees, announced on Thursday that it will not reopen next March, and instead will rely on donations to keep the iconic institution operating at a minimum of", "The next Biennial should be held in 2020.\n\n\nThe Museum of Modern Art (MoMA) has launched a new initiative, “Above and Beyond: Art and Artifacts,” to support artists in managing their collections and preservers of art in the future. The platform will offer free admission to participating museums through June 15, 2020.The program will offer curators and researchers curated exhibitions, development of new public programming, and donations of donated works. It will also include a scholarship award that will encourage the collection of work by artists who have not been included in the public exhibition program. The scholarship will count toward the museum’s “Grand Challenges: How Do We Rebuild the World” project.The announcement marks the second phase of an initiative that began as part of the $1.2 billion renewal of the Javits Center, which opened to the public in 1996. The first phase, which was led in large part by Richard Armstrong and featured artists such as Robert Irwin, Nee Yeoman, and Jasper Johns, was canceled in 2008. The second phase is currently underway. The ambitious program will provide $1.8 million in grants to over eighty arts organizations and will support the preservation of artworks that have never been exhibited or", "The next Biennial should be in 2019. Featuring an exhibition of more than fifty works by twenty-five artists from the United States, Europe, and Japan. This year’s event will also feature an opening reception at 7 PM on September 17. The full list of participants is as follows:Academy of Arts & Design, New York, NYAcademy of Fine Arts, New York, NYAcademy of Fine Arts, New York, NYAcademy of Arts, New York, NYAcademy of Fine Arts, New York, NYAcademy of Arts, New York, NYAcademy of Fine Arts, New York, NYAcademy of Fine Arts, New York, NYAcademy of Fine Arts, New York, NYAcademy of Arts, New York, NYAcademy of Art, New York, NYAcademy of Arts, New York, NYAcademy of Fine Arts, New York, NYAcademy of Fine Arts, New York, NYAcademy of Arts, New York, NYAcademy of Arts, New York, NYAcademy of Arts, New York, NYAcademy of Art, New York, NY", "The next Biennial should be a revival of the history museum’s first year, a presentation of the work of the current exhibition programme and an examination of the exhibition’s contemporary format. The theme of the upcoming edition is “Open Worlds.” The exhibition will be held at the institution’s new home in the Nineties, in the building that was previously occupied by the museum, on the north side of the museum, in a building that was completed in 2005.The Biennial was founded by the two men who would later become the founders of the Danish Design Museum: Lars-Erik Arnebrand and Ingvar Kamprad. Over the course of its twenty-year history, the exhibition has exhibited artist installations by artists such as Moritz Selke, Peter Szczepanski, Carl Gjerde, Ulla and Neus, Lévy Gorvy, Marcel Proust, and Edward Kretschmer. The exhibition will also feature photography by the artist Marcia Angell, who was the first to use the term “photographer” in the context of an exhibition.\n\n\nThe British Royal Shakespeare Company (BRTC) has appointed Stephen Deuchar as its new artistic director. Deuch", "The next Biennial should be held in 2021. \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than 120 works by twenty-four artists, including Domenick Dolce, César Ayr, Alejandra Freire, Adriana Lazara, Charlotte Cuddy, Alex Pappas, Luke Turner, and David Veldhuis, and will soon be able to display them in a new building designed by the Italian architect Takashi Tezuka. The artworks will comprise works by eight artists—Cécile B. Evans, Francesca Pascual, André Breton, Luis Candy, Robert Hogue, John Lindsay, Charles Marlow, and Ashtanga Mabasa—and will be inaugurated by the exhibition “All That Remains,” which will be broadcast live on the internet.The gift includes eleven works by seventeen artists, including Frank Gehry, David Hockney, Jean Nouvel, and Jean-Michel Basquiat. The venue will be staffed by a curatorial team made up of Vivian Mathews, Joshua Mathews, and Joseph Zwirner, as well as an exhibition staff of three", "The next Biennial should be held in September 2020.\n\n\nThe Art Newspaper reported that the British American Tobacco Company (BAT), which manufactures Nicorette cigarettes, is preparing to open a new $100 million production facility in the Czech Republic. The new facility will be dedicated to the production of cigarettes and will be located on the same campus as the tobacco factory in the Czech Republic.The new facility will be opened in August 2022 and will be located near the former site of the old BAT Factory in the city of Novy Rakov, in the Czech Republic.The new facility will produce 20,000 cigarettes per year and will bring together the company’s manufacturing and distribution facilities. The opening of the new factory will coincide with the annual Art Basel New York fair, which will take place in May 2020.Details about the new facility are still under discussion, but the company claims it will be able to raise funds for the project through its subsidiary, BAT Infrastructure, which is a public-private partnership between the company, the government of the Czech Republic, and several private companies. The plan is to be completed in the first half of the year, with the production of cigarettes scheduled to begin in the second half of the year.Commenting on the new hub,", "The next Biennial should be held in Helsinki in the fall of 2021. It is also considering opening a branch in London in the mid- to late-2020s. \n\n\nThe Institute of Contemporary Art (ICA) in Paris has announced that it is preparing to welcome visitors again in 2021 following a temporary closure due to the Covid-19 pandemic. The institute had temporarily shuttered in March due to concerns over an increase in Covid-19 cases, but reopened in April with a new set of regulations that curtailed gatherings and other activities.The institute’s director, Nathalie Bondil, told the Art Newspaper that the reopening of the space will enable the ICA to continue to engage with a diverse group of artists and audiences across the city, including in the suburbs, in an effort to create a “more intimate environment” for art. The center has previously reopened in April as part of a $579.5 million expansion. “Sooner or later, we have to face the fact that we are no longer in a space, a moment, a single moment, when art and the environment are not intermingled, as much as possible,” Bondil said. The ICA, which is housed", "The next Biennial should be held in 2021. Be it.\n\n\nThe Geneva-based nonprofit Historical Art & Design (HAAD) has announced that it is collaborating with the French Ministry of Culture to create a catalogue of the works of French avant-garde painters. The initiative was announced in an open letter by thirty-eight artists and designers, including Anna-Sophie Bochereau, María Berrío Pérez, and René Magritte, who wrote that the work should be organized into twelve broad categories\u0097herbalism, design, performance, photography, sculpture, performance-video, painting, photography-video, and mixed-media.“The initiative aims at creating a comprehensive picture of the cultural heritage of France,” reads the open letter. “This catalogue will be a representation of the cultural heritage of France, and will include biennial and exhibition works, translations of works, and other materials related to the cultural heritage of France. The catalogue is the cultural heritage of France, and it will be presented as part of the official celebrations of the centenary of the fall of the second French Empire.”The initiative will be launched with th Hollis Longitudinal Assessment,", "The next Biennial should be set up at the museum as soon as possible, and we should organize a presentation of the work in the coming months. Biennial this year was much better organized, with a better program, and better access.\n\nThe museum is planning to move the entire collection to a new facility in Taiwan's capital, Taipei. The move follows the museum’s decision to close its current exhibition space in the city, known as the Modern Art Museum, and move the entire collection to a new building in the city, known as the Arts and Heritage Museum (AMY).The new venue, which is slated to open in 2021, is being built by the architect Reden Institute for Contemporary Art in Hangzhou, China. It will be inaugurated by the museum’s new exhibition, “The Death of Louis Vuitton: The Struggle of Fashion,” in November. The museum’s previous home in the city was a three-story, 252,000-square-foot building, which it had occupied since 2009. In order to move the collection to a new space, the museum will move the collection’s medieval and Renaissance holdings from its current home in the temple of the Sun in the downtown center of", "The next Biennial should be announced soon and will be presented by BiennaleBox office.\n\n\nThe Massachusetts Museum of Contemporary Art (MMCA) in Boston has initiated a new program that will launch in 2021 that will partner with local, neighborhood, and regional nonprofit arts organizations and will bring them together for two days. The twenty-fourth edition of the Massachusetts Creative Alliance (MCAs) will include a number of new and emerging works by artists participating in the three-day event: Tahira Alam, Christopher Alexander, and Melissa Armstrong.“We are thrilled to partner with these amazing venues to further amplify the ways in which MA’s creative ecosystem can continue to thrive and thrive in the face of this pandemic,” said director Christopher Bedford. “MA’s artists are integral to the city’s creative ecosystem, and we are grateful to them for their dedication and for inviting them to explore new and exciting ways to express their voices.”The program will launch with a lecture by David H. Watson, director of the Elizabeth Argyros Program in the Arts, and will culminate with a reception with the artist collective Cahiers du Cinéma. The event will be", "The next Biennial should be held in 2021 and will be organized under the terms of an agreement signed in 2016. The exhibition will have the theme “New Attitudes and New Relationships” and will be staged in both Los Angeles and New York City. MGM Grand has also announced that it will host a new exhibition of work by the company’s artists in Spring 2021. The first show, which will be held at the company’s Los Angeles location, will be “New Perspectivas: Art and Politics in the Age of Black Power” and will feature work by fifteen artists, including Caroline Askew, Joey Bosa, and Olu Olu. The show will run afoul of MCA’s contractual obligations to the Museum of Contemporary Art in Los Angeles (CAOLA) and will be limited to twenty works.“We want to extend a warm welcome to our new MCA colleagues and fans in Los Angeles,” said David Kordansky, the CEO and president of the museum. “The staff and board of directors are ecstatic about this milestone achievement and the new partnership. As we look ahead to the next three years, we will continue to prioritize the artistic meaningfulness", "The next Biennial should take place in the spring of 2021. The 2019 exhibition was held at the Kodachrome, Tokyo and featured works by artists such as Shigeo Takemoto, Satoru Inoue, and Toshio Akiyama.\n\n\nThe Institute of Contemporary Arts (ICA) in Paris, France, has received a $1.3 million donation from the Sotheby’s Group, which also served as the source of the $900,000 that was set aside for the 2020 edition of the European art fair. The donation comes at the end of an eight-year partnership between the organization and the Sotheby’s Group, which began in 1985 and lasted until 1992.The partnership’s directors, Frédérique Baillot and Charlotte Soudoun, said: “We are extremely proud to have contributed to the success of this year’s EAA Biennial, and we are especially pleased to receive this significant asset as it comes during the last year of its four-year cycle. This year’s EAA Biennial witnessed a record number of exhibitors, its highest number ever. The exhibition attracted more than 1,200 visitors, including artists, collectors, and", "The next Biennial should be a triennial, instead of a series. That would be a fantastic continuity for the biennial. It would develop over time to become a biennial of a new theme each year. It would never be a single exhibition. I would love to see it. I would like to see you. I would like to bring you, and I would like to bring the next generation of artists to this place. I would like to see the world through your eyes.\n\n\nThe Museum of Fine Arts (MFA) in Houston announced today that it has received a gift of twenty-five works by more than thirty artists from artist-in-residence (AIR) organizations in the city. In a ceremony last week, the museum revealed that the gift was delivered by the Addison R. Edwards Foundation in partnership with the Brazos River Arts and Cultural District, the city of Houston, and the Brazos River Watershed Association.The gift includes works by artists such as William Eggleston, Christopher Wool, American photographer and painter, and former Addison R. Edwards Foundation trustee, and Houston native, Tanya Bonakdar; Jason DeMesko, a Houston native, and Houston-based painter J", "The next Biennial should be held in the summer of 2021, following the reopening of the Museum of Modern Art in the fall of 2021. It will be organized as a series of exhibitions during its three-day event, with an exhibition opening at 10 AM on Saturday, June 6, and a closing reception at 11 PM on Sunday, June 7, at the West Village. This year’s event will also include the first public visit of the new Bangalore-born architect, K.S. Khanna, who is helming the exhibition, “Building Stories: Architecture to the Future,” curated by the architect and curator Girma Ambani. The exhibition will highlight the work of thirty-two artists, including Vishal Sharma, Manish Nandakumar, Samantha Jantajik, and Mukesh Ambani, and will also explore the concept of memory and the relationship between memory and memory. The artist-run museum will also present a retrospective of the work of Manish Nandakumar and Nita Krishnamurthy.\n\n\nThe National Galleries of Scotland (NA), which has been struggling since it announced the reinstallation of its permanent collection in January 2019,", "The next Biennial should be held in 2020–21, with the aim of reviving the unique, locally-based art that is currently under threat from the bulldozing of historic sites and the expansion of urban areas.The museum is collaborating with the Delhi-based architecture and design firm Zaha Hadid Architects to create a new series of exhibits that will provide a glimpse into the former shipping yard. The inaugural show, “Secrets of the Shipyard,” will feature 101 artifacts that were salvaged from the old shipyard where the museum is located, and will be presented at the museum in December 2021. The second show, “Women in Architecture,” will open at the new municipal city hall in 2021 and will be followed by a “Women in Design” exhibition in 2022.Museum director Deepika Goyal said: “I have been deeply inspired by the powerful and anarchic spirit of the city. The building of the museum is an extension of this vision and of presenting history in its most alive, lively, and colourful form. As I explore the history of the city, I hope to build a museum that will feel as transformative for Delhi as the museum is for me.”\n\n\nThe University of the Arts", "The next Biennial should also involve a new exhibition, titled “For the Evolutions,” to be held at the museum every two years, and will be led by Elsa Pfeifer, director and curator of the museum. In May 2019, the theme of the museum will also shift, with the exhibition “For the Evolutions” in honor of the theme of the biennial. The public will also have the opportunity to view the new exhibition “For the Evolution” at the gallery through the museum’s new digital platform on October 6.\n\n\nThe National Gallery of Canada is launching a new digital platform that will bring together the world’s greatest art historians, curators, and historians to help curate Canadian exhibitions. The platform will offer curators and historians the tools they need to build online audiences for projects and will include live streaming and digital versions of exhibitions, events, and seminars.The platform will be led by two curators, Ceri Paquette and Jane Panitch, and will debut on May 22. The art experts’ association is crowdfunding the project, which will be co-produced by the National Gallery of Canada, the Canadian Academy of Arts, and the Toronto Art Gallery, and will", "The next Biennial should think in terms of a cross-section of artists, with the same or substantially different interests, and will be a collection of work in a single exhibition. We must consider carefully the ways in which the first exhibition, Architecture of Life, funded by the Künstlerhaus in the early 1980s, and the second, “Together/Leaf,” funded by the Zentralarchivs Museum der Kunst/Berlin in 2017, pose questions over how art and architecture can function in a complex contemporary world.\n\n\nThe Museum of Fine Arts (MFA) in Boston is launching a new initiative, “Artists’ Cities,” that will provide grants and help small arts organizations in Boston and surrounding areas. The program will focus on artist-driven initiatives that will be centered around the themes of artists’ journeys, partnerships, and experiences, and will aim to help these organizations achieve financial independence through the arts and create new opportunities for local, regional, and national artists.The first round of grants will support the creation of an exhibition for the Kullberg Center for Contemporary Art at the University of Massachusetts at Amherst (UMass) that will showcase work by ten", "The next Biennial should take place in Seoul at a venue that has recently welcomed visitors from around the world, including the United Kingdom and France. The theme of the event is “Life and Art in Contemporary Art,” and the exhibition will explore the creative work of artists working in the twenty-first century, including Alan Kistner, María Berrada, and Busy Philipps.The exhibition will also honor the biennial’s founder, Park Hyun Jung, who passed away in February at the age of seventy-nine. Park was born in Seoul in 1931. He graduated from the Academy of Fine Arts in 1964 and later received his Ph.D. from the Academy of Fine Arts in 1965. He lived and worked in Paris, Tokyo, Seoul, and New York, and taught at the Academy of Fine Arts in California, the New School in New York, the Art Institute of Chicago, the Art Institute of Chicago, and the Art Institute of Chicago. Biennial director Kim Woo-sung said: “Park Hyun Jung and his colleagues have built up a strong legacy in the field of artist-designed homes, so we deeply appreciate their efforts to support the exhibition in spreading the message of life and art", "The next Biennial should meet in the fall of 2020 to receive the 2018 award. “We are deeply moved by the awardee’s ongoing dedication and commitment to the museum, to our collection and to the collection as a whole,” said Richard Armstrong, director of the museum. “At the same time, we recognize that most people have other priorities and that the museum is not a permanent solution for everyone. So we have decided to make some changes in terms of the exhibition schedule, the programming, and the exhibitions, and will present a biennial that we think is better for everyone.”The changes will be made to the exhibition calendar, which will return to the Memphis Museum of Art (MMA), sometime in the spring of 2020. In January 2019, the committee that selects the thirty-two winners of the $20,000 biennial award, the Memphis Art Museum, unanimously voted to reduce the duration of the award, which is awarded annually. Current winners include Jemima Brent, Suzan-Lori Parks, and John Wesley Powell. The biennial will now be held annually at one of the twelve museums in the city, with a total of twenty-four artists represented. The biennial will now be held annually", "The next Biennial should focus on artists and their work as an invitation to re-imagine the possibilities of documentary photography. All the more so as it closes with the exhibition “Between Two Worlds: Contemporary Art and the Black Death,” which is curated by Adrian Piper of the Musée du Quai Branly. The biennial will be held at the Pérez Art Museum in Mexico City from December 6–December 8, 2019. The full list of participating artists is as follows:Anton Büchner (Germany)Bambang Saar (Ghana)Bana Mukund (Liu)Bashir Ahmed (Pakistan)Bashir Ahmed (Pakistan)Bashir Ahmed (Pakistan)Bashir Ahmed (Pakistan)Bashir Ahmed (Pakistan)Bashir Ahmed (Pakistan)Bashir Ahmed (Pakistan)Bashir Ahmed (Pakistan)Bashir Ahmed (Pakistan)Bashir Ahmed (Pakistan)Bashir Ahmed (Pakistan)Bashir Ahmed (Pakistan)Bashir Ahmed (Pakistan)Bashir Ahmed (Pakistan)Bashir Ahmed (Pakistan)Bashir Ahmed (Pakistan)Bashir Ahmed (Pakistan)Bashir Ahmed (Pakistan)", "The next Biennial should be up in 2021. The 20th edition will be held in the city from March 14 to March 20, 2020.The theme of the next edition will be “Gambling on Life, Death, and Other Distances” and the artist will be as follows: Shirley Neeley, David Kline, Jane Albright, Oskar Eustis, and Karl Brauer. The selection of artists selected for the twenty-first edition will be made by a committee chaired by Kunsthal Aarhus, chaired by Joachim Pfeifer.The biennial will be held at the Volfestød museum in Copenhagen and will run from April 3 to April 5, 2020. The city’s collection of thousands of works will be expanded, with the creation of two special exhibitions, “Gambling on Life, Death, and Other Distances,” and “The Duplex Display” (both on display at the Volfestød). The former will guest-cuse Nygård Museum, while the latter will be hosted by the Musil Museum in Oslo.The biennial’s selection committee consists of Kunsthal Aarhus curator", "The next Biennial should take place on the island of St. Barts in the Bahamas next year. This year’s edition will feature works by seventy artists from twenty-two countries, including Kenya, Nigeria, Botswana, and Thailand.\n\n\nThe Zaha Hadid Foundation (SHFB), London, has welcomed eight new members to its board: artists Emile Elissart, Frieda Janssen, Laura Owens, Peter Sidwell, and Tarek Srih. The board also renewed the appointments of Sharmila Sharma, whose first piece for the biennial will be “The Star and the Moon,” on December 5, and Ajay Rajtarajan, whose first work for the biennial will be “Journey Home,” on December 19.“I’m delighted to welcome the eight new board members, who demonstrate the diverse talents and passions of our talented board,” said Shalini Debnath, director of SHFB. “They bring valuable perspectives and knowledge to our work, and will serve as strong foundations for our upcoming work and the work of our board in selecting the next board president. We look forward to working with them.”The new members", "The next Biennial should take place in the Portuguese capital in 2021, which would be the first in the Americas to feature works by indigenous artists. The 2021 edition of the conference, titled “The Wretched of the Earth: Art of Conflict,” will feature the work of fifty-four artists, including Carlos Eduardo Ato, Michael Collins, Julio César Jocson, and Hélio Oiticica.\n\n\nThe Royal Academy of Arts (RA) in London has appointed Adriana Carovani as its new chief executive and director of contemporary art. She succeeds Rupert Sheldrake, who was appointed chief executive and director of the National Galleries of Scotland last month, and will take up the post in January 2021.Born in Hamburg, Germany, in 1960, Carovani previously worked as a freelance curator and writer. Her first book, Art of War: From Warhol to Breton, 2009, was nominated for the Prix de l'Art et l'Arts in 2008 and won the prize. She also cofounded “Carte Sa'Ecole Polytechnique” in Paris in 2006, and served as a consultant for Art of War: The Untold Story, 2017", "The next Biennial should be held in the city in 2020.\n\n\nProspect House, an artist-run development center in Brooklyn, New York, has appointed Alex Yglesias as its next director. Gaining experience in a number of industries, including retail, film, publishing, publishing, and performance, the forty-five-year-old focuses on building new works in relation to the contemporary landscape.In his new role, which will run from May 15 to May 22, Yglesias will work closely with executive director Jen Rosenslee to shape the future of the arts space. He will also oversee the center’s programming, including exhibitions and residencies, and will establish new partnerships with local and regional local organizations.“Alex is an ideal leader and visionary leader of Prospect House, as a venue for contemporary art created by a diverse group of artists, and we look forward to having him as the director,” said Rosenslee. “His vision and drive for the future of Prospect House will directly impact our work and the work of the staff.”Prior to joining Prospect House in 2013, Yglesias worked as an independent curator, writer, and educator in New York City and as a freelancer in", "The next Biennial should be announced by the end of March.  The Art Newspaper is reporting that the prize ceremony will be remarkably similar to that of the first exhibition, and will most likely consist of the same twelve artists presented. The inaugural event was held in the Swiss Alps in March. Just a few months later, the Swiss artist and architect Jan-Öt-Gerhard Richter was awarded the Prix d'Art Contemporain (PACE), the most prestigious award in the art world. The biennial will run for ten years.The French artist, who lives and works in Paris, was also selected to represent France at the Fifty-Ninth Venice Biennale in November 2018. His first solo exhibition at the museum in twenty years will open in January 2020. The exhibition will also feature works by the French and Italian artists Toguo, Piet Mondrian, and Légeraune Pérez. \n\n\nFilipino artist and educator Emiliano Zapata, who passed away on March 23, was one of the earliest recipients of the National Arts Award (NAVA), the country’s national award for outstanding contributions to literature and art.Born in Manila in 1925, Zap", "The next Biennial should also take place at the Museum in São Paulo, which has been closed since May because of the Covid-19 outbreak.  A statement by the Biennale said: “The twenty-fourth edition of the Biennale, which will take place at the Mana Reserve in Manaus, Brazil, on September 13–September 16, 2022, will be a new era for the exhibition and its students. The theme of the biennial is ‘postcolonialism’. The exhibition will take up themes of ‘severity’ and ‘individuation” and will commemorate the fifty years of the contemporary art movement. The exhibition will be themed “The Way of the Artist” and will feature work by twenty-eight artists. The new version of the exhibition will be organized as follows:September 13–September 16Tacita and Her Age: The Art of Voyaging (New York, 2018)September 16–September 21Miniaturistas: Women, the Art of Making (New York, 2019)October 1–October 4The National Sculpture Park: The Art of Sculpture (New York, 2020)October 6–October 9The Invisible: An Eth", "The next Biennial should be offered in September, and the venue should be selected by an international panel of curators and experts. “The application process will be open and accessible to the public,” the organizers said.If organizers are successful in securing the $50,000 grant, the organising body will be required to present a blueprint for the venue, which will be designated as the Biennial House. The entry fee for the exhibition will be waived for the first time, in commemoration of the twentieth anniversary of the institution. The authors of the letter are Frederick Douglass, Henry David Thoreau, and Aldrich von Neumann.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than five hundred works from artist-philanthropist Douglas and Gere Kavanaugh, whose impressive collection includes works by artists such as Oscar Wilde, Franz Kafka, and Thomas Edison. The museum is currently restoring the 80-year-old filmmaker’s former residence and will open up the contentious former Tanger Outpost to the public in 2021.The gift was made during a lengthy and painstaking renovation of the museum, which was completed in 1954. The renovation included the addition of the Dino Art Museum,", "The next Biennial should be held in the first quarter of 2020, and the next one in the second quarter of 2020. The next Australian Exhibition should be held in the United States in the second half of 2020. The next International Biennial in the United Kingdom should be staged in the first quarter of 2021. The next Art of the Gathering should be held in the first half of 2021. The art world’s cultural sector is facing a radical restructuring as museums and cultural institutions brace for a collapse in revenue. The art market is suffering as a result of the coronavirus, which is transmitted mainly from person to person and is spread mainly from close contact, including through close family members, to the extended community. By February 11th, the art world was reporting losses of more than $100 million, and many were predicting a financial collapse.  The Art Newspaper reports that the Commonwealth Bank of Australia is bracing for a financial blow to the arts sector as a result of the coronavirus, which has already caused the deaths of more than 7,300 people in the United States and Europe. The bank expects losses in the region of $100 million. Given the severity of the infection, the coronavirus is treating coronavirus-related", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid, the National Museum of Modern Art in Tokyo, the Museum of Modern Art in Seoul, and the Museo de Arte Contemporáneo Para. 3 in Madrid. The first exhibition, titled “The Modern Monument,” is currently on view in the museum, which inaugurated the program in January 2019. The next Biennial will take place at the Fondazione Beppe Cipolletta in Rome. \n\n\nThe National Museum of Art (MoA) in Washington, DC, has appointed Kate Kenyon as its next director and CEO. She will assume her responsibilities on November 22.“Kate has led the institution through a transformation that began in 2009 with the launch of the Modern Art Museum and has completed in five years, more than doubling the museum’s size and modernizing its operational structure,” said Museum Director and CEO Virginia Govan. “Her impressive track record in growing and maintaining a museum through difficult economic times, in attracting and retaining important audiences, in providing the museum with a critical platform for the exhibition of very rare works, and in working with the", "The next Biennial should be held in 2021.\n\n\nThe Burton Prize, which honors excellence in the field of European art, has awarded $7.5 million to the fifty-eight members of the French-born, Paolo-based group ARTE FRANCE (AFRICA). The award was made with the intention of highlighting the contributions of the group’s founders, the late artist Günther Osterreich and the late video artist Didier Paolini. The sixteen finalists were announced by the organization Arte Povera, which is headquartered in the city of Saint-Etienne, France. “We are truly honored that these sixteen artists have been selected for this year’s prestigious award,” said Arte Povera director Nathalie Baumgarten. The winners are Claude Dufy, Lea Remo, Douglas Gordon, Fanny Hernández, and Jacobin Française, who were nominated by LA-based artist James Turrell, who was also awarded the prize in 2017.Incorporating elements of video art, performance, and performance art, the shortlisted artists have worked within the context of the institution since 2011. Julien Hilmy, a", "The next Biennial should be titled “When Two Worlds Collide,” which will examine the intersection of art and geopolitics, and “The World As We Know It” will be held in 2022. The 2019 prize ceremony was held in the exhibition venue of the same name. “We are enormously proud to have helped to shape this year’s Biennial, and to have played an active role in developing the exhibition, its architecture, its programming, and its themes,” said Romano Cattelotti, head of the Biennial and a professor at the University of São Paulo.  “It has been a great pleasure and honor to work with the jury to create an exhibition that represents Latin American art in the most spectacular of places, the Americas.”\n\n\nThe São Paulo Bienal (SPB) has appointed the Portuguese artist Beatrice Oliveira as the artistic director of the upcoming edition of the Buenos Aires Biennale, slated to run from November 18 to November 20. Oliveira will be responsible for developing the themes and the biennial’s programming of the exhibition, which will take place in the former building of the Brazilian Ministry of the Interior in the capital of Buenos", "The next Biennial should be held in 2021, and the fifty-seventh will be staged in 2022. The twenty-eighth iteration of the festival will be held in 2021.The 2022 edition of the festival will be hosted at the Museum of Contemporary Art (MoCA), in New York; the museum has yet to announce a date for the event. The twenty-ninth biennial will be held at the Corcoran Gallery, New York; cofounder of the group Paul Graham is challenging the Board of Trustees of the institution to establish a date for the event. The event will also be held at the New Museum, New York. The event will be held in conjunction with the annual biennial “The Birth of Modern Art: From Mark to Art,” which will take place at the Broad on November 15. The event will feature the retrospective of photography, with the exhibition “The Death of the Camera: A Critical History” on December 7.“I see a potential here for a truly international point of view,” Anthony Giddens, president of the Royal Academy of Arts, said of the spring exhibition. “I think it has enormous potential to be a fusion of international, modern, and contemporary.�", "The next Biennial should take place in 2025. The most recent iteration of the event wrapped up in 2017. Cultural historian Robert Cuno-Saunders, writing in the April 2018 issue of Artforum, called the exhibition “one of the most ambitious installations to date, full of new ideas and new approaches.” The 2019 edition, “NIRIN” (artists and objects), was organized by director Michael Carey and artist Julian Schnabel, and featured forty-one works that explored the symbolic dimensions of art. \n\n\nThe Museum of Contemporary Art (MoCA) has awarded the British artist Frank Gehry the $310,000 2019 MCA Artist Prize for his work in the exhibition. Gehry, who is known in the United Kingdom and the Netherlands as a proponent of modernism and a prolific designer, was selected for the award by London’s Tate Modern. The institution’s board of trustees, chaired by Sir Michael Coles, chairman of Tate’s board of directors, and director Tim Boardman, also announced the 2020 prizeees, who are: Hyaku Inagaki, Brigid McCall, Michael Powell, Tanya Breslin, and Zoya Surova.�", "The next Biennial should be a double-header, housed in the Museum of Modern Art and the Museum of Modern Art, which already includes a retrospective of Michael Kimmel’s work The Future Is Still Present. “We are working closely with our partners at the National Museum of Art and will present the 2017 exhibition ‘Time for Change: From Visual Art to Contemporary Art,’ and the 2018 exhibition ‘The Future Is Not What it Used To Be.”The exhibition ‘Time for Change’ will include new works by artists who are active in the contemporary scene and will be organized by a committee made up of Sarah Dessen, curator of contemporary art, the Studio Museum in Harlem; René Morales, curator of twentieth-century art at the Museum of Modern Art; Markus Persson, director of the Kölnischer Kunstverein, Germany; and German artist Wolfgang Neugebauer. Next year’s event “Plush,” a memorial tribute to the late artist Thomas Dolby, will feature several new works by the artist and his wife, Valentina, and will open at the Kölnischer Kunstverein in August. \n\n\n", "The next Biennial should focus on issues of preservation and international exchange, with a particular reference to the exhibition of this exhibition, “The Vanishing of the Vanishing American Woman.” The third Biennial should explore the legacy of the artist Mack Sennett, who is best known for his work depicting women as objects and for his influence on modernist, post-Impressionist, and post-Cubist art. The fourth should explore the legacy of the late Jules and Wilfred Stieglitz, who were among the first to work in the contexts of and around art. The fifth and final exhibition will focus on the history of the Düsseldorf house of art Kunsthalle Biennale, which opened in 1960 and closed in 1981, and will include works by the late German designer Helmut Kammerer.Scheduled to open in September 2020, the fourth Biennial will feature work by the Swedish artist Natalia Atlas, the French artist Henri-Claude Boudin, and the British artist Olafur Eliasson. The fifth is Alfred Heirloom, the first exhibition organized by the New Museum in New York since the end of World War II, and will feature work by", "The next Biennial should be held at the Museum of Contemporary Art (MoCA), Los Angeles. The museum will remain closed through March 18. The 2019 edition will be curated by Susan Horbin and will feature work by thirty-six artists. [Update: March 21, 11:30 AM] A statement issued by the museum on April 10 reads: At this time, MoCA is not closed or in the process of shutting down. We will share more information as warranted. \n\n\n\n\nThe Miriam and Ira D. Wallach Art Gallery at Columbia University in New York has named Alexandra Bohman as its next director. Bohman comes to the institution from the Hirshhorn Museum and Sculpture Garden in Washington, DC, where she has served as assistant curator of contemporary art since last summer. Previously, she worked as a curatorial assistant and as a freelance curator. In addition to her duties at the museum, Bohman previously helmed the exhibition program at the Brooklyn Museum.“We are thrilled to welcome her to the Miriam and Ira D. Wallach Art Gallery at Columbia University,” said museum director Nat Stokes. “Her professional and curatorial background and expertise make her uniquely qualified to lead", "The next Biennial should be held in 2021, in the city of Biarritz. The theme “The Garden of Life” will be adapted from the 1949 painting of the same name by Valérie Aichele and Isabel-Sophie Béchardt.[Update: September 10, 2019, 3:04 PM] The upcoming exhibition has been postponed to December 28–December 29. \n\nThe National Geographic Society in Washington, DC, announced today that it is working with the artist-run nonprofit the Center for Art, Design, and Performance (C4AD) to create a new biennial biennial of contemporary art. The new exhibition will focus on “design,” a term that includes both painting and sculpture and will be organized in partnership with National Geographic’s annual gala, which will take place in Manhattan on December 25–26, 2020.“We are thrilled that the work of C4AD will be included in National Geographic’s 2020 National Geographic Society,” said National Geographic director Tod Williams. “This is a moment of great change for us and the field of contemporary art, with the inauguration of Donald Trump as our next president. We look forward to a new chapter", "The next Biennial should be held in 2020. Although it is expected that the 2020 event will be inaugurated by a lecture by Christine Segal, the director of the federal-agencies program at the MacArthur Foundation, the 2020 edition will be produced by the same team that produced the biennial’s previous iteration, which was held in 2008. Its program will focus more on the study of contemporary art and less on the history of contemporary art. The first exhibition will be “A World That Never Was: Remaking Art from the American West,” which will open on October 17. The event will be hosted at the Hayden Planetarium at the Getty Center in Los Angeles and will also be presented as part of the World War II–themed “The Art of War” series. The biennial, which was founded in 2016 by Julian Schnabel, Julian Rosenblum, and Julian Taylor, is currently open to the public.The 2020 biennial will include a selection of work of art from the US’s Northern and Western regions. The US and Canada will be represented by a selection of artworks by artists such as Edward Bienstock, Billie Tsien, and Anita Blair. “After the event, the panel", "The next Biennial should open in January 2020.\n\n\nThe Smithsonian’s American Art Museum in Washington, DC, has received a $25,000 donation from the estate of American painter Frank Stella. The gift, which comes from the estate’s long-standing benefactor, Charles Ehrlich, was made in memory of the late artist who, in addition to his painting and sculpture, also taught at the institution and served as a board member.“While appreciative that the museum has invited Frank to be a part of its future, we have been working hard to ensure that the museum remains free of institutional control and that his legacy remains intact and future-oriented,” museum director Daniel D. Weiss said in a statement. “The gift of Frank’s art and life is a powerful signal that the museum is prepared to become a meaningful and enduring contribution to the nation’s capital.”In addition to the gift of two of Frank’s works for the museum, the institution has received a gift of ten works by the artist’s son, David, from the estate of artist and philanthropist A.J. Delgado. The works are on display in the museum’s new Donatell", "The next Biennial should be held in 2020. Architects are currently working on the project, which will be an extension of the 2009 exhibition “Comparing the Past and the Present” (with the Egyptian exhibition “Egypt: From the Palais de Tokyo” next month), and are hoping to raise ten million euros for the project. “We have been working on this project for more than two years when we were organizing the Biennial of the National Museum of Egypt. It has been a long-term goal, and we have put forward many challenges, to present a painting of the Suez Canal in the Central African Republic in 2020. We are now confident that we have found the best way forward for the artist and his work in the twenty-first century.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has issued a statement regarding the ongoing redevelopment of the Central Park Conservancy’s (CPAC) campus. Since the announcement in September 2019, the CPPAC and the City have been at war over a $300 million decision to tear down the park and replace it with a shopping center, restaurant, and hotel. While the DCLA says that the plans are", "The next Biennial should be held in 2021 and will be given the title of Awards of Excellence. The festival will also incorporate a section on human rights issues. It will be hosted at the South Asian Cultural Centre and will take place in the city of New Delhi.Commenting on the award ceremony, Kunal Bahl, director of the State-run Arts and Culture Institution and Bangalore, said: “As soon as the organizers of the biennial have decided on the dates and have given a timeline for the exhibition, the exhibition will open in the city and will be a platform for alternative and contemporary perspectives. I am very much looking forward to watching the exhibition unfold and to the installation.”In a statement, the city said: “We are delighted that this year’s Biennial has been a success. We are happy to support our artists and the city through this challenging period as they continue their work. We hope that this year’s event will be a good one.”\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is working with the families of four victims of the devastating fire that tore through the museum’s former space in the", "The next Biennial should be held in 2019, with the ­\"Nirvana of Contemporary Art\" exhibition scheduled for 2020. Both exhibitions will take place at the Nirvana Institute in Perugia, Italy.\n\n\nThe Asia Contemporary Art Biennial in Japan, which was originally announced as the first iteration of the innovative event in the country in 2022, has been postponed to 2021. The 2021 event, which kicked off in Japan in September, was rescheduled for October. The reopening of the Biennale will now take place in October 2021.“The 2014 Tokyo Art Summit saw the first wave of new collaboration between artists and institutions in Japan, and our new partnership with the National Museum of Fine Arts is another important milestone,” said Noriko Morishita, director of the Biennale and the National Museum of Fine Arts. “Together, we are working to present a new stage of art in Japan, where art and artmaking can be found in diverse ways, and in the emerging culture of Asia.”The inaugural exhibition of the new partnership, “Art and the Future of Tokyo,” will take place at the National Museum of Fine Arts (NMA), from October 27 to January 3, 2022", "The next Biennial should focus on the environmental effects of the mass production of food, and the next should dedicate itself to the relationship between art and the body. The next will be a dialogue with and a reflection on the life and death of Pablo Picasso, and the next will be a celebration of the creative life of Ingvar Kamprad and its effect on the history of art. We are living through an extraordinary period of history, and it is up to us, as citizens, to respond with respect, solidarity, and imagination to the challenges ahead.\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of thirty-four rare works by William Eggleston, a celebrated contemporary American who taught his craft in a studio his parents built in rural Tennessee. The donation, which came from artist and philanthropist Roy and Elizabeth Eggleston, includes works by artists such as William S. Burroughs, Jasper Johns, Michael Skipper, Paul Gauguin, Louis Malle, and John Currin, among others that have never been previously exhibited in the United States.The museum received the gift, which was made in the form of a gift certificate, from artist and philanthropist Roy and Elizabeth Eggleston. The couple originally", "The next Biennial should be held in 2024. The theme for the 2019 edition, “The New Power Structure,” was “Ensuring the Future of Modernity” and was curated by Oriana Garcia-Baca. The theme for the 2018 edition, “Intersection of Art and Politics,” was “Power in the Streets” and the artists chosen for the 2020 event were Ms. Miro, Mr. de Bont, and Ms. Cattelan.\n\n\nThe Mitsui Corporation, Japan’s major electronics manufacturer, has announced that it plans to invest $6.5 billion into a new research and development (R&D) center in the capital city of Nagoya, led by the Canadian designer, architect, and industrialist Frank Gehry. The $6.5 billion project will aim to advance the company’s research into new types of flexible displays and displays technologies by five to ten years.“We are incredibly excited by the prospect of collaborating with Frank Gehry and his team to advance our research,” said Mitsui CEO and chairman Taro Naito. “This is a truly global and interdisciplinary project, and the project will bring us closer together", "The next Biennial should take place in 2019. Boucher told Artnet News: “I have no doubt that the next Biennial will be a landmark.” The museum has previously held two biennials—in 1985 and in 1993. \n\n\nThe Liverpool Biennial, which was made up of thirty-three artists and collectors\u0097most of whom hail from the UK and several other countries\u0097is set to reopen in 2020. Titled “Liverpool: Forever,” the exhibition will be staged in the city in conjunction with the Liverpool Biennial and the annual Art of the Event, a series of contemporary art events that was organized by the city’s artistic and cultural district.“We are thrilled to open up the new Liverpool Biennial to the public on October 21, 2020, and to introduce the exhibition to a new level of audience and to kick off the new year with a special exhibition of contemporary art at the Liverpool Biennial,” said Juan Pablo de la Torre, the director of the biennial and Art of the Event.The opening of the exhibition will coincide with the opening of the exhibition “Liverpool: From Beyond the Waters,” which will include works by thirty-six", "The next Biennial should have been held in June, but for the sudden and unexpected turn of events. The event was abruptly canceled, and its twenty-six artists and designers, including Maria Hernández, Trisha Brown, and Monir Shah, were forced to move the exhibition dates. The reasons given for the move were specific and varied, but often cited lack of space, the possibility of an emergency, and the resignation of a director. The move has also been criticized by some artists and designers for forcing them to move in order to secure funding. In an open letter dated June 6, Artnews writers wrote: [The move] will hurt the artists who are working on the project, and will undermine the appreciation of the work that was in the final stages of completion. It will be a betrayal of the promise made by the organizers to present an exhibition of works in a similar format to the one curated by Professor Ruanne Abbot and to open up a new space for the art. It will be a breach of the promises made by the organizers to present an exhibition of works in a similar format to the one curated by Professor Ruanne Abbot and to open up a new space for the art.And yet", "The next Biennial should be held in the Spring of 2020. \n\n\nThe Imperial Museum of Fine Arts in Beijing, which was scheduled to open in the summer of 2022, has issued a new five-year budget for 2020, and the institution has also announced that it plans to hold a general meeting of the general public in early 2021, as part of the Centenary Year celebration.In a press release issued by the museum, director Li Bing said: “The 2020 budget for the museum is a departure from the theme of the institution, and it is an historic milestone for the museum. We have been able to assemble a budget that is balanced with the theme of the institution, while still meeting our promise to more than double the museum’s public footprint in the next five years. We hope the end result is a budget balanced with the theme and the museum’s ambitions.”Previously, the museum has been able to draw over two hundred thousand visitors per year, but the new ten-year financial plan, which was released on June 7, states that it expects to draw fewer than 600,000 people in 2021. However, the museum will allocate twenty-two slots for international engagement, and will hold an extra summer exhibition in the first half", "The next Biennial should be held in 2020, said Fan. While the event will be redesigned to take place on the campus of the University of Texas, the campus will not be affected by the pandemic and will be able to hold up to six exhibitions per year, with the possibility of extending the format to ten years. The 2019 exhibition was the first of twelve planned for the campus.The biennial, which would be organized as if it were a contemporary museum, will feature work by between fifty and sixty artists from sixteen countries. The event will take place in the Guggenheim in the Guggenheim’s new and expanded exhibition space, the Frieze Center, which was completed in 2017. “This is a very important milestone for the Guggenheim,” said museum director Bob Al-Qasimi. “This is a golden opportunity to re-imagine the exhibition as an innovative, interdisciplinary platform for the collection of the past, and to rethink the future of the exhibition.”The biennial was founded in 1994 by American sculptor Richard Avedon, who also served as artistic director of the Metropolitan Museum of Art in New York between 1994 and 1997, and German architect Helmut Newton. In 2009", "The next Biennial should take place in Warsaw in May 2020.\n\n\nThe British artist, playwright, and educator Arthur C. Clarke, who championed sci-fi and dreams of a post-scarcity world alongside Harry Hopkins and Douglas Adams, has died at age ninety-three.Born in London in 1940, Clarke first studied under the English artist John Galliano. In the late 1940s, Clarke moved to New York before the war and began his career as a writer and activist. He was awarded a CBE in 1948 and became a professor of art at the University of Cambridge in 1957.In 1963, Clarke was elected as a Fellow of the Royal Society of Arts and the Metropolitan Museum of Art, and in 1966, he published A Brief History of Time, a history of the solar system he drew from the imagination of an extraterrestrial force. In the 1970s, Clarke taught at the University of Cambridge, the School of Arts, and the School of the Art Institute of Chicago, and taught at the University of Chicago, the University of Edinburgh, and the University of Chicago, the Met, the University of Manchester, the University of Cambridge, the School of Arts, and the School of the Arts, while he cofounded several arts and design institutions as well", "The next Biennial should be held at the Paris Museum of Modern Art in some time next year. The dates are still under discussion but expect the event to be held in July 2020. The next European pavilion will be staged at the Autóstica in Madrid in December 2021. The next major exhibition will be released in the spring of 2022. The next two editions of Art in the City will be staged at the Museo de Arte Contemporáneo in Lisbon and the Museo Leonardo in Turin in May. The next edition of the Venice Biennale will be staged at the Vatican in March 2022.\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced that it is preparing to welcome visitors back to the institution on September 9. The reinstallation of the museum is being made possible by a $1.1 billion expansion project, called the Los Angeles Renaissance, that will return the museum to its original architectural form, adding a theater, public art, and gardens, and reconfiguring the courtyard and lobby.LACMA is redesigning its interior in the hopes of making it more welcoming and appealing to visitors. It is also adding more galleries, classrooms, and public", "The next Biennial should take place in 2021. The artist-run exhibition will run at the Public Museum of Modern Art from October 6 to October 13. The exhibition will be hosted by the Public Library of Congress and will include twenty-four works by thirty-six artists, including Daniel Kaluuya, Alex Katz, Mallitawada Kishore, and Patricia Marrow. The full list of participating artists can be found here.\n\n\nThe Bechdel Test, a large-scale art-criticism project that aims to assess artworks by comparing them to a statement such as, \"If you paint a picture of a dog sitting on a sofa, it must be a picture of a dog eating a dinner.” It was founded by two German women in 1981 and launched by a German architect in 1996. The project’s next iteration, “Eco Gegenwart” visits twenty-six artworks gathered in the city of Württemberg in 2022. The exhibition will be curated by Andreas Roslind, who also curated the first edition of the show in 2003, and will mark the artist’s ninety-fifth birthday.“We are delighted to present this year’s edition of the", "The next Biennial should be held in 2021. The Royal Academy of Arts in London will stage a new documentary about the shifting sands of history, as part of a new partnership with the Royal Shakespeare Company, which will invite ten British artists to present a project about the ancient world. The Royal Festival Hall in Manchester will stage a new exhibition of B-movies. The National Galleries of Scotland will open a new, outdoor museum in the city to the public as part of its plans to create a new cultural destination on its land.Australian curator and historian Stephen Deuchar, who commissioned the new exhibition “The Untouchables” (2019) in Australia, told the Art Newspaper: “These are extraordinary times. We must be vigilant not to let them blur the boundaries between us and the future, but we also have to remember that we are part of it. I think what matters most is that we are all connected, that we are all part of something.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Anna Ana Lewis as its next director. Lewis currently serves as director of the Museum of Contemporary Art (LA), which is the home to the Museum of Modern Art, the", "The next Biennial should take place in the summer of 2021. Currently, the exhibition is scheduled to run from December 2019 to March 2021. The Biennial is a major milestone for Museums, and a great success for the central role of the Biennial in the history of Italian art. The decision to expand the exhibition calendar by adding a second phase is part of a comprehensive strategy to support the development and the growth of Italian art, with a view to making the exhibition calendar a platform for cultural exchange and collaboration. Nardelli said: We are thrilled by the prospect of reaching more people with our upcoming exhibition. The exhibition will be hosted in the new Museum Udine, which will be completed in the spring of 2021. The exhibition will be organized within the framework of the Biennial's programme: a selection of works from the exhibition will be presented in the form of a series of exhibitions that will take the form of a biennial. We have also been working hard to create the best environment possible for visitors to the exhibition, so that the exhibition will be accessible to everyone. In addition, the exhibition will include a number of projects that are currently underway within the Biennial, including the exhibition “Udine:", "The next Biennial should be almost 15 years away—it was announced in September 2016 that the exhibition would be held at the historic Palace of Fine Arts in Beijing. Since then, the exhibition has been moved to the National Museum of Chinese Art, Beijing, and has been running in Düsseldorf for eighteen months. During this time, the exhibition has received a total of nineteen exhibitions, two book chapters, and over two hundred presentations.  Since the Biennale of Edinburgh in 2012, the event has been held every five years.\n\n\nThe Winnipeg Art Gallery and Bechtel International in Winnipeg, Canada, was awarded a major $30 million grant from the Künstler-Stiftung (KST) in Germany on Thursday, October 26. The organization received the funding in support of the display of the exhibition “Heavy Metal: Metal, Politics, and the Politics of Sound” at the Kunsthalle Basel from the Künstler-Stiftung in June 2019. The award is the second of its kind for the Künstler-Stiftung, which was founded in 1989 and has represented the art of industrial music since 1997.The Künstler-St", "The next Biennial should be held in the spring of 2020. According to a release, the new exhibition will be a new concept, and will focus on the history of the artist-built site, which is located on the campus of the University of Exeter and will be inaugurated by a major exhibition titled “Innovation and Design” (2019–2020).“We are excited about the work that is being created by the talented artists coming through the exhibition, and that the public will be able to enjoy it once it takes place,” said Laura Donlan, director of the London-based biennial. “We hope that the forthcoming exhibition, ‘Innovation and Design’ will draw in new audiences to the exhibition, and encourage them to think of how we can work together to push forward new ideas.” \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Lauren Ravaglia as its new president and CEO. She succeeds David K. Lin, who announced her resignation this week after a tumultuous five-year tenure, and will assume her responsibilities on January 8.“Ravaglia’s leadership and vision for MoCA extend beyond the museum and extend to the", "The next Biennial should focus on “the politics and culture of the Americas”–a particular theme of the 2020 edition. The 2019 edition, titled “America after the New Deal,” featured works by twenty-six artists, including Michael Aus, Colma-1, and Léa Roux.\n\n\nThe Miami-based artist, filmmaker, and educator Kameel Abdurraqib, who has exhibited widely at institutions such as the Museum of Fine Arts and the Museum of American Art in Manhattan, has died at age eighty-eight. He is survived by his son, Samad, and his wife, Mariam.Born in New York City in 1947, Abdurraqib grew up in Miami Beach. After completing high school, he moved to the city to study at the University of South Florida (USF), leading to a career as a podiatrist in the 1980s. He has since taken up painting and drawing, and directed his own instructional studio, which he runs from his home. “In the early 1980s, I ran a painting and drawing studio and taught myself to create paintings and drawings,” he told the Art Newspaper in 1999. “I was a practiced hand at the", "The next Biennial should take place in the capital of Mauritania, Abuja, in March 2021.  \n\n\nThe Museum of Fine Arts (MFA) in New York has announced that Ariana Dzegede has been selected as its next director. Dzegede currently serves as the senior curator of contemporary art in the United States.  Dzegede succeeds Daniel Scully, who retired in January 2019 after seven years at the helm of the museum. “We are thrilled to welcome Ariana to the MFA,” said MCA director Hugh Bennett. “Her visionary leadership, deep commitment to the museum, and ability to bring people together are among her greatest strengths. We are confident that her new direction will be transformative for the MFA and for the city of New York.”Dzegede’s tenure at the MFA has been marked by unprecedented growth, with the institution adding more than 2,300 works between 2013 and 2016. Dzegede also spearheaded the acquisition of more than 1,400 works by artists such as Pierre Huyghe, Marcel Proust, and Tanya and Olga Weiss, and has authored numerous guides to the collection, including “D", "The next Biennial should be held in the first half of 2020.\" This statement is followed by the writer’s statement: “I am very excited to announce that the 2020 biennial will be held in the coming months. The thirty-fifth Venice Biennale will be staged in the spring of 2021.The recasting of the triennale, which is a tribute to the aesthetic and technical achievements of the last twenty years, was undertaken in the context of the upcoming fifty-fifth edition of the pavilion, which will be staged in the fall of 2021. Several artists have recently expressed their intention to participate in the new exhibition format, which will focus on the theme “This Is Not an Event,” in the first half of 2021. With the installation of the Art and Technology Archive in London, a collaborative project between the curator and the biennial, it will be possible to create a new platform for the exchange of art and technology from the biennial to the public in the UK. As part of a series of commissions under the auspices of the Biennial Fund, the artist Tomájova Csíkova will be asked to create a “virtual exhibition” for the biennial", "The next Biennial should take place in the town of Helsinki in 2021. The year after that, the Swedish city of Malmo will stage a biennial of art from the artist’s studio. The upcoming edition will take place in late March, and will feature forty artworks by thirty-eight artists, including Damien Hirst, Lars von Trier, Nils-Axel Hjortenberg, Kim Stanley Robinson, Marcel Duchamp, and Jasper Johns. The thirty-eighth edition of the Stockholm Biennale will take place from March 15 to March 21, 2021.\n\n\nThe Carnegie Museum of Art in Pittsburgh on Friday unveiled two new additions to its collection, the first of which is a new edition of the artist-designed, six-part video installation, “Stop,” which will be on view March 18–March 21. The work, which was created using a combination of film and video, was created by artist-designs Ricardo Montalban and Anna Atkins and premiered at the 2016 edition of the Whitney Biennial, “The Concrete and the Digital,” and is a reconstruction of a subway stop in West New York. The work is located in the exhibition “The Future We", "The next Biennial should be held in 2020. “Theatre is an abode of the soul, and the future of art is inextricably linked to the past and with it, the future of art,” said Lebanese artist Hamza Abdul Nabi. “The biennial is an occasion for artists to share their personal narratives, to engage with the most recent work and to be involved in the making of art. The upcoming edition will be truly a ‘power of life.’”\n\n\nNew York’s Metropolitan Museum of Art has received a gift of seventy-one works from the New York–based collector and philanthropist Oskar Eustis. These works were purchased by the museum on behalf of its current director, Daniel H. Weiss, who passed away in March. Weiss set up the nonprofit Metropolitan Museum of Art Sotheby’s auction house in 2011 in order to raise funds for the museum. The gift includes works by Pablo Picasso, Michelangelo Antonioni, Henri Matisse, Robert Mapplethorpe, and Pierre-Auguste Renoir, as well as thirty-one works by Janis Joplin, Victor LaViolette", "The next Biennial should be held in 2021.\n\n\nThe Carnegie Museum of Art in Pittsburgh, which has been closed since March due to the Covid-19 pandemic, has appointed Mark B. Cooper, the museum’s curator of American art, as its next director. Cooper comes to the institution from the Museum of Fine Arts, Boston, where he has served as chief curator since 2011. He succeeds Maureen Ryan, who announced in March that she is stepping down after eleven years at the helm of the museum.“I’m delighted to welcome Mark to the Carnegie Museum of Art and am looking forward to seeing how he will shape our future vision for the structure and programs of the museum,” said board chair Jennifer Keil, adding that she is confident that Cooper will continue to lead the Carnegie for years to come.“Carnegie’s history of championing the full range of artistic disciplines, from the highest ideals of aesthetic design and the lowest imaginable in the most outrageous ways, lay at the heart of the design and curating process at the museum.”\n\n\nThe New York Academy of Art (NYA), which will reopen in 2021 and which had been closed since March due to the coronavirus pand", "The next Biennial should be held in Washington, DC, in 2022. \n Griswold, who studied abroad in Great Britain and Germany, and lives in New York City, will serve as a juror for the 2019 event, which is named after the late New York–based artist and activist Griswold. The recently-deceased Griswold’s works are housed in the collections of numerous institutions across the United States. \n\n\nThe Museum of Jewish Heritage (Mohebbi Gallery) in Paris has announced that Naima J. Keith will be the first director of its new institution. Keith, who currently serves as the curator of the recently reopened Museum of Modern Art in New York, will assume her post in January 2020.“It’s a very exciting time to be director of an institution that was founded by the Museum of Modern Art’s founders, Don and Henri DiFranco, in 1987. Naima shares our vision to organize exhibitions that challenge the museum’s current practice, to engage with the very fabric of society, and to draw from the experience of museums in the city,” said Museum director Bruno Racine", "The next Biennial should have a clear concept and a clear mission, and should be organized as a platform for diversity, social justice, and peace.”\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it will hold a special screening of the new movie The Shape of Water, a documentary about a group of Native American women who were forcibly relocated to reservations in New Mexico and Arizona, on December 7. The screening is part of the institution’s reopening initiative, “Assemblies of the Holy Ghost: The Last Days of the United States” and will feature a selection of the film as well as original music by the band Duran Duran. The event will take place at the MFA’s new two-story, 600, 400, and 500-seat museum on the grounds of the museum.The film, which was filmed in Albuquerque, New Mexico, and the town of Big Spring, Arizona, and chronicled the lives and deaths of the women, Duran Duran and their children, and features music by the band as well as selected Native American artworks and artifacts. The event will also feature a performance by the Durans, and a presentation of an original Native American painting by artist", "The next Biennial should take place in 2020, and will be hosted in conjunction with the opening of the museum’s new exhibition “It’s Not a Crime.”\n\n\nThe Metropolitan Museum of Art in New York has announced that it plans to make substantial room in its new building for the exhibition “Theater of Operations: The Gulf Wars 1991–2011”—a major collection of images that show the aftermath of the US-led invasion and occupation of Iraq. The retrospective will be staged in two sections: the first half of the exhibition will be open from September 16 through October 22, 2020, and the second half from November 4 through November 7, 2020.“The Met has always believed that the building and staging of an exhibition in a museum was the best way to engage audiences with the latest scholarship and art,” said Marc Glimcher, the Met’s director. “The project that we’ve completed thus far, a multi-part set of exhibitions that will show the work of twenty-four artists, and will organize them in a way that is accessible to everyone, is a step in that direction.”Added Glimcher: “Theater of Operations’s", "The next Biennial should include a three-dimensional exhibition of works by the Los Angeles–based artist Georgia O’Keeffe, the first African American woman to be awarded an Emmy. The 2020 event will be held at the Los Angeles County Museum of Art (LACMA), and will feature works by the emerging and established artists of the Pacific Northwest. The inaugural event, titled “Outsider in the House,” was curated by Sara Cwynar of the Black and Puerto Rican Studies group at the University of Rochester and Kunita Martínez, both in New York; Pierre Ronell, the curator of twentieth-century art at the Los Angeles County Museum of Art; and Angela Penny, director of the Los Angeles Biennial.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it has received a gift of fifty-nine works by the American painter John Moore from the artist’s estate. Curated by Stephen Hahn and Mary Clare Booth, the pieces were given to the museum by the family of Moore, who passed away in December 2019. The gift includes works by thirty-two artists, including Nene, Bridget Riley, and David Salle, and is", "The next Biennial should take place in the spring of 2021, and will be free to the public.<|endoftext|>The Museum of Contemporary Art (MoCA) in Los Angeles announced today that it will recommence construction of its new $3 billion West Coast exhibition space in the city, which is currently being developed as a temporary extension of the museum. “The future of West Coast,” said curator, architect, and designer Paul Graham. “For decades, the museum has welcomed visitors from around the world, and has nurtured the careers of many of its most distinguished artists. Now it intends to become a major cultural destination for visitors from the Pacific Rim and beyond. We are committed to designing a space that will enhance the history and identity of West Coast in the greatest way possible.”The museum opened its new showroom in the former Miriam and Ira D. Wallach Building in September of 2018. It is planning to unveil the new exhibition, “Pacific Rim,” in November. The show will highlight emerging work by Pacific Island artists and will feature the work of twenty-four artists whose work first appeared in the exhibition “Pacific Rim” (2019).Established in 1992, MoCA was founded as a sort of", "The next Biennial should take place in 2020. The 2020 event will be held at the MAMCO in Sao Paulo, Brazil, and will have the theme: “Biodiversity and the Mass Production Process,” and will feature paintings and drawings by many of the artists appearing. The show will be anchored by a selection of works by Mana Eldredge, Xianqi Wang, Jean-Luc Melancon, Celso Sola, and Rory O’Grady. The full list of participating artists is as follows: 1. Jean-Luc Melancon - SOUTH 2. Jean-Luc Melancon - North 3. Jean-Luc Melancon - Southland 4. Jean-Luc Melancon - Italy 5. Jean-Luc Melancon - Italy 6. Jean-Luc Melancon - Brazil 7. Jean-Luc Melancon - Brazil 8. Jean-Luc Melancon - Italy 9.Jean-Luc Melancon - Italy 10.Jean-Luc Melancon - Italy 11.Jean-Luc Melancon - Italy 12.", "The next Biennial should take place in the fall of 2020. The first iteration was held in 1995 and ran from March to November.  Additional Festival Materials will be Released in the Coming Months. The MNEAD–MIDWIT Gallery will represent New York at the 2019 edition of the Mid-Atlantic Region, which will be held in the city during the fall of 2019, and will serve as the first institution in the state to host an exhibition of works by Japanese artist\n“Tokyo Pool in New York”Mollie Corrigan and John Corrigan, two artists who have been involved in the MNEAD-MIDWIT art project for decades, will stage an exhibition at the MNEAD–MIDWIT Gallery in September 2019. The show will feature works by fifty artists and will be curated by the artist and their respective associates and will explore the relationship between works and their environments. The event will feature works by forty-one artists, including Damien Hirst, Julien Ghebaly, Ed Ruscha, and Jean-Michel Basquiat. The show will run from September 20 to September 24. The exhibition will feature work by fifty-nine artists, including Alice Aycock,", "The next Biennial should take place in early 2021. The charity will construct and manage the exhibition space, which will be in the heart of the city and at a time when it will be hosting the first major exhibition of works by the works of contemporary artists in the United Kingdom. This exhibition, titled “Henry Moore: The Art of Life” will span forty works and will focus on the Dakota artist’s radical return to Native American art, the relationship between art and politics, and the legacy of the Ojibwe artist Richard Telling.\n\n\nAfter a group of artists staged a protest at the Museum of Modern Art (MoMA) in New York on Wednesday, October 5, in protest of the museum’s relationship with controversial donors, the institution announced it is waiving its annual stipends for any returning artists. The move means that any of the fifty artists who received $75,000 or more in donations for this year’s exhibition will not be charged.“We acknowledge that the decision to waive the stipends was difficult, but we believe that the right thing to do was done,” said museum director Daniel H. Weiss. “I hope that this means that the artists are not penalized in any", "The next Biennial should take place in 2021. The local council, which comprises ten to fifteen local authorities, is currently drafting a programme for the event, which will begin in March and run until July. The local commission will work with the Tate and about ten other partners to shape the theme. The digital-based art world exhibition will feature work by fifty artists and will be curated by Lucy Craig-Ishak. The inaugural exhibition, “20/20,” will be on view in May and will draw from a selection of works by twenty-eight artists born and based in the UK.\n\n\nThe Gilbert and George Gallery in New York has announced that it is expanding its curatorial team and opening an artist-in-residence residency program. The center’s curatorial team comprises Anna-Marie Gomez, curator of contemporary art and design, and Natalie Rondin, a curator of contemporary art and design; Jennifer Roesler, a curator of contemporary art and design at the Museum of Modern Art in New York; and Michael Howell, director of the Museum of Modern Art. Its residency program, which will focus on artists’ practices in the city, will be led by Gomez, Roesler, and Howell.�", "The next Biennial should be held in 2020 and will be hosted at the Uffizi Gallery in Florence. The upcoming exhibition will take up the theme “The Death of Art” and will showcase works by more than sixty artists and will feature a new selection of works by Giacomo Beccaria and Paolo Cattelan.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has created two new positions within its curatorial team as part of a new initiative launched by director Daniel H. Weiss in response to the Covid-19 pandemic. The initiative, “Unseen,” aims to both reimagine the museum and boost the museum’s collection through direct engagement with the artists who create work in the museum. Under the leadership of Derek Hale, “The Death of Art” will be a series of exhibitions, presentations, and performances that will engage with the work of the museum’s curators, collectors, and staff in order to provide a firsthand look at how they plan to support the creative projects of their museums and their artists.“We are thrilled to work with the staff and the incredible artists who have made The Death of Art such an extraordinary show,�", "The next Biennial should take place in the summer of 2022.”The event, titled “Art and Place,” will be held at the Italian city of Venice and will be curated by the architect and urban designer Tadio Cecchini, the art historian Stefano Cattelan, and the architect Giuseppe Bellini. It is slated to run from March 13–March 15.\n\n\nThe Art Newspaper reports that the Turkish Ministry of Culture has denied a United States artist residency in Istanbul in 2019 because he did not disclose that he has a major new exhibition opening in 2020. The exhibition, titled Modern Life: The Contemporary Art of El Durra, will focus on the work of eight new artists, including Burhan Agir, Nuri Diyabadi, Sayeeda Farsi, and Huseyin Gogal. As the show opens, more than 400 museum employees are boycotting work scheduled, and the government is attempting to shut down, in an attempt to reduce the annual losses of the civil-defense, security, and health sectors in the country of Route Turkey.The New York Times reports that on May 29, a minister of culture statement said: “The minister of culture", "The next Biennial should also examine the role of the arts and culture in helping to shape the city’s public policies. The next iteration of the biennial will focus on the city’s future plans for the Arts and Culture. The 2019 edition of the event will take place in the city’s art district, MUNICH, and is being organized by the Berlin Cultural Foundation (Bundesarchiv für Berlin), Berlin Art Week (Bundesactivzeitung Berlin), and the Frankfurt Art Museum (Bundesinstitut für Berlin), which will partly support the €15,000 prize.The 2019 biennial will consist of twelve exhibitions, including “Art and Resistance” (2019), “Feminine and Revolution” (2019), and “Ateliers Histories” (2019). The 2020 edition will consist of twenty-three works by seventy-eight artists, and the 2021 edition will be a collaborative effort between the BKA and BKA Berlin.The 2018 edition of the biennial, “Ateliers Histories,” featured work by thirty-six artists from fifty-two countries. The 2019 edition, �", "The next Biennial should be staged in 2021. “I am really optimistic about the future of the city,” said Mayor Rahm Emanuel. “As we continue to grow the biennial, we will achieve more for the people of Chicago. That’s what this is all about. An initiative that will benefit us all.”The biennial will host sixty-two artists, including Betty Parsons, the widow of American painter Robert Parsons; Ron Gorchov, the cofounder of Gorchov Space; and Louise Bourgeois, the widow of American painter Dorothea Barso?s daughter. The biennial will also present the work of fifty-six artists whose work will be included in the reopening of the Foster Museum, including Robert Irwin, Francis Jordan, and David Koepp. “The idea of a biennial was born out of my desire to see how the art world works in a city where art is so disconnected from the core concerns and practices of organized life,” said Emanuel. “It’s going to be an open canvas for artists to engage with the city.”The city and the Museum of Arts and Design are also planning to launch a series of pilot programs to", "The next Biennial should be held in 2020, before the novel coronavirus is contained and before the first-time exhibitors enter the venue. Datta said that the theme of the biennial should be “academic freedom, diversity of scholarship, and the possibility of scientific inquiry in the context of cultural, historical, and spiritual heritage.”\n\n\nThe Museum of Art (MoA) in New York has hired Paul Mpagi Sepuya, a professor of the history of art at the University of California, Berkeley, and the author of the new book Art and Human Rights in the Philippines, to the position of director of the museum. Sepuya will assume his post on January 30, 2021.During his professional career, Sepuya has worked as a curator, writer, and educator; taught at universities and colleges throughout the Philippines and has presented projects at international conferences such as the Venice and the Venice Architecture Biennales. He also serves as the founding director of the creative-development program of the University of the Philippines, UP. He previously served as the director of Gallery Asia Pacific, and as the director of the Museum of Contemporary Art, Japan.“We are thrilled that Paul has joined our team to become", "The next Biennial should be held at the Museum of Contemporary Art, New York, in 2021.     In May 2021, a commissioning team comprising Karl Lagerfeldt, Budi Balsom, Melissa Chiu, Lucas Delaney, Stephanie Elshtain, Kristina Friel, Sharon Grendel, Ruth Halperin, Sandra Haiduk, and Karen King—the inaugural group of curators known as the Balsom Trio—will present the final exhibition of their ten-year project “Pace” at the Museum of Contemporary Art, Los Angeles (MCA).The biennial, which was conceived as a joint project of Artforum, the Los Angeles County Museum of Art, and the Art Institute of Chicago, will take place across eight biennials. The first will be held at the Los Angeles County Museum of Art (LACMA); the second at the Art Institute of Chicago (AI); the third at the Los Angeles County Museum of Art (LACMA), the Art Museum of Contemporary Art, and the Museum of Contemporary Art, New York (MCA); the last at the Museum", "The next Biennial should take place in the autumn of 2022, and the first in January 2020. The other events that have been canceled are Art Basel Hong Kong, Art Dubai, Art Dubai Triennial, Art Dubai East, Art Dubai North, Art Dubai Studio, Art Dubai Spring, and Art Dubai Spring.The full list of participating artists can be found here.\n\n\nThe New Museum in New York has added five artists to its roster for its upcoming fifteenth edition, “Between the Sun and the Moon,” in September 2020. The exhibition, which explores the concept of time and space through the work of artists such as Paul Gauguin, Henri Matisse, and Pierre-Auguste Renoir, will also include a discussion with artist-activists Stella and David Kander and will be accompanied by a new edition of the Whitney Biennial.The biennial will bring together thirty-five artists from six continents and will be organized as follows: September 14–September 2061 October 4–October 12, 2021 October 13–October 20, 2021 October 21–October 28, 2021  October 29–October 31, 2021 November 3–November 6, 2021 November 7–November 11, 2021 November 14", "The next Biennial should aim to take place in 2021 and will be led by the curator of contemporary photography, the curator of modernism, the curator of contemporary art and design, and the curator of digital art. All three of the artists nominated for the project are from the UK.\n\n\nThe National Galleries of Scotland (NGA) has appointed Joan Bennett as its new director. Bennett arrives at the institution following a five-year stint as director of the National Museum of Scotland, where she helmed the prestigious exhibition “For the Future of Galleries” (2011–12) and the “Galleries at the National Museum” (2015–16), and has been named the NGA’s next director.“Joan’s record of commissioning and leading exhibitions across Scotland and the rest of the UK is impressive, and her appointment reflects the vision and commitment of the NGA as an institution that brings together contemporary thought and vision, exploring the future of galleries in partnership with local and international artists, institutions, and institutions’ collections,” said NGA director Johanna Johnson. “The board believes that Joan is an excellent leader for our collection and exhibitions and we look forward to working with her to", "The next Biennial should take place in 2020. The 2019 event—which consisted of a combination of three main blocks, each of which was led by a single artist—was largely seen as a milestone in the artist’s career. The exhibition was held at the Centre Pompidou in Paris and the Hirshhorn Museum in Washington, DC.\n\n\nThe newly awarded $1.2 billion Biennale di Bernardo in Turin has welcomed the Joan Brown Foundation to Italy. The foundation, which was established by the philanthropists Joan and John Brown in 1987, will now oversee this year’s event. “I’m delighted that the Joan Brown Foundation will now be able to shape the picture by delivering new and exciting models that are responsive to the current needs of the art world and its audiences,” said Marino Cipolletta, director of the Instituto di Bernardo (ICA) and the Biennale di Bernardo. “Joan Brown is the quintessential visionary of modern art and we are honored to represent her in the Italian pavilion for the 26th edition of the", "The next Biennial should be in 2020 and will be co-organized by the Museum of Modern Art and the Massachusetts Institute of Technology. It will take place at the Museum of Human Nature and will take place on the grounds of the Hayden Gallery in Boston.  The event will also feature the Biennial of African Art and the Biennial of the Arts, which will take place at the Museum of Contemporary Art in New York. “We are thrilled to be able to debut the new project,” Michael L. Stein, chairman and CEO of the Rockefeller Foundation, said in a statement. “The second edition of the World Biennial will showcase the most cutting-edge art, the most innovative and innovative practices, and the most innovative solutions. We are aware of two works currently on view that could be included in the biennial, ” and are working on a plan to add more works and will share with the public as soon as possible.\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of more than two hundred artifacts from the estate of Helen Franklyn-Prestel. The donation is made in the name of Helen Franklyn-Prestel and her husband, John, a veteran collector who", "The next Biennial should take place in 2021. *The New York Asian Art Museum, where the first exhibition took place in 1937, closed in March 2019. The Art Institute of Chicago announced that it will begin welcoming visitors in 2020. According to the Art Newspaper, the inaugural event will comprise twenty-one solo exhibitions, organized by subject, and will draw 400,000 visitors. The 2020 event will be held at the Museum of Contemporary Art in London. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has announced that it will reopen to the public on August 30, 2020, with the opening of a new series of exhibitions, “Away from the Camera: Art Photography and the American Body.” The first exhibition, “Away from the Camera” will feature works by seventy-four contemporary artists. The show will then return to the Museum of Contemporary Art for a second season of “Spiral Rise” in 2021.  “The first exhibition in the new series came out of the Museum of Contemporary Art’s acquisition of Carl Landgraab’s work in 1989. This series has been established to provide a space for artists to experiment with photography and to expand", "The next Biennial should take place in the spring of 2020 and is being organized by the Naval Museum of History, Tokyo.The museum is already planning to stage a retrospective of the work of the late Swiss artist Dietrich Neue in the autumn of 2020.  The Breitkreuz Museum, in Frankfurt, Germany, will also soon have a new exhibition dedicated to Dutch artist Klaas-Pedersen, who experimented with geometric and sculptural forms when he painted his first work in the late 1960s. The Flemish artist Lars-Heinz, who often used geometric forms to portray landscapes, died in 2002. He was ninety-two years old.\n\n\nThe Royal Academy of Arts (RA) in London has appointed David Walton as its new chair of contemporary art. He succeeds Mark Rylance, who retired in March after nineteen years in the role, and will assume his new responsibilities on January 21, 2020.“The RA has been an outstanding cultural institution for seventy years and I am enormously proud to be the chair of its new artistic and curatorial wing,” said Rylance. “I have enjoyed the unique path that David has followed to this point, and am fully confident that he will continue to be", "The next Biennial should take place in 2020 at the Palais de Tokyo in Paris. Clashes between police and protesters have also taken place in the capital of Hong Kong, where students and civil servants are demanding universal suffrage, the release of political prisoners, and the release of political prisoners who were arrested for nonviolent offenses, such as refusing to disperse from pro-democracy protests in Hong Kong.\n\n\nThe Association of Art Museum Directors (AAMD) has announced its top ten exhibitors for its 2020 edition. The event will run from December 5 to December 8 in Santa Monica, California. The full list of exhibitors is as follows:1. Warhol and Westart (New York) 9:00 AM to 10:00 AM2. Modern Art (New York)10:00 AM to 1:00 PM3. Haus der Kunst (New York)10:00 AM to 11:00 PM4. Kubrick’s House (New York)10:00 AM to 12:00 AM5. Modern Art (New York)11:00 PM to 12:00 AM6. Museo de Arte Contemporáneo (Montecristo, Italy)10:00 PM to 10:00", "The next Biennial should take place, in the summer of 2021, at the Panja Gallery in Paris. The theme of the exhibition is “Towards a New History of Art:” The exhibition will include three works by British artist Peter Doig, featuring a tribute to his son and the show will also include paintings by artist Alighiero Petrarca, a work on paper by the American artist Vincent van Gogh, a selection from the Dreyfuss Collection, and a selection from the Fiskhäuser-Girard collection.The biennial will run from March 3 to March 5, 2021 in two cities, Paris and Milan. The event’s director, Jean-François Leclerc, said: “It will be a new dimension in the history of art, a new step in the evolution of the art of art history as a whole. The new event will aim to unify the history of art and to transcend the boundaries that separate art and art history.”\n\n\nThe Museum of Contemporary Art (MoCA) in New York has selected the 25 artists who will represent the United States at the Fifty-Ninth Venice Biennale in 2021. The exhibition,", "The next Biennial should be held in 2022. The next edition will be held in Hong Kong, and the 2019 iteration, which was cancelled due to the Covid-19 pandemic, will be held in South Korea. The 2020 exhibition will be hosted by the Hong Kong Museum of Art and will be hosted at the Museum of Contemporary Art in Seoul (MoCA), which is currently undergoing a major renovation, from January 25 to March 3, 2021.The 2019 exhibition, titled “Theater of Operations: The Gulf Wars 1991–2011,” was organized by the Center for Contemporary Art in Baghdad and screened at the Baghdad Art Museum. The exhibition was inspired by the 2013 work “What Is Literature?” by the Iranian artist Kamil Masoori, a “project” of the artist’s World War I experiences.The 2019 exhibition, titled “The Oil Spill Crisis: Iraq and the World in 2014” was organized by the International Center for Contemporary Art in Baghdad. The twenty-second iteration, titled “Wu Xiaodong” was presented by the Shanghai Gallery of Modern Art, which is currently undergoing a renovation, at the invitation of MoCA, and will open in", "The next Biennial should bring together a new generation of international art-historians from different countries of the world.”Participants in the inaugural edition include: Birgitta Braun, Leila Bair, Linda Gilbert, Alexandra van der Ploeg, Stewart Hindle, Sasha Lopate, Narendra Mani, and Dyinga Fattal.\n\n\nThe Los Angeles County Museum of Art (LACMA), which said last week that it will soon reopen to the public in an attempt to mitigate Covid-19-induced traffic disruptions, has revealed that it will extend the festival by two months to March 8. The announcement follows an update to the museum’s website and a statement released by LACMA on February 14, which said that it will reopen with a longer-term plan for “the future of art.”The announcement coincides with the opening of the Art of the Party, an all-day celebration of art that will include performances, panels, screenings, tours, and other activities, on March 7, and coincides with Art Basel Hong Kong’s partnership with LACMA. The event will also feature new", "The next Biennial should take place in 2020 and will consist of a total of nineteen artists, including Avita Banerjee, who has won the Arthur Rossig award twice, and Justin Catrambone, who is the founder of the biennial label Catalyst Art Fund.\n\n\nThe Renaissance Society in London has appointed Jennifer Staveley as its new director. Staveley comes to the institution from the Metropolitan Museum of Art in New York, where she has served as the executive director of the institution since 2013. She succeeds Chris Pack, who retired in March 2019 after eleven years at the helm. Staveley arrives in the capital from the Royal Academy of Arts, where she has served as interim director since April 2019.Founded in 1965, the Renaissance Society is one of the largest and most prestigious contemporary arts organizations in the United Kingdom. It has a permanent collection of more than 250,000 works and holds more than three hundred exhibitions a year at its headquarters in the city of London. The museum houses a collection of more than 450,000 artifacts dating back to the first millennium AD and has a permanent collection of paintings, drawings, sculptures, and photographs dating back to the 14th century. The institution also has a new campus in the Romanesque Revival town", "The next Biennial should be held in 2020. \n\n\nArt historian and curator Gavin Brownlee, the director of the legendary Los Angeles–based nonprofit Film at Lincoln Center, has died of cancer at age fifty-seven.Born in London in 1960, Brownlee first rose to prominence in the 1980s by championing experimental art in Los Angeles. Among the curators whose work he often cited were Douglas Gordon, Paul Gauguin, and Jean-Luc Donne; a frequent collaborator with John Galliano, the legendary American painter. Throughout his career, Brownlee was a critical collaborator and a pioneer in the field. In 2013, the Los Angeles Times’s Art Bulletin described his work as “integrating all the elements of film, sculpture, music, and painting—the abstract, the domestic, the mundane, the sentimental, the mundane, the surreal, the sublime, and the spiritual.”Born in Manchester in 1957, Brownlee studied at the School of the Art Institute of Chicago, the University of California, Los Angeles, the Museum of Modern Art, and the Museum of Modern Art. He eventually earned a Ph.D. in social anthropology at the Museum of Modern Art. In 1998, the Museum of Modern", "The next Biennial should be held in 2021. Artforum has launched a new award program that will provide $1,000 cash awards to artists who have been selected to represent their countries at the 70th Venice Film Festival. Winners will be selected by an independent committee chaired by Sixto Petti, director of the Museo Nacional Centro de Arte Contemporáneo de São Paulo. The deadline for submissions is April 7. The biennial will be divided into sixteen sections. The first four will be organized as follows:“Introduction, Part 1: Avant-Garde, Transport, and Art,” which will consist of a series of interviews with artists; the next two sections will explore the influence of the avant-gardes in transport. The ninth section will focus on the history of art in the last hundred years, with a particular attention to the seventeenth and eighteenth centuries. The final section will be a discussion of the future of art.“Art and Society: The Past and Present,” will consist of a series of interviews with scholars, writers, artists, activists, and other experts on art and its impact on society. The topics of the section will be chosen", "The next Biennial should be from March 20 to March 22, 2020. SCAD is planning to engage with all local, regional, and international artists to increase the visibility of the exhibition by developing programming that engages with local communities and places of interest. The artists will be chosen from a shortlist culled from a pool of seventy-five. “This is an unprecedented challenge for SCAD,” said SCAD director Kim Hill. “It is our intention to engage with artists from the Philippines, and to make SCAD a truly international museum.”\n\n\nThe Bechtel Group, the San Francisco–based conglomerate owned by the Koch brothers, has announced that it will send over $3 billion to “save the planet” in 2020. The funds will be used to combat climate change and mitigate the ecological impacts of industrialization and climate change; they will also assist the fossil fuel industry by reducing carbon emissions and implementing policies that will exacerbate climate change; and they will support conservation efforts.“With a limit of $1 trillion, we can reverse the damage climate change is doing to the economy and the climate system,” said David M. Reich, president of the global conservation group Friends of the Earth. “", "The next Biennial should take place in 2020. Brian Clark, chair of the board of trustees of the Biennial Foundation, said: “We are encouraged by the new political climate, with a great deal of urgency, and the fresh outlook for art and the preservation of the arts. The theme of the upcoming four-year cycle should be ‘Living Together,’ and for the first time in its history should encompass both the natural and divine.”\n\n\nThe Los Angeles County Museum of Art (LACMA) is planning to remove more than 200 works by thirty-three foreign artists\u0097including Adriana Pape, Amanda Ross-Ho, and Yishan Huang\u0097from its collection after it closed in March due to Covid-19.The museum announced on April 17 that it planned to remove some three hundred works by thirty-four other artists, including Jannis Kounellis, Tarek Atoui, and Kiki Smith, as well as the Wang Wei-Han sculpture that depicts a woman hugging a man, which was on display at the museum on April 7. “The work will now be moved to a secure location, and the LACMA Art Museum will continue to display the", "The next Biennial should take place in the spring of 2022. The question, of course, is whether the Guggenheim will organize an exhibition to commemorate the occasion.\n\n\nThe Hong Kong–based, nonprofit New England Center for Art and Culture (NEEC) has named David Jewell as its next executive director. The New York–based, New England-based board president, who has been a director since 2016, is the founder of the Hudson Valley-based nonprofit Art Impact, which has assisted artists throughout the United States. Through its educational programs and grantmaking, NEEC has supported more than 1,500 artists through an initiative that aims to give them the tools to develop their careers. “David is a leading curator, writer, and educator whose career is synonymous with the arts,” board president Deborah Blank said in a statement. “He is a tireless champion of artists who has shaped the contemporary tradition in every way imaginable. With his vast experience, vision, and energy, he will be key in catalyzing the next generation of artists, who will be given an unprecedented platform to perform and push their own social and cultural destinies.”Jewell succeeds Matthew Higgs, who announced in September that he was", "The next Biennial should be held in 2020. “We are extremely optimistic about how this time next year will unfold,” said Director Koen Antwort, who added: “This is an exceptional group of curators, and at a time when we are all finally beginning to rejoin society. We are confident that together we will create a new era of exhibitions.”\n\n\nArt historian and curator David C. Driskell, who helmed the Museum of Arts and Design (MAD) in New York, has resigned from his post. In a statement provided to Artforum, Driskell said that he accepted “the challenges and complexities that accompany the exhibition process.” He added: “I also recognize that, going forward, the next year will be an especially imperfect time to finish my term. ”Driskell, who created the Moth, a series of large-scale, architectural architecture works around the museum’s building and received a $100,000 MacArthur \"genius grant\" in 2013, will depart MAD in August. In his statement, he said: “I’ve had the opportunity to work with a number of talented and dedicated colleagues here over the years,", "The next Biennial should take place in 2022 and the date will be set in 2020.\n\n\nA trio of New York City–based artists - Miguel Angel Saro-ÃOltara, Jorrit Pedersen, and Tunga Bulow - have won the 2019 Art in the City Award, an annual $50,000 award presented by the Art Gallery of Modern Art (AFAM) to a local artist for his or her work in the city of New York.“We’re thrilled that this year’s award, which honors the dedication to display, to present, and to sell art in the greater New York metropolitan area, has brought a new generation of artists to our program,” said Alex Meneguzzo, director of AFAM. “With their work, they have demonstrated their ability to create immersive experiences through the use of a photogrammetric system and a meshing of art and technology, combining both art and technology and spatial and light work in a way that is both experimental and immersive. The art and technology they have created is a sort of canvas on which they can continue to create.”Awards are given annually at the end of the fifteenth edition of the Art in the City", "The next Biennial should be held in 2022 and the first in 2025.The project is being spearheaded by a group of international artists and designers who are collectively calling for the removal of all statues commemorating colonialists and war criminals in Bangladesh and India and for a new constitution that addresses the legacy of colonial regimes.Coinciding with the campaign is a global campaign against racism and state terrorism led by artists Michael Elgin, Andy Warhol, and the Black Lives Matter movement. According to the Art Newspaper, in recent months, protests have occurred in Mexico, Turkey, Egypt, and South Africa as well as in Poland and India. President Donald Trump has yet to publicly address the global movement against racial injustice, but in a 2017 interview with the Art Newspaper he said that he would consider changing the United States’s constitution to address the legacy of slavery.While the activists are advocating for the removal of all statues and monuments that perpetuate slavery and are in favor of revising or removing statues, some are concerned that the push to remove historical figures will backfire. If the push leads to the removal of a revered historical figure, other critics fear it could be seen as insensitive to the suffering of slaves. While Richard Spencer, the former executive director of the National Policy Institute who was", "The next Biennial should be held sometime in the second half of 2020. “The Museum of Art in New York is working with our partners to re-invent the museum,” said Mark Rothko, the director of the Goodman Gallery in New York. “I am grateful for this opportunity to be a part of the Museum of Art’s exciting future.”\n\n\nThe Metropolitan Museum of Art in New York has commissioned Pierre Schäfer, Angela Byars, and Charlotte Carhart–Harris to create new works for the institution’s exhibition “Dreams in Marble” as part of a show by director Christopher Wool that will open in the museum’s new building at 50 East Seventy-Third Street on September 21. The exhibition will be based around the story of the Van Gogh-inspired painting The Rime of the Ancient World, which, according to the artist, represents the beginning of the “Death of Man.” The exhibition is part of a larger plan to engage with the cultural and historical significance of the Van Gogh and the works of his contemporaries, including Gustav Klimt, Adam Merz, and Patrick Caine.Wool said the commissioning of the works was", "The next Biennial should bring the extraordinary artists working in the biennial to life in a variety of settings, such as a public performance, a museum exhibition, a closed exhibition, a film or video project, or an online event. Biennials should also engage with contemporary issues, including the role of art in society, the relationship between artists and the communities they represent, and the role of art in urban life. The 2021 event will take place in Prague, the Czech Republic and will run from November 22 to December 6.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it is preparing to reopen to the public next week following a $450 million expansion, in preparation for the upcoming New York City fair. The renovation, which also included the addition of a new gallery, a new restaurant, and the new public plaza, added two hundred more seats to the museum’s grand opening party on September 3, and is also planning to open the museum in the fall.This year’s edition of the New York fair, which is still on-going due to the Covid-19 pandemic, kicked off on August 26 with a preview party at the Museum of Modern Art (MoMA) in Manhattan, followed", "The next Biennial should take place in 2022, and the twenty-eighth in 2023. The first show of the upcoming structure, titled After Earth, will open in March 2020. The Biennial will then feature the work of more than seventy artists from thirty countries\u0097nearly fifty of whom will be selected by a jury comprising artist-activists, architect and landscape architects, and scientists.Artforum will post a review of the biennial’s exhibitions in Helsinki next week. \n\n\nThe Metropolitan Museum of Art (MoMA), New York, has released guidelines for the handling of artworks that have recently entered its collection, in an attempt to keep the collection safe for museumgoers and museum staff. The guidelines, which were issued by the board of trustees of the museum, outline four general categories of items that can be opened by visitors, including artworks, drawings, photographs, videos, and installations.Sensitive handling of artworks is necessary, the authors write, as it can be mistaken for dangerous substances or even deadly substances. Other items that are potentially dangerous for staff include objects that have been altered or fabricated to resemble dead animals or people, and objects that have had their contents sprayed or otherwise simulated with chemicals. The recommendations apply", "The next Biennial should take place in December 2020. \n\n\nThe National Gallery London has appointed writer-activist and curator Michèle Savoie as its next director. Savoie will be the first woman to lead the institution since it was founded by a group of American women in 1940. She succeeds Peter Hujar, who served as director of the institution for three years before stepping down in 2017. “Michèle Savoie has been a passionate champion of culture and an internationally-acclaimed curator for over twenty years, and is now poised to further the National Gallery’s commitment to diversity and inclusion,” said the institution’s director Hamish Hamilton. “She exemplifies the National Gallery’s ambitious view of how we can work together to advance the gallery’s extraordinary collection of art. We are confident that she is the right person for the job, and look forward to working with her to shape our future.”The appointment was made by the National Galleries of Scotland through a private sale that marked the end of a decade of the institution’s existence. The sale, which marked the end of a contract with the National Galleries of Scotland, also follows the National Gall", "The next Biennial should be in 2020. The institution, which has been in operation since 1960, is currently undergoing a major expansion that will increase the museum’s footprint by nearly eight hundred acres. The renovation, dubbed the Biennial of Contemporary Art, in honor of the museum’s benefactor, Zbigniew Brzezinski, was completed in 2008, the same year the museum received a move-in ceremony from the original Art Deco building, which was finished in 1960. The renovation also added nearly twenty thousand square feet of exhibition space and added over twenty thousand square feet of lobby. The new building will also boast a food court, a bookstore, and other amenities that were not previously realized.“The new building and the mission of the Biennial of Contemporary Art in Prague is a new beginning for Biennial,” said Brzezinski. “We are now able to present the exhibition in the form of a museum that will be a very strong platform for the exhibition, for the exhibition, and for the students.”\n\n\nLotta Garetti, an Italian writer, artist, curator, and educator whose iconic illustrations of domestic and urban landscapes and her 2010 book Of Mice and Men (1948)", "The next Biennial should take place sometime in the first half of 2020. The next iteration of the Nobel Prize will be held in December 2021. The New York Times reports that the prize is a cover for the upcoming exhibition “Art and Politics: Légerie and the Statuette” (December 21–December 26, 2020) at the Musée d’Art et de lui, Paris.\n\n\nThe European Parliament has voted to lift a long-standing ban on Dutch-based human rights organization the Alliance of Liberals and Democrats for Europe (ALDE), which has been working to increase the rights of refugees and migrants in the Netherlands, in a way that will allow the institution to continue to operate. The move was made in a special legislative committee meeting on Wednesday. The committee voted unanimously in favor of lifting a ban that was put in place in December 2016 when the United Kingdom voted to leave the European Union. The decision sparked uproar across the EU and triggered a massive wave of solidarity protests.The United States, however, voted against the move, claiming that it would be in the country’s best interest to preserve the current deal with the UK. The amendment would allow the UK to leave the European Union but only in", "The next Biennial should be held in 2020. \n\n\nThe Metropolitan Museum of Art (the museum) in New York City has announced that it will divest from its holdings of art and artifacts made by Nazi Germany’s Nazi-era architects Franz Klima and B.F. Hoffmann. The institution previously withdrew more than $40 million in donations in 2017 and was forced to lay off at least seventy-five employees in March 2019. “While the museum has made great strides in addressing the legacy of the museum’s holdings, we must also take these steps in the service of the many survivors of the Holocaust,” said Mark Thompson, director of the museum. “The museum has made tremendous progress in this regard, and we anticipate a similar result in this year’s show.”The decision to stop making financial donations to the Hitler Museum of Art in Munich and its subsidiary Gebirgs-Bauhaus-Wirtschaft, following a wave of resignations following the exhibition “The Third Reich,” was made by the Met in protest of the institution’s continued support of the Nazi regime. “We are not convinced that the museum�", "The next Biennial should aim to “unify the audience, the work, and the venue’s design. An extension of this theme concerned the performance of the work. In taking this step, the art historian Juliette de Montreal will be able to expand the portrait and the performance into a kind of ‘techno-futurist’ space, an exploration of the possibilities of the digital and the digital apparatus,” he said in a statement.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than eight thousand photographs by American artist Harry André and his wife, Nancy, an armistice signed by the American and French governments in 1945 and 1948. The work, which was donated to the museum by the couple’s son, Alexander, and a LACMA patron, James George, was given to the institution by a collector who purchased it in 2001, a decade after the couple’s death.According to Artnet, the gift includes twenty photographs by Harry André and another six by Nancy, who were involved in the development of his painting and collage works, “The Body and the Impossible,” from the period of the American", "The next Biennial should also consider the long-term future of the exhibition and how it might emerge from the current political climate. Among the issues that should be addressed are the institution’s relationship with the local community and the architecture of the exhibition. Should it be moved to a museum in another city or should it be relocated to the museum in its current location? Should the exhibition be restored or should it be retitled “Pró x Biennale: Mémoires des délutions” (“More Prisms?”) and staged in a different location?Should the exhibition be opened from October 21 to October 27 and closed on October 30?Should it be presented in English or French and be included in the museum’s collection? And most importantly, could the show be reopened by the municipality of Saint-Tropez at twenty-five o’clock on the morning of March 14, 2020, so that the public can enjoy the works in its entirety?“This is an important question for us, but a difficult one for the Art Newspaper,” Jean-Luc Bénétière, the executive director of the Biennale de Lyon and the chair of the 2020 edition, told the Art Newspaper.", "The next Biennial should take place in the capital city of Chicago at the beloved Illinois Institute of Technology (IIT), where the biennial will be held from March 5 to March 7, 2020. The biennial will feature more than 100 works by women artists, including Sarah Sze, Talia Sassen, and Eytan Schoelkopf, and will focus on the life and work of the late artist Barbara Bowman.“We are so excited to present the first show of works by women artists in Chicago,” said museum director Karla Case. “The best way to describe the work of this exhibition is as a city-wide celebration of the work of women artists in Chicago. The first show is the opportunity to see some of the work of women artists, and it is the show that will define us as an art museum. We invite you to join us in celebrating the work of women artists throughout the city.”\n\n\nThe Pérez Art Museum in Mexico City has received a gift of fifty-seven works by Pablo Picasso from the estate of the late French painter Philippe Lanthier. It is believed to be the first time the estates of two of the greatest painters have been united in this way", "The next Biennial should be held by the end of the year. If the date is moved forward to the end of the year, then the theme of the exhibition would be “Unfinished Business.” The upcoming event will be housed at the Museum of Modern Art.\n\n\nThe Metropolitan Museum of Art in New York has appointed Caroline Owen as its next director. In her new position, Owen will work with the museum’s staff to advance the museum’s vision of a more inclusive, interdisciplinary, and collaborative collection.“Caroline is a visionary leader who has built a successful career by championing the work of underrecognized and underappreciated artists, championing artists who were not represented in the United States, and championing artists who had only recently begun their careers,” said Amy Spalter, the newly appointed chair of the museum’s board of trustees. “Having worked with her for nearly a decade, I’m confident she can make the museum a destination for everyone.”Since 2010, the museum has employed a team led by Owen to research and design the exhibition program. The team also oversaw the museum’s acquisition strategy for the more than five hundred works on view", "The next Biennial should be held in the coming months, during the time of the academic year. The biennial will receive an additional ¥140 million from the January 2020 issue of the magazine, “Artforum: The Politics of Art.”\n\n\nArtforum announced today that it will publish the next edition, “The Politics of Art: From Filmmaking to Cinema” in the spring of 2021. The biennial will also introduce a new digital platform and exhibition, “The Standing Room Table,” which will examine the history of cinema from a feminist perspective, and will include a selection of works by women artists\u0097a touchstone for feminists before they left the academy to found the radical feminist group the New Art Press.The exhibition will be curated by Julie Bakr, director of the Pulte Museum in Lisbon; Domenick Csoksi, the curator of modern art at the Kitakyushu Museum in Japan; and Rebecca Langan, the director of the New York City–based Center for Feminist Art. The artist-run collective will take the stage at the Hammer Museum in London on September 9.The biennial will highlight the work of women filmmakers\u0097to date, the project has launched twenty-seven", "The next Biennial should commence in 2021–22. “We are excited to start the next stage of the work of the exhibition,” said Pia Catellani, president of the exhibition. “It will be a challenge to keep the exhibition on track to the themes and to the design of the exhibition, but we are certain we can.”Besides the aforementioned themes, the biennial will aim to present new work and reconstruct the history of the exhibition. The project of reconstructing the exhibition will be headed by Oskar Eustis, architect of the new exhibition space Frieze NYC. An exhibition of work by Hilma Roden and LaToya Harris will also be staged.Inaugurating the exhibition will be a new series of sculptures by King Kamegala, a contemporary artist and leader of the Nabor sect of Hinduism, which are based on the body of a hippopotamus. The topic of the sculptures will be “The Elephant,” a series of images involving the body, the elephant, the trunk, and the trunk of the hippopotamus.“The project of reconstructing the exhibition is a collaborative effort between the artists and organizers,” said the artist. The exhibition will", "The next Biennial should be held at least once every two years. The first iteration of the event will take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Nadim Kobe, a longtime associate curator at the Los Angeles County Museum of Art (LACMA) and the Los Angeles County Museum of Art (LACMA) curatorial staff member, as the new associate curator of modernist and contemporary art. He succeeds Zoe Leonard, who departed the institution in March 2019 to become the deputy director of curatorial projects at the Morgan Library and Museum.“We’re thrilled that Nadim will join the staff of LACMA and LACCAM at a time when they’re facing a difficult and challenging time,” said Liz Anne Manley, curator and chair of the board of trustees. “We’re grateful for the work she’ll do to further LACMA’s legacy as an innovative and passionate institution in our community. We’re proud of her both as an associate curator and as an LACMA alumna.”Kobe comes to the institution from the 2018–19 school year, where she was a graduate assistant at the Cooper", "The next Biennial should focus on the historical and cultural qualities of the local environment, the food, and the people, as well as its relationship to the local community. The theme of the 2020 edition should be “Biodiversity and Human Well-Being.” The event will take place at the Nara Museum of Art in Nara, Japan, from November 5 to November 8, 2020.\n\n\nThe National Center for the Arts (NCA) in Washington, DC, has received a $5 million gift from Jay-Z and Beyoncé. The $5 million gift, made by Jay-Z, comes after the NCA received a $2.5 million donation from Beyoncé and her husband, Jay-Z & Beyoncé, in 2017. This gift will allow the center to build a new 330,000-square-foot home for its collection.The National Arts Center, who received a $2.5 million gift in 2018, has also recently transformed from a half-million square feet of urban space into a museum. The centerpiece of the expansion is its new urban farm, located on the northeast corner of the NCA’s campus in North Adams. Known as the Jay-Z Lab, the project will bring together", "The next Biennial should take place in 2022. “The collection shows the direct and often incisive connection between art and the African diaspora,” said Paul. The move follows the departure of director Greg Wilgus, who had led the museum for nearly twenty years, and was facilitated by the appointment of Karen Beasley as senior curator of African art. She will assume her responsibilities on March 5.\n\n\nItalian architect and architect-historian, Stefano Cattelan, has been appointed the next president of the Venice Architecture Biennale. Cattelan will succeed Felice Reale, who is retiring in April, and will assume his post in June. He succeeds Giuseppe Cimolino, who has served as president of the venue since 2015. “Giuseppe Cimolino and Stefano Cattelan’s vision to build an architecture for the future of the Biennale is very clear,” said Reale. “Giuseppe Cimolino has given an example for the project and for architecture and the world in general. Stefano Cattelan has been a true champion of the place and, at the same time, an inspiration for architecture", "The next Biennial should be held in 2021. \n\n\nThe Art Newspaper in London has released the newest issue of its biennial Artforum, featuring interviews and analyses with twenty-eight artists and collectives, including Tim Franklin, Kiki Smith, Richard Thewlis, Andrea Lemke, María Berrío, and Elizabeth Peyton.Browse the full issue here. \n\n\nThe Museum of Modern Art (MoMA) in New York has recalled almost four hundred employees after workers discovered that a construction site in the museum’s New York City outpost of the Cooper-Hewitt complex had collapsed in a fire that broke out on January 30. The New York Times reports that the building, which is undergoing a $2.5 million rehabilitation, and the museum were not prepared to deal with the incident for weeks, leading some workers to believe that the entire space could have collapsed within days.The structural engineer who inspected the building, which has been under construction for over a decade, determined that the fire had been sparked by electrical wires that were pulled through the building. According to the New York Times, the scaffolding that surrounds the building was also not designed to withstand the weight of the building’s contents, which include the Whitney", "The next Biennial should take place in the city in 2022.The selection committee made the announcement on Wednesday. The next edition of the biennial will be hosted by the National Museum of Modern Art in Berlin.\n\n\nArt in America: Previews and Submissions, a new exhibition organized by the Sundance Film Festival (SFF), has announced that it will open in January 2020 in partnership with the Smithsonian American Art Museum (SAAM), the National Museum of African Art in Washington, DC, and the American Argumentum. The event will feature more than 150 works by forty-nine contemporary artists and will run alongside the upcoming exhibition “How Did We Get to this Point?,” which will present fifty works by thirty-six artists over the course of two days. “We are thrilled to invite our fellow SFF Festival attendees to experience the full breadth and depth of the Sundance Film Festival,” said Kim Wallach, cohead of the Sundance Film Festival and curator of the forthcoming exhibition. “This year’s show will explore the interdependence between art and filmmaking beyond the obvious—and within the art world as well—by showcasing the work of nineteen new and established artists, as well as the work of artists of", "The next Biennial should be held in 2021. [More information]\n\nThe National Geographic Society’s next major public sculpture, the seventy-second edition of The Copper Furies, will open in the spring of 2021. Titled The  and the  (2017), the show will feature more than seventy works by forty-one artists, including Jonathan Pryce, Rayyane Fadal, Hélio Oiticica, and Molly Crabtree, the final exhibition of its long-term collaboration with the institution.Set in the town of Copper, England, the  will engage with themes of history, religion, and the Bible, and will feature works by artists such as Harriet Tubman, Lori Sullivan, Wangechi Mutu, and Madeline Albright, as well as Anish Kapoor, Cara Henry, and Jean-François Chalard, among others. The show will also include a new music video by Melissa Borthwick and Jenny Hollett, which will be simultaneously shown on both Korean and English television. The new institution, which is owned by John Varley, will be located near", "The next Biennial should take place in 2020. “The revolution in art is underway, and it is rapidly changing how we live, think, and experience the world,” said Jane Kleiman, president of the museum. “We are at a critical juncture in which to shape and shape artists’ practices to meet our changing needs and needs of the future. While the next Biennial will not resolve the complex cultural challenges and opportunities of our era, it will be an important step in the evolution of a new kind of museum.”The biennial—which will be held at the Metropolitan Museum of Art in New York from September 5 to September 8, 2020 and will be hosted by the Biennial Center in the Bronx—is supported by a $5 million grant from the Andrew W. Mellon Foundation. The full list of donors is as follows:A.F. & A.M. Benenson & Partners, Inc., New York City· $5 millionArchitecture Research Fund, New York City· $5 millionArt Institute of Chicago, Illinois· $5 millionArtist Relief Fund, New York City (formerly known as the Art Fund) (formerly known as the Art for America program) (formerly known as", "The next Biennial should be held in Tokyo in 2020, and the 2020 season will be biennial-long. The event will receive an extra $1 million from the Tokyo Science, Technology, and Society (STS) council in 2020. In an editorial published yesterday, the newspaper stated that the fiscal agreement between the city and the state of Tokyo is “a major step in safeguarding Japan’s future as a top tourist destination in Asia.”The agreement establishes a new $1.5 billion fund to support the construction of new Japanese cultural sites, and also provides ¥100,000 grants to help fund the construction of new sites for the 2020 and 2021 seasons, and an additional $0.5 million for the 2020 cycle. The state will receive the funds through an emergency fund established by the government in February 2017.The announcement of the fiscal agreement came amidst the midterm general election campaign. The political battle over the biennial, which was organized to promote Japan’s cultural exports, has been a contentious issue for a number of months. On February 15, the daily Report from Japan Times published an article questioning the legality of the deal. The same day, the Japanese government announced it would suspend the 2020 season, and the 2020 biennial was"]