["The next Biennial should take place at the Biennale de Lyon in January 2021. “We are working hard to make the new project of the biennial with a new and new narrative, and the change of the theme is not an easy decision,” added Bonham-Baker. The biennial, which will be staged at the newly created Het Lumijn in Amsterdam, will be divided into two parts: “The Story of Art and the Museum,” an exploration of the life and legacy of artist Karl Lagerfeldt (1876–1940), and “Art and the Concept of Time,” a retelling of Lyrically Inspired Dada (1939). In the new biennial, between the story of Lagerfeldt, a German Jewish artist who split from the Nazi party in 1931, and the museum, the text will explore the history of art and the spatial limits of time. This is one of the first times the new theme will be presented in the Dutch city of Amsterdam. The biennial will also include a discussion with artist and scholar Ulla and Hans Hollechner, the creators of the sculpture Exacto, the first work by the artist to", "The next Biennial should be held in 2020. But if it doesn't happen, we will continue to receive funding from the British government for our exhibition, exhibition and research in order to continue our work. In fact, I know that if we continue with this programme, which we have been doing for more than twenty years, our exhibition will continue to be staged.\n\n\nOn Friday, British Prime Minister Boris Johnson announced that he will give the National Museum of Scotland the $5 million to create a new exhibition dedicated to the life and work of Scottish artist and philosopher Erma Bombeck. Johnson also announced that an additional $200,000 will be made available for the institution to commission new works by artists such as Bertrand Russell, William Kentridge, and Erma Bombeck’s husband, Thomas.Commenting on the donation, director Stewart Clark said: “We are hugely grateful to the British Prime Minister for his leadership on this important matter. From early on and throughout, Johnson has sought to support the museum in its struggle to gain recognition, to encourage a greater understanding of the importance of art and architecture in shaping the cultural life of Scotland, and to champion the importance of artists and thinkers in shaping the future of Scotland. It is our mission to support", "The next Biennial should take place at the Pacific Institute in London in May 2020. The event will be hosted alongside the first edition, marked by the artist William Eggleston, in the exhibition hall at the SSE Arena, London, which will also host an exhibition of work by the Los Angeles–based Filipino artist, Nene Yeboah.For the second year, the festival will be held at the Palazzo Bernardo in Venice, and will also feature works by internationally acclaimed artists including the New York–based artist Naguib Mahfouz, the Singapore-based artist Fotopatcto, and the New York–based artist Kaustubh Patel.For the third year, the event will take place at the Museum Trieste in Rome, and will also introduce a new series of events and activities. The theme of the event is “Concerned, with care, is the soul of art,” and will end with a reception for the participating artists and a concert by the artist Doleful.The programme, which will run for five days, attracted a mixed response from critics and collectors. Artforum editor-in-chief Max Beckman called it “an experiment on a grand scale,", "The next Biennial should be held in 2020–21, with the biennial expected to run as long as twelve months.In the meantime, the institution is working towards securing additional funding for its collection, including the first-ever interviews with the American and Israeli delegations to the Fifty-Ninth Venice Biennale. In a statement, the museum said the project is part of its efforts to “exceed the Venice Architecture Biennale” and “constitute a new landscape for cultural exchange and dialogue between the United States and the European Union.”\n\n\nThe Toronto International Film Festival (TiFF), which was scheduled to run from September 25 to October 3, has canceled its upcoming edition, which was originally set to take place at the University of Toronto (UT), as it works to address the health problems caused by Covid-19.The festival—which was cofounded by the university and the Israel Film Institute (IFI)—was also forced to cancel its inaugural edition in March 2019 after organizers discovered that one of the invited filmmakers tested positive for the virus. In May, the Toronto Film Festival board voted to remove the ten participants from the event, which had already been moved to the city’s Annex in an attempt to lessen", "The next Biennial should introduce the public to the work of artists whose techniques were influenced by the space as well as to be able to identify with and experience them. The visual arts have been neglected for so long that they are often overlooked. The new Biennial should seek to address this.”\n\n\nA delegation of artists and academics led by American photographer Laurie Anderson has announced its intent to boycott the Fifty-Ninth Venice Biennale, scheduled for March 22–March 29, 2020, citing the pavilion “where the exhibition of the work of Laurie Anderson’s photographs would be neglected.” Anderson, who resides in New York, has spent an inordinate amount of time and effort to secure the exhibition space in her hometown, photographing landscapes and people in person in order to gain a better understanding of how their bodies and minds work together. Her photographs have been exhibited at the Museum of Modern Art, the Museum of Modern Art, the Metropolitan Museum of Art, and the Los Angeles County Museum of Art, and she has organized solo exhibitions at the Whitney Museum of American Art in New York, the San Francisco Museum of Modern Art, and the São Paulo Biennale.Following months of activism by artists, academics, and activists,", "The next Biennial should focus on the history of the institution and in particular the impact of the institution on the lives and art of twenty-seven artists, including João de la Mora, Filipe de Espírito Santo, and Alfredo Arruda. \n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has put out a public call for proposals for its 2020 edition, which is currently underway. Among the works that have been selected are pieces by the artist-turned-philosopher Rob Thomas, a statement entitled The Future is All Around Us, a work that was made in a sea of purple, and a composition by Willem de Kooning, which is inspired by a painting by the artist Altiniti.The biennial will run from September 11–September 13, 2020 and will be held at the Los Angeles County Museum of Art (LACMA), the sprawling former Air Force base west of downtown LA, and will be organized as a series of studio visits and will draw fifty thousand visitors. The theme of the exhibition will be the future; the museum is currently working on a new exhibition for the period between December 1 and February 2.The proposal deadline for the biennial is September 5.", "The next Biennial should be held in 2020 and will be hosted by the Museum of Modern Art, New York; the Museums Association, New York; and the Museum of Contemporary Art, Boston. The 2021 edition will be hosted by the Museum of Fine Arts, Houston, the National Museum of Women in the Arts, Washington, DC, and the New Museum, Washington, DC. The 2022 edition will be hosted by the Museum of Modern Art, New Orleans; the Museum of the American Indian, St. Louis; the Metropolitan Museum of Art, the Metropolitan Opera House, and the Smithsonian American Art Museum in Washington, DC; and the Museum of Contemporary Art, Chicago. The twenty-third Biennial will be held at the San Francisco Museum of Modern Art in 2022.\n\n\nThe Museum of Contemporary Art (MoCA), New York, has announced that it will enter the 20th century with a new collection of works by Iranian artist and theorist Ali Sina. The exhibition will be inaugurated by a special exhibition of Ali Sina’s art, titled The Sultans of Peace, at the Javits Center in New York on September 5. A companion exhibition on Ali Sina’s art will be presented at the", "The next Biennial should focus on the work of international artists in their home countries and regions, and will assemble thirty-two works by artists from twenty-six countries and territories. The first version will be staged in the first exhibition held at the museum in the United States. \n\n\nThe London-based art dealer Danh Vo and his Singapore-based partner have announced that they are suing the city of Singapore over the relocation of the company that operates the Singapore Art Museum (SAM) to the city’s Kensington precinct and has threatened a class action if the organization does not make improvements. The suit was filed in the High Court of Justice in Singapore on January 9.“The defendants have committed a number of breaches of the defendants’ undertaking to repair the premises and to ensure that the premises remain in working order,” Sydney-based lawyer Andrew Deane told Artnet. “They have failed to indicate any intention of addressing the structural damage that has been caused by the bankruptcies of the three leading private real estate companies in Singapore, and have instead shown a real lack of concern for the sustainability of their businesses.”The case has serious implications for the future of the institution, which has been closed since April 16 and", "The next Biennial should begin as scheduled on October 22, 2020, and conclude as scheduled on December 21, 2020. The 2020 edition will be subject to the same conditions as the previous edition, the 2019 edition, and the 2018 edition. The 2020 edition will be held at the Museum of the Moving Image in New York and will be co-curated by curator Scott Clement of the Museum of Modern Art and associate curator of thematic practices Judith Block and Gregory L. Martin. The 2019 edition, “Moving Images,” was organized and curated by Hanna Rosin and was hosted by the W.A.S.K. Gallery in Pasadena, California. The 2019 edition featured work by forty-three artists, including Victor Basagal, Anna Atkins, and Barbara Halperin.\n\n\nThe European Parliament has voted to establish a €1.2 billion fund to help Greece recover from the economic repercussions of the coronavirus. The legislation, which was adopted by a vote of 240 to 211 on Tuesday, allows the European Commission to allocate up to €1.2 billion ($1.5 billion) to help Greece address the economic fallout stemming from the novel coronavirus.The fund will provide financial assistance to individuals and small and mids", "The next Biennial should take place in 2021–20.\n\n\nThe University of Bristol is launching an initiative to bring more than twenty-five thousand items from the collection of the British Museum to the City of Bristol. The initiative, which will involve the transfer of twenty-five thousand items from the museum, known for its collection of more than one hundred thousand works, including works from the British Museum and the Tate, and will culminate with the return of a fifty-foot-long glass cube from the collection of the Museum of Modern Art (MoMA) in New York.The project is part of an international effort to improve the lives of people living in the city through the exhibition of works by artists living in the area. The initiative was spearheaded by the university, which is currently working with artist Zoya Makhmud to develop a new MoMA–Birmingham series, and is set to run from February 21 to February 29, 2021.“In our ongoing effort to support artists, curators, and the City of Bristol, we are excited to be working with MoMA to deliver a new series of exhibitions that celebrates the breadth and depth of our collection,” said Toby Steed, the director of the university. “MoMA is one", "The next Biennial should be held in the spring of 2022 and will be led by the Los Angeles–based firm Nara Roesler. The theme for the show is “In Praise of Life” and will be “in honor of life and quality of life.”“Through the work of biennials, we are committed to carefully crafting works that highlight the central role of art in shaping new cultural and social practices and new modes of expression,” said Bell. “We hope that the Biennial will be an occasion for the United States to reflect on the limits of art and the ways in which art may exercise an influence on the future destiny of the country.”\n\n\nThe Tudor Revival Foundation, which was established by the Tudors to conserve and restore the collection of the late William Shakespeare and his wife, Anne Boleyn, has introduced a new scholarship initiative that will seek to create a shared vocabulary and a common narrative around Tudor architects and how they and their buildings stand in relation to modernism and design.The program, which will consist of online courses and seminars, will be organized as part of Tudor Revival’s initiative to engage with the Tudor Revival Museum and Galleries (R", "The next Biennial should encompass the history and current affairs of the city, the history of the city’s arts and culture, and the city’s architectural heritage.”The 2019 event will be held at the Museo de Cultura Moderno, in Lisbon’s capital, on October 27–November 4.\n\n\nThe Hong Kong–based artist, who also serves as head of the Hong Kong Art Museum (HKAM), has been awarded the Guerrilla Prize, an annual award presented by the Hong Kong Art Museum (HKAM), Hong Kong, to encourage the creation of new work by emerging and established artists. The artists selected for the award, which is given annually by the Guerrilla Foundation, are Tze Tiankai (Taiwan), Anake Tsuda (Taiwan), and Tung Siwei (Hong Kong).Guerrilla Prize will be presented at an event to be held in 2020 at the HKAM, Hong Kong. The winner will be announced sometime this year.\n\n\nThe nineteenth edition of the Hong Kong Biennial, which was held in September 2018, has been canceled. The fifteenth iteration of the exhibition—a solo presentation of works by seventeen artists that took place in November—was supposed to take place in", "The next Biennial should be held in 2021.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) is launching a new online platform that will provide visitors with a new way to experience the museum. Called the Metromontaine, the platform will debut on December 6 and will feature more than 1,600 works from the collection that are currently on display in the museum’s collection.Among the works that have recently entered the exhibition are Matthew Arnold’s exhibition “Golgi Theory and the Metamorphosis” (2019), which was shown at the Museum of Modern Art in New York in December 2018 and previously featured in the inaugural edition of the National Film and Television Archive in Washington, DC, in April 2019. The work will be featured in the exhibition “The Metamorphosis: A Modern History” (2019–20), which premiered at MoMA in January 2020. The platform will also host an exhibition of work from the collection that will be on view until March 20, 2020. \n\nThe Museum of Modern Art (MoMA) in New York is launching a new online platform that will give visitors a new way to see works by the Museum’s distinguished gift patrons—artists", "The next Biennial should take place at the Salone de São Paulo, in central Brazil, in 2021. The application process for the 2019 edition was closed on May 30. The reopening of the exhibition will be marked by the exhibitions “Alberto Burri: A Fantastic Spectacle” (2019) and “José Bonté: The Work Is Not Laid Down.”\n\n\nArtforum has revealed that the 2019 edition of the prestigious Art Basel (ABS) fair in Hong Kong will be postponed due to the Covid-19 pandemic. The Hong Kong pavilion, titled “NIRIN,” will be moved from December to February. In a blog post, Artforum said that the move was made on the advice of a “small number of trusted advisors” and that the decision to move the exhibition was made “in the spirit of forming new partnerships and strengthening the presence of Art Basel in the region.”The decision to close the show came after an “open letter” written by some 200 art-world executives to ABS director Charles Shy. The letter stated that the decision to cancel the show was made in the interest of “more than", "The next Biennial should take place in Jalalabad, Pakistan, in April 2020.  Previously scheduled for March 2022 and March 2024, Shahid Khan-e-Sanusi and Mark van Praag, the directors of the Claremont Institute in California, have announced that they will move the exhibition from its current location in San Francisco to London. The move has also forced a change in venue. In April, the biennial was rescheduled for July. The biennial will now be held at the Southern Forum in London. The biennial, which, according to the Los Angeles Times, was conceived as a way to engage with issues central to the Muslim world, will now culminate in the exhibition “In the Name of Allah, the Most Compassionate.” The 2020 edition of the event will be hosted by Mr. van Praag at the venue, which is located in an industrial park in the city of Coventry in England, from February 31 to March 7, 2020. \n\n\nThe jury in the trial over the killing of George Floyd, the North London hip-hop artist who was set to be killed by police in May 2019, has upheld the killing of the ninety-three-year-old", "The next Biennial should be in 2021 and is currently on track to take place in the spring of 2023. District director Kailash Satyarthi told the Art Newspaper that the theme will be a “quest to think about how the biennial is encoded in the biennial.” He said that the art of the biennial will be constructed through the creation of new narratives that are fully constructed through the biennial.Satyarthi said that the exhibition “will be a reflection on the film and the world through the lens of the biennial.” The artist will also discuss how the exhibition will present a “new historical narrative on the history of India.” \n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the opening of new public artworks in the city. The guidelines, which were issued by the agency on April 1, outline how the public may display works in public spaces, including parks, on public transportation, and in public spaces where the public has a direct view of the works.The guidelines state that “artwork installations, performance, performances, screenings, performances, and screenings of art, ‘including video’ exhibitions,’ may be", "The next Biennial should be held in 2020. “The global demographic crisis is a global crisis, not a local one,” said Michel Lellou, Chairman of the institute and president of the Paris-based biennial space Cinéma. “It will require all of us to act together, to create and to share knowledge, and I believe we can. It is a question of whether collective action and solidarity can prevent the catastrophe.”All of the participating artists have agreed to continue working by signing an open letter on Thursday, July 28, 2020, which reads: “We, the undersigned artists, artists-in-residence, and artists-in-residences of the French Republic, are writing on behalf of our fellow sovereigns and artists and in favor of the ratification of the Paris Agreement on Climate Action. This Agreement divides humanity into two camps: those who want to limit humanity’s impact on the environment and its inhabitants’ consumption and those who want to increase the atmosphere’s temperature, absorb more carbon, and heat the planet. We demand the European Union and the European Commission to implement the Paris Agreement and to comply with its obligations.”The agreement, which was signed by", "The next Biennial should be held in 2022, with the theme 'Heritage, Identity and the Present.” The first iteration of the exhibition, which was organized by the museum’s Institute for Contemporary Art and the artist-run organization 'KAMIKS’ collection, took place at the museum in 2006. The biennial will include the works of seventy-four artists and will run concurrently with the upcoming exhibition “Requiem: Artists’ Legacy/KAMIKS” at the following venue:\n\nA new exhibition opened in the Bárbara Collection’s Manhattan space in the Museum of Modern Art (MoMA) on Saturday, May 23, featuring work by thirty-six artists including Agnes Martin, Agnes Martin-Davis, Cindy Sherman, and Isabel Rivera. The show, titled “Power of the Body” (PHA), was curated by Anna-Marie C. Oxtoby, an artist-in-residence at the Museum of Modern Art, and was first presented at the institution in 2006.The show is a continuation of the project “Sensate: Art in the Age of Black Power” (2013–14), which examined", "The next Biennial should be held in 2021.\n\n\nIn a decision that has exposed deep divisions within the Swiss Federal Office of Culture (BfV), a group of five artists have announced they are withdrawing from a planned exhibition during the May 2020 edition of the exhibition, which focuses on the history of art in Switzerland. The exhibition, titled “Totenkopf Kunst” (Tree of the History of Art), will focus exclusively on works in the collection of the BfV. The group comprises Markus Bacher, Oliver Burkhart, Peter Schäfer, and Stefan Schubert and will take place in the exhibition space in Basel from May 20 to May 21, 2020.“We were surprised to receive the news that no other works in the exhibition would be included in the next edition,” said Stefan Schubert. “We were also disappointed that there wasn’t a new exhibition about art that was immediately created.”The decision to pull the works from the exhibition was made with the approval of the museum’s board of directors, which comprises members from the public, the Higher Council of the Swiss Federal Cultural Heritage Authority (BKA), and the Büroclassica,", "The next Biennial should be held in 2020–21. The exhibition will feature work by thirty-five artists, including Jim Jarmusch, Oksana Akhmatova, and Tanya Bonakdar, and will focus on “human tendencies in the face of extraordinary obstacles.”\n\n\nThe Grand Canyon National Park in Arizona has become the latest state museum to begin welcoming visitors from China—the Chinese American Art Museum (CAAM) announced that it will begin welcoming visitors from the mainland on Wednesday, March 8. The announcement coincides with a series of events that have been organized by CAAM to promote awareness of international immigration and to promote the Chinese American art museum’s work in support of arts and cultural exchange between the United States and China. CAAM executive director, Laura Hu, said the move is part of CAAM’s “commitment to creating an environment for the exchange of ideas and experiences.” Charles G. Yang, a former curator at the San Francisco Museum of Modern Art who studied with Hu at the institution, hailed the announcement as a “game changer.” Yang added: “CAAM’s outreach program has been very effective at bringing people together. The", "The next Biennial should take place in 2020. The next exhibition should be staged at the end of March. The next book should be published at the end of June. In addition, a new research platform will be created at biennial.org to give the public access to a digital version of the program. The new site will also feature a virtual exhibition hall and an online digital library of over 10,000 lectures and books. The platform will also offer a digital art museum experience, with a dedicated space for students and families.\n\n\nThe Museum of Fine Arts (MFA) in Boston has welcomed artists Richard Anagnos and Christopher Woolley to its curatorial staff. They will serve as the MFA’s first artists-in-residence in the United States since the museum’s founding, and will work as part of the first-ever semester long Art-art project, “Shaping the Museum in a Different Way,” which will focus not only on the museum’s architecture but also on how the institution can change over time in order to reflect the cultural and social landscape.The curators will create pieces inspired by pieces worn by the artists by connecting them to their everyday lives; the museum will mount the", "The next Biennial should be held in 2030. \n\n\nAlberto Gilardi, the Argentinean contemporary artist who spent more than forty years creating works that use his body and ideas in bizarre and surrealistic ways, has died at the age of eighty-nine. In an article published by the Museum of Modern Art (MoMA) in New York on September 27, the museum said that many of his works were based on ideas he had received from his late wife, the Brazilian artist Ida Gilliam, who was also his partner and collaborator throughout his career.His art is divided into three distinct themes: space and distance, movement and the abstract, and color and form. The essay “Alberto Gilardi as a Modernist” (2009) by the Italian artist Giulia Casaletti, who was once a friend and collaborator of Gilardi, is a great example. “Gilardi is a master of the abstract, an architect of distance, a painter of the color’s envelope, and a sculptor of form,” Casaletti wrote in a 1979 letter to her. “He is a living work. He is more alive than art.”The gallery, which recently renovated its space in the former H", "The next Biennial should be on the theme 'In Defense of the Heart: Feminist Art and the Human Face” at the Minneapolis Institute of Art; the sixteenth will be on “Living History: Art and Feminisms in the Late Medieval Period.” The 2019 edition of the exhibition, “A Lullaby to Myself,” will be held at the Haus der Kunst in Württemberg, Germany. The 2020 edition of the exhibition will be held at the Brooklyn Museum, New York; the 2021 edition will be staged in the Museo de Arte Contemporáneo Venezia, Luger, Italy; and the 2022 edition will be staged at the Palazzo d'Italia in Parma, Italy.\n\n\nThe museum in the Bronx where Gustavo Dudamel, the contemporary art historian, inventor, and cultural theorist who helped shape the Americanist postwar movement, died this week has hired John Lloyd, a former art curator, to serve as its new director. Lloyd, who has been honored by the MacArthur Foundation for his contributions to modernism and contemporary art, will take the helm from Kate Fowle, who has helmed the museum since 2014, on January", "The next Biennial should be held in the spring of 2020. The 2020 edition of the event will be hosted at the MCH Group, the parent company of the German daily tabloid Frankfurter Allgemeine Zeitung, in the capital Bern. The event will consist of a series of exhibitions, presentations, and performances, with the theme of \"New Relationships\", and will draw up to five thousand people. The biennial will also focus on the themes of the year, with a special exhibition titled “Year of the Dragon” and “Winter of the Human Race” at the Contemporary Art Museum Stuttgart, in the autumn.Commenting on the 2020 event, Jean-Claude Dufault, the managing director of MCH Group, said: “We believe that the theme of the theme of the 2020 edition of the Art of the Year is the most important thing for us as we stand at the beginning of a new chapter of Art History. The theme of the biennial is to re-embrace the solemnity and beauty of the past.”The 2020 event will be hosted at the MCH Group in the MCH Building, known as MCH Berlin, and will be co-organized", "The next Biennial should take place in the spring of 2021 and will include forty artists, including Hao Jingbin, Hai He, and xiao wang, who work in the sculpture, performance, installation, and installation art fields. The installation of Huiying Zhang, Hao Jingbin’s first solo exhibition in Shanghai in over two decades, and a solo exhibition of work by Wang Xueqi in the city in the summer of 2021 are among the themes of the upcoming event.\n\n\nAs the crisis in Ukraine continues to worsen, art workers across the country are struggling to support their families while in the country. One of the leading causes of financial hardship for art workers is the cancellation of a planned trip to Europe. Cosartia, an arts and culture platform run by the Gennady Zyumdzhan Foundation, announced on Tuesday that it would not return Art Basel Hong Kong, the luxury fair that traditionally takes place in the city, and instead will hold a retrospective of artist René Magritte’s upcoming exhibition, “Druida,” at the Art and Architecture Museum in Beijing in 2021. The show will be presented by the French-based dealer Lévy Gorvy.In a statement, Cos", "The next Biennial should take place in St Petersburg in 2022. In January 2020, the exhibition was to open in Berlin, Helsinki, Helsinki, Kiasma, and Škoda. The project was originally scheduled for completion in 2020, but was postponed because of the Covid-19 pandemic. The exhibition will now be held in 2021.\n\n\nThe Metropolitan Museum of Art in New York has received a gift of twenty-four artworks by the artist Vanessa Redgrave. The works, which were donated to the museum by the Deborah Redgrave Foundation in October 2018, include the work for the exhibition “Under the Skin” (2019), which is currently on view until November 14, and “The Shot Heard Round the World” (2019), an exhibition that reimagined the image of a woman in prison, with a group of artists portraying the incarcerated.The gift includes the six works by Redgrave, including “The Shot Heard Round the World” (2019), which appeared in “The Prisons and the Walls” (2019), which was on view until November 14; “Finished,” an erotic lesbian ballet performed by Redgrave and Patrice Oosterbaetens; “The Ho", "The next Biennial should focus on exploring the legacy of the late artist and present his work in a contemporary context. “The Biennial was born of a desire on the part of the artist to be able to meet the needs of an evolving audience, a contemporary audience in a time of extraordinary change,” said Jean-Michel Basquiat, the chief curator of the 2017 event, which was held at the Museo de Arte Contemporáneo in Madrid. “The Biennial was born in an era of globalization and the prevailing notion of art as a universal language, but also a culture of conflict. Art is learned, art is experienced, art is remembered, art is made into art, art is made into art with the artist, with the artist as the key.”The 2018 edition of the exhibition, which opened in March and ran through September, featured work by seventy-six international artists and was directed by Federico Bagnardi, who has curated the show annually since 2008. It was attended by a crowd of fifty thousand people.\n\n\nNew York’s Solomon R. Guggenheim Museum has received $50 million from the Frieze Artists’ Fund, an", "The next Biennial should be held within two years of the event.For the first time, the event’s schedule has been announced ahead of time and the events will be announced as we approach the festive period in December.The Biennial is organised as a series of open-air exhibitions spanning a number of themes, from the historical and the contemporary, and is organized around a theme-park, the city of Trieste, and the cultural centre of the ancient city of Graz. The 1,500-year-old city will host forty-four exhibitions, including thirty-six works by visiting artists, and will be transformed by a series of underground tunnels. The works and exhibitions included in the biennial will also be exhibited in the Venice Architecture Biennale in 2021.The event will also include a number of presentations on contemporary issues, including the importance of digital platforms and the development of new ways of responding to issues such as climate change, the exhibition of the work of Polish artist Wojcie Sosnowicz, the exhibition of the work of Ekaterina Zbaryska, and the upcoming exhibition of the work of Czech artist Petr Četa. The biennial exhibition will take place in the city of Trieste from January 25", "The next Biennial should be held at the Museo de Arte Contemporáneo, Barcelona, next February. The next edition of the Biennial should be held in the city at the end of March.\n\n\nThe London-based charity Hearts of Oak has announced a new ten-year grant program that will invest in the lives and well-being of young artists and will strive to create a more just and equal society. The program, which was launched by the Tate and the London-based charity Arts Council, will provide $100,000 to young artists in the UK by focusing on the areas of the brain, body and spirit, which are at the core of the Tate’s business. “With the new ten-year grant program we are creating a new model for supporting young artists and are building on the impact that Arts Council and Tate made for over a decade with our award,” said Tate director Maria Balshaw. “It is an incredibly exciting and unique opportunity to support young creatives in their journey to understand and feel the social and cultural impact that Arts Council had on London’s art and culture in the 1980s and 1990s.”In addition to receiving the grant, young artists will", "The next Biennial should focus on the social, political, and personal crises of our time. ” The 2019 edition, titled “Days of our Lives,” was held in collaboration with the City of New York and the Metropolitan Museum of Art. It will be inaugurated in Shanghai, the home city of the Hangzhou Museum of Fine Arts, and will examine the ways in which art and fashion intersects and clashes with daily life in the country. The 2020 edition, titled “Beyond the Frame,” will take place in Helsinki, featuring works by fifty artists, including Karolina Wojtas, Antony Gormley, and Isabel Moro. It will also feature the first exhibition of its kind for the Helsinki Art Museum, which was founded in 1829, and will be presented by the Helsinki Art Museum curator Marina Salomassa.\n\n\nThe Los Angeles County Museum of Art (LACMA), California, has released the list of sixty-five artists who will participate in the 2020 edition of the Los Angeles Artadia biennial, which will run from March 16 to March 18. Titled “The Contemporary,” the event promises to address issues of society and fashion with the", "The next Biennial should be scheduled for 2021–2022.  From April 13 to April 15, the Center for Art and Architecture at the University of Württemberg, Germany, will host a twenty-third edition of the exhibition.  The twenty-fourth iteration of the exhibition will be held in a different building, the Kunsthalle Basel, from April 16 to April 21, 2022. The twenty-fifth iteration will be held at the Museum Freie Universität Kunst, Berlin, in April 2021. The twenty-sixth and the twenty-seventh editions of the exhibition will be held at the KW Institute for Contemporary Art, Vienna, in October 2022 and March 2024, respectively.Other major events at the event include a selection of new works by solo and group exhibitions, a new Collaborative Exhibition, and a book launch. The full list of participating artists is as follows:Salta Albatross (Egypt)Arash Farid (Tunisia)Arash Farid (Sierra Leone)Arash Farid (Switzerland)Arash Farid & Lulzul Al-Araby (Morocco)Abdullah Farid (Sierra Leone)Abraham Farid", "The next Biennial should start on September 10 and run through December, 2021. This will be followed by a reopening of the museum on September 11. The museum will also close its doors for a fifteen-day period on September 13–14, the last day of the year for visitors.\n\n\nThe Metropolitan Museum of Art in New York has announced the twenty-two artists who have been selected for the 2019 Whitney Biennial. The biennial will focus on the theme \"Thematic Conversations, 1965–1975, with a particular focus on the work of artist-in-residence Charles A. King. The work of King, who had a long and distinguished career in both printmaking and film, is represented by the Met, which is collaborating with the artist in the exhibition.The biennial will present the work of twenty artists, including Ed Moses, Ellsworth Kelly, Lonnie Mack, Arnold Sturtevant, Robert Irwin, Dennis Hopper, and John Sheehan. The artists selected for the exhibition are Alberto Barbera, Cartas and their collaborators, Elizabeth Blum, Gavin Brown, Diana Conrado, Dawn Diaz, Joe D'Am", "The next Biennial should take place in 2022, when the museum will reopen to the public after a $260 million expansion and renovation. The theme of the inaugural edition was “The Past, Present, and Future of Art.” The theme of the second edition was “Anomalisa,” a portmanteau of the words “anomaly” and “possessed.” The work will be on display in a retrospective of work by three of the three artists featured in The Past, Present, and Future of Art, scheduled to open on September 27 and September 28, respectively.The biennial will feature the work of four artists: Agustín Arteaga, Juan Giménez, and Luciano Nuzzo. The other participants are Matthias Müller, Íñigo Lopes, and Pedro Luna. “We are delighted to help the Trieste to become an institution of contemporary art,” said Luca Michele, director of the museum. “In the last ten years, the museum has presented a series of exhibitions that reflect the contemporary vision of the participants. This year’s exhibition series is a reflection of that. Its two-day event will be an", "The next Biennial should be a serious exhibition of the work of the best artists of the twentieth century. I am convinced that, if the work of all the artists chosen in one year is presented at the Biennial, the exhibition will be a great success.”As it happens, the 2017 edition of the Biennial, “In the Beginning” (2019), was organized by the Manhattan-based artist Stéphane Berger. The exhibition included a selection of work that Berger created as a result of his experience in collaboration with composers McDonnell, Giles, Carrier, and Grant. The show also included new works by a number of other artists, including Paul Gauguin and Gertrude Stein.Lehmann Maupin, “For a Brief History of Space” (2019), was curated by Kathleen Chenoweth. The exhibition includes works by artists such as Mary Cassatt, Ma Sze, and Harald Sze. The 2019 pavilion was made up of twenty-three works, which were presented in chronological order by the artist.The 2019 Biennial will be held at the Guinness Corso di Vicenza in Italy from November 7 to November 10, 2020.\n\n\nThe Royal Academy", "The next Biennial should be held in 2021, and the first museum in the United States to host the exhibition should be completed by 2024.The new exhibits, which will feature works by twenty-seven artists selected by the National Governors Association, include works by artists such as John Lanchester, Thomas Kienholz, Mark Rothko, Julie Benz, and Geroë Rochat. In addition, the exhibition will also include a collection of works by artists from the Pacific Rim and Africa. The new institution, which will be inaugurated by a presentation of work by the artist William Eggleston, will be located in the former National Gallery of Scotland.“The National Gallery of Art is an extraordinary collection of world art,” said National Post editor-in-chief Carolyn Fair. “It is a treasure trove of eighteenth-century texts, drawings, paintings, designs, drawings, paintings, sculptures, and photographs that are as timeless and luminous today as they were fifty years ago. The National Gallery of Art cannot exist without the generosity of the public and the generosity of the National Museum of Scotland. We are privileged to support them in their transition to an institution that reflects their world-class artistic practice and ethos.”The Biennial", "The next Biennial should take place in the United States, and the show will be hosted by curator and curator of modern and contemporary art Juliana Cervantes, director and CEO of the Smithsonian American Art Museum, and curator and curator of modern art Peter Zumthor of the Art Museum St. Louis.“We are thrilled to be collaborating with the Saint Louis Art Museum for the 2019 biennial,” said curator and biennial director Mary E. Bogart. “It’s an important and vital chapter in the history of the museum. We are fully aware of the impact that this exhibition has on the lives and well-being of the artworks represented and the impact it will have on the cultural fabric of the city of Saint Louis.”A selection of works by artists and activists that are currently on display in the museum will also be presented to visitors in the fall of 2020. The biennial, which includes biennial exhibitions of work by artists such as Walter de Maria, J. M. Van Til, and Jean-Michel Basquiat, is curated by Elizabeth Alexander.\n\n\nCanadians are urging Prime Minister Stephen Harper not to lay off civil servants as the country faces a $716-million deficit owing", "The next Biennial should be held in 2019. The full list of eligible artists for the event is as follows:Artist Submission Deadline: 8:00 AM to 1:00 PMArtist Submission Location:Providence, RI Artist Submission Cost: $25+Submission Fee: $10Submission Subject: Art or Artistic PracticeArtist Submission: Anthropomorphic Practice Artist Submission: Artistic Experience Artist Submission: Anthropomorphic Experience: Biennial DiscussionArtists that have in the past: FilipinosCarbonforo, Carmen Cattell, James Cuno, Christian H. Bonakdar, Alexis Cristina, Thomas D. Kind, H. J. Johnson, Lee S. Hoehn, Marcia Kienholz, Larry Kudacki, Andrea Koudelka, Robert Louis Stevenson,University of Minnesota, Minneapolis, MNJoelyn Olsen, Charles Pines, M.A.R.E.N. Center for Contemporary Arts, College of New Jersey, Newark, NJJosh Mellenby, Columbia University, New YorkMichael Mellenby, Columbia University, New YorkJulia O. Hopkins, //bi", "The next Biennial should be hosted in the spring of 2021, with the exhibition to begin the following March.The first edition of the event, held in March 1924, featured more than 250 artists, including Cécile B. Evans, Erich Fromm, Leonor Øst, Franz Kline, and Hochstetten; played a crucial role in defining the fictional landscape of contemporary art; and offered the first solo exhibitions of artists such as Pierre-Auguste Renoir, Johannes Kiefer, and Andrea Pindell. The exhibition was followed by a second Biennial in September 1925, “Tout le monde ai un jeune homme.” The third Biennial, held in January 1929, featured artists such as Agnes Martin, Marcel Proust, George Herliz, and Louise Nevelson, and was curated by Yves Klein. The fourth Biennial, held in January 1932, featured nearly sixty artists who were represented by an international list compiled by the artist’s studio, including Agnes Martin and Pierre-Auguste Renoir.\n\n\nThe Smithsonian’s National Museum of African Art has given $1.25 million to Yale Union, an artist-", "The next Biennial should be held in the spring of 2021. The institution plans on opening the exhibition as part of its redesign, which will be completed in the summer of 2021.\n\n\nThe Institute of Contemporary Art (ICA) in Florence announced today that it has received a gift of seventy-two works by Italian modernist Stefano Mignelli. In addition to selected works on paper, Mignelli also created works on canvas and wood, and worked on prints and collages. The works, which were donated by his son Mario Mignelli, will form the centerpiece of an exhibition titled “Mignelli: From Paper to the Stone” that will open at the ICA in April. The exhibition will focus on Mignelli’s legacy, and it will feature works by thirty-seven artists.“This is an incredible gift of thirty years of Mignelli’s work to the Institute of Contemporary Art,” Mario Mignelli, the father of Stefano Mignelli, said. “The ICA is now in a very special position to merge Mignelli’s legacy with the ICA and to make the occasion of his seventy-twoth birthday a celebration. This fifty-", "The next Biennial should be held sometime in 2020. The institution has also received a $50,000 donation from the estate of the late British artist and activist A.J. Ayer. The gift will allow the museum to create a new 16,000-square-foot exhibition space in the former Betty Wright building.\n\n\nThe Samuel Johnson Foundation has announced that it will grant $50 million to contemporary artists in the United States in the form of grants. The organization will select three recipients, each of whom will receive $50,000. The foundation will then split the funds among the artists.The first round of grants, which were made on June 1, will focus on artists making work that addresses issues of the day and requires no more than five thousand hours of work. Each grantee will be given $20,000.The foundation is also offering a $5 million grant to the Detroit Institute of Arts (DIA) to encourage the exhibition of work by thirty-six artists from across the country. The announcement of the grant follows a $2 million gift from the estate of the late artist and activist Richard Anuszkiewicz, whose work was housed in the home since 1996. The second round of grants, which will be", "The next Biennial should be held in 2021, and the 2019 will be remembered as the year it began.The museum is planning to convert the former Grand Central Station into a world-class contemporary art museum with an extension to become the first museum in the United States to exhibit the work of Maurice Chevalier. The extension, which is slated to open in 2023, will be a science fiction museum that will hold exhibitions in both the museum and the city.“Grand Central is a vital cultural gathering point for the vast nation,” museum director Maria Balshaw said in a statement. “It is also a flagship for our work to create a more just, equal, and inclusive future. We are so excited to work with the City of New York and the City University of New York to create an environment for these important works to be viewed and enjoyed by people of all backgrounds and experiences.”The Grand Central Sculpture Garden in Central Park is currently undergoing a $50 million expansion, which will bring the grand finale of the event, the installation of a live installation of work by artist Michael Beasley, to the East Village. The project, which will include the construction of a 600,000-square-foot extra-curricular space", "The next Biennial should take place in 2021. “The Long Road Ahead: Art and the New Mandarins” (2019) will also return Artforum’s seal of approval next year. The biennial, which is being organized by the University of Maryland, will be hosted at the Frederick Art Museum in Maryland. The event will feature forty exhibitions that are on view in the institution in 2020. The Mawson Center for Art and Design at the University of California, Los Angeles, which was founded by two brothers in 1981, has received a $100,000 grant from the Henry Luce Foundation.  The Prestel Foundation, which is backed by the German industrialist, donated $50,000 to the Smithsonian’s Prescott-Newman Center for Art and Design, where it will showcase Untitled, 2011, a pain-stakingly crafted bronze work by artist Markus Messager, who is best known for creating works that experiment with light, movement, and opacity. Messager, who lives and works in Berlin, has previously won the Prix de l’Amiti’s prestigious $150,000 prize for his work Regina, 1979, and", "The next Biennial should be held in 2020. \n\n\nThe French Academy of Arts (AFAM) in Paris announced today the construction of a new, two-thousand-seat, contemporary art museum, called the Pétain Pavilion, in the city of Lille. The new institution will be named Pétain Pavilion and will be built in the city’s suburb of Montpellier.Alfred Prouvé, director of the AFAM, said: “The concept of a contemporary art museum is at the heart of the project. I hope that the Pétain Pavilion will be a template for the future. Pétain Pavilion will be a museum that is more than just an exhibition space, a community center, a research laboratory, an archive, and a library. Pétain Pavilion will be a museum of art that combines the history of art in France and that is contemporary, an important part of the history of art in the country.”The Pétain Pavilion will celebrate the history of art in the French Republic with a collection of more than 50,000 works by twenty-six artists, including Guy Debussy, Piet Mondrian, Pierre-Auguste Renoir, Pierre-August", "The next Biennial should be held in 2021, and the biennial will be hosted by the Galleria Almine in Beijing.\n\n\nThe Metropolitan Museum of Art in New York has appointed artist-in-residence Luanda Auril as its next director. She succeeds Carolyn Bennett, who died last September, and will assume her post in July.“Auril’s ambitious, politically minded leadership style, her ability to integrate a diverse range of existing practice, and her commitment to engaging with the lives and works of her subjects make her a strong candidate for the post of director of the Met,” said museum director Neal Benezra. “Her leadership at MFA will ensure that the museum’s curatorial and administrative teams are positioned to support the museum’s long-term goals, and that our exhibitions and programs reflect both the broadest and most diverse audience possible.”Previously, Auril was the associate curator and head of MFA’s Center for Contemporary Art, where she curated “Diana Al-Hadid: New Life” (2017) and co-organized the exhibition “Arts & Sex” (2016–17). She also served as an editor at large for", "The next Biennial should commence in the autumn of 2021.\n\n\nThe Haida Museum of Art in Vancouver, Canada, has appointed Peter Midgley as its next director. Midgley comes to the institution from the New York–based firm of Nara Shapiro & Samson. Previously, Midgley held senior positions at the Model Railroad Company (now the Detroit Institute of Arts), the Alamo Drafthouse, and the Museum of Tolerance. He succeeds David Salle, who retired in April 2019 after twenty-five years in the role, and will take up the post in November.“Peter has built a successful, inspiring, and ambitious museum from the ground up, integrating the design and construction of a contemporary art museum with an ambitious curriculum, affording opportunities for the museum to connect with visitors across the city, developing a global perspective through exhibitions, readings, and other programming,” said director Leigh Ann Robinson. “This new role will allow Peter to build on the museum’s recent success with a new collection that reflects the diversity of the field and the breadth of the history of art. Peter is a skilled and dedicated leader who has been instrumental in elevating Haida Museum of Art to the status of a world-", "The next Biennial should take place in 2021. As the artist-run event prepares for its second year, the Museum of Contemporary Art San Francisco (MCAF) has placed a $100,000 prize for the best-selling artist-endowed book of the year. The prize, named for the work of Sam Spiegel, will be presented at the MCAF Museum of Art from January 17 to January 22, 2022. The six shortlisted artists were Jessica Alba, the objet publique for the inaugural exhibition, and Dadaist Jean-Luc Godard, who was nominated for the third edition of the Biennial. The museum also announced that it is preparing to open a new museum dedicated to the artist-run spaces in San Francisco. The venue will be named after the recently-deceased artist-in-residence, Larry Marder, and will be located at 545 North Van Ness Avenue, just north of Government Street.The MCAF, which has been exploring the idea of a museum dedicated to cultural institutions since 2016, said that it expects the new venue will draw some twenty to thirty thousand visitors from around the world each year. The museum will also host educational programming and serve as a space", "The next Biennial should take place in the autumn of 2021. \n\n\nThe Center for Contemporary Art (CAA) in New York has announced that the organization will award $16 million to seventy-five artists from twenty-three cities, including New York, Los Angeles, Miami, and San Francisco, for the 2019–20 season. The funds will be distributed through a program that will be led by Alexandra Kubitskina, the CAA’s executive director and chief curator, and will draw from a pool of more than $65 million that was established by a $50 million gift in 2018.The seventy-five proposals are grouped into ten categories, ranging from the experimental, such as a performance by Joe Beasley, a former deputy director of the Museum of Modern Art in New York, to the dramatic, such as a documentary about a young pregnant fugitive in Mexico, which was shot entirely in Mexico City. In addition, the 2019–20 season will include fifteen exhibitions, including the first solo shows of work by artists such as Paul Gauguin, Bertrand Russell, and Ed Moses, and eight international solo shows, including the first show of work by an African American artist at the Museum of Modern Art in New York in more than twenty years", "The next Biennial should take place in New York in 2022. The work of artist and curator Karl Lacher is slated to open the event. \n\n\nOver the last forty years, the museum’s permanent collection of fifteen thousand works has been transformed by the revolutionary, multidisciplinary Art Advantages program, which aims to increase the breadth and depth of the museum’s collection by giving fifteen thousand artists a platform to present their work at the museum.The program’s first iteration, which began in 2002, promoted the work of \"non-Western\" artists, including a group of artists whose work was first exhibited at the Venice Biennale in 2004. The program has since been expanded to include work by artists whose practice spans both East and West, and the collection is now comprised of more than four thousand works.\n\n\nThe fifth edition of Art Basel Hong Kong is the latest edition staged by the Hong Kong–based organization. The fair will be held in the city of Almaty, Kazakhstan, from November 13 to November 15.“We are really excited about the exhibition,” said Mark Staben, Art Basel’s director of Asia. “It will be an exciting exhibition for Hong Kong and", "The next Biennial should be held in 2021, and the 2018 winner, Pablo Picasso, will receive his own retrospective at the Museum of Modern Art in 2020. The 2018 winner of the prize is Nicholas Rozhoff, whose work will be included in an exhibition at the Museum of Contemporary Art (MoCA). He is the first to receive the award, which was founded by Ed Moses in 1977 and is awarded annually.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Venus Diaz-Klaus has been named the new director and CEO of the institution. She succeeds Elizabeth Gilbert who retired last month after fifteen years in the position.“We are thrilled to have Venus join the MoCA family,” said museum director and CEO Paul Mpagi Sepuya. “Her deep experience and passion for art and art history makes her uniquely qualified to lead the museum in her new role, which is dedicated to expanding the collection and bringing it into the public eye. With this appointment, she will expand and shape the museum’s relationship with its world through new, connected, and expansive experiences.”During her tenure, Diaz-Klaus has developed new programs and made important financial contributions to MoCA, including ", "The next Biennial should be held in 2021 and will include works by artists such as Andy Warhol, Jean-Michel Basquiat, and Maurice Chagall, among others that have been on display since 2007. The 2019 biennial was held in the museum’s former location on the fifth floor of the Haus der Kunst, and featured work by more than 130 artists.The biennial will be inaugurated by the artist’s final exhibition, “The Heart of Man: Exploring the Origins of Art in the Twenty-first Century,” which will be on view through September 1. The exhibition will include works by contemporary artists, including the Swedish sculptor Rintoul, whose works have been on display at the Biennale in Barcelona since 2008, and the Italian modernist Gio Ponti, who will open the biennial in the city of Venice in 2021.\n\n\nThe Royal Philharmonic in London announced today that it is teaming up with the British Film Institute (BFI) to produce a biennial exploring how cinema has affected the lives and works of countless people across the United Kingdom. The partnership is part of a wider campaign to promote visual art in the UK, which was launched by BFI", "The next Biennial should focus on the role of the media in shaping our collective political and spiritual experience,” said the artist. “There should be a new platform for reflection that is free of the constraints of institutional and political interests.”The show will be organized as a “multiplatform exhibition,” which will include lectures, demonstrations, and other public events. The art will come from the collection of the artist’s husband, the Egyptian-born sculptor Gamal Aboussi, and will be curated by the exiled Egyptian novelist and scholar Barak Ravid.\n\n\nThe twenty-third edition of the Milan Biennale, curated by Roberto Cicutto and announced today, has announced that the event will now take place from September 5 to September 8, 2020 at the Stadio Arti in Milan, Italy. The event’s full list of exhibitors is as follows:Art Fund, located in New York; Center for Contemporary Art, located in New York; Gallery e Piretta, Milan; Gallery e Piretta Milan, Italy; Gallery Gatestone, Vienna; Studio Lad, Milan; and Studio Nino, Rome. The event’s inaugural edition was held at the legendary Tre", "The next Biennial should be held at the Graff Museum in New York in 2021. The 2020 edition of the Biennial will be held at the Museo de Arte Contemporáneo in Lisbon in 2022. \n\n\nThe Baltimore Museum of Art (BMA) has announced that it will receive $1.2 million from the Celant Foundation in support of its pilot program for artists and designers in the city. The grant, which is for arts and design projects, will also support the design of a new $100 million arts and culture hub, the Baltimore Arts Hub, and the creation of an open call for proposals.“This year’s Biennial of the Arts is a watershed for Baltimore, with its origins in the larger social crisis of the year, and the profound impact it has on the city’s creative community,” said BMA director Christopher Bedford. “The arts are central to our city’s fabric and identity. We are committed to working with the BMA to develop a new platform for the culture of our city that reflects the vision of the founding fathers and represents our city at this pivotal moment in its history.”The program, which will explore", "The next Biennial should be in 2020.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has appointed three new members to its staff: David Dolman, the museum’s curator of American art; Leila El Samerraieh, the director of the Center for American Art at the University of Texas at Austin; and Julia Wilke, the curator of European art at the Metropolitan Museum of Art. The Hirshhorn added Sara Benitez, who previously served as the museum’s assistant curator for American art; Austin-based artist and curator Jennifer L. Jones, who previously worked as an artist-in-residence at the Hirshhorn; and Vivian Richards, a curator and educator from Minneapolis.“We are thrilled to welcome these three talented and experienced artists to Hirshhorn,” said Hirshhorn director Christopher Simon. “Their backgrounds as professionals, as well as their enthusiasm for collaborating and engaging with our community make them a perfect fit for their roles. We’re confident that their talent, expertise, and dedication will help us to continue to present a spirited exhibition showcasing the work of emerging and established American artists.", "The next Biennial should be held on the basis of a new generation of artists, new ideas and a new reality. The task of the biennial’s artistic director is to develop, to rethink, to redefine and to create a new art. The biennial’s new purpose should be the foundation of a new way of thinking about the life and death of the artist.”While the exhibition will focus on the work of artists whose work has not yet been shown in the United States, the biennial will be held at the artist’s studio in San Francisco. “We felt it was important to recognize that our country is in transition right now and that, in the twenty-first century, art is a vital and essential vehicle for communicating ideas and experiences,” said Walter Isaacson, president of the Foundation for Art and Culture. “We looked to the art world for guidance on how we can move beyond our post-9/11 world. Art has a way of bringing people together that we can all take comfort in.”The fifteen artists who will receive the Biennial Award this year are:Alberto Barozzi, ItalyFederico Belloni, ItalyM. LeBlanc, FranceM", "The next Biennial should be released sometime in the second half of 2019.\n\n\nThe Metropolitan Museum of Art in New York has appointed Todd Covilart as its next executive director. He has been appointed from the group of Andrew Kreps, who has led the museum since 2013, and is the first to assume his post. Covilart will assume his position at the museum July 1.“Todd has the knowledge, skills, and experience necessary to design and implement a strategic plan to enhance the Met’s public engagement and the museum’s financial and operational performance, while preserving and modernizing the Met,” said Michael Govan, the museum’s director and chief executive. “The board is committed to supporting Todd’s performance and his vision for the future, and we’re confident that he’ll be able to deliver on his promises.”Covilart comes to the Met following a distinguished career in the private sector. He began his career in the finance and investment sectors, serving as an investment banker at Goldman Sachs from 1999 to 2000. He previously worked as a professor at Columbia Business School and as a consultant to commercial real estate companies and private equity funds.Commenting on his", "The next Biennial should be held at least five years after the last one.  The next edition of the Biennial should be held in 2021.  The next edition of the Contemporary Art Museum Houston (CAMH), which will launch in late September, will be held in June. The next edition of the Fine Arts Museums London will be held in May.   The future of the Metropolitan Museum of Art is currently under discussion. According to the New York Times, executive director Maria Balshaw said that the organization is not planning to move forward without the support of the public.“In order to avoid the crisis of our times, I am committed to working with all of you to build on the museum’s extraordinary collection, its program, and our mission,” she said. “I understand that this is a challenging time for many museums and that many of us have lost interest in visiting our galleries and museums. I hope that this letter will be a signal that our museums will continue to thrive and thrive under the current circumstances.”\n\n\nThe Metropolitan Museum of Art in New York has appointed David J. Apfelbaum as its next director and chief curator. He succeeds Matthew Boyd,", "The next Biennial should take place in 2020. \n\nCOPENHAGEN (Denmark)’s Düsseldorf Art Museum and the Danish University of the Arts (SKU) have announced their partnership to form a new cultural consortium to explore the possibilities of virtual reality. Former SKU director Magnus Hjortenberg will serve as chair of the new partnership, which will culminate with a symposium and conference in 2019. Dubbed the Copenhagen Virtual Reality Center, the collaboration will also promote the exhibition and research of works in the Center.The Danish Virtual Reality Center will function as a hub for research and exhibition in the public spaces of the Danish capital. It will host exhibitions, residencies, classes, seminars, concerts, and other events.“We are delighted to be able to present the Danish Virtual Reality Center,” said Luca Piscitelli, director of the Danish University of the Arts. “In this rapidly changing and technologically accelerated world, we have a responsibility to foster a sense of interconnectedness and a sense of belonging within an ever-changing and increasingly fragmented world. This partnership will help us to do this in the best possible way.”The partnership will connect the Düsse", "The next Biennial should be announced later this year.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed John LeBlanc as its next chief curator. LeBlanc comes to the institution from the Los Angeles County Museum of Art (LACMA), where he has served as supervising curator since 2016. He succeeds Willem de Kooning, who retired last year after eleven years at the helm of the museum.“John has been instrumental in shaping the LACMA and LACMA + LA’s curatorial profiles,” said museum director Louis Vuitton. “His knowledge, skill, and passion for art made in LA made him a strong candidate for the job of chief curator, and I’m thrilled to welcome him into the museum.”LeBlanc, who was previously a curator at the Los Angeles County Museum of Art, collaborated with curator Ann Powers and art historian Tim Teitelbaum on the exhibition “No Place Like Home,” which opened on June 2, 2019 and runs through March 30, 2020. The show features twenty-six works by twenty-eight artists, including Cheryl Ajayi, Ursula Bächli, and Amy Cahn.", "The next Biennial should take place in 2021, when the pavilion will be struck by a tornado in the US. \n\n\nThe National Museum of Fine Arts (NMA) in Washington, DC, has received a gift of more than 100 works by American artist Richard Avedon. Founded in 1892, the institution was renamed in honor of the late American theoretical physicist, astronomer, and theorist Albert Einstein in 2007. The gift includes nearly two hundred photographs and more than 1,600 prints by the artist, who died in 1962.Born in New York City in 1942, Avedon relocated to the DC area during the Vietnam War years. He graduated from the DC-Maryland Institute of Art in 1972 and from the Smithsonian’s Union College of Art and Design in 1977. In 1982, he became a founding member of the experimental American art movement, the Human League, and began exhibiting his work. Included in the gift are photographs of photographs, ceramics, prints, drawings, paintings, and sculptures by Avedon that were created before his conception of the work as a digital medium.“We are thrilled to present the work of Richard Avedon in the collections of the National Museum of Fine Arts and the National Gallery of Art", "The next Biennial should be held at least every four years. “The current schedule is just not sustainable,” said Ms. Gilligan. “We are doing all we can to delay it, but it is a slow process. And I fear it is only a slow process.”\n\nThe World Health Organization (WHO) has issued a global emergency aid plan for the coronavirus, which has infected 1.2 million people in the Philippines, the United States, and China, and has also caused at least 3,400 deaths in Hong Kong and Japan, and is expected to rise to more than 140,000 cases in the Philippines.The Philippines, which is home to more than 1,200,000 people, has reported more than 3,800 deaths and is currently facing a health crisis caused by the coronavirus. The death toll from the virus has reached 1,000, and more than 10,700 people have died from the virus, which is transmitted mainly from person to person and not by direct contact. The death toll from the coronavirus is expected to rise to seven hundred thousand people in China, where there are more than 5,000 cases and over three hundred coronavirus-related deaths. The", "The next Biennial should assess the history of the exhibition, which will be curated by American artist Anita Endres; the curators of the forthcoming exhibition, which will be staged at the Museum of Modern Art in New York next month, are Drew G. Vogel, Lila Sze, and Julian W. Fernandez.The inaugural exhibition, “After Love/Victory,” will open at the Biennale in Oslo in September, 2020. The exhibition will present the work of thirty-three international artists, including Alex Katz, Jonathan Morris, Devi Surya, and Anish Kapoor, who will share their personal experiences of their work, the exhibition will also be a way for the world to experience Indian art.The show will be organized as follows: October 21–November 3 (all times IST)\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has announced that it will open a new forty-story museum on the city’s Embarcadero waterfront. The two-hundred-plus-foot-tall museum, dubbed the Museum of Modern Art San Francisco, will be located in the former bicycle storage area of the former San Francisco Public Utilities Commission (SFPUC) and will host a", "The next Biennial should take place in the city's historic Cheim & Read building, which will celebrate the forty-fifth anniversary of the Rochester Art Museum, extending the biennial beyond the town of Rochester. The event will be free to the public and will begin on June 1.\n\n\nThe National Gallery of Art in Washington, DC, announced today that it is moving the inaugural exhibition “Slow Picture,” an exploration of the cinema by director and curator David Lean, from March 15 to March 19. The March 19 edition of Slow Picture will now open in the exhibition’s new home at the Smithsonian American Art Museum in D.C.“Slow Picture is a milestone for the National Gallery of Art and shows how Lean came to be identified with the American tradition of cinema,” said National Gallery director Daniel H. Weiss. “Far and away his best work, his experimental and virtuosic exploration of the medium that takes the viewer inside the head of the director as well as inside the mind of the filmmaker.”The move, which was made in honor of the 400th anniversary of the National Gallery of Art, marks the first time the exhibition will be staged outside of the United States for the first time in its", "The next Biennial should be held in 2022.The winner of the 2020 prize, Seán MacGill, will receive an additional $50,000, which has been donated by the former chairman of Tate, Sir David Murray, and the former chief curator of contemporary art Mary Beard. In addition, the museum has received $50,000 in support of the design of the exhibition and its development; the institution will have its name engraved in the city’s Chamber of Deputies.\n\n\nThe Smithsonian Folk Art Museum in Washington, DC, has received a gift of twenty-four works from artist Aamir Khan. It is the latest major donation to the institution, which was set up in 1933 by her parents, Irshad and Maher Khan, to raise funds for the development of its holdings of early twentieth-century art.The gift includes works by twenty-three artists, including the creators of Suraya (1940), from the collection of Irshad Khan, and Ayesha Akunjee (1947), from the collection of her father, who served as special envoy to the United Arab Emirates (UAE) from 1988 to 2010. The institution also announced that Michael Jackson (1936), George", "The next Biennial should take place at the Cultural Centre of the Arts in the city of Medina, which is currently undergoing a major renovation, at the end of the year. In the meantime, the twenty-third edition of the fair will be held at the municipality of Medina on January 16 and the twenty-seventh at the historically Al-Madina museum in the city of Madinat Al-Mukalla on January 18.Dr. Mohamed ElBaradei, the director of the Medina Art Museum, told the Art Newspaper: “We are delighted to announce the twenty-third edition of the Biennial in Medina. This is a very exciting year for film and art. The new museum will be part of the city of Medina and will provide the audience with an exceptional venue for engaging with contemporary art.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $50 million donation from the Charles and Lucille King Family Foundation. The $100 million gift was made on behalf of two longtime donors, Charles and Lucille King, who have been devoted supporters of the museum for more than thirty years. The donation comes after LACMA board chair Michael Govan announced that he plans to raise more than $100", "The next Biennial should take place in August 2022. In addition to the exhibition, the event will include a series of public lectures, a symposium, and a performance. The 2020 iteration of the Taormina Biennial will be held in the Palazzo delle Papesse in Rome and will consist of an open-air installation and a live performance.“The Taormina Biennial is a contemporary statement of fashion,” said Italian curator Mattia Pirazzo. “I really like the concept that the exhibition represents and the performance the architecture. The artist speaks directly about fashion and the curator speaks about architecture. The two of us are accepting this challenge together to create an experience that is new and creative.” The Taormina organisers will announce the date and locations of the event, which will be hosted at the Palazzo delle Papesse.\n\n\nThe Simon Museum in Seoul and the Seoul Museum of Art (SMA) in Seoul have received a $1.5 million donation from the Save the Children’s Foundation. The gift, made in partnership with the organization, will aid in the construction of a new, state-of-the-art gift shop in the museum and will", "The next Biennial should be held in the summer of 2021.”\n\n\nThe CAAB Foundation, a nonprofit organization that works to advance the health and well-being of African American artists and thinkers through exhibitions, scholarships, and other programs, has announced that it is expanding its scope to include gender-focused programming. The organization will present the first show by Baltimore-based artist, writer, and performer Camila Cabello, who is black, in March.The organization will showcase the work of thirty-two artists and collectives that represent various communities in the city, including artists from the CAAB Human Services, the Black Arts Coalition, the Baltimore Youth Foundation, the Black Arts Coalition of Greater Baltimore, the Black Community Fund, and the Black Mamas’ Bunch.Carmen Sexton, the founder and artistic director of the CAAB Foundation, told Artnet that the show will highlight the contributions of Black women artists and will include the work of a number of the project’s previous exhibitions, including the “Celeste Kelly Show,” which featured work by forty-five artists in the CAAB’s inaugural exhibition at the Museum of Modern Art, and “Diana Johnson’", "The next Biennial should be held in 2020. \n\n\nThe Contemporary Art Museum Miami Beach (CAMM) has appointed Jessica Gass as its new executive director. She succeeds Aaron Miller, who will remain on staff as a curator at the museum until at least the end of the 2020–2021 fiscal year.“We are deeply honored to welcome Jessica to CAMM,” said Steven Mulligan, chair of the institution’s board of trustees. “Her proven leadership, enthusiasm, and creativity will ensure that CAMM’s programming continues to thrive as it reflects a strong and diverse community of artists across the globe.”Gass is the first woman to head the institution since the founding of the department of visual art and design in 1972. She comes to CAMM from the Metropolitan Museum of Art in New York, where she has served as a curatorial assistant for fourteen years. During her tenure at the museum, she organized numerous exhibitions, including “The Art of Drawing” (2011), “The Repetition of Images: Visual Art and the Repetition of Objects” (2015), and “Sarah Laura Owens: The Best of Friends” (2017).Commenting on her appointment, Gass", "The next Biennial should be in December 2021. In addition to the usual exhibitions, the festival will include a series of short biennial films, a lecture by an artist, a book signing, and a reception. The theme of the 2020 edition will be “The Wandering Earth.”\n\n\nThe National Gallery in London is planning to launch an online platform that will allow visitors to see all of the work that is currently on display through the institution’s new digital viewing rooms. Titled “Viewing Rooms,” the platform will be hosted by the National Gallery and will be powered by Amazon Web Services. The centre’s director, Melissa Lodge, said: “I’m enormously excited to see how Viewing Rooms will change the way we experience art and to see how much people want to see this art.”Installing an online viewer is not new for museums. Other platforms such as the London Gallery of Modern Art’s (LGC) Digital Viewing Rooms and the Georgian Museum’s (GMM) Digital Viewing Rooms allow visitors to use devices such as computers and tablets to view artworks. In a parallel project, the Solomon R. Guggenheim Museum has also rolled", "The next Biennial should commence in 2022 and will consist of a series of exhibitions, performances, and residencies.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has appointed Joshua Levin, the newly appointed deputy director of the agency, as its next director. He succeeds Nancy Krantz, who departed the agency in March after eighteen months to become head of the Metropolitan Museum of Art.“The DCLA is grateful to Nancy for her leadership and accomplishments,” said board chairmen Charles Gabi and John Weinstock. “Today’s announcement marks a moment of renewal and renewal for the DCLA, as we open a new chapter with our newly commissioned short-form program, which will include the first works by emerging and established artists in the United States in nearly a century. We are thrilled to welcome Joshua to the department and look forward to participating in his leadership role.”Levin currently serves as the director of the city’s parks and cultural institutions, which include the Brooklyn Museum and the Metropolitan Museum of Art, and was previously the director of the Metropolitan Museum of Art. He also serves as the director of the Grantmaking Program, which supports the New York City Department of Cultural Affairs (DCLA),", "The next Biennial should begin shortly after the opening of the new exhibition and should focus on the current state of modern and contemporary art and the biennial’s connection with the larger contemporary art scene. The Art Newspaper has contacted Ellen Brown, the curator of the show, for a statement.\n\n\nThe Solomon R. Guggenheim Museum in New York has received a gift of fifty-six works by Palestinian artist Walid Raad from the Jewish Museum in Jerusalem. The donation includes works by nine artists from the Palestinian diaspora, including Muhammad al-Kasasbeh, Abu Rajab, and al-Kasasbeh’s wife Shimon.The gift includes works by the artists as well as works by Palestinian families, including Abu Rajab’s father, Abu Rajab al-Kasasbeh; his cousin, Abu Hamza al-Kasasbeh; and his son Muhammad Abu Rajab.The sixty-nine-by-numbers display, which includes works by thirteen Palestinian artists, includes works by Abu Rajab and Abu Hamza al-Kasasbeh. The display was presented to the museum by the Kfar Sakhnin Foundation, a nonprofit that supports the artists through their", "The next Biennial should announce its opening date, and the dates for the biennial exhibitions should be announced. “The Biennials are the sum of many pieces that are organized into a single exhibition and are organized under the guidance and the creative leadership of Michelangelo Bienni, as a guest curator at the Museo del Opulento and a member of the staff of the Museo del Sacro,” Valentino della Garza, the director of the Museo della Scala, told the Art Newspaper. The institution will also begin hosting an exhibition of Leonardo’s sculpture, Giacomo Signorini’s work, and Edvard Moles’s space-age paintings at the National Gallery of Art, the Metropolitan Museum of Art, and the Whitney Museum of American Art in New York.The next iteration of the Museum of Contemporary Art Chicago will take place at the Chicago Architecture Center (CAC) in December 2021, the same month that the institution’s annual Art of the Party will be held. Like the first iteration of the Museum of Contemporary Art Chicago, the museum will employ an open-concept design in order to eliminate the need for a traditional museum building. The design will be constructed of", "The next Biennial should be scheduled for 2020, when the exhibition will not be able to proceed with the scheduled opening of the exhibition, which has been postponed from March 21 to March 28. Speaking to Artforum, executive director and artistic director of the Biennials, Anne Arnaud, said: “It is regrettable that the premiere of the exhibition ‘Unstoppable: Art and Performance’ will not take place, but it is our duty to continue to support the show in its search for a new venue and in our desire to be a platform for discussion and reflection.”\n\n\nThe National Gallery of Art in Washington, DC, has received a significant gift of more than 4,400 artworks from the philanthropist André and Evelyn Arnaud, the husband and wife team of the late collector and philanthropist John and Evelyn Arnaud. The couple’s vast collection, which includes works by artists such as Andy Warhol, Thomas Dolby, and Louise Bourgeois, was recently acquired by the Smithsonian in the exhibition “The Arnaud-Warhol Legacy: Art and the Collection” (November 28–December 3, 2019), which opened at the National Gallery of Art in January", "The next Biennial should involve the creation of an exhibition dedicated to the development of the museum’s collection over the course of twelve years. The theme should be one of the museum’s “interconnectedness.” The Biennial will then conclude with an exhibition of works by the newly appointed director general, Monica Laudel. The first exhibition, “Mamità Moderna,” will open in January 2021 and will feature more than thirty new works by the recently deceased artist/collector Mario Cipolletta. In a letter addressed to the Biennial’s board of directors, Laudel said that she hopes the exhibition can become a “point of departure for people who want to learn more about the museum’s collection, and how it relates to contemporary life in New York.”\n\n\nThe museum’s collection of around three hundred works by the late Italian architect Sesto Mocenigo has been closed since February 24 because of the Covid-19 pandemic. According to the Art Newspaper, the collection comprises work by works by painters who were working in the early 1960s, such as Claudio Cipolletta", "The next Biennial should be in May 2020, and the first will be in September 2020. \n\n\nIn the first major retrospective of the artist’s work staged at the Kunsthalle Basel, Switzerland, in more than forty years, the Kunsthalle Basel said it is moving forward with the exhibition as planned. The event will resume with the work of the artist at the Museum Kunsthalle Spoleto in Frankfurt in May 2021 and will return to the Kunsthalle Basel in September 2021. The Kunsthalle and the Museum of Fine Arts, Hamburg. The Kunsthalle and the Kunsthalle Basel have announced that the exhibition will run from March 19 to March 21, 2021. Kunsthalle director Christoph Schäfer said: “The work of Walter Gropius is as essential to modern art as it is to any other major movement. He has called to mind the most important works of that period, and I believe will call to mind the next.” The exhibition will feature pieces from the exhibition “Walter Gropius: Essays on the Future” (2018), “Walter Gropius: Selected Letters” (", "The next Biennial should begin with a reduction in the size of the artworks, an exhibit of new works, a symposium on “art in general, and” and a “survey of contemporary art”\u0097\"“The Future Is Now: Democracy, Art, and Art in Action”\u0097with the aim of “turning the biennial into a public space for reflection and reflection on life.”\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles announced today that the institution has received a donation of $1.1 million in support of the redevelopment of its campus and new galleries. The gift was made by Film Group Chairman and CEO Thomas C. Coleman, founder of the Coleman Group, and his wife, Sue Coleman. The donation includes $1.16 million to improve the gallery’s existing space, including the installation of a new 35,000-square-foot theater and a new campus-wide library. The new works, titled “Strings of Logic,” will be on display in the institution’s newly renovated galleries.“This gift will allow us to redefine our own mission, reimagine the future, and accelerate our transformation into a", "The next Biennial should include a retrospective of the life and work of the Italian post-Impressionist painter and sculptor Claudio Cipolletta, a 2016 selection featuring work by Andrea Marini, the Italian artist whose work was featured in the first edition, which opened in May. The 2020 edition, “Vivian & I.S.” will be held at the Museum of Modern Art in New York from September 22 to September 26.\n\n\nThe National Gallery in London announced today that it will remove a bust of Winston Churchill that was hung in its National Portrait Gallery (NPG) until 1954, with a new $250,000 commission by the artist-activist Holly Hendry. The artist turned-out to be an ally of the Black Power movement and an active member of the Nation of Islam, which advocated for the overthrow of the British Empire.Hendry, a British American artist, created the commission in order to draw attention to the role black Americans have played in the defeat of the British Empire in World War II and the creation of the Black Nation. She told the Art Newspaper: “I wanted to highlight how the National Portrait Gallery has been complicit in discarding Churchill’s legacy and have", "The next Biennial should have been held in the spring of 2020. Instead, the inaugural edition, which was supposed to take place at the Kunsthalle Basel in March 2019, was pushed back to the summer of 2020. The 2020 exhibition was originally scheduled to open at the Museum of Contemporary Art Stuttgart in August 2020. However, due to the Covid-19 epidemic, the exhibition was moved to the end of the year, and the 2021 event was released from its March 15 opening.“We are deeply concerned by the unprecedented surge in Covid-19 cases in the United States,” said Adam Gass, executive director of the Association of Art Museum Directors. “This pandemic has already had a significant impact on the museum industry and on the museum business. The next two years will be critical for the livelihoods of museum professionals and museum staff, and for the survival of art institution.”The Metropolitan Museum of Art (the museum) in New York opened its doors to the public on March 9, and California recently reported that it has already run out of room on its building‐size schedule to accommodate the new Covid-19 cases. In an attempt to slow the coronavirus outbreak, the United", "The next Biennial should take place in the fall of 2020. Hirshhorn Museum curator Kirsten Dunlopfelter, who is spearheading the commission, said: “We have been discussing a series of exhibitions around the world that will attempt to explore and redress the historical neglect of the African diaspora. As a result, we are now in an excellent position to take the first steps toward recognizing the legacy of our African ancestors and to create new paths for future scholarship.”\n\n\nThe Museum of Modern Art (MoMA), the Museum of Modern Art, New York, and the Metropolitan Museum of Art all opened to the public on Friday, October 3, in an attempt to stave off Covid-19, a coronavirus that has led to the deaths of at least 264 people in the United States and was first reported in China by the New York Times on August 29. The news that the coronavirus was made in West Africa was not unexpected; experts had predicted that the virus would reach the United States only a week ago.The opening shows the Galleria di Belle Artola in Milan and the Visitor's Center in New York, respectively, alongside a number of new works by artists, including Nigerian", "The next Biennial should focus on how the artists and creators of the exhibition are positioned within a changing world and how they are creating a new kind of work about the exhibition. The next Biennial for Contemporary Art will focus on how art and the exhibition is changing, and how this can be positive for the exhibition and the work of the artists involved. \n\nBrooklyn Academy of Art, the Savannah College of Art and Design, and the Cooper Union in Nashville will collaborate on a new arts program that will run from September 5 to September 7. The October 12 launch of the Brooklyn Academy of Art’s Art of the Real series, which will focus on innovative, interdisciplinary approaches to art as well as the work of African American artists, marks the first time the program will be held in New York City.“The program will be a place where young artists of every generation can get connected with and interact with a wide range of contemporary artists,” said Brooklyn Academy director Rina Banerjee. The event will welcome visitors from September 5 to September 7, and will be free to the public.The partnership between the two institutions is notable in that it is the first time the two have collaborated in such a way to create a series. Previously, the", "The next Biennial should specify a new format, “communal assemblies,” a revolutionary social and political concept that would simultaneously challenge the radicalism of the 1972–73 exhibition and re-create a new kind of duality that would challenge and further extend the 1967–71 movement. The exhibition should receive a new title and be hosted by an international committee of artists and scholars and organized by the city of Barcelona.The announcement of the 2020 edition of the Biennial was made during the official opening of the exhibition “Land and Life in the Design Space,” organized by the Paris-based collective Laberge, at the historic city of Barcelona. The twenty-sixth edition will take place at the El Madrigal in Barcelona from March 15 to March 22, 2021. The exhibition will be preceded by “The DREAM Festival,” a music and performance festival to be held three times a year in 2019; “Soraya Di is a Madrid Dream,” a major public event that will feature hundreds of artworks by the National Movement; and “Land and Life in Design,” which will feature work by thirty-four artists last year.The ten shows from the current run include “Life and", "The next Biennial should take place in 2021 and will be the first exhibition devoted to the life and works of a single artist. “Diana’s portrait of a life of art is one of the most important and beautiful pieces of early modern art,” said Rita Cassatt, curator of the exhibition. “It is also one of the last. Both in form and content, it connects us to early modern art and to the creative process in general.”The Biennial will be staged in the exhibition space of the Museo de Cultura de la Plata (Museum of Modern Art), which is currently undergoing a major expansion. The expansion brings the exhibition space closer to the city of Santiago and is part of the MOU project, which aims to create a platform for the exchange of works by Chilean and international artists.\n\n\nThe City of New York has awarded $5.5 million to twenty-eight arts and cultural organizations in its development of the new Community Art Fund, which will provide grants to arts and cultural producers in the city for the construction of new works of art. The funds will go toward the construction of the Frampton Arts District, a multi-building project that will connect the West Village with Gramercy Park", "The next Biennial should take place in the autumn of 2020, with a new exhibition dedicated to nonverbal communication and empathy, and will be hosted by the Museum of Contemporary Art Los Angeles (MCA). The exhibition will organize a wide range of works, from cels to drawings and sculptures, that address issues of celebrity, identity, and the body.The festival, “Unseen,” will be presented by Agustín de la Fuente, co-founder of the artist collective BIC, and will be curated by Tony Arsht, director of the show 'Art for Art” at the Gallery 66. The Buenos Aires-based artist will also commission new works by dozens of artists and will present a lecture series about the exhibition, which will open on January 22 and run until March 5.Commenting on the upcoming shows, de la Fuente said: “This is a moment of enormous change for us, and especially for the history of art. We are now entering a new phase. We are now able to present works in the galleries in Buenos Aires in a way that is very different from the past. It is a period of experimentation and of introducing new concepts, new materials, and new designs.”\n\n\n\n\nFollowing", "The next Biennial should bring together more than one hundred artists and cultural workers from the United States, Europe, and Asia. The festival will also feature a discussion with artist-activists from the Black Lives Matter movement and a presentation of works by contemporary artists. More information about the program can be found on the Cinéma Arts Center’s website.\n\n\nMore than 3,000 artists and other cultural workers have signed an open letter condemning the Paris Climate Summit as a “breach of international law” and calling for a “strong and resolute” response from the international community. The letter, which was coordinated by the Paris Literary Festival, reads: “[The Paris Climate Summit] will be a catastrophe for humanity and the planet. It is an affront to the Paris Agreements and a departure from the spirit of the Paris Climate Accord. It is a departure from the climate-optimism and climate justice that have defined our Paris Accord. It is a departure from our stated goal of keeping temperatures below 2°C. It is a departure from the commitments already made under the Paris Agreement, which are just as dangerous, unjust, and yet more expensive. It is a departure from the climate summit, which was the", "The next Biennial should take place in the fall of 2022. The 2019–20 event was held in March and was attended by more than 750,000 people.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has launched an on-call, four-day emergency response for the Museum of Contemporary Art (MoCA) in Los Angeles. The emergency operation will be hosted by the museum until March 7, 2022.The museum will reopen on March 14, 2022, and will emphasize the long-term planning of its future programming. The announcement came two days after the museum received a major blow to its finances, when the Los Angeles Times reported that the city of Los Angeles will take over the museum’s operating budget in a deal that will save the city more than $100 million over the next two years.“The deal is the largest gift the city of Los Angeles has ever received in its history, and the museum’s first in almost fifty years,” said lawyer Charles Harder, the lawyer representing the city of Los Angeles. “The MoCA board is thrilled by the news, and I’m sure the board and staff are grateful for the work of the experts and volunteers who helped make this possible", "The next Biennial should be a joint show consisting of the latest exhibitions and works in the Biennial, as well as a selection of biennial projects. The following year will be a free event organized by a select collection of arts and culture professionals under the the theme “Toward a New Italian Modernism” and “In Defense of Freedom: Art and Prima Facie Freedom in the New Italian Republic.” The 2019 edition of the exhibition will be held at the Casa del Popolo, Rome, in February.\n\n\nRichard Avedon, the director of the Museum of London, has created a new role for the UK’s Tate as the chief executive of the museums it insures. In a statement, Avedon said: “Tate’s vision for the future is to become a great financial and cultural hub for the UK, so I’m delighted to be a part of that. The team at Tate are talented, ambitious, and dedicated, and I am confident that they will deliver a truly exceptional exhibition programme in 2020.”Richard will take up the post on January 8, 2020. Prior to joining Tate in 2013, Richard served as the director of the London-", "The next Biennial should be held in 2022.The exhibition, titled “Roots: The American Art of the 1980s” will be on view until March 22.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed the Dutch artist Geert Hofmann—a renowned pioneer of Impressionist and modernist art who often used his practice to address issues such as the role of painters in the art world, the nature of modernism, and the limits of space in museums—as its first director. Hofmann’s appointment follows the museum’s decision to open a new sixty-five-thousand-square-foot, modern, glass-enclosed exhibition space in the museum’s former location on East Eighteenth Street in Manhattan, which will be called the Noguchi Gallery. Hofmann’s first solo exhibition, a 1956 exhibition of works by his father, Hans Hofmann, at the Museum of Modern Art in New York, was the first exhibition devoted to a living painter. The artist then embarked on a multi-year, multi-venue project, “The Plantation of the Abstract Painting” (1974–77), which chronicles his practice and the small", "The next Biennial should commence in a month and will likely open in March 2020. Yang told the Art Newspaper that the event would welcome an extra six million visitors in 2020. Over the years, the event has hosted more than five thousand exhibitions, and in 2019, it was awarded the Hong Kong Foundation for Contemporary Art (HKFCA), a Hong Kong–born, Singapore-based organization that supports the development of contemporary art exhibitions and scholarships.The organizers are also planning to expand the exhibition, which currently holds an exhibition space in the former Coca-Cola plant in Hong Kong, by adding an additional thirty-five thousand square feet of gallery space and by adding a cinema and a restaurant. In addition, the exhibition will undergo a renovation that will add more than six hundred, if not seven thousand, seats.\n\n\nThe Arts Council London is launching a new initiative to help local artists by providing them with support and advice on how to navigate the Brexit process, including how to apply for funding and what to expect once Brexit is finally implemented. The program, which will initially focus on promoting the work of established and emerging artists, will expand to include more ambitious recommendations.“Following a period of uncertainty caused by the Brexit vote, the British", "The next Biennial should be held in 2021 and will be hosted by the Institut für Bildung und Gesellschaft. The 2019 event was held at the Kunsthalle Basel and drew a crowd of some forty thousand people.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Mary Ellen Karp as its next director. Karp comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as interim director since August 2019. Karp has also worked as a curator at the Santa Monica Museum of Art, and was the recipient of the 2013 Joan Mitchell Award for Excellence in Arts Journalism.“Having served as an arts curator in Los Angeles for fifteen years, I’ve been impressed by the breadth of experiences and breadth of artistic outlook of the current leadership team at LACMA,” said Karp. “While I’m excited to continue to work with the talented and dedicated staff and board to advance the museum’s mission and to expand the work of the contemporary art movement in America, I’m particularly looking forward to this new chapter with the LACMA community and to the future of the museum as the institution grows.”", "The next Biennial should be held in 2021, but the organizers have noted that it will not be a “perfect year.” There will also be a reopening of the MCH Group’s factory in the city of Baku and of the city’s two largest art galleries, the Baku Art Museum and the Museum Makaraba.\n\n\nStevenson-Bickel Gallery announced today that Marina Wolf has been named the winner of the 2019 Art of the Year award. She is the first artist from the United States to be awarded the honor, which was established by the Art Foundation in 2019 to honor the achievement of artists who have made significant contributions to the contemporary art world. Wolf was chosen from a shortlist composed of artists nominated by a jury chaired by Michael Kagan, director and CEO of the Art Institute of Chicago; Jocelyn Stevens, artistic director of the Museum of Contemporary Art Brooklyn; and Casey Kaplan, president and CEO of the Art Gallery of Ontario.“Marina Wolf has been recognized as being a truly gifted and talented curator since she began working at the Gallery in 1977,” Kagan said. “Her contributions to the art world have been extensive and impressive and deserve recognition. I am thrilled to", "The next Biennial should take place in 2021.\n\nClick here to read the full article.\n\n\nThe City of New York announced today that it is reopening to the public in early 2020 following a $100 million expansion. The reopening of all of New York City—including Central Park, the Hudson Yards, and the Catskills—will take place over the course of six years. Executive director Julian Jordan said:  “We are reopening as a community and will continue to do so as long as it takes to make the City of New York accessible and affordable for everyone. The expansion of our transportation network will make the City even more accessible and affordable. The expansion of our public amenities will make the City more welcoming and inviting to everyone. The expansion of our cultural offerings will make the City more attractive to tourists and local families.”The reopening of the city’s public spaces will be facilitated by the construction of the Central Park island extension, which will extend the length of Central Park by eight miles, and the Hudson Yards redevelopment project, which will dedicate more than three-quarters of a million dollars to beautification and preservation efforts. In addition, the city will raise more than $100 million for the construction of its New", "The next Biennial should be held in 2022, said Naveen Katherine, chairman of the board of trustees. “The museum has been and will continue to be a platform for the full range of contemporary art, and we are proud to continue to present this work of art in the London galleries and at Somerset House.”The renovation project, which includes the construction of the Biennial Gallery in London, the London Studios in the City of London, the London School of Economics, the London Pullman Museum, the Tate, the National Portrait Gallery in London, the Tate Britain, and the Tate Modern, is scheduled to be completed in 2023. The museum’s first European Biennial, held in the Netherlands in 2010, will be held in 2021.\n\n\nThe United Kingdom’s Institute of Contemporary Arts (I.A.A.) is planning to move from its current location in Whitechapel, north London, to a larger campus in the city’s East End. The move will allow the I.A.A. to become more integrated with the surrounding arts and culture and will also allow it to expand its programming. The decision was made after the I.A.A. received a £3 million grant from", "The next Biennial should be held in 2020.  The next exhibition should be in the Spring of 2021. The next exhibition should be in the Spring of 2022. The next exhibition should be in the Spring of 2024. The next exhibition should be in the Spring of 2020. The next exhibition should be in the Spring of 2019. The next exhibition should be in the Summer of 2021. The next show should be in the Spring of 2021. The next show should be in the Spring of 2022. The next exhibition should be in the Spring of 2020. Like this: Like Loading... Related Articles Beijing Gallery Show: Ayn Rand, the Politics of Existence, and the Visual Arts, 2019--28 Boston Art Book Fair: Tacita Viklund, 2018, and the Future of Art, 2019 Brooklyn Academy of Live Art: Anna Atkins, 2017, and the Future of Art. Los Angeles Handbook: Juan Carlos Marin, The American Dream, 2018, and the Future of Art, 2019 Los Angeles Times: Nancy Spector, Art and the Bending of the Body, 2017, and the Future of Art, 2019", "The next Biennial should take place in 2021. In the meantime, the institution has released a statement regarding the pending redesign:Culture and Art Museum, New York: “It is the museum’s intention to redesign the Biennial to its full advantage and to ensure that the design and construction of both its building and the museum are in harmony with the new Museum and plaza. The redesign will also include the reopening of the biennial in a way that will complement the new Museum and plaza.”\n\n\nThe University of Washington, Seattle’s Graduate Center and Museum (GMCM) are working together to create an exhibition \"that questions the boundaries of art and technology and that explores the boundaries between our digital and physical worlds.” The partnership, announced last week, coincides with the university’s inaugural year of the new $250 million Rockefeller Center. The center will also host a number of collaborative projects, including a film series, an artist residency, and an art and technology incubator.“This is a time of great change and uncertainty for most of us, but for our communities, it is a time of opportunity,” said museum director Elizabeth Anne Meyer. “We invite you to join us in creating", "The next Biennial should take place in the spring of 2020 at the Museum of Modern Art, in New York, and will be led by photographer and curator Lydia Mayhew. The show will showcase the work of over seventy artists, from the late Victorian era to the present day. Sara Bronfman, director of the Biennial, said: “Lydia Mayhew’s close-up portraits of early modern artists such as Albrecht Dürer and Piet Mondrian are central to her exploration of the early moderns as a cultural archetype. I look forward to her presenting the show as it opens.”\n\n\nThe Connecticut Museum of Art (CMA) in Eden, Connecticut, has appointed Katie Rosenberg as its next director. Rosenberg comes to the institution from the American Folk Art Museum (Alfred and Ida Stieglitz, founded in 1975 in New York City) in January 2019. She succeeds Sarah Pierce, who retired in January following a ten-year stint as director of the Brooklyn Museum.“Katie’s approach to leadership and the CMA’s commitment to bringing people together around meaningful stories makes her a strong choice for the position of director,” said director Christopher Cooper", "The next Biennial should take place in Tokyo in 2021 and will run from March 20 to March 24.\n\n\nThe Museum of Contemporary Art (MCA) in New York has canceled a show that was set to open at the institution only a month later than originally scheduled. The announcement came on the heels of a statement issued by the institution on March 3—which stated that it was studying various options—which was considered a delaying tactic by the artist’s representatives. After a lengthy investigation, the board of trustees concluded that the show was not feasible, and that the MCA would cancel the show.“Our minds are made up on how to bring about this change, and we are working hard to prepare for that possibility,” board chair Edward DeNiro said in a statement. “I especially welcome the opportunity to work with the artists, whose work has so much in common with the future we wish to create, and to how to create work with art.”While the show was supposed to open on March 16, the date was changed to coincide with New York’s April 7 kickoff. “The Festival is centered around themes that are universal and present in every culture and language,” Stephen Jarvis", "The next Biennial should be held at the Stedelijk Museum Amsterdam in 2020, and then at the Kunsthalle Basel in January 2021.\n\n\nEuropean Art and Architecture Biennial 2020\n\nInaugurating the Venice Architecture Biennial, the European Art and Architecture Biennial 2020 (E&A) will present four exhibitions, each presenting a selection of contemporary artworks, or a combination of different works, in the coming twelve months. The biennial will also feature a number of other events, including a course for art students from all over the world, an exhibition at the Museum of Modern Art, and a virtual reality installation at the Art Institute of Chicago (Art Is VR).“The new exhibition calendar features a combination of primarily contemporary and contemporary artworks, as well as a number of works that have not yet been exhibited in the flesh,” said Ilse Reinert, director of the Museum of Contemporary Art, Phoenix. “E&A will continue to be an important platform for diverse and challenging ideas, as it has been since its launching.”The full list of participating artists is as follows:Alfred Akai, New York; James Cook, London; Naho Hiko, Tokyo; John Gass", "The next Biennial should be in the spring of 2020. We look forward to welcoming the public and to presenting the best contemporary art from the year 2020. We hope that you will be able to join us. \n\nThe celebrated architect and the architect-historian, Yuki Kondo, has announced he is suspending his teaching in the spring of 2020, citing health reasons. Kondo, who has taught at the Kunsthalle Basel from 2006 to 2019 and at the Jugendstil from 2008 to 2011, said he has not yet decided whether he will return to his home town of Fukuoka, Japan, in the autumn or the spring. He will be returning to Japan in May.“I have been working since 2009 with a small group of partners, including the extraordinary architects Kiyo Takahashi and Shunsuke Kikuchi, to create a new school of architecture in the city of Fukuoka, which is located in a prime location on the bay,” Kondo said in a statement. “The team is proud to have developed the new School of Architecture at the Kunsthalle, the first in Japan, and have been inspired by the innovative ways in which the school and the surrounding environment", "The next Biennial should be held in 2021, the artist said.\n\n\nThe twenty-second edition of the Art Basel (ABI) in Hong Kong, which was canceled due to the Covid-19 pandemic, has been postponed until next year. The twenty-third edition, which was slated to take place in 2022, was also put on hold. The next iteration of the Art Madrid fair, which is scheduled for September 2022, was also pushed back, and the next Art Dubai event, which was supposed to take place in November 2022, was cancelled.Dubai Art Week, which began as a partnership between the Art Newspaper and Art Basel in December 2019, has been canceled, with its next edition scheduled for June 2020. The twenty-fourth Dubai Art Week, which was scheduled for September 2020, was also scrapped.Dubai Art Show, which was originally scheduled for March 2020, was also postponed. Dubai Art Dubai, which was supposed to take place in March 2020, was also postponed. “We had hoped to present the best exhibition of the year in March, but unfortunately due to the Covid-19 pandemic, the event has been canceled,” an Art Dubai spokesperson said.Dubai Art Show Tokyo", "The next Biennial should take place in the city in 2021, and the first exhibition should open in the city in 2024. In a statement, the festival said: “We are delighted to be a part of the city’s cultural fabric and the MCH Group has been instrumental in securing the duration and scope of the project. The design of the pavilion was entrusted to the architect, curator and architect, and we will continue to present exhibitions and exhibitions that relaunch and re-invent our city.”In addition to the Biennial, the MCH Group has been organizing a series of shows, performances and other events for the city. The 2018 edition was held at the Brooklyn Museum; the 2020 edition will be staged at the Brooklyn Navy Yard. The MCH Group is also developing a new masterplan for the city, which will include the largest public art project in New York and will open in the spring of 2021.\n\n\nOn Tuesday, the New York City Department of Cultural Affairs (DCLA) announced that it intends to begin allowing the public to purchase affordable housing units in newly renovated, publicly subsidized apartments built to last through the 2021–2022 fiscal year. The initiative, which will also include the construction of 1,200 affordable housing", "The next Biennial should be held in 2020. For Gary, the controversy is about more than just the future of the art, it is about who will be in charge of it and how. He believes that the current system isn't working for the art and that it needs to be overhauled. He also believes that the institution’s current board members—including Thomas L. Friedman, James Cuno, and Elena DeAvoli—are not capable of creating a new institution that is responsive to the needs of New Yorkers.“What is happening now is the consequence of a long-standing, systemic problem,” Gary said. “The gallery industry is full of people with no formal education, who have no experience in the art world, and who are driven by greed and self-interest. We have to change that.”\n\n\nThe London-based nonprofit Open Arms has received $1.5 million from the Coronavirus Aid and Relief (Carp) Act in support of its core mission of providing financial aid to artists and small to mid-size arts and cultural organizations in the United Kingdom affected by the coronavirus. The money is being divided between five different organizations—Open Arms Poetry Slam, Open Arms Boar", "The next Biennial should be held in 2021 and will be staged at the Museu de Arte de São Paulo and the Brazilian National Museum. The show will include work by a select group of thirty artists, including the artist Jair Bolsonaro, who will receive a prize at the exhibition.The winner of the prize will be announced in the first quarter of 2020.\n\n\nThe Guggenheim in New York has announced the sixty-ninth edition of the Guggenheim’s Museum of Modern Art (Guggenheim Museum) Symposium. Presented by the Guggenheim and curated by Hernán Díaz Báez, the event will run from August 21 to August 28, 2020. The twenty-sixth edition will take place in the Spanish city of Barcelona from September 5 to September 8, 2020.The theme for this edition was “Life and the Art of Motion:” and the works presented will include “Stalin’s Art of War:” (Benito Mussolini), “Avant-Garde Movement and Performance:” (Alejandra Almagro), and “Hiroshima” (Hiroshima Peace Festival).", "The next Biennial should be held in 2020.\n\n\nThe Turkish parliament has voted to establish a central bank based on a gold and silver alloy that has been used in its currency for more than a millennium. The bill passed on Tuesday and will now be considered by the country's president, Recep Tayyip Erdoğan.If the legislation becomes law, the bank would be tasked with remaking the Turkish national currency, the rültür, into a more stable exchange rate. The rültür will be backed by the government and will be issued by a newly created 11-member board. The board would be comprised of three members from each district of the country, with the exception of Istanbul, which would still be considered part of the country.“The industrialization of the country’s major cities and its modernization of the education system are the key issues in this transformation,” Erdoğan told parliament. “We must use this opportunity to reorient the country’s economy in order to make the rültür more stable and more affordable for businesses. This includes strengthening the domestic market in order to encourage more investment, encouraging savings, and encouraging savings among small and medium-sized enterprises.”The legislation also outlines the creation of an", "The next Biennial should involve four hundred local, state, and international artists, including Manfred Kamm, Pia Camille, Wilfredo Pelias, and Yoko Ono, and will take place at the Museum of Modern Art in New York from March 21 to March 24, 2020, at the Beacon Arts Center in Salem, Massachusetts.\n\n\nThe Museum of Art has released the first photos from the upcoming exhibition “ONE PHASE.” The forty-fourth edition of the annual event, titled “ONE STEP BACK,” will open in March 2021. The exhibition will include works by eighty-six artists from thirty-five countries and territories. The list of participating artists is as follows:  Austrian Albrecht Dürer;\n\nCzech artist Michał Soskala;\n\nPolish artist Grzegorz Kawczak;\n\nPeruvian artist Rodrigo Palma Torres;\n\nKorean artist Park Joo; and\n\nKorean-born American artist Sam Haley. The show will also present work by artists such as Han Ho Yoon, Lin-Manuel Miranda, and Linda Satterwhite, among others", "The next Biennial should be held in January 2021.\n\n\nThe Osher Museum of Art in San Francisco has received the $10,000 $5,000 and $2,000 awards from the Museum of Modern Art (MoMA), the Los Angeles County Museum of Art, and the California Academy of the Arts. The MoMA and the Los Angeles County Museum of Art (LACMA) will receive $6,000, $5,000 and $3,000, respectively. The Museum of Modern Art in New York, whose director and CEO, Andrew Kreps, announced the awards on Vimeo on April 2, said: “The awardees represent the many years that MoMA has been a leader in the field of contemporary art, and our museum’s team and staff have made tremendous contributions to the museum over the years. We are grateful to the last three for their recognition.”The $5,000 grants were presented at the MoMA screening of Devotion: The Hell of Primitive Art (2017), a documentary about the exhibition “Devotion” and the creators of the space, which curated by Hideo Noguchi and Masahiko Suzuki, in which the works", "The next Biennial should be hosted at the Royal Opera House in London, which already has a digital version of the show, and will be staged three times a year. The event will examine the work of seventy artists, and will include the first time the show has ever been staged in the United States. The artist-run platform will host biennial entries on a rotating basis. The first show, which will feature works by seventy artists, will open on October 7. The second show will take place in the spring of 2020. The third biennial will be held in the fall of 2020. “In the current climate, it is in everyone’s interests to’traditional artistic practices,” Amada Cruz, the executive director of the National Association of Biennialists, told the Washington Post. “While we will continue to present artists with new and challenging works, we want to support and amplify the work of established artists in their efforts to make a difference in the world.”\n\n\nArtist-run platforms that donate works to museums and that receive grants from arts organizations have been accused of profiting from the sale of works by wealthy collectors. The accusations were first raised by Walter Isaacson, a New York–", "The next Biennial should take place in 2019, and the first in 2020. While a 2019 date remains possible, the organizers have already said that it is unlikely that the exhibition will be held in the fall.\n\n\nThe National Endowment for the Arts (NEA) announced today that it has awarded $1.2 million to twenty-six artists in the United States. The grants are part of its Arts for the Future (BFOF) initiative, which aims to shift the conversation about the arts by connecting audiences with new and experimental works, and were created in support of the Organizing for America (OFA)’s March for Arts.Participating artists include Adam D. Weinberg, Karla A. Alexander, J. Lee, Mary Beth Paine, and William Paine. The NEA will distribute $200,000 to the top ten recipients, with the $100,000 each going to the sixth and seventh seeds. The artists selected for the grants were given the option of submitting shortlisted works for consideration. The money is aimed at helping ​​American artists ​under the age of thirty​ gain a more informed and engaged cultural understanding of contemporary art.“The NEA’s Arts for the Future grants provide", "The next Biennial should commence in the autumn of 2021. The selection committee comprises Ksenia Alekseeva, director of the State Border Museum in Belarussian city of Nizhny Novgorod; Oleg Burov, a former artistic director of the Mariinsky Museum of Modern Art in Moscow; and the artist Pavel Guts.\n\n\nThe University of Oxford announced today that, between 2020 and 2023, it will provide extra funding to support the study of artist-built environments (BECs) in the university’s buildings. The institution will split the funds among the BECs currently housed at the university. “The BEC programme is a vitally important way of supporting the work of underrecognized and underrecognized artists, and is one of the best-kept secrets at Oxford and one of the most-visited places in the world,” said Neil Armstrong, director of the university. “The research and development activities that will be undertaken by the university will enable us to make, for instance, the first ever large-scale attempt to create a BEC in a university museum, so that we can understand how a BEC can govern a museum and how a BEC can participate", "The next Biennial should take place at the Museum of Fine Arts in Athens on March 22–March 26, 2020. The next event should take place in Berlin on March 28–March 31, 2020. \n\n\nThe French Ministry of Culture has granted Diadema Pharis a special status as a cultural organization under the country’s state of emergency. The declaration means that the South African artist will be able to build on her best-known work of using black iron, 'Masai Kudzu', and a few other objects to make new works for the museum. The works, which were exhibited at the 2017 Venice Biennale, will be on view in Diadema Pharis’s museum from May 19 through May 22.Commenting on the support, Culture Minister Nathalie Bondil said: “The status of an organization under the state of emergency is a very important step for museums, and Diadema Pharis is one of the foremost modern art museums in the world. I am very proud of the support given to Diadema Pharis by the French Ministry of Culture.”\n\n\nThe Museum of Contemporary Art (MoCA) Los Angeles has received a gift of twenty-four works by Chilean artist Luis Cam", "The next Biennial should be held sometime in the first half of 2021, according to curator Rudolf Zuber, who has curated the show since its inception in 1983. While the venue has yet to announce a date for the exhibition, it will be held at the Museum of Contemporary Art, Atlanta. “The History of Art: A Biennial of Contemporary Art” will feature seventy-nine contemporary artworks from fifty-five countries.  The showcase will also feature six artworks by forty-seven artists, including Elinor Castello (Italy), Henry David Thoreau (United States), Gianluigi Pina (Italy), Thomas Prouvois (France), André Bazin (France), Adrien Brody (France), Tacita Dean (United States), Eduardo Cervetto (Italy), Wang Shufu (China), Jean-Michel Aikens (Germany), and Charles Lucy (Germany).\n\n\nThe Taichung Biennial, which will run from March 13 to March 16 in the city of Taichung, China, is now accepting submissions for its fifth edition. Based on a theme of “nature and the", "The next Biennial should be held in the spring of 2020.The forthcoming exhibition will be organized under the title “Lights, Camera, and Sculpture: The Power of Light” and will have its first show in the United States since 1955. Titled “The Other Side of the Same Sun,” the exhibition will offer a range of works, including works on paper, photographs, and collages, and will showcase the work of more than two hundred artists working across fifty countries.\n\n\nThe British artist and educator Richard Linklater, whose experimental, experimental and conceptual art explored the relationship between painting and photography and his own relationship with the medium, has died at age eighty-eight.Born in London in 1947, Linklater studied under the artist Pat Mills at the Parsons Institute, and also worked at the Cooper-Hewitt, and the Serpentine Gallery, before he joined the School of the Art Institute of Chicago. In 1974, the same year Linklater won the Prix de Jean-Jacques, he was awarded the Richard Linklater Prize for his experimental, experimental and conceptual work The Elephant in the Studio, which was also included in last year’s Whitney Biennial.In 1987, Linklater created a photographic collage", "The next Biennial should be held in 2022, and the last will be held in 2023. Both of the new events are expected to draw upwards of 1.5 million visitors.The decision to cancel the exhibition was made in light of the coronavirus outbreak in China and the coronavirus outbreak in the United States, as well as the coronavirus outbreak in Hong Kong. The cancellation of the exhibition was first reported by Artnet. The Hong Kong Art Museum’s board and the Hong Kong community are currently negotiating a new contract for the exhibition. As of Thursday, December 6, the Hong Kong Exhibition and Books Festival had already received 2,300 visitors and was scheduled to run from March 16 to March 20.In a statement, the Hong Kong government said: “All relevant decisions and management at the Hong Kong Exhibition and Books Festival were taken in accordance with Hong Kong’s national policy and the Hong Kong Convention and Parade Commission’s request that the fair be canceled. The decision to cancel the fair was made in line with Hong Kong’s universal policy to cancel exhibitions and other events in accordance with the Convention and the Convention Commission’s request for a different event.”\n\n\nThe Museum of Contemporary Art (Mo", "The next Biennial should be held in 2022, and Debrecen will be awarded the $22,000 Rauschenberg Prize along with the artists Stéphane Garza and Sarah O. Debrecen.Other honorees are Simone de Beauvoir, Hélio Oiticica, and Yoko Ono.\n\n\nThe Contemporary Art Museum Los Angeles (CALA) has released its 2017–18 schedule, and the first set of exhibitions is “Gangs of New York,” which will feature work by twenty-six artists from forty-four cities across the United States. The exhibition, which will run until November 25, has been designed to draw an international audience and will showcase the work of artists who have lived or will soon live in Los Angeles. The full list of participating artists is as follows:Allen Strand, New Orleans, LouisianaBrittany Graham, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York,", "The next Biennial should take place in the fall of 2020. The event will include a retrospective of work by Kirsten Ahern and a new selection of works curated by Sana Nadra. The new program will be led by Katherine Ryan, director of the contemporary and historic photography program at the San Francisco Institute of Art.\n\n\nThe Filipinos of the International Committee for Museums (PIC) have endorsed the campaign group Binawat, which has been campaigning for the removal of former President Benigno Aquino from office, as the next president of the Philippines. According to the New York Times, BINAWAT has already collected over one hundred,000 signatures in support of removing Aquino from the presidency, and the organization has been given permission to stage an event designed to draw attention to the petition.The civic group was founded by the late activist and collector Cabangis Rizal, who was an ardent backer of the late president. While his political aspirations were never fully realized, his legacy lives on as a symbol of the moral strength and resilience of Filipinos. “The future of our country and our world is at stake,” Rizal told the New York Times.", "The next Biennial should be held in the autumn of 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than twenty artworks by artists formerly housed at the institution. The institution also announced that it is teaming up with the Getty Foundation to determine a potential future conservation strategy for the collection. The works, which were previously on display in a preview of the upcoming exhibition “The Art of Destruction,” will soon be restored in its entirety.LACMA director Roxann Taylor confirmed that the institution will work with the Getty Foundation to develop a conservation strategy for the collection and noted: “Over the course of the museum’s nearly eighty-year history, the works were exhibited in ‘The Art of Destruction’ and ‘The Collection: A History of Art,” and “The Art of Destruction: A Documentary History,” both in 2006 and “The Art of Destruction,” 2007–2008. Taylor stated that the institution considers the collection “a historical asset that should be maintained in its most pristine state” and plans to use the Getty’s donation to develop new conservation conservation practices and better understand how the work of art has impacted", "The next Biennial should include a public performance by a national or regional group of contemporary artists that is organized in a contemporary way, in accordance with its local community, including a costume contest, a reception for a large group, or a presentation of work by selected artists.”\n\n\nThe Canadian Centre for Contemporary Arts (CCA) in Toronto has announced that it will reopen to the public on September 6, with a new exhibition and author-and-publisher event, the inaugural edition of which is currently on view until September 9. The biennial, entitled “Mémoires des Arts,” will be curated by Yael Lipschutz and will be led by Dalia Miro, a curator and artist based in Paris. Lipschutz, a Toronto native who lives and works in Montreal, is a professor of art history and design at the University of Toronto and an adjunct art history professor at the University of Montreal. Miro, a Toronto native who lives and works in Paris, is a curator and scholar at the Institute for Contemporary Art in the City of Toronto and is a winner of the Prix Marcel Duchamp in 2007. The exhibition will be accompanied by a book tour and an online preview day on August", "The next Biennial should be held in 2022, and the exhibition will be staged in Barcelona, Lisbon, and Venice.The museum is planning to open a branch in the capital of the Basque Country in October 2021, in collaboration with the city of Barcelona. The institution has also expressed confidence in its capacity to host at least five exhibitions per year.\n\n\nThe Newark Museum of Art (NMMA) in New Jersey has been granted a $1.5 million donation from the New York–based philanthropist and collector Francis and Julie Ranzell. The donation, which follows a $2 million investment in the institution by a group led by artist and collector William and Regina C. Ranzell, provides the museum with a new 125,000-piece collection, which will include works by artists such as Mark di Suvero, Elizabeth Peyton, and Sloane Square, and will also include the exhibition “September/October 2003: Contemporary Art in New Jersey”, which will be curated by Joan Marcus.The donation coincides with the opening of a new center dedicated to the arts and culture, The New Center for New Jersey Art. The arts space will be located at 875 Bedford Avenue in Newark, and will inaugurate with a public art installation,", "The next Biennial should begin as planned next week, and will feature forty works by seventy artists.  “We are at a critical juncture,” said Galerie director Anne-Marie Tremblay, who was appointed director of the biennial by the French minister of culture, Marie Kévin, on July 29. “We must make sure we have the resources to carry out a thorough and specific evaluation of the biennial program, and to present a new view of the exhibition.”\n\n\nThe twenty-second edition of the Venice Biennial, titled “Between the World and Me,” will be held at the Palazzo Nazionale in Venice from January 26 to February 29, 2020. The fifteen-year-old event will be staged at the Palazzo Nazionale in collaboration with the private contemporary art museum, the Palazzo delle Papesse, the city of Venice, and the region’s cultural and charitable organizations. Art historian and curator Andrea Battista, who served as curator for the event, said: “This is an urgent moment for Venice. The city is facing a crisis of legitimacy. The organizers have tried to present the event as a celebration of diversity,", "The next Biennial should take place in 2019. More information can be found on the Art of Biennials’ website.Artists in the US and Europe: Danilo DiCarlo, Emilio De Torres, Alejandro Gara, and Alejandro Villarreal.Pace Gallery in New York: The exhibition is now on view until October 9. See more in a retrospective of the artist’s work at the museum here. Pace Gallery is also planning to hold an exhibition of DiCarlo’s work in September 2020. On the upcoming exhibition, which will be organized as a traveling retrospective, DiCarlo said: “I am very much looking forward to working with young people and young artists in the United States and the United States’s artistic ecosystem. We will be opening the new exhibition in September and will be announcing further dates for the show as we move forward.”The September 28–October 2 exhibition will be curated by Julie Larson-Weir, who has worked at the gallery for seven years, and will celebrate the fourteenth anniversary of the event. Larson-Weir will be working with the artist-in-residence, Niles Mochiz", "The next Biennial should be held at the Museum of Contemporary Art Chicago in 2021.\n\n\nThe Fisher-Price Foundation, the foundation dedicated to conservation and restoration of art, has announced that it will donate ten works by internationally recognized contemporary artists to the National Museum of Ireland. Each donated work will be given an exhibition space at the museum, where it will be displayed for three years.The museum was already working with Art Gallery of Ontario (AGO) to acquire a series of works by American painters Joseph and Martin Luther King Jr. through a partnership which also offers curatorial support to the Palais de Tokyo and the National Museum of Art in Washington, DC. The restoration project, which was initiated in 2018, involved the donation of twenty-one works by artists including Peter Hujar, David H. Koch, and Sean Kelly.“Fisher-Price’s commitment to supporting and preserving the legacy of these artists and to ensuring their long-term access to exhibitions and collections is inspiring and heartbreaking,” said foundation president and CEO Thomas Ehrlich. “Together we will continue to have a profound and visible impact on the work of the great Irish artists.”The works will be restored and moved to the National Museum, and will be", "The next Biennial should be announced in May 2020.\n\n\nThe Institute of Contemporary Arts (ICA) in Berlin has presented a new group exhibition in support of the European Union in support of the hundreds of thousands of workers who are currently facing unemployment in the country. The exhibition, titled “Letters/Notes and Other Intimate Remarkable Objects” (Stiftung und über den Gesellschaft), will run at the ICA until December 29. “We are delighted to welcome the ICA to Berlin,” said Alexander Kling, the director of the ICA. “The ICA offers a unique intellectual and artistic environment for the thousands of arts professionals on the ICA’s campus who are struggling to make ends meet. The ICA’s network of artists, architects, curators, artists’ studios, and schools provides a platform for them to connect with and collaborate with the ICA’s artists, and for the ICA to cultivate and deepen its relationship with the artists on its campus.”The ICA’s artists have used the ICA’s art to advance the art of their careers. In 2007, the ICA exhibited work by nine artists from", "The next Biennial should be organized in 2021, with the goal of establishing a new institution in the city center of the capital, which currently hosts the Greek island of Piraeus. As a result, the institution will be renamed and will reshuffle the program in the coming months. The reopening of the museum will coincide with the 2020 Olympiad.“We wanted to re-create a new institution in the city to promote contemporary art and to develop contemporary art in the city,” explained Moltha Silò, the director of the Bibliothèque Nationale in Paris. “The Biennale is a great example of how to develop a new cultural center in the city, without destroying the cultural heritage of the city. The renovation and the redesign will complete its mission of presenting contemporary art in the city.”Li has been named the new director of the Biennale de Lyon and is overseeing the renovation of its current premises, which is scheduled to reopen in the spring of 2021. It will then host the event “Between the Sun and the Moon,” which was staged in phases between 2007 and 2015. The biennial was founded by an alliance of the French Ministry of Culture and the Arts", "The next Biennial should be held sometime between the dates of September 15–September 22, 2020. The date of the event will be announced soon.\n\n\nThe Metropolitan Museum of Art (MoMA), which has been under scrutiny since Hurricane Maria swept through the United States in October, has launched an emergency fund for cultural institutions in the event of a major loss of life or damage to cultural assets. The fund, which was established in partnership with the National Association of Theater Owners (N.A.T.O.), will distribute $1.2 billion on a case-by-case basis.The fund was established to compensate cultural institutions for lost income from Hurricane Sandy and to promote the recovery of cultural assets through the event of a loss. It will also provide financial assistance to institutions that have an active hurricane recovery plan and that have not already received funds from the federal government. The first phase of the fund, which will consist of $218 million, was established in October and will address losses at cultural institutions, including the Metropolitan Museum of Art, the Museum of Modern Art, the Brooklyn Museum, and the Bronx Museum of the Arts. The fund was also created to help the cultural sector following Hurricane Irma, which claimed the lives of forty-six people and caused widespread", "The next Biennial should be held at the Venice Architecture Biennale in September 2020.\n\n\nThe Royal Academy of Arts (RA), in London, has named Catherine Beard as its new chair of the Arts. Beard will be responsible for spearheading the organization’s transformation into a public realm institution with a new 40,000-square-foot building and an expansion of the RA. The installation of a new curriculum, exhibitions, and performances, as well as the establishment of an ongoing residency program, will begin immediately.“Catherine Beard brings a fresh perspective and a wealth of experience both as an academic and as a practitioner in the fields of theory and practice,” said Richard Biggs, the RA’s director of contemporary arts and design. “Her appointment marks an exciting moment at the RA as we work to deliver on our vision to support and inspire the creative and the creative-minded through the arts. We are thrilled to welcome her to the RA and look forward to her leadership role in helping the RA shape a future for the arts and design in partnership with the local community.”\n\n\nThe twenty-third edition of the Berlin Biennale, held at the Berlin Art Museum (BAM) from November 13 to", "The next Biennial should take place at the New Museum in New York in 2022. Its inaugural exhibition, “The Art of Painting,” consists of six exhibitions curated by the same artist, Laure Wilhelmus, who will focus on Manet’s painting and sculpture. A single special exhibition will also take place at the Museum of Modern Art in New York in 2022. \n\n\nThe heirs of the late British painter Norman Rush, who was born in Glasgow in 1940 and raised in Whitechapel, London, have filed a lawsuit against the Museum of Modern Art in New York claiming that the institution breached the estate’s “agreement to pay royalties, profits, and expenses over the life of the work,” the New York Times reports. They also claim that the museum neglected to inform the heirs of the artist and failed to consult with the estate in the years leading up to the artist’s death.The lawsuit, which was filed in a New York federal court on March 18, seeks $5.5 million from the museum. “Norman Rush was a great and highly valued colleague and colleague,” Richard and Margot Rush told the New York Times. “His talent, his integrity,", "The next Biennial should be held in 2021. If all goes as planned, the upcoming exhibition will take place in the city from January 17 to January 19 and will be led by Nara Zaatari, whose work is currently on display at the exhibition “Xavier Huyghe,” which will be staged in the Biennial’s new location in September.\n\n\nAmerican artist George Nelson, who created a series of sculptures that resemble miniature versions of New York landmarks, including the Empire State Building and the Wall Street Journal, has died at age eighty-four. In the mid-’50s, Nelson moved to New York with his wife and their young son, a result of his lifelong interest in architecture, and established the museum-series Nelson’s American Performance Art. These works, which often engage with the concepts of politics, history, and cultural identity, are often juxtaposed with shots of landscapes and are sometimes accompanied by text. “Over the last twenty years, I’ve been working toward my own appropriation of the American dream,” Nelson told a critic in a letter published in the April 1977 issue of Artforum. “I have devoted a lifetime to this quest, and have chart", "The next Biennial should take place in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has been ordered to remove a sculpture by artist Jessica Morgan that undermines the museum’s relationship to the institution’s former director Andrew Kreps, who resigned in June 2019 over allegations of sexual harassment.Michael Kimmel, the former head of MoMA, accused Kreps of manipulating her into having sex with him and of pressuring her to have a sexual encounter with Kreps. She alleges that the sexual encounter was consensual but “incompetent” and that Kreps pressured her into making “false and defamatory statements about me,” the artist told the New York Times.“I think it’s important for people to understand that there are people who were complicit in this culture of harassment and abuse and now it’s their turn to speak out and demand change,” Kimmel told the New York Times. “The art world is full of people who are willing to stand up and take personal responsibility. It’s important for people to know that there are people who are truly dedicated to creating a more just, inclusive, and harmonious world.”Kreps is currently embroiled", "The next Biennial should focus on “imaginary worlds,” he said, which will be “foundations of the action.” The exhibition will take place in the same building as the museum’s current exhibition space, the Biennial of Contemporary Art (BCCA), which opened in 2018. The new venue will be developed by the Massachusetts–based firm W.A. Lange & Sohn and will be inaugurated by a program of interviews with artists, including Larsen and Kappe, and will feature work by seventy-five artists from twenty-four countries, including Chile, Finland, Mexico, and the United Kingdom.“The next Biennial of Contemporary Art will be a celebration of the best contemporary American art of the twenty-first century,” said Kate Bradley, Biennial curator and head of the exhibition team. “The exhibition will also present a selection of work by artists whose work was included in this year’s Biennial. This year’s exhibition will celebrate the work of thirty-six artists whose works were selected by the Biennial’s jury. The show will also incorporate a series of conceptual explorations of the contemporary art of the Americas.”The seventy-fourth and", "The next Biennial should be held in the spring of 2021.  In a statement, Artadia said: The doors of the Biennial will open at 4 PM on Friday 7 March, 2020 and will remain closed until then. The exhibition will be followed by a visit of the exhibition by visiting artists. The dates of the events and works of the year are all as follows:March 14–March 18: The exhibition will be on view until March 29.March 28–March 30: The exhibition will be on view until March 30.March 26–March 30: The exhibition will be on view until April 3.and will be closed until after April 4.The exhibition, concert, and the lecture series will all resume with regularity following the opening of the Biennial in the spring of 2021.\n\n\nThe Art Builders Association (ABPA), the New York–based nonprofit dedicated to the preservation, restoration, and conservation of industrial and commercial art, has appointed Sarah Sze as its next president. Sze comes to the organization from the Solveig Foundation, which has funded the museum and its work since 2013. After serving as the board president of the organization for four years, Sze was elected to"]