["The next Biennial should take place in 2021. “The new museum will have a long-term vision for the museum, building on the company’s history of working with artists on the topic of the exhibition,” said Kallmann. “We hope the Biennale will continue to advance and be expanded. Its artists and collectors deserve many more years to continue their excellent work.”\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has appointed Kenneth Williams as its next executive director. Williams comes to the institution from the Museum of Modern Art in Atlanta, where he has served as interim director since September 2018. He succeeds Karen DeCecco, who led the institution during the coronavirus outbreak that began in Waltham, Massachusetts, in March 2019.“The board of trustees, headed by a remarkable and dedicated group of executives, including Peter W. Singer, chair; Bruce Harrell, vice chair; and Kelly Rindl, secretary, has created an exceptional appointee to head SFMoMA’s board and staff,” said board president Matt Strand. “Kenneth brings an outstanding record of moving our institution forward and a proven track record of transforming institutions. His", "The next Biennial should take place in the spring of 2021, and will organize a retrospective of the work of a total of eight artists, spanning forty and thirty years. Its winner will be selected by a panel of artists, biennial organizers, scholars, and curators.\n\n\nThe Sherwood Art Museum in New York has appointed Christina Belloni as its next president and CEO. The forty-seven-year-old artist, who teaches at the University of Pittsburgh, will be the first African American to lead the institution since the late director Michael Richards. Belloni will succeed deceased founder Richard L. Sherwood, who steered the museum through its four-decade run and a contentious search for a new president.“As we look forward to the inauguration of President Sherwood, I’m thrilled to join the Sherwood family in celebrating the legacy of our founder Richard Sherwood,” said Belloni. “With his inspiring words and his vision for a museum that truly can be said to be the cultural and intellectual center of the world, I look forward to creating new and exciting experiences for our visitors and our local community.”Belloni currently serves as an associate professor of art history at the University of North Carolina, Greensboro. She", "The next Biennial should be presented by the city of New York, which has been working with the artist to create a new exhibition space within the city limits of the Queensbridge enclave (where the centre was built in the early 1990s) since 2016. The artist is also collaborating with artists such as Michaels Amirkhani, whose work was recently included in the twentieth edition of the Palais de Tokyo in Paris, to produce a series of exhibitions that will be open to the public.“I have long stated that the future of art is to be found in the digital realm,” Antonia Anselm, the board president of the Art Newspaper, told Artnet. “I continue to believe that the future of art is digitized and on-demand, and I hope this museum becomes a model for the digital art world.”In a letter addressed to the public in May, 2017, the artist wrote: “I am now a very old man. In the past twenty years, I have shown to the world a series of works which combined documentary and virtual reality worlds in order to explore the potentialities of art as a tool for radical self-actualization. I have also been able to create some of", "The next Biennial should be held sometime between the end of March and the beginning of April, with a new theme each year called “Experimentation.”\n\n\nMuseum of Contemporary Art (MCA) in Los Angeles announced today that it will reopen to the public on January 25, 2020, following a $9 million renovation and expansion. The MCA will announce further details about the reopening date and the reopening date of the museum will be determined by the time of the opening of the MCA’s new home, the Los Angeles County Museum of Art (LACMA).“MCA remains committed to giving the public a truly unique experience in the museum,” said museum director Christopher Knight. “We are confident that the new LACMA will further celebrate the institution’s long history of pioneering work and the rich legacy of Christopher Wool, and we look forward to welcoming visitors back to LACMA in the spring of 2020.”The renovation and expansion of the museum, which opened in 1957 and was completed in 1965, began in partnership with the Los Angeles County Museum of Art (LACMA) and was completed in 2014. Most recently, LACMA commissioned Christopher Wool’s home in", "The next Biennial should be held at the São Paulo Art Museum, which is currently undergoing renovations and is currently closed to the public. “I am very happy about the development of the 2nd Biennial at the Museu de Arte de São Paulo,” the artist said. “In this moment of crisis, it is important to show the ways of reconciliation and creativity, and to be present in the midst of the most sensitive and difficult situations. The ‘13/14 exhibition opens on December 10. Significantly, the exhibition ‘13/14’s opening was held in a space that was prepared for the exhibition, because we wanted to use the opening of the exhibition to draw attention to the exhibition’s theme and to mobilize the exhibition. In the past two weeks, we have been able to gather over five thousand artists, designers, filmmakers, musicians, dancers, actors, and other creative and artistic professionals from twenty-eight countries and twenty-two cities, and from twenty-nine countries and twenty-three cities in Brazil. At a time when the creative and cultural life of Brazil is being seriously threatened, the artists participated in this exhibition in solidarity with the public. We hope the exhibition will be a", "The next Biennial should focus on “postcolonialism,” the third of the series, which will be hosted at the Venice Biennale in 2021, and “postcolonialism and art,” which will open at the Tehran Art Biennale in 2022. The three exhibitions are also supported by the Persian Gulf Cultural Heritage Foundation, which is funding the event through its “Hassan Fund for Cultural Development.” The event’s inaugural edition, “The Fall of the AlUlašan Empire,” will be hosted at the Rendering House in Tehran, which was completed on February 23, 2022 and opens on March 15.The next edition of the Tehran Art Biennale will be held at the Farabi Gallery in the city of Shiraz from March 23 to March 26. The third edition, “The Shaping of Modern Art,” will be held in the Khomeini Museum, Shiraz, on March 27.  In addition, the Beirut Art Book Fair is currently on display in the Musée Radisson downtown. The first edition of the Tehran Art Biennale was organized by the Iranian authorities in the", "The next Biennial should be staged in 2021. \nAmong those who have died or are currently buried are Italian artist David Hasegawa, who was born in Milan in 1875; Italian photographer Lina del Valle, a fellow Milano native; and Anish Kapoor, a Milan native who worked in the city of Maranello, Italy, the birthplace of Alessandro Nuzzo, the founder of the Nuzzo Group, an umbrella company that includes companies including Ueda, Litton, Bicocca, and Gioia, and was a carpetmaker and textile producer in Milan. The four-story home—built in 1950—was renovated by an Italian architect, Giuseppe Foscari, in 2005 and is now a museum. The museum, which is housed in a former convent, is a UNESCO World Heritage site.Kathrin von der Leyen, the curator of modern and contemporary art at the Schloss Alkelnhaus in Berlin, said: “This is an extraordinary collection. . . . The works are of a range of styles, from early Cinéma and  Cinéma Avant style, to 1970s avant-garde", "The next Biennial should take place in the German town of Essen from March 16 to March 17, 2021, the official said. “We must not forget our historical role as a world leader in the preservation and restoration of art,” said Bernd lofström, the local mayor. “With more than 90 percent of the works in our collections destroyed or lost altogether, we need an exhibition that can remind us of our history.”Art historian Joachim Neugroschel, the founder of the museum, said: “In this very important year, the Biennial for the Arts is a great opportunity to rediscover the lessons and art history of the twentieth century. We hope that the German cities and regional governments will welcome the exhibition and appreciate its importance for Germany’s cultural heritage.”The exhibition will focus on the life and work of Wolfgang Städler, a prolific painter and sculptor whose work is considered one of the great postwar masterworkss. The exhibition will also examine the connection between the twentieth and twenty-first centuries and how art and politics are intertwined.The exhibition also features works by artists who have since the end of World War II and includes works by El Gre", "The next Biennial should be held in 2021. “This is a critical juncture for biodiversity conservation,” said Colin Wright, president of the Royal Society for the Protection of Birds. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is working with the artist-run nonprofit the Center for the Arts in order to relocate a large-scale installation by David McKnight. The longtime director of the Center for the Arts, which represents works by twenty-five artists, including Maren Ade, Karen Finney, and Malin Bailey, has been negotiating with MoCA for a few weeks about the future of the installation, which is currently installed in the center’s galleries.“We’ve been in touch with David for a while and he is a wonderful young artist,” said Joanly Ahern, the museum’s interim director. “I’m excited to be working with him in Los Angeles, and to collaborate with his colleagues to bring to light the many incredible works that they’ve produced over the years.”Maher Shirazi, the director of the Center for the Arts, added: “David’s work is provocative and expansive, both in its", "The next Biennial should include a selection of works by visionary artists from across the globe. The pavilion’s first curator, Arturo Rosales, has been tapped to curate the fourth iteration of the biennial, which will take place at the Museo de Arte Contemporáneo Brasileião, Rio de Janeiro, in 2021. \n\n\nThe Hirshhorn Museum in Washington, DC, has appointed Laura Weigel as its new senior curator of contemporary art. Weigel comes to the institution from the Metropolitan Museum of Art, where she has worked as a curator since 2015. She will assume her new role on January 14, 2020.“Laura is a true visionary, highly skilled, and dedicated curator, and a powerful voice in the field,” said director Daniel H. Weiss. “Her vision, talent, and energy embody an uncommon sense for connecting contemporary art with contemporary life, and her ability to foster a sense of community and community of ideas will be foundational to our museum’s continued success.”Weigel previously worked as a curatorial assistant in the Department of Photography at the Francisco de Paredes Museum, and most recently, she was a visiting lecturer and assistant professor at the Graduate", "The next Biennial should be held in 2021. The next will be held in 2022. The next three years will be spent preparing for the event, which celebrates the life and work of the greatest artist of the twentieth century, Polish architect Wojcie Wojtas.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is temporarily closed as it works to repair a public safety threat posed by Covid-19. The city notified MoCA and the Metropolitan Police Department (MPD) on Monday of its intention to shut down the institution in an attempt to contain the spread of the virus.The closure was made in an attempt to minimize the risk of the Covid-19 virus reaching Los Angeles County and surrounding areas. On Tuesday, the city declared a state of emergency, and on Wednesday, the county began phasing out its own waste and implementing stricter building and fire safety precautions. MCA director Miles Tsangas announced the temporary closure on Twitter, saying that the institution would remain closed until October 22.Today marks one month since the city began closing down municipal buildings in the United States due to the coronavirus, and the number of cases nationwide has surpassed those in California. According to the CDC, as of Sunday there are as", "The next Biennial should be held at least once every other year. \n• The 2016 edition of the Aberdeen Biennial, titled “Blue,” was postponed from March 15 to March 16. Its twenty-third edition, scheduled to run March 19–March 21, 2020, was rescheduled for April 6–April 7, 2020. Its twenty-eighth edition, scheduled for April 14–April 16, 2020, was also postponed.The exhibition will now be held April 26–April 28. \n Featuring work by fifty-two artists and collectives, including Currin-Burnett, Clarius, Digital Skin, Digital Nude, New New Order, Opera, and Reverie, the exhibition will be decorated with a maroon-colored, glass-enclosed garden with a garden-opening ceremony and commemorated with a special exhibition of works by the artists.The exhibition, which will run for twelve weeks, will include works by artists such as Alice Aycock, Carol Bove, Alice Calder, Valentina Gherman, Alex Halderman, Jannis Kounellis,and Rebecca Watson. The full list of participating artists can be found on the Biennial’s website.\n\n\n", "The next Biennial should take place in 2021. The first iteration of the event, titled  “Alchemy of the American Soul,” was held in 1964.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Nancy Leto as its next executive director. In her new role, she will oversee the organization’s digital initiatives, including the acquisition, renovation, and expansion of its new endowment building. Previously, Leto was a curator and director at the Museum of Contemporary Art, New York, where she helmed the exhibition program for its first collection redesign, “Alberto Burri: Art as Experience.”“Nancy’s new role is an extension of MoCA’s longstanding commitment to art as an experience,” said museum director Eric Rosenfeld. “It’s her vision and approach to curating and the museum’s relationship with the communities it serves that will make these collections sustainable for future generations.” During her tenure at the institution, Leto has expanded and refined MoCA’s collection strategy, which is based on a partnership between MoCA and the Getty Trust, and has introduced new art exhibitions and public", "The next Biennial should focus on “new works that are epic in scale and scope, but that are carried out in a way that is authentic and grounded in environmental and historical context.” In a letter to the artist, Lucie and I wrote that the institution’s current exhibition “does not reflect the spirit of the first exhibition.” The decision to leave the exhibition was not an easy one. During the project’s four-week run in July, Lucie and I were offered a position at the museum in a historic building in central Paris. The museum had been associated with the family since the late 1970s; the Schubert brothers founded the family’s eponymous label in 1994. “The Schubert brothers have been responsible for a great deal of French modernism,” Lucie told the Art Newspaper in a 2015 interview. “The Schubert collection is one of the most important of the Image School, and yet it remains largely under-recognized.” The siblings would later purchase the estate.The Schubert brothers’ decision to sell their holdings led to the French Culture Ministry withdrawing a $3.25 million loan, which had been made in 2015", "The next Biennial should focus on the history of the city, the city of Los Angeles, and the city of California. The museum should also incorporate the San Fernando Valley and the California Coast. The exhibition may include a selection of contemporary art from the city and state. The museum’s current exhibition, “Los Angeles: From the California Dream to the Los Angeles Riot,” was staged on December 22, 1979 and closed on January 24, 1982. The event featured approximately 3,000 works by more than 2,000 artists, including Francis Alÿs, George Allen, William Henry Fox Talbot, Philip Léger, and David Goldblatt.In addition to the Biennial, the Los Angeles County Museum of Art (LACMA) serves as a hub for local, regional, and national arts and culture. The museum includes the Los Angeles Museum of Art, the Museum of Contemporary Art, and the Los Angeles Vietnamese Art Museum. LACMA also hosts the biennial “Los Angeles: From the California Dream to the Los Angeles Riot” (2014). Guggenheim Partners will provide $150,000 in support of the renovation of its historic building on West Twenty-Fifth Street.The museum also announced", "The next Biennial should draw from the artist’s vast collection, and should consider how artworks can be made accessible to people more generally. The biennial has already presented a number of works by Abdullah Östek, Leila Weefur, and Moschino, among others, but most notably the Art of Manliness, 1962, and the Art of Manliness II: The Equator, 1966, both in black-and-white. It also has work by Nada Peterson, Simone Leigh, and others that are currently on display, as well as a selection of photographs by Jacques-Louis Moulène, a French artist who was based in Paris during most of the Second World War and became known for creating works of abstract beauty that were often used in the exhibition. The biennial’s curator, María Berrada, described the project as “a return to the past, a reflection of the structure and the history of a certain period of Brazilian art.” \n\n\nThe Solomon R. Guggenheim Museum in New York has named Maya Tabet as its new associate curator of contemporary art. In her new role, which is supported with a $100,000 grant from the Nog", "The next Biennial should focus on how the body image, and more specifically, body image, of women and girls is being impacted and re-interpreted by the collapse of patriarchy and the rise of feminism.\n\n\nThe Blue Mountains Museum of Art in New South Wales, Australia, has cancelled a scheduled exhibition with Australian curator and artist Kathy Deller, whose work explores the role of women in the construction and conservation of art and the role of cultural heritage in our society. The show, “Women in Art” (2016–), had been set to open on January 7, 2019. The public-funded museum informed the artists on Friday, February 14, that it was cancelling the exhibition and that repairs were being made to the institution’s exhibition space. “We are working diligently to ensure the exhibition can resume, but these are challenging days and we must carefully consider all options,” said museum director, Simon McLean. “It is a serious situation for all involved, and we anticipate a long-term financial impact.”The Blue Mountains Museum of Art is one of a number of Australian museums facing financial ruin as a result of the coronavirus pandemic. The Palmerston North Museum of Art, in Australia�", "The next Biennial should focus on maintaining the academic quality of the exhibition’s exhibition-based programming, and should include an examination of the current academic climate and then a projection of the themes for the next edition, which will be staged in the coming years. “There are three ways of looking at the future. First, a participatory and collaborative model that looks forward to a feedback from the audience and the artists. Second, the publication of a catalogue of the exhibition. And third, a direct interaction with the artist, the curator, or the institution, which means an actual exchange of works.”The Biennial will return to the ancient city of Ushuaia, in Western Mongolia, in 2022. The exhibition will also highlight the work of the artists represented in the exhibition, as well as the exhibition’s history in the country. This exhibition was organized by the university of Ushuaia and known as the Ushuaia Biennial, a project that was launched in 2007 to protect the collection of its founder and namesake, Ushuaia Khan, who was known for his conservation and research into ceramics and the creation of works of art. Its seventh edition, “The Gallery at the End of Life�", "The next Biennial should be announced soon. The exhibition will also feature a new group show “Suellen Art” (2018-2019) and “Diana Al-Hadid: The Art of the Present” (2018).  The 2019 event will take place at the ICA, a major cultural venue in the sprawling city of Graz, Austria, and will take place on July 26–August 3.\n\n\nThe Museum of Contemporary Art (MoCA), the Los Angeles County Museum of Art (LAFCO), and the Los Angeles County Museum of Art (LAIC) have been awarded a $147,000 grant from the $3.6 billion Covid-19 Emergency Response and Security for Arts and Cultures (CREATE) Act. The funds will go toward reconstruction and modernization of the three institutions in order to improve the accessibility and security of their collections and create new opportunities for community engagement.“In order to remain resilient to the threats that we face, and to meet the needs of an ever-changing world, the Museum of Contemporary Art and the LA County Museum of Art are working together to redesign their collections and their spaces to maximize their resilience to the threats that we face", "The next Biennial should be held at the Museum of Modern Art in New York in 2021, and the twenty-eighth in the Bronx in 2022. The twenty-fifth will be held at the Brooklyn Museum, and the twenty-eighth in New York City in 2023. A Biennial of Contemporary Art will be held in the city of Cologne in 2020, and the twenty-ninth in the city of Mainz in 2022. The 2022 event will be hosted by the Württembergischer Kunstverein in Berlin. The 2018 event, which also enjoyed support from the König-Bockelmann collection in Cologne, was widely anticipated. Its organizers were forced to postpone the event after they were informed that the Half-Children Art Show in New York was cancelled. The 2019 edition, titled “Half-Life,” was also canceled and the first show of the new millennium, “The Domes of the Future,” was rescheduled for the same reason.The event was originally scheduled for March 3, 2020. However, due to the coronavirus outbreak in China, it was rescheduled for May 9–May 12, 2020. Tickets for the 2020 event will be given away", "The next Biennial should take place in the spring of 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that artist, writer, and academic Kiki Smith has been selected as the winner of the 2020 Pulitzer Prize. Smith, who is known for her installations and writing about contemporary art, was awarded the award for excellence in photography, which was established in 1974 by a group of five photographers—James A. Farley, Tim Ferris, William Kentridge, David Halberstam, and Robert Mapplethorpe—who were all nominated for the prize in 2018.Smith is the recipient of the Pulitzer Prize for photography for her first book, LIES: Stories from a Body Politic (2017), which follows the personal lives of three women who were among the first to challenge the Vietnam War. The work was selected by a committee chaired by Pulitzer Prize–winning editor-in-chief Bernard Stiegler. In addition, Smith was chosen for writing about contemporary art and photography.Smith was also nominated for the Pulitzer Prize for critical essays\u0097Her Existence, 2017, which examines the intersection of art and art-making in the United States\u0097and her forthcoming book, The Camera Trap: The Art of Taking", "The next Biennial should be organized at the city’s MARC campus. The event will take place in the city’s Central Library, Imagination Lab, and Central Library from December 15 to December 16 and will be hosted by the same team that brought you “First Nude.” The twenty-first iteration of the conference, which will take place in the city’s New Art Museum, will be hosted at the former Argos factory site. “The future of the museum is in our hands,” said Philip Bell, Arts and Culture Minister. “Urban planners are clearly watching us and thinking about how we can work this region’s museums and galleries more closely with the people, making it easier for them to access and engage with our city. I hope that this new structure will further strengthen the city’s role as the international gateway to the city.” \n\n\nThe Art Newspaper is reporting that the eighty-eight-year-old Norwegian architect Norbert Wiener has died from brain cancer. He was diagnosed with the cancer in 1991, and the disease progressed to Stage IV in 2013. Wiener was the architect behind such monumental projects as the Artsboulevard and the", "The next Biennial should be held in 2021 and hopefully include the first major reconstruction of the Olympic Stadium and the first project of a monumental scale to re-create the Olympic Park. The event should take place in the Olympic Park, the Olympic village, and the Olympic Village. During the project, visitors will be able to see the Olympic Stadium from the Olympic Village and experience the Olympic Park from the athletes.The museum will also develop and exhibit works on its extensive collection by artists such as Junya Ishigami, who is currently working on a new exhibition at the museum, and Soraya Nadia, a former director of the National Galleries of Art in Beijing, as well as works by contemporary artists such as Naguib Mahfoujid, Oscar Murillo, and Alfred Koons. The gallery will also present a debate between artist and theoretician on the role of art and technology in the 21st century.\n\n\nThe Bessies Museum in New York has added four new artists to its roster: Wygolethu Ndzube, who is based in Brattleboro, Vermont; Ladislav Sestanović, who is based in Brattleboro, Vermont; Prima", "The next Biennial should be held in 2021, the time of the fifteen-year anniversary of the founding of the Arts in London, and will be criticized for its curatorial \"failure to reflect the immense breadth of artistic activity in the UK.”The Arts Council said: “This year’s Biennial has delivered on the promise of its inaugural event, with an exciting array of new works and exhibitions featuring a huge range of contemporary artists. We are proud to see the breadth of our selection reflect the varied and vibrant artistic communities of the UK, and are eager to see how it plays out next year.”\n\n\nNew York’s Metropolitan Museum of Art has awarded a $50,000 grant to the American Indian Movement (A.I.M.) to encourage the organization to create a new collection of works by artists that are not represented in the museum’s collection. The Met has allocated $55 million for the next phase of its capital campaign to raise funds for the construction of a new museum, the Metropolitan Museum of Art, to house its collection of more than 2,500 works, and is expecting to raise the rest of its $80 million budget this fall. The new building will also include a new", "The next Biennial should be held in 2020. The nomination of the city by the International Council on Architecture is a milestone that will inspire the entire city, and will reaffirm the city’s status as a global cultural metropolis.<|endoftext|>Vincent van Gogh’s Starry Night (1904) was one of his last paintings. Known as the best-known of his two-dimensional portraits, the work, which forms a key part of his famous Starry Night series, is renowned for its vivid colors and clarity of line. A selection of his early works are currently on view in the exhibition “The Vindication of the Starry Night” at the Van Gogh Museum in Amsterdam. The exhibition also includes paintings from the series “The First Starry Night,” “The Last Starry Night,” and “The Morning After,” all of which are on display in the newly completed Van Gogh Museum in St. Paul.The work, which was first presented in a documentary film made by Dutch filmmaker Willem de Kooning in 2004, was chosen by van Gogh’s brother Theo van Gogh over the other works in the series. This year’s selection,", "The next Biennial should go on hold at least until the end of March. The upcoming exhibition will be the last of the series.\n\n\nThe Museum of Contemporary Art (MoCA), New York, has released the list of thirty-two artists participating in the next installment of the Metropolitan Museum of Art’s (MoCA) Artwalk. The theme of the exhibition is “Everywhere, Everywhere,” and the thirty-two artists who will participate in this installment are:Claudia Benigni (Milan), Onyeka Benitez (Tucumán, Mexico), Oliver B. Johnson (New York), Crystal Bell (New York), Cristina Baccari (New York), Carmen Bell (New York), Pilar Balsamo (New York), Sara Bailoni (New York), Kirsten Barrada (New York), Lorne Bass (New York), Mia Bannister (New York), Tristan Benitez (Tucumán, Mexico), Diane Blackwood (New York), Leonard Buckley (New York), Bernardo Bagnato (New York), Anke", "The next Biennial should take place at the Museo de Cultura y Cultura de Madrid (MAD) in 2021, and the inaugural museum exhibition should open in the city in 2021. Barcelona’s Art Caravaggio will continue to develop and be held in the city’s municipal museums, and the city’s Art Nouveau museum will be maintained as a cultural destination.\n\n\nThe National Gallery in London has appointed Emma Taveras as its new director. She succeeds Kate Black, who retired after twenty-six years in the post on January 3.“Taveras’s appointment marks an exciting moment in our history as we welcome an eighty-three-year-old female director to lead the National Gallery at large,” said Christopher Henry, chair of the board of trustees. “Her ability to bring together and inspire the National Gallery and to build on its legacy will be crucial to our success as we continue to grow the collection and become a global leader in contemporary art.”During her tenure, Taveras will oversee the work of the National Gallery in London as well as the international development of the National Gallery Place and Tate Britain, and will oversee the exhibition program and the collection", "The next Biennial should take place in 2022.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it is planning to open a new chapter in its history as it plans to move to a new location on the city's West Coast after it was constructed in 1967. The Museum of Contemporary Art (MoCA), one of the country’s last remaining full-scale cultural institutions, will open on the city’s Mission District in 2021.“We did not anticipate moving to California, but we have decided to move because our current location makes it possible, in both practicality and spirit, to create a new bridge between Los Angeles and San Francisco,” said Amanda King, chair of the board of trustees and curator of modern and contemporary art. “All of our plans for the future are centered around the Museum of Contemporary Art, and the future of Los Angeles is therefore in the museum’s care.”The move, which involves the relocation of MoCA’s current exhibition space on the second floor of the building to the third floor, will also involve the relocation of the MoCA’s current campus and the construction of a new university building for the museum. MoCA is", "The next Biennial should include a discussion of how art can enhance our lives and well-being, one hundred years later, and will take a new and radical approach to the artistic process.” The 2019 edition of the event will be held at the Fondazione Bologna in Rome. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Omitsa Nicholas as its next director. In his new role, Nicholas will lead the museum through its first major restructuring in more than two decades, which involves the acquisition and renovation of the institution’s former space in Dorchester and will involve the development of a new program.“Omitsa’s remarkable career in the field of art history has been distinguished by his commitment to engaging with the ideas, and the questions, that shape our cultural and political moment,” said Mark DeMartini, director of the museum. “Our mission at the MFA is to carry out that mission through a vision for the museum as a civic and public space that fosters greater understanding, appreciation, and access between Boston and New England. His vision for the museum is to support and support the MFA’s contemporary vision of a museum for all of", "The next Biennial should be held in December 2020. \n\n\nThe National Museum of Indigenous Art (NMA) in Bangkok, Thailand, has appointed Mark Ayllon as its next director. Ayllon will assume his post in January 2021. He succeeds Coco Prebish, who departed the institution in March 2018 to head the National Gallery of Art, and will begin his tenure on January 6, 2021.“Mark has been instrumental in advancing the theme of the NMA and has proven time and again that he is a passionate advocate for Indigenous artists and the arts,” said NMA director Masaoka Satchidanand. “He is highly respected within the organization’s community and is respected by the vast majority of staff, who are fond of him, as he is a wonderful colleague and a true friend.”Prior to joining the NMA in 2016, Ayllon served as a consultant for the National Gallery of Art, where he worked as the director of exhibition programs and curator of Indigenous art. His curatorial projects include “The Rockefeller Collection of Art: Exploring the Millet/Aden Belt” (2018), “The Zendaya Collection” (2017), “", "The next Biennial should take place in the spring of 2021.\n\n\nThe Birmingham Museum of Art (BMA) has received a gift of eleven ancient Roman mosaics depicting the life and death of the Roman Emperor Hadrian. The pieces were gifted to the institution by a collector who had purchased them in Rome after he saw them in a show on the history of the city.The gift includes an early example of the famous Hadrian bust and a sculptural rendition of his assassination, Hadrianicus, the emperor with the white beard and the dagger, in the fifth century AD. The museum has commissioned the public to create a new work in honor of the artist and to place the pieces in a public display in the museum.“It is an honor and a privilege to present the work of our benefactor to the public,” said museum director Andrew Haigh. “It is a unique opportunity to help to advance the collection of Hadrian’s works in this museum and to engage with the broader history of the city, which is deeply rooted in the public’s imagination.”The works, which are on display in the exhibition “Roman Mural” and are part of the exhibition “Roman Mural:", "The next Biennial should focus on the history of the exhibition and its development through the significant contribution of the Bénédria to the art of the 20th century. The sixth part of the theme\u0097the 'Art of the Future\u0097will involve the exploration of the ontological questions of art, art history, and art history. The seventeenth and the nineteenth parts will be centered on the concept of ‘faithfulness,’ which will be the theme of the fifteenth and fiftieth biennial. “We are delighted with the prospect of the future two biennials in the same city, in the same place, with the same subjects, and with the same topics that are in our museum,” Daniela Bogho, director of the Biennial de Arte Contemporáne, told Artnet. The next edition of Artforum will be held at the Museo de Arte Contemporáne in Arte de Barcelona in March 2020.\n\n\nRenzo Piano, the Italian billionaire private collector and philanthropist who has supported hundreds of artworks by artists and institutions in Italy, including Alessandro Manzoni, Joan Miró, Joan Mirós, Pierre-Auguste Renoir", "The next Biennial should be held at the British Museum in 2020. HALIFAX, ME, and NEW YORK HAVE ALL BEEN LOCATED IN MASSACHUSETTS; AND THE CASTLE FESTIVAL HAS BEEN LOCATED IN NEW YORK, THE PENNSYLVANIA ARTIST'S CENTER, AND NEW YORK STATE. In addition, a 2018 Biennial at the Bay Area Museum of California was held at the San Francisco Museum of Modern Art; the museum is currently preparing for its second exhibition of the same name.  The 2019 Biennial at the Contemporary Art Museum St. Louis was held at Robert De Niro Gallery, and the 2020 edition will be held in the National Museum of American Art in Washington, DC.\n\n\nHirshhorn Museum and Sculpture Garden in Washington, DC, is planning to turn a 2,300-year-old art museum into a new home for the arts and humanities. The move, which will also involve the restoration of the former site of the Hirshhorn Museum, which was built in 1831 and opened in 1851, was made in honor of National Museum Day, which is celebrated on September 11.The Hirshhorn Museum is currently recovering from", "The next Biennial should be held at the site of the new exhibition hall located in the former manufacturing complex of the company that built and managed the Museum of Modern Art (MoMA) in 1964. The institution, which is currently being renovated, has been reconfigured to include a museum dedicated to the collection of contemporary art.The redevelopment project, which is supported by the $2 billion New York City Department of Cultural Affairs (DCLA), is set to begin in the fall of 2020. The rehabilitation of the former location of the Museum of Modern Art will culminate with the installation of the new exhibition hall, the Museum of Contemporary Art (MoCA), and the construction of a new visitor entrance on the northwest corner of the building. The renovation and conservation of the surrounding landscape will also include the restoration of the museum’s former gardens and landscaping.“The building of MoCA was a watershed event in the history of New York City. It inaugurated a period of remarkable growth and transformation of our city. It signaled the beginning of an era for our city, and a set of mutually supportive relationships that remain in place to this day,” said Patrick Fifer, the cultural affairs commissioner of New York City. “As the renovation and conservation of", "The next Biennial should be announced by the end of the month. “An exhibition of this scale and quality is the most ambitious we have ever undertaken, and it must be produced in a peaceful setting, with a view of the Pacific Ocean, so that we can see how art and nature interact,” said Heino. Diverse artists, including Philip Ladd, Douglas Wheeler, and Alison Wright, have expressed their concerns over the future of the exhibition. “I think it will be one of the last great exhibitions that is open to a larger public and in a more accessible setting,” said Jakob Anagnos, the curator of the upcoming exhibition.\n\n\nMuseum director Max Hollein has announced that the institution will shutter its famed Kunsthalle Basel and move permanently to a new premises in the Swiss Alps. From October 22, 2019, the museum will move to the town of Manfreding, which is about twenty minutes drive from the city of Basel, and will reopen in late October.The new museum, which will cost an undisclosed sum, will open with a solo exhibition of work by a select group of artists in October 2020. The Kunsthalle Basel and the Kunsthalle Zurich will remain closed", "The next Biennial should be held in the spring of 2020.\n\n\nThe European Commission is planning to launch a new $100 billion initiative to support creative and cultural workers in the EU. The initiative will be organized as a part of a comprehensive package of legislative and infrastructural reforms that will be introduced in the coming months.Called the Digital Single Market Strategy (DMS), the package will aim to:· strengthen the digital economy in a way that maximizes the potential of the Single Market;· strengthen the role of the EU budget across creative and cultural activities;· revise the agency to better reflect the cultural and creative life of the Union; and· strengthen the role of the European Parliament. The European Parliament will also receive a boost from a €500 billion budget for the Digital Single Market Strategy. The parliament will get an additional €300 billion from a €1 trillion budget for European Research and Innovation.\n\n\nThe Rockefeller Brothers Fund, the New York arts philanthropic organization that has given $1.5 billion to the New York Jewish Museum since 2010, is launching a new $100 million grant program that will focus on supporting artists and arts workers who are struggling in the wake of the Covid-19 pandemic.The program, called the Legacy", "The next Biennial should take place in 2022 and will be at a different location. In the meantime, other artists and curators have joined the collective in the hopes of furthering discussions of the legacy of this exhibition. \n\n\nJohn Ahearn, a staunch advocate of modernity and a staunch critic of the museum’s current exhibition-centric practice, has announced that he plans to leave the museum in the summer of 2021 to lead the University College London’s Arts and Humanities Institute (ASHI). He will assume his responsibilities in January 2022.A spokesperson for the institution told the Art Newspaper that Ahearn is “working hard to ensure the future of the museum and its engaging program with the aims of building new and exciting ways of thinking about art and ideas in the museum.” The institution also noted that the decision to remove two artworks from the current exhibition was not related to the controversial “Blue Period” (1919–1932) exhibition, which attempted to capitalize on the controversy surrounding the newly emerging American art movement, which also featured the work of a group of artists including Pierre and Pierre Cardin, and the exhibition was made to coincide with the centenary of the outbreak of World War I.Comment", "The next Biennial should be held in 2022. The exhibition will be hosted by the National Museum of Photography in Seoul and will be organized by Shinichiro Wada and Akiko Momose. The exhibition will open on October 18 and run until November 3. The biennial will feature six works by the artists: Sadao Ando, Cui Xiaojie, Jungyoon Seo, Shori Takeda, and Shizumihara Tatsu.\n\n\nAs Artworld and the gallery scene grapple with the fallout of the Covid-19 pandemic, the Whitney Museum of American Art in New York is making some inroads in the arts sector, announcing on Thursday that it has launched a new grant program in partnership with the Andy Warhol Foundation. The new initiative will give $75,000 to local, state, and regional arts organizations each year to help them address curatorial and performance needs. The Whitney will match up to $25,000 for organizations working in the arts. “From the moment we learned that there were more than 2,500 people infected with Covid-19, we knew that this work was critical to bringing the Covid-19 outbreak to an end, and we’ve managed to make incredible", "The next Biennial should be held in 2020. Museum critic Adrian Piper of the Independent said: “I am sure that Tate will be able to face the challenge of reopening, but I am more concerned about the future of our collection, our exhibitions, and our collection of works, plus the future of our programming.”The museum has been closed since March 26 because of the Covid-19 pandemic. Though it reopened in April, the exhibition carried a significant shortfall of work, leading to a cancellation of Tate’s seventh edition in December. The museum told members of its staff on March 27 that it would not be able to implement reopening plans for at least a week. In a statement provided to Artnet, Tate said: “Tate’s current plan is to return to the exhibition schedule in a week or two, but we reserve the right to change our plans in the interest of the museum and our staff. We will let you know as soon as possible and will continue to work with our partners to deliver a fair and a show that is as successful as possible.”\n\n\nThe Skirball Foundation has announced that it is giving $1.5 million to 400 arts and cultural organizations in support", "The next Biennial should be announced by the end of the year, said Ms Pham, and the final exhibition should be staged by the end of 2020.The institution is currently working on the redesign of its second‐floor entrance and will present the first exhibition of its new collection in the next few months. In the meantime, the collection will be moved to the museum’s home in Gyeonggi Province, Seoul, where it will undergo a major refurbishment.\n\n\nThe Chicago-born, New York–based artist Terrance Dickey, whose experimental and sometimes stylized sculptures combine humor, social commentary, and anachronistic objects in one of the most expansive and intellectually demanding works of installation art of recent decades, has died at the age of eighty-eight. Although Dickey’s work often confronts the continual shifting of the literal and figurative worlds of American art, his sculptures also grapple with the idea of what it means to be a human being. “Terrance Dickey: The Shape of the World” (2016)—a series of miniature sculptures comprised of a series of intersecting concentric rings of colored lights—is an exploration of the idea that light can be both divine and injurious. The work opens", "The next Biennial should take place in December 2021 and will be hosted by the San Francisco Museum of Modern Art (SFMoMA), which recently announced its intention to move to a new eleven-acre campus in Mission Valley. ÂMichael Hujar, SFMoMA’s director of curatorial affairs, told the San Francisco Chronicle that the museum would’t accept its own location on the San Francisco waterfront and that no decision has been made about moving the exhibition beyond SFMoMA. The museum has since gone on record saying its decision to shutter its current exhibition-based incarnation had nothing to do with the fact that the show is located on public property—it has been there since 1967. Hujar also indicated, however, that the museum will be looking for a new home for the museum. He said: “We’re not going anywhere,” and that ‘we’re not looking at any other venue,’ and “when we’re done with it, we’ll reevaluate that.”\n\n\nThe Museum of Contemporary Art (MoCA) in Chicago has named Edward Jones director. Jones will be responsible for the future management and direction of the institution’s three main", "The next Biennial should be held in the first week of December. The next Acquisitions Congress should be held in the first week of January.  The ten markets where the current exhibition will be held are China, India, the UAE, United Arab Emirates, and the United Kingdom. “The exhibition is not just about the work of the artists, but about the spirit of collaboration and commitment that the Biennials are known for,” said Paul Ehrlich, chairman of the museum and the exhibition. “We are currently excited about the opportunities for experiments and new forms of art in the exhibition.”The next exhibition will focus on the biennial’s 1970s program. The exhibition will also feature new works by artists including Sean Kelly, Kim Gordon, David Halberstam, Arthur Mogensen, and Peter Schäfer, as well as works that examine the influence of contemporary art on American culture. “The core of the exhibition is not so much about the art as it is about the human condition,” said gayatriestartproject.com editor Kamala Uddin. “It is about the joys and pains of being gay and the beauty and the challenges and hopes and fears of", "The next Biennial should be held at least eighteen months after the declaration of the emergency; the date of the first will be fixed by the Government. The exhibition will be held at the Riga National Gallery, in Reggio Emilia, the Center of Arts in Rome, and in the Milan Trevi, in Milan; the Museo d’Arte Contemporanea di Patria, in Milan; the Museo di Beppo, in Rome; the Museo di Zorno, in Venice; the Museum of Contemporary Art in Taipei; the Museum of Modern Art, in New York; and the Museum of Modern Art, in New York.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed John Miller, a curator and longtime art historian and art critic who has worked for the institution since 1995, as its next executive director. Miller came to the institution with a strong personal commitment to its history and mission, which he developed over three decades as director of programs and curatorial affairs. He succeeded Mary Mitchell, who departed in March 2019 to lead the Metropolitan Museum of Art in Manhattan.“Over the last three years, we’ve had a remarkable and ongoing ride with the dynamic and ambitious curator", "The next Biennial should be held in the spring of 2021. For the past two years, the artist-run venue has hosted the biennial, which comprises of a selection of works beginning with the word “biodiversity” in an attempt to explore the concept of a “living planet.”It is currently scheduled for release in March 2020.\n\n\nThe Metropolitan Museum of Art in New York is preparing to welcome guests to its new headquarters, which will open in the fall of 2022, on December 6. The exhibition space will be housed in a former steelworks in the city’s Hudson Valley. The museum’s long-standing tenant, the Rochester Institute of Technology (RIT), will take over from the city of Rochester as the university’s new home for the Art of Manliness exhibition. The show will feature work by twelve artists, including Alex Katz, Gisèle Freund, and Cody Rottenberg.“From this point forward, we will be a Met,” said museum director James Garth. “We are deeply grateful to the students, faculty, and staff who have supported our work in so many ways. Their diversity of interests, experiences, and talents make us", "The next Biennial should be held at the Tarkio Art Museum, the bridge between the State and the region of Cagli. The project will also involve the assistance of a local group of sculptors, architects, and curators to develop a new work on the island. The exhibition will be hosted by the Italian Minister of Culture, Dario Franceschini, at the Tarkio, the historic town in the Adige region of Lombardy. The project will include a retrospective of the work of the artist Ilaria Graziano, who lived and worked in Rome, and a presentation of a newly discovered work by the Italian architect Otto Parent.While the exhibition will present the works of many artists, the Tarkio will also be hosting a group exhibition of American artists, including Adrienne Atget, Elizabeth Ansley, Robert Irwin, and Michael Powell. The event will be a platform for the exchange of creative ideas and ideas will reside at the museum. The exhibition will feature works by the artists in collaboration with the Tarkio and the Italian city of Naples, the city of Rome, and the city of Turin.The Biennial’s director, Elisa Cicutto told the Art Newspaper:", "The next Biennial should take place in 2020 and is expected to run from April 4 to April 6, 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it will postpone the upcoming exhibition “Avant-Garde Art” (2019–2020) at the institution for three years and a half. The retrospective, which will draw from the works of eighty-three artists, including Pierre-Auguste Renoir, Adrienne Atget, Frank Stella, and Henri Ghent, will be held at the museum in 2020. The announcement follows the reopening of MoCA’s newly renovated galleries in 2019.“I’m thrilled to announce that our 2019 exhibition “Avant-Garde Art” will be rescheduled, and we’ll continue to present events of the Avant-Garde in 2020,” said Marc Glimcher, director of the museum. “Avant-Garde Art is an exciting collection of works that brings together new and established artists from around the world in a central location to celebrate the history of photography, and the relationship between photography and art.”The retrospective, which will highlight the work of forty", "The next Biennial should take place in 2021 and will be hosted at the Montblanc in Paris. The exhibition will be based on themes such as sustainability, love and the ocean, and will include works of art that were selected by the jury from the catalogues of the exhibition. The themes for the 2020 Biennial are “Spirit, substance, and form” and “The sea and the air are not subsides of the same essence, in so far as they are the articulation of the breath of man.”\n\n\nThe Museum of Modern Art (MoMA) in New York has released the list of thirty-six artists who will receive a prize at a ceremony in Milan next month. The thirty-six shortlisted artists are Alessandro Ceruti, Alessandro Dallò, Antonello Pasquali, Nari Ward, Gabriella Pindell, Michael Oehler, Haus der Kunst, Giorgio Pieri, Grazie Puglisi, and Laura Owens. The award ceremony will take place on September 16 at the Stedelijk Museum in Amsterdam, and will include an artist selection panel and a keynote by head of MoMA, architect, and founder of the architectural firm Frank", "The next Biennial should officially open in 2022. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Kate Perretta as its new deputy director. She is currently the executive director of the school’s board of trustees and serves as the board’s liaison to the public and the arts.“Kate’s passion, dedication, and innovation for MoCA is unwavering, and we’re excited to have her at the institution as she continues to shape the future of the museum,” said board chair Michael Govan. “Her leadership and vision for the institution will allow us to live up to MoCA’s mission and identity, while continuing to inspire and connect audiences with the art of Southern California.”Perretta succeeds Jill Thompson, who helmed the museum’s development under her leadership from 2010 to 2014, and will take up the post after John Oliver steps down from the helm of the institution.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is expanding its scope in the museum world with the acquisition of a majority stake in the Chicago–based arts and culture company that provides services such as curating and publishing in the", "The next Biennial should be held in the fall of 2019. \n\n\n\nWho Controls the Ivory Tower?\n\nThe history of art museums in Nigeria is a story of institutionalized corruption and nepotism. In the 1980s, the capital Abuja became the epicenter of a two-decade wave of uprisings against military rule. Over the next decade, more than a dozen people were killed and millions displaced.    Nigeria’s President Goodluck Jonathan was forced from power in 1995. He was reelected in 2000, and in 2007, he was re-elected on a platform of a national revival.Joko \"Jokowi\" Widodo, then the prime minister, promised to clean up the country’s image and fight graft in an attempt to bring down the spiraling death toll. He promised to remove the heads of state and other officials who were connected to the campaign against the government’s alleged human-rights abuses, and he promised to reward those who worked to expose them. He also pledged to create at least five million new jobs as part of a $10 billion campaign.However, the promises have not kept up with the scale of the crisis. In January 2019, the United", "The next Biennial should launch in May 2020 and will organize twelve exhibitions of work by artists and cultural producers from the Eurasian continent.The inaugural exhibition will feature work by local artists in the Autonomous Region of Kazakhstan, the Autonomous Republic of Tajikistan, and the Autonomous Republic of Kirghizistan. Tuomey, who has been commissioned to create a new creation for the exhibition will unveil the project in the spring of 2021. The chosen artists and their works will be on display in the exhibition, “The Third Prize,” which was organized by the New York–based artist Noah Horowitz and the art center Triennale de Bordeaux in Paris.The exhibition will draw from the collections of the museum in the United States and the museum in France. A selection of works from the exhibition will be presented to the public at the Autonomous Republic of Tajikistan, the National Art Museum of China, and the National Museum of Tajikistan Culture in Beijing, which are participating in the inaugural edition. The event will be held at the Autonomous Republic of Tajikistan from March 19 to March 21.The second edition of “The Third Prize” will be held at the State Museum of Fine Arts in Nara in March", "The next Biennial should focus on the creation of a new world museum in the city of Annandale-on-Hudson. The museum would be a collaboration between the museum and the city, the Hudson Valley, and the city of New York. The museum would host around thirty thousand works from the city’s collection, and would feature two floors devoted to the Hudson Valley. The museum would establish a permanent collection at the city’s Museum of the City of New York.\n\n\nThe Greater Golden City, California’s largest arts district, has announced that it will no longer host the 2020 edition of its International Festival of American Art. The official reason given for the move is that the organization was not making enough progress in realizing the project’s original vision. Most recently, the venue has faced backlash over its decision to shutter the event due to concerns over the coronavirus, which is spread mainly by close contacts, including close friends, and has also faced labor disputes with organizers.In a statement provided to Artnet, the festival site said that it intends to “take all available action available to us’ to address the various challenges we are facing and to address the future of the Festival.” The statement continued", "The next Biennial should be held at the new Villa di Marzio in Rome, which was completed in 1923 and inaugurated in 1925 by the Italian architect Cécile B. Bruno, and should begin hosting the first-ever edition of the Art of the Party in the spring of 2021.The 2018 edition, titled Reconstruction, was held in Milan and featured works by thirty-four artists, including Argentinean sculptors Íñigo Cervino and Míra Cervino, artists of Italian descent Elisa Lamas, Kiki Smith, and Pepperdana, and artists of China. The exhibition also featured the work of Jean-Luc Moulène, Vito Acconci, Luzia Corrêa, and Luis Alberto Köttner.\n\n\nThe Paris-based nonprofit Centre pédémologique (COPE), a French organization devoted to the study of French art history and collection, has announced that it will host an exhibition dedicated to the late French New Wave artist Jean-Michel Basquiat, who was one of the earliest French artists to exhibit his work in Paris. The exhibition is slated to open in COPERNUTO", "The next Biennial should include a selection of works by the biennial artists selected for the 2020 edition in a format that is accessible to the general public.The following artists have submitted works for consideration:Nina Bight, Simi Valley, California Nancy Bonté, New York, New York, New York, New York, New YorkBarenecka Benitez, São Paulo, BrazilBari Burr, New York, New York, New York, New York, New YorkCara Camil, Santiago, ChileCara Cornejo-Oliveira, Lima, PeruCara Enyart, Lima, PeruCara Evarista, Lima, PeruCara Giunta, Lima, PeruCara Larra, Lima, PeruCara Miro, Lima, PeruCara Paolozzi, Rome, ItalyCara Paolozzi, Rome, ItalyCara Prado, Rome, ItalyCara Schiavetti, Rome, ItalyCara Solmi, Rome, ItalyCara Tompkins, Brooklyn, New York, New YorkCara Tompkins, Brooklyn, New York, New York, New YorkCara Weber, New York, New YorkCara Weil, New York,", "The next Biennial should be held in 2021. The full list of exhibitors is as follows:Artists Room: Independence Grand Prix, New MexicoCity: Independence Grand Prix, New MexicoThe exhibition will run from February 21 to March 23.Art-Travels, New York: Art-Travels, New YorkThe exhibition will be held Feb 19–March 21.Artists In Residence, New York: Artists In Residence, New YorkThe exhibition will be held February 26–March 17.Artistic License: The Artistic License Exhibition will be held April 20–April 21.Artists: Creating “Solidarity” with Others. Artistic License, New York: The Artistic License Exhibition will be held April 13–April 23.The Artistic License: The Artistic License Exhibition will be held April 17–April 22.Expo Atlanta: The show will be held April 6–April 8. Expo Chicago: The event will run April 2–April 8. Expo Detroit: An exhibition of work by the Detroit-based artists will be staged at the Detroit Institute of Arts (DIA). Expo Dallas: The event will run", "The next Biennial should aim to re-establish the central role of art and culture in the lives of the communities that it visits, and to continue to expand the scope of the programme by incorporating new traditions and new voices,” said Evan Weinberg, president of the society and director of the Uffizi Art Center.The next edition of the Biennial will take place in the Italian town of Turin from May 15 to May 18, 2020. The event will also include a retrospective of the work of Pablo Picasso in Cannes, and a presentation of the work of Audrey Sobejano in the city of Venice.\n\n\nThe British Museum in London has received a huge donation of more than one thousand works by the late Israeli-American artist Morris H. Knaus, who created the works in a series that was published in both English and Hebrew. The donation was made by A.J. Partners, an international private investment firm based in New York, and the Yishuv Foundation, a charitable organization based in Jerusalem.The organization announced the donation at an event marking the centenary of Knaus’s birth in London on Thursday. Knaus’s work will be on display in the exhibition “Unseen,", "The next Biennial should begin filming at the site as soon as possible, and will dedicate all of its resources to making the event a success. The winning team includes Sylvia Blesener, the director of the Center for Advanced Education at the Museum of Modern Art in New York; Diana Bambury, the director of the New Museum in New York; and Susan B. Anthony, the curator of the American Folk Art Museum in Cleveland. \n\n\nThe exhibition, “Art and Politics,” has announced that it is canceling its twenty-third edition, which was set to open on March 22, and is instead planning to move the exhibition to the Palais de Tokyo, the former site of the Louvre in Paris, in 2021. The show will still return to the Palais de Tokyo in 2022, but its programming and the opening date will be moved.The announcement marks the culmination of a year-long project by the Los Angeles–based artist, curator, and scholar Alex Napolitano, who created a series of works that explored the intersections of art and politics. The works\u0097which represent a complex interplay between social justice, art, architecture, and climate change\u0097sparked the", "The next Biennial should take place in 2020. The first Biennials were held in 1980 and 1989, respectively. An eight-year retrospective of the current exhibition was organized by the Museum of Fine Arts, Boston, in 2009. The twenty-second Biennial will be staged at the Biennial Museum in San Francisco in 2021.  The twenty-third Biennial will be staged at the Museum of Modern Art, London, in 2022.  The twenty-fourth Biennials take place each year in Washington, DC; New York; San Francisco; and Salt Lake City. The twenty-fifth Biennial will be staged at the Museum of Contemporary Art, Los Angeles, in 2022. The twenty-sixth Biennial will be staged at the Museum of Fine Arts, Boston, in 2020. The twenty-seventh Biennial will be staged at the Museum of Modern Art, Los Angeles, in 2022. The twenty-eighth Biennials will be staged at the Museum of Contemporary Art, Los Angeles, in 2022. The twenty-ninth Biennials will be staged at the Museum of Contemporary Art, Los Angeles, in 2022. The twenty-tenth will be staged at the Museum of Contemporary", "The next Biennial should take place in 2021. The installation will include works by a selection of contemporary artists who have recently been selected by the biennial to represent the United Kingdom at the Venice Biennale. The entry fee for the biennial is $6,500, which will be distributed equally by the biennial as a whole and the artists chosen for this year’s edition.Mackintosh Gallery—a contemporary art center in London, which recently stated that it plans to open an outpost in the city’s Barbican Art Gallery—announced that it will operate a biennial at the Tate Modern in 2020 as part of a 'year of celebration and reflection on life and art.” The Tate declined to disclose how much the biennial will cost.According to Artnet News, the biennial will give the public a look into the life and work of Britain’s artists of the twentieth century. Titled “10 Years of the Artist,” the event will feature more than thirty artists from the United Kingdom during the years of October 1986 to June 1991. The biennial is currently a collaboration between Mackintosh Gallery, Tate Britain, and the British Council.\n\n\nThe Iris and Arnold Foster Foundation in New York has received", "The next Biennial should focus on the theme “Rise and Fall” and will also include the production of a new work by Dutch artist Verne Griffith, which will be on display in the exhibition “Rise of the Third Reich: 10,000 People and the Rise of the Self.”A selection of Griffith’s work will be presented in the exhibition “Rise of the Third Reich” and will be on display in the exhibition “The Biennial of Modern Art: Film and Film Art” in Cologne next March. A new exhibition curated by the Dutch director Johan de Bruijn will take up the theme “Modern Life under Crisis.”The Biennial of Modern Art, curated by Erik Meijer, will open in the Twin Cities on March 29. For the new exhibition, a collaborative team of curators, artists, and historians formed by the artists of the exhibition will create a new narrative of film art through interviews, archival research, and performance.The exhibition will also feature works by the conceptualists Jorge Cassano and Hajo Henrikjärvi, the director of the modernist museum in Venice, and a selection of works by the late Danish director Kjet", "The next Biennial should be held in 2024. MAA will also be reopening with the exhibition of a new group show, “Mid-Century Modern: The Art of Art” on November 24, 2019. \"I am thrilled to reopen with a new group show focused on the art of the 1970s and 1980s, and the exhibition of a new exhibition of work by Josef K. van der Rohe on February 18 and 26, 2020,” said MAA director Christian Brecher.The group show, which will focus on a group of artists who were influenced by the avant-gardes in the late 1940s and 1950s, will be organized in a collaborative fashion. In order to create an immersive environment for the audience, the artists will have to work together in different ways.“The exhibition ‘Late-Twenty-First Century: Art in the Age of Computerization’” will be curated by Maxim Orlando and will be led by artist and filmmaker Rachida Akram. The show, which will be organized on the theme of the twenty-first century, will be curated by and will be presented by Max Kammerer and will be accompanied by the exhibition “Mid-Century", "The next Biennial should be held in 2020.  The decision was made after discussions with the Paris-based student and the collection's director, Guy Remedios, who is also president of the Paris-based institution. The new date, which is in alignment with the opening of the exhibition “Agnès-Lyonnais: Images of Paris” next month, was chosen after a thorough analysis of the biennial’s development and trajectory, the exhibition’s five-year run, and the exhibition’s growing audience. “I’m very excited for the first exhibition in the new venue, a French institution that has been selected by the men and women of the collection and whose members have been invited to participate in the event for the last twenty years,” said Remedios. Remedios added that the exhibition is also an opportunity to participate in a new way of thinking about the collection and its art and to know our future with the collection. Along with presenting works on the collection’s collection, the exhibition will also include a selection of acquisitions made by the collector and will include a discussion with artist Elissa Morin, the director of the Women’s Museum in", "The next Biennial should be in early 2021, and the first in March 2022. The location and the period of the exhibition will be the same as that of the current exhibition, which features works by twenty-six artists from twenty-six countries. For the next edition, titled Art and Architecture, the exhibition will be located in the same building, and the show will be curated by Sophie van de Wijngaard, the curator of contemporary art for Contemporary Art Dubai.Sylvie Brouwers, director of the Biennial for Contemporary Art and the Art of the Arts, said: “The next edition of the Biennial will be the most ambitious exhibition to date, integrating the most recent and most innovative works from twenty-six countries. Our team of curators and we are very excited by the possibilities of now to introduce new, contemporary art to the UAE and the world.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Caroline Thompson as its next executive director. Thompson comes to the institution from the Metropolitan Museum of Art (MoMA), where she has served as deputy director and chief curator since 2017. She succeeds Gillian McKeith, who retired in March 2019 after fifteen years at the agency,", "The next Biennial should be titled Biennial of Art and Design, which will be held in January 2020. The exhibition will continue with the exhibition of the first exhibition, “The Material Body: Visual Impact” in December 2020. “A wonderful balance of academic and social and cultural relevance,” said the museum’s director, Adam D. Weinberg. “The first exhibition in the series will be an exploration of the relationship between art and physiology by demonstrating the work of Simone Weingarten. The second exhibition will be a workshop on the history of art in the USA, which will present a special project that will be a gathering of artists from a variety of backgrounds. The exhibition will be themed ‘Art for a Better Future’ and will feature work by seventy-seven artists.”The Biennial of American Artists will be held at the private museum in New York from February 3 to March 18, 2020. Its inaugural event, “Away from the Camera: Biennial of American Artists” (March 23–March 27), will examine the American visual arts through the lens of filmmaker Charles Brown. The exhibit will feature twenty-three works by forty-four artists, including Charles Atkins, Michael C", "The next Biennial should begin in 2020 and conclude in 2022.  The first exhibition was titled The Event Horizon, 2016, and was curated by Luca Paolini. The second exhibition, entitled The Unseen, 2013, and curated by Zoe Nadler, was staged at the American University in Cairo. The third exhibition, entitled Stage Design, 2017, was organized by Daniel Amenil and is a retrospective of works by artists such as Marc-Andre Ellmann, Nina Major, Rory Mulligan, Alessandro Cattelan, and Liu Xiaoxiao. The fourth exhibition, titled Reflections on Space, 2018, was organized by Angela Hsu and is comprised of works scattered across eleven spaces in the Guggenheim in a project conceived by artist and activist Sara Ziff. The fifth exhibition, titled Alessandro Cattelan: Selected Art, 2019, was organized by the artist and writer Laurie Anderson and is curated by Cate Blondell. The sixth exhibition, titled The Living Room, 2018, was curated by Andrea Giunta, and is currently on view until October 28.The seventh", "The next Biennial should take place in 2021. Razan Duray, chair of the museum’s committee for the 2020 edition, told the Art Newspaper that the museum was hopeful that the first exhibition would open in 2020. The museum has also committed to releasing an open-air sculpture series inspired by the works of the late Tunisian artist Walid Raad, as well as the work of the artist’s sister, as part of a wider push to engage with the artist’s work, and has announced an open-air museum inside the MCA.The Tunisian artist Larissa El Saadraad was chosen as the winner of the 2020 prize. El Saadraad, who is known for her influential installations, including the opening of the MCA in 2006, will receive the prize at a ceremony at the MCA in January.\n\n\nThe Solomon R. Guggenheim Museum in New York has awarded the Whitney Museum of American Art (MoA) its 2020 Kenneth Pollack Award. The $50,000 award is a four-year award that recognizes a leader in the field of American art who has made significant contributions to the visual arts. The award is one of around $50,000 given to the", "The next Biennial should be held in the spring of 2020. “The full breadth and depth of the exhibition program of the greatest contemporary art, with a special focus on the new and emerging artists, has never been more important to us,” said Michael Kuk, chair of the board of trustees and director of the organization. “This year’s Biennial is a spectacular example of how art can be utilized to address complex and pressing issues in the contemporary world in ways that are relatable to the museum’s audiences, and that will delight and inspire our visitors.”The biennial’s inaugural exhibition was “The Hand in the Mirror: Art in Motion” (2019–20). The exhibition—which featured work by seventy artists spanning from the late 1960s through the early 2000s—was followed by “Away from the Mirror: A Classic Biennial” (2017–18), “The Art of Walking: Art in Motion” (2017), “Fashion and the Body” (2017), and “The Car that Changed the World: Fashion and the Body” (2017).\n\n\nThe National Endowment for the Arts (NEA) is offering", "The next Biennial should be in 2020. · Kolkata Biennials was established in 1962 by the Kolkata–based artist Hiroshima Sadao. Since the institution is known for organizing exhibitions that are free to the public, it created the International Biennials in 2013. Since its inception, the Kolkata biennials have participated in artistic and cultural events including the 2005 Venice Biennale and the 2010 Shanghai Art Biennale. In 2012, the Kolkata biennials were chosen as the theme of the 2014 edition of the Venice Architecture Biennale. In 2019, the Kolkata biennials won the Dolan Award for their “historic work,” which was presented to the artist at the 2017 Venice Architecture Biennale.\n\n\nThe Los Angeles County Museum of Art (LACMA), which is currently closed because of the Covid-19 pandemic, will reopen on Saturday, March 25, at 10 AM. The reopening, which was originally set for March 24, was delayed when the institution was forced to cancel two works by the late Japanese visual artist Akiko Nakaya. “", "The next Biennial should take place in the autumn of 2022. The $65 million Gulf Cooperation Council (GCC), a United Arab Emirates–led initiative, said that the event “will be about ‘contextual,’ and ‘beauty.” The GCC also said that the exhibition would focus on three themes, “transformational,” “ephemeral, and non-transformational.” In the past, the exhibition has featured works by artists including Chris Levine, Alighiero Modigliani, and Mina M. Piazza.\n\n\nThe Feltrinelli Museum in Florence (FMC) has announced that it is reopening on February 27, 2020 following a $1.2 billion expansion. The refurbishment project, which included the construction of an extensive new exhibition space and the establishment of a new research studio, aims to create a more accessible and inclusive environment for the museum. The renovation project also included the acquisition of 45 acres of land in the Ponti region of Italy, which houses some of the museum’s collections. The FMC’s views of the Ponti valley will be reconstructed in a new exhibition space, which will open to", "The next Biennial should be announced soon.”\n\n\nThe Museum of Contemporary Art (MCA), Los Angeles, has announced that it will remove a statue of Edward Colston, a transgender American painter and sculptor who lived and worked in Los Angeles between 1938 and 1972, from its grounds in the city’s historic Treasure Valley district. The work, titled The Pleasures of Man, was dedicated to a nude woman, whom Colston depicted in his paintings, and was dedicated to depicting women. The work, which is on permanent display in the art center’s Edward Colston History of Art, is an extension of the museum’s ongoing campaign to bring awareness of the legacy of the California native, who is considered one of the most important surviving members of the Trans-Pacific Band of the Sixties.According to the Los Angeles Times, the campaign began in 2014 with the unveiling of a plaque in the city’s downtown street known as Colston Boulevard. The work, which celebrates the work of 19 artists who made their mark on the city and region, was chosen as the theme of the fifteenth edition of the Los Angeles Biennial. The exhibition, titled Los Angeles: The Collection, tapped a wide array of artists", "The next Biennial should be held within six months of the date of this letter. If there is any reason to doubt this, we urge you to consult with our experts.\n\n\nThe exhibition “Logic,” curated by Dorota Nadal, and Nick Milbury, at the 2018 São Paulo Bienal, has announced the opening of a new digital platform that will allow visitors to experience the works of the main artist-in-residence, Red Sun, as well as the first project by newly-renovated artist-in-residence Marlene Diop, currently on view in the exhibition.Diop is collaborating with Artforum writer Bianca Rodríguez Rocha, who will be the first artist to address the new platform, “Logic,” in an exhibition that will run in a random order from January 3, 2020 to November 27, 2020. “Logic’s mission is to present a new approach to art, a new point of view, to play with the boundaries of what is possible,” said Bianca. “The first piece of the show is a show of the works of Red Sun,", "The next Biennial should focus on British sculpture since it is considered the 'gold standard'. Indeed, the only other British exhibition that has ever been staged at the museum was the opening of the museum’s new collection, “Parisho‐Bueno: The Modern Life of a Dead Man,” which closed last May. The biennial, which was curated by sculptor James Turrell, is renowned for its deep, intimate paintings, which address issues such as mortality and the afterlife. The themes of the exhibition, which were inspired by a painting he saw while visiting a secluded island in the Bay of Bengal, are often inspired by sadness and melancholy, as well as by the role of art in providing a platform for artists and writers to speak with one another. Turrell plans to incorporate these themes into the gallery’s upcoming exhibition “Shakespeare’s Sonnet,” which will run from March 22 to March 26, 2020.\n\n\nThe 2015-16 school year will arrive in just over a month and a half, with schools in the United Kingdom that are facing closures due to the coronavirus pandemic, and will begin on March 22. The first phase of the “school year,", "The next Biennial should be held in 2021.\n\n\nThe Walker Art Center (WAC) in Minneapolis has announced that it is moving forward with the construction of the new David Zwirner–designed David Chappell–designed theater, the David Zwirner–designed indoor venue, and the David Zwirner–designed museum. In a statement, the institution says the project will ensure a robust and contemporary collection of contemporary art.“The development of our new David Zwirner and Noma Nuccitelli facilities has been an enduring goal of the museum,” said Brian McInerney, the museum’s director. “This was the decision that best served the WAC’s long-term goals of a state-of-the-art building to integrate David’s work and education. We are pleased to be able to unveil these plans at this critical time in our transformation and strive to build on their success.” In the statement, McInerney called the installation of the David Zwirner–designed building a “watershed” for the city of Minneapolis, which suffered a devastating fire in May 2019. The building will also serve as", "The next Biennial should take place at the Museum of Contemporary Art St. Louis, which has more than 1,600 works on display, in 2021. Rollo will remain involved with the museum as a consultant, and his new role will include developing and simplifying the museum’s digital interface. She will also lead the museum’s cultural affairs committee.“I’ve been delighted to be part of this community for more than three decades, and I’m honored to be able to continue to support the art of this community with my time and talent,” said Rollo. “I’m thrilled to announce I’ll be leaving the museum, and to continue to be a positive force for the arts in the city of Saint Louis with my new role.” \n\n\nThe CNEA, the Cleveland arts center and the Cleveland Museum of Art, are teaming up to make Cleveland’s parks and open areas more accessible to people with disabilities. The initiative will involve providing local, state, and federal governments with digital tools—such as apps, webinars, and websites that can be used by people with disabilities—that can help improve accessibility in Cleveland’s parks", "The next Biennial should be set up in 2020 and will focus on contemporary art and the history of the 'Arab Spring' worldwide. Its inaugural exhibition, “Twenty Years of Islam,” will showcase approximately 100 works from the exhibition. The second Biennial will be held in 2022 and will focus on the twentieth century. The third will be held in twenty-first century and will focus on contemporary art in the Nile Delta region of Egypt. The fourth will be held in 2021 and will focus on modern art in the West Bank and North Africa. The fifth will be at the Port of London in 2021 and will address contemporary art and the Gulf War and the economy. The sixth will be at the Royal Academy of Arts in London in 2022 and will be directed by Jonathan Pryce, director of the Serpentine Galleries in London.The seventh Biennial will be hosted by the Royal Academy of Arts in 2022. The event will be led by the Academy of Arts curator of contemporary art Richard Black and will be co-organized by director of arts and culture, Jonathan Bendavid, chief curator of modern art, and curator of contemporary art, Asif Kapadia. The exhibition will be curated by artist Daria Balshaw and artist Makram Bey, with special", "The next Biennial should be held during the first half of 2020, and the first exhibition should be held between January and March 2021. The institution has also been awarded a $500,000 grant from the Artists Fund, which will support the development of a biennial program for women artists, who comprise the majority of the approximately $6.5 million in prizes awarded this year.The 2019 winner was Leonor Edleson, whose work is located on display in the museum’s Queen Elizabeth Hall, and has been selected for the 2019 Artists Fund Prize. The prize jury comprised Tobias Gernberg, curator of contemporary art at the Museo Nacional de Arte Contemporáneo de Mexico; Bettina Fox, director of the Max Mara Collection and curator of art at the Museo Nacional de Arte Contemporáneo; and Ewan McAllister, director of the Centre for Contemporary Art at the National Gallery of Scotland.\n\n\nThe Centre for Contemporary Art at the National Gallery of Scotland has appointed John Hartigan as its next director. He assumed his new post on January 8 and will assume his responsibilities in January 2021. Hartigan comes", "The next Biennial should focus on thinking beyond the three-dimensional, in-house model, rather than the current exhibition-based model;” the director of the Biennial, Ingrid van der Leijse, said. The 2018 exhibition “overlooked the main themes of the exhibition, and did not reflect, and was not able to reflect the spirit of the exhibition, as well as the diversity of the changing political situation.”Van der Leijse added that the charity will re-examine the exhibition “in order to find a new way forward that is open to the theme of love and peace.”The 13th edition of the Biennial, titled “Polarities,” opened on November 5 and ran until February 13, 2019.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has awarded the American artist and educator Joseph Beuys $10,000 for his work The Magician and the Thief, which is currently on display in the exhibition “The Magician and the Thief: The History of Modern Art” at the Whitney Museum of American Art. The $25,000 prize marked the institution’s eleventh anniversary, and Beuys", "The next Biennial should be in 2021, the organisers said.The exhibition “is about to open a new chapter of its Art exhibition series, for which the Biennial is combining the most important exhibitions of the past twenty years, to create an exhibition which combines the best of contemporary art and modernity for this year’s event,” the show’s inaugural edition, “Art in the Age of Resistance” (2021), was set to open in January.\n\n\nThe British artist and activist Carolee Schneemann, who served as a model for the radical, often energetic, and often nude body art that defined the 1960s feminist and gay rights movements, died on Tuesday at age eighty-one, from cancer.Born in London in 1940, Schneemann studied at the College of Art, Design, and Photography before graduating from the University of Central Lancashire in 1964. In 1967, she moved to New York and began to work with various artists, including Jane Sturt (now in her nineties), and the Stonewall Institute, then known as the Gay and Lesbian Research Centre, which quickly attracted the attention of the National Union of Journalists (NUJ), which joined forces with the British Gay and", "The next Biennial should focus on the conceptual development of the institution, and the design of the exhibition, and its role as a bridge between the contemporary conceptual landscape and a more inclusive Indian art history, and between the contemporary Indian art history and the wider global contemporary art history.”In order to facilitate the exhibition, the museum will create a digital platform called the Biennial Portal on the Biennial Foundation’s website. The portal will host the first exhibition of the new series, “The Drone,” which will be curated by K.K. Ramaswamy, and will host the biennial’s first major retrospective in 2019. The show will be curated by K.K. Ramaswamy, a former curator of contemporary art at the World Congress in Mumbai; M.M. Akbar, a curator and curator at the Indian Museum in New Delhi; and O.M. Farah, a curator and curator at the SIT.In addition to the exhibit, the museum will host a series of events and include a lecture by Ramaswamy and Akbar. “The biennial is a very important step for Biennial Foundation to be able to present new and varied exhibitions in the best", "The next Biennial should be a presentation of new works by internationally renowned artists, in keeping with the theme of the history of the museum, the exhibition will also include a series of discussions, symposia, lectures, demonstrations, and other activities with curators from around the world. “This is an unprecedented global crisis,” said Kristina Ivers, chair of the board of trustees of the Berlin Biennale Foundation. “We are very proud to support this theme, which is also the theme of the exhibition. It is this particular promise of the theme that brings us together to create the Biennale.”Former director of the Art Museum Stuttgart Hans-Jörg Hager, who was named the head of the biennial in 2017, said: “Themes and concepts of the history of the museum are central to the development and the preservation of the Berlin Art Museum (BAM), where I once worked as a curator. The theme of the biennial is to re-create the history of the museum, to re-create the past, and to re-create the future. The theme of the exhibition is ‘bliss.’ It is to have a space for art that is free from", "The next Biennial should take place in the spring of 2021 and will be held at the Kunsthalle Basel in Switzerland. The exhibition will focus on the artist’s work “in the tradition of Polska and Konigsberg.”Artforum Media has acquired the creative and artistic control of the Austrian photographer Heinrich Zundel, who died in 2008 at the age of seventy-six. The eight-by-eight-inch photographs he took of what he called “serious objects” in his studio are now available for purchase by collectors who have private collections.Zundel’s work is a source of inspiration for many contemporary artists, including Johannes Moritz Tripp, Werner Herzog, and Stephan Franck, among others. “In his photograph, Zundel depicts one of the most important and essential aspects of contemporary art today: the object,” wrote Peter de Gruijthuijsen in a review in the November 2003 issue of Artforum. Zundel, who was born in Vienna in 1936, first studied photography at the Academy of Fine Arts in Vienna in 1948. In 1949, he returned to the Academy to study photography at the Leipzig University of Technology (Kunder),", "The next Biennial should be held in 2021.\n\n\nNew York’s Solomon R. Guggenheim Museum (SGM) has welcomed Astrid and Martin Edens to its board of trustees, which includes Joseph and Susan Guggenheim, and has appointed John Wiester as its first director. Guggenheim’s longtime trustee and former board chair, Thomas Jacobs, stepped down last fall following a conflict with a fellow trustee over a $7 million donation made in 2018.  John Wiester will be the new director of the institution.“Daniel Edens and I are thrilled to welcome Astrid and Martin to the SGM board, and proud to have raised so much of their own expertise and talent,” said SGM director James Guggenheim. “They are two of the most gifted and dedicated scholars of their generation, and they embody the most important values of the Guggenheim: curiosity, appreciation, optimism, and passion.”Astrid and Martin Edens are the authors of The Art of Painting: Astrid and Martin Edens, 1945–1966 (Eden & Co., 2019), and The", "The next Biennial should be staged in 2020. \n\nThe new exhibition, “The Dynamics of Ambience,” will be hosted by Arne Glimcher at the Aspen Art Museum in Colorado, the Museum of Modern Art in New York, and the SculptureCenter in Long Island City, New York. Biennial director R.J. Mitzg, who has also curated the upcoming edition of the Venice Biennale, said that the new format will allow the museum to “rethink the exhibition.” “What if we were to present a show of the most extraordinary sculptures in the world?” Mitzg told Artnet News. “What would that show be like? And how would we be able to share that work with our audiences?” He added that the pavilion will be “shorter and more intimate.” The pavilion will also be “more concerned with the assemblage techniques and materials of the past.” Mitzg hopes that the new format will allow the museum “to become a living organism with a daily activity and a life of its own.” The new exhibition will be on view through June 14, 2020.", "The next Biennial should be held in 2020, and the ten-year plan should be revised upward to twenty-five years from twenty-four. “The duration of the exhibition is a reflection of the significant role that art has played in the past twenty-five years,” said Kunstmuseum Berlin director Christian Neuköll, who added: “It is an opportunity to deepen the current exhibition and extend its legacy, and to bring greater range and depth into the exhibition.  The new themes will be inspired by the Biennial October 1988 and its producing team, with a view to turning the exhibition into a Biennial event in 2020. ”The forthcoming exhibition will be organized as follows: The Wunderkammer Art Museum (Wunderkammer, the former Bayerischer Kunstverein) is planning to reopen in November with an exhibition of work by a select group of artists who have been designated as the “Hermes” by a new initiative launched by the German government and the Hermes Foundation, headed by Florian Her­mann, and entitled “The Seven Seas,” a prelude to a show of works by William Kentridge and Hans Ulrich Beck.", "The next Biennial should begin the week of March 23, 2020, at the Grand Palais in Paris and run until April 7, 2020, at the Centre Pompidou in Paris. The thirty-ninth edition of the Biennial will be held at the Pérez Artístico in Madrid in March 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Michelle Sbai as its next executive director. In her new position, Sbai will oversee the organization’s international expansion, including the opening of a new, four-hundred-th-anniversary celebration in 2021, and will assume her post on March 4.“We are delighted that Michelle Sbai has agreed to lead the Museum through its ambitious reopening in 2020, and look forward to welcoming her to the Museum and working with her to advance our mission and the museum’s collection of contemporary art,” said museum director Daniel H. Weiss. Sbai comes to the institution from the Metropolitan Museum of Art, where she most recently served as deputy director of development. She succeeds Elizabeth Anne Anderson, who retired after fifteen years at the helm of MoCA.“It is a tremendous opportunity to welcome to", "The next Biennial should be announced in the next few weeks. For now, you can view the full list of participating artists here. \n\n\nIn an attempt to limit the damage that the coronavirus can do to public health, the City of Washington, DC, announced on Monday that it will phase out the use of plastic shopping bags by the end of the year. Instead of disposing of the waste, which is made from adhesive, vinyl, and rayon, the city will donate the material to local food banks and other organizations that can then place the bags in grocery bags that can be recycled.According to the New York Times, Washington DC collected more than 1,300 plastic shopping bags from retailers and restaurants in the city since the outbreak began in Wuhan Province, China, on December 5 and has spent more than $1 billion trying to contain the coronavirus. For some cities, the expense has been prohibitively expensive. In New York City, Mayor Bill de Blasio announced last month that the city would begin taking bags off city streets by the end of the year, but the program will only be fully phased in for thirty days after New Year’s.“The plastic bags are being used by tens of thousands of people across", "The next Biennial should be held in 2020.\n\n\nThe National Museum of American Art in Washington, DC, is planning a new $150 million expansion to its iconic exhibition space, the National Gallery of Art, with the construction of a new building, which aims to add more than 1,000 works and create a new exhibition space designed by the French architect KPMG. The museum plans to open the new museum on January 26, 2021.When the project is complete, the new museum will boast of more than 1,500 works by fifty artists, including Alexander Calder, Mark di Suvero, and Lisette Lagnado, among others whose work will be presented in a new exhibition format. The expanded museum will also boast of a new theater and public spaces, a design studio, a research library, a digital exhibition space, and a gallery.The National Gallery of Art also announced that it will become the first institution in the United States to include a sculpture garden in its current location, which is in the National Museum of American Art. When the new building is completed, the sculpture garden will occupy an additional 1,500 square feet, as well as an area for public programming and public education. The National Gallery of Art, which is currently housed in the", "The next Biennial should be a research-focused exhibition that will include a selection of works from the collection previously exhibited and curated at the Museum. The exhibition will also include a re-creation of the Museum’s former vaulted ceiling and will host a series of discussions, which won’t directly address the current events but will explore how art and society—and specifically the exhibition—are defined by events, such as protests and conflicts. The next show, “Embarrassment and the Future of Art: Contemporary Art from Latin America,” will open at the Museum in September 2020 and will run until December 21, 2020. Stevenson Gallery, New York: Stevenson Gallery has announced that it will temporarily close its doors to the public in early March. The gallery’s former space in the former Waldorf Astoria building in Manhattan has been closed since March 14 because of the Covid-19 pandemic.Stevenson Gallery will continue to present art throughout the pandemic, but only until March 15, the day it reopened with new programming. Bradley Gallery, New York: Bradley Gallery will continue to display works across its space in the Astoria until March 14, the day it reopened with new programming. ", "The next Biennial should be held at the south end of the city. Among the exhibitions scheduled are “Sons and Daughters” (2019); “Mona Hatoum: Eye of a Stranger” (2019); “Sohrab Mohebbi: All of Me” (2019); and “We Are All Arabs” (2019). The exhibition will also include a special presentation of work by Basel Abbas and Nour El Din at the end of the event, and a presentation of works by the artist Salvador Dalí. The first Art Biennials were held in 1980 at the Uffizi Gallery in Florence, Italy, and in 1994 at the Museo de Arte Contemporáneo C.A.A. in Madrid. The inaugural event was held in London in 2004.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is attempting to restart negotiations with the families of several missing artworks after it closed for a second consecutive year due to concerns surrounding the pandemic. Among the works that will be on display in the institution’s newly created Gallery of Modern Art, which opened in the city in 1976, are The Bell", "The next Biennial should take place in 2020 and the following two years, for a total of six years. The first, a retrospective of the biennial, was staged at the Rijksmuseum in Amsterdam in 2021 and was on view until March 24, 2020. The following year, the show opened at the MoMA in New York and the Biennial Museum in San Francisco. The new dates for the Biennial and the Sydney Museum of Art were not announced.\n\n\nThe London-based nonprofit Art Fund announced today that it will provide $1 million to help artists and small to midsize galleries worldwide during the Covid-19 pandemic. The funds will go to help them prepare for reopening and for the ensuing uncertainty, including how long they can keep artists on loan and how they will pay their bills.Over the course of the crisis, the Tate, the London museum, and the Royal Academy of Arts (RA) in London have announced that they are preparing to reopen, but many smaller arts and cultural spaces are not yet reopening. Some are preparing to close entirely. According to The Guardian, the Royal Shakespeare Company in London is suspending production, and the Royal Shakespeare Company at Stratford-on-Avon is", "The next Biennial should be held in 2020. The event would then begin a series of exhibitions, concerts, and other events that would culminate in the exhibition of the work of the artist in the exhibition-format, with a few selected works that had not yet been exhibited, in December 2020. Each year, the work will go on view concurrently, at the institution.The Biennials have been staged at various locations in Milan, including the Museo CIMAM and the Museo di Venezia, and recently were given a new location at the Palazzo d'Italia, formerly the Hotel de Corse.\n\n\nA group of artists, designers, writers, and other cultural workers in Bangladesh who were protesting the country’s alleged human rights violations by the government are petitioning the United Nations to launch an international inquiry into their treatment by the authorities. The signatories of a joint statement that was published in the New York Times on June 7 claim that the authorities “knew or should have known that there was a big problem, a serious problem, with the conditions for workers, about to set in motion,” a “severe situation.”“We call on the government to do more to protect the basic", "The next Biennial should be presented by the Nairobi–born, London–based artist Lia Gershon. A selected group of artists will collaborate with Gershon in a show curated by the New York–based artist, curator, and educator Tarek Atoui, who has organized numerous exhibitions in the United States, Europe, and Australia.The exhibition will include new works by the artist, and will be organized around the themes of self-love, the body, and the body parts. The contemporary artist will also present an unusual new work depicting the artist’s parents, who are performing a role reversal of sorts. In the piece, which is part of a series called “New Genesis,” the artist depicts his father, a philosopher, and mother, who are philosophizing about their relationship with God, and how their relationship with God has influenced their own lives. Gershon’s work will also be featured in the 2019 show “MELANIE: LIFE, ART, and LIFE AFTER ELNA.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Kate Poznanski as its next director. Poznanski comes to the institution from the Metropolitan Museum of Art,", "The next Biennial should take place in the second half of the decade and will aim to redress the balance of power between the Russian and European peoples by organizing a public exhibition featuring the work of a new selection of twenty-six works by artists and thinkers. The first piece, a monumental reconstruction of the ancient city of Kazan, was organized by the same team as the exhibition “Art” in 2020.\n\n\nThe Italian studio Wunderhouser, whose practice explores the relationship between modernity and the environment, has announced its representation of the artist-in-residence, the philosopher-poet Paulo Siqueiros. Hailing from the island of Lampedusa, in the Italian seas, the twenty-six-year-old Siqueiros presents an open-ended, often paradoxical, aesthetic practice. His works range from the earthy and intimate to the abstract and monumental. “As a painter I always try to create a work where the lines and forms of the canvas are as open as possible,” Siqueiros said in a statement on the artist-in-residence’s forthcoming exhibition at the Italian pavilion at the Venice Biennale in March. “In my work,", "The next Biennial should take place in the spring of 2021. The full list of participating artists is as follows:Jean Paul Sartre’s The City and the City of the Dead (1948)Gillian Wearing’s Suspended Life” (1951)Alexis Ćwasecka’s Paintings from the Jewish Museum (1952)Solzhenitsyn: Auschwitz’s Treblinka (1952)Adolf Stepanov’s Wart of the Nazi’s Body (1953)Nils Stærk’s The Swedish Theater (1953)Peter Molyneus’s The Twelve-Glass Elevator (1955)Sylvia Plath’s The Slumber Party (1960)Sarah Bernhardt’s The Dreamer in the Dreamhouse (1960)Lillian Graham’s The Dreamer in the Dreamhouse (1960)Peter Levine’s Wake Me Up at 6 AM (1960)Kathrin Langenbühler’s Dreaming of a Red Sun (1961)Kathrin Langenbü", "The next Biennial should be held at a location chosen by the mayor of the city of Los Angeles, who has expressed interest in hosting an exhibition centered on the city’s Latino communities. The 2020 event would be hosted by the Museum of Contemporary Art (MoCA), which will vacate its current space in the building in the fall.The move comes amid the city’s ongoing fight over what will replace the old Angelenos’ shopping district, dubbed the Mission, and surrounding neighborhoods, including West Hollywood and Westwood, which are home to a large community of artists and activists. The battle lines have yet to be drawn, but activists are predicting a bitterly divisive outcome.Among the organizations opposed to the plan are the Los Angeles–based nonprofit American Civil Liberties Union (ACLU), which represents artists, artists’ representatives from the area, the local Urban Institute and the Los Angeles County Museum of Art (LACMA), and the city of Los Angeles—the mayor hopes to break ground this summer on a $1.6 billion overhaul of the city’s transportation system, a plan that critics say will exacerbate traffic and homelessness issues and is being pushed through with little public input.Calling the plan “arbitrary, capricious,", "The next Biennial should focus on “the practice of science.” The organizers will also introduce a new, two-day workshop focusing on “Science and Society in Transition.”\n\n\nThe Tazreen Museum of Art in Tehran has been awarded a $65 million grant from the Royal Swedish Academy of Arts (Skärkischer Kunstverein). The institution, which was founded in 1974 by the Tazreen family, has received the grant for its efforts to integrate art and design in its future exhibits. According to the museum, the support is a milestone for the Tazreen’s history and reveals their commitment to the museum as an international cultural hub.The academy awarded the organization an additional $75 million for its efforts in supporting the museum’s expansion and renovation plans. Since the foundation’s founding, the museum has expanded its collection by more than 300 works, added more than 1,500 new works, and organized more than five hundred exhibitions and events. The new Tazreen center, pictured above, is scheduled to open in 2022.\n\n\nThe Harlem Renaissance Society (HRS), the New York–based nonprofit founded in 2012 by artists to advance the African diaspora in New York City", "The next Biennial should take place in the spring of 2021.\n\n\nThe Pérez Art Museum Miami (PAMM) has received a gift of forty-two works by five artists\u0097Abraham Lincoln, Mark di Suvero, John James, and Erskine Childers\u0097from the Diamond Head Foundation in Los Angeles. The seventy-five-foot-by-eight-foot paintingworks, which were donated by the Andrew W. Mellon Family Foundation and the Andrew W. Mellon/Hirshhorn Museum, are available to the public for the first time.PAMM director and CEO Mary O. Bruce said: “These works are miraculous and the gift of these works is so extraordinary. We are thrilled to share them with the community. This gift will inspire and excite, provide a rare window into the mind of an artist, and bring the Pérez Art Museum Miami to life once more.”The works are currently on display in the museum’s exhibition “Art of Life” (2019–20), which was curated by artist and philanthropist Peter W. Kunhardt, who also donated twenty-nine works. The museum recently received a major gift from the W. L.", "The next Biennial should be held at the newly renovated Biennial House in London in 2021, and the first exhibition should open in 2022. The biennial was founded by the Dutch-born architect Bertil Boecker in 1989 to extend the reach of contemporary design to the widest possible audience. The exhibition, which staged more than twenty exhibitions and included the largest public installation of modern-day art, will be held at the museum until 2021 and will be followed by a biennial of works by contemporary designers.Inaugurating the exhibition will be a retrospective of the work of the same year as the Biennial House, which will be joined by works by artists such as David Hockney, John Graham, and Richard Anuszkiewicz. The exhibition will feature work by a selection of contemporary designers whose work is not currently on view, and will run concurrently with the Biennial House. The show will also feature work that has never been shown in the United Kingdom.In a bid to diversify the exhibition, twelve works by thirty-four artists will be presented by a select group of curators in conjunction with the opening of the exhibition. More details about the upcoming show, which will take place in the spring of 2021, and the exhibition are expected to", "The next Biennial should begin in 2020 and conclude in 2021. The first edition, Walk and Talk, opened in 2017 and was held in 2017. The second edition, The State of Light, opened in 2019 and was held in 2018. \n\nThe Dubai Art Festival is expanding the event to three additional cities: Sharjah, the United Arab Emirates, and Almayyad. The fourth edition, Art Dubai, will take place in the UAE from March 16 to March 19 and will convene in Alser AlKhalifa in Alsina from March 16 to March 19.The expansion of the event coincides with Art Dubai’s 75th anniversary, which will mark its first anniversary in 2020. Dubbed Dubai Museum City, Art Dubai is one of the largest art fairs in the world. It was founded by Saul El Samerraei, Hassan AlFalihi, Abdullah ElSamerraei, and Ahmad AlKhalifa, and was launched by former Dubai governor and art collector Hamdan Musa. Dubai Museum City is currently undergoing a $15 million expansion, which will make the fair more accessible to the public. Its inaugural edition, held at", "The next Biennial should take place at the Southbank Centre in London from September 9 to September 14. The first exhibition will showcase the work of Asia-based artists in September 2020. The 2019 edition of the event saw thirty-eight artists from twenty-five countries participate, including Chinese artists, Indonesian artists, and Pakistani artists.\n\n\nThe contemporary art center Sohn Gallery in New York City has been sold to a Chinese collector for $2.5 million. The news comes two months after the institution announced it would part ways with the Chinese-American artist Huang Jiah, who was featured in the exhibition “The New Art of China.” The deal is believed to be the largest ever for the artist’s art.The sale of the longtime Sohn collaborator’s work and the upcoming seventy-fifth edition of the Sohn Galerie exhibition, which is being organized by the Los Angeles–based developer Artaktion, is also significant for the artist’s descendants. Although the sale is not expected to be completed until late spring, the eighty-six-year-old Huang Jiah’s descendants are confident that its completion will mark the end of an era.“This is a real moment for my lineage and", "The next Biennial should take place in New Delhi in December 2020. The exhibition will also include a selection of works by the artists mentioned above.\n\n\nThe Pérez Art Museum in Madrid has appointed Miriam Hirsch, who has served as its director since 2015, as its new general director. Hirsch comes to the institution from the Architecture Museum in New York, where she has been the director of planning and acquisitions since 2010, and will assume her new responsibilities on January 6, 2021.“We are thrilled to welcome Miriam to the Pérez,” said Pérez director Ana Maria Almeida. “She has been instrumental in shaping the Pérez into one of the most important centers of modern art in Europe, and has been instrumental in bringing together many of the greatest artists of the twentieth century—including Josef Alberts, Salaizi, and Nicky DeSalvo. It was her vision and great energy that made the Pérez possible, and we are grateful for her tremendous contributions to this great institution.”Esther BOBEL, Pérez’s director and CEO, added: “We are delighted to be able to welcome Miriam to the", "The next Biennial should be on December 13–December 16 and will serve as a platform for artists to collaborate in a collaborative way. Each participating artist will receive $10,000; the winner will receive $5,000. The biennial will focus on the history of photography in the Philippines and will be organized as follows: From the collection of Nogen Weerasuriya. From the collection of Ano Ima-Karaka.\n\n\nRappaport Art Center in Brooklyn, New York, has hired Jonathan B. Brown as its new senior director of visual art. Brown currently serves as the interim director of the NYC-based nonprofit Artabasis. He succeeds James J. Patterson, who retired in May after a decade at the center.“In an age of polarized politics, racial unrest, and economic uncertainty, the landscape for visual art is shifting, and Jonathan is uniquely qualified to help move it forward,” said Michael J. Feuerstein, the center’s founding director and CEO. “We are thrilled that he will be a valuable addition to our growing team as we continue to work with world-class artists while ensuring the organization’s long-term sustainability.”Brown", "The next Biennial should be held in 2021. The other three biennials will be in 2022, 2023 and 2028. Inaugurating the venue is a special exhibition about the life and death of Diego Rivera, the famed Puerto Rican revolutionary who led the Spanish government to cede Puerto Rico to Spain in 1898. The exhibition will run concurrently with the biennial of artists. [UPDATE: March 23, 11:45 AM] The opening and closing ceremonies for the upcoming edition of the Biennale Los Angeles will be held at the newly renovated Centro de Cultura Artes, which was completed in 1991 and was completed in 2012. The thirty-second edition of the Biennale New York will take place at the Marriott Marquis in June, and the third edition of the Biennale Paris will be held in December. The full list of participating artists is as follows:Arts Director: Art of the PartyOrganization: New York•Exhibition: The Boy With the Blue Porcupine Heart and the Yellow and White Porcupine Heart, 1976, New York•Organization: New York•Organization: New York•Organization: New York•Organization: New York•Organization: New", "The next Biennial should be staged in November 2021.\n\n\nArts Fund, the London arts charity, has launched the Arts for London 2020, a new initiative that will provide funding for creative projects and arts education across the capital. Launched by arts patron George Miller, the director of Tate Britain, and director of Tate Liverpool Jack Tracey, the initiative will aim to generate both financial and artistic benefits for London’s arts and cultural sector.The initiative was founded by Miller and Tracey following the quarter-finalists at the 2020 São Paulo Triennale, and will provide the artists and creatives who were selected as the finalists with a total of $2,500. The next edition of the São Paulo Triennale will take place in the United Kingdom from September 25 to September 28, 2020. Since the initiative was launched in July 2019, it has awarded funding to seventy-five artists and up to $2.5 million have been given grants. “We know that the arts are at the core of all that makes our city special, and our city as a whole,” said Miller. “The Arts for London 2020 is a way to help support and inspire London’s arts in the", "The next Biennial should take place on the campus of the University of Oxford in the month of December. The next exhibition should have a theme of 'Advancements in Technology and Society, 1912–1949,” and will focus on the impact of modern science and technology on society. The exhibition will take place in the former National Gallery, which has been undergoing a £10 million expansion, and will be open to the public from January 26 to February 28, 2020. The institution has also revealed that it is working with architects around the world to create new spaces that will be able to house the exhibits. The first phase of the project, which will be led by the UK–based architecture studio TBWA, will include the redesign of the Academy-Conference, a meeting and reception space that will enhance the Oriel College, a contemporary art school in the city.The project will also involve the creation of a new public courtyard in the College of Fashion, creating an exhibition space for the exhibition, which will be housed in a former textile factory, in the city, and will involve the installation of more than 300 panels, sculptures, installation and installations, and related activities and will be curated by the Baltimore-born, New York–based curator Jane Pan", "The next Biennial should be held sometime in the 2020s.\n\n\nGerman artist Martin Buber, a pioneer of the late Kunstprogramme and the Frankfurt School, has died at the age of eighty-nine. He was one of four artists to be included in the exhibition “The Berlin Art Show: 1937–1945” staged at the Hammer Museum in Los Angeles and will be the first to receive the award.“Martin Buber is a living master of the art of the artist,” said Edward Mering, chair of the biennial’s board of trustees. “His work is advanced by a tradition of critical and fruitful experimentation, an unswerving commitment to the originality of the art available.”The four-hundred-piece exhibition, which debuted at the Hammer Museum in May 1947, featured work by artists such as Rintoul, Gershom Ronev, and Ferrer, among others that were active in the ’80s but first reached the United States in the ’70s. The show, which was held in conjunction with a Berlin Art Week, the Museum Freiheitstag, and Berlin Art Week, was the first to feature work by artists who had not", "The next Biennial should be held in February 2021, and a second in May 2022. The 2019 event, titled 'Art, Politics and Theory: The Fall of the Berlin Wall', was curated by Kai Nocita, the biennial’s artistic director; Günther Fiegl, the director of the Schloss Museum; and Sophie Jacob and Herbert Pfeifer.\n\n\nThe Institute for Advanced Study in Contemporary Art (IASA)’s Renzo Piano, who has served as a director of the museum since 2007, has died at age seventy-eight. The artist, whose physically imposing yet endlessly adaptable work unfolds images and sounds simultaneously from the various senses, has been called the world’s “God of sound.” Born in Vienna in 1936, Piano began his career in the studio as an electrician before moving to Paris in the 1950s and founding the IASA in 1958. The institution, which operates at a loss of space in a former military barracks on rue Saint-Denis, has hosted an extensive collection of the artist’s works and is currently working to organize a retrospective of the artist’s work at the museum in 2020.In 1973, the institute opened a", "The next Biennial should be the first in four years. The theme of this five-year cycle will be “Emergence, Change, and Change Management.” The theme of the 2020 Biennial is the theme of the next five years: “The future is here, and we are all here,” said Anna-Marie O'Neill. ------\n\nThe National Museum of Fine Arts (NMA), in Washington, DC, has appointed Monica S. Van de Putte as its next director. Born and raised in New York, Van de Putte is currently the founding director of the Southeast Asian Studies Center (SAWC) at the NMA. Prior to joining the NMA in 2001, she served as director of the Asian Studies Museum at the Art Institute of Chicago. Van de Putte’s first major appointment was as director of the Asian Studies Collection, which opened in 2001, and she has served as director of the museum since. Van de Putte’s announcement follows the announcement of the fifty-ninth edition of the Asian Art Museum and the seventy-ninth edition of the Asian Studies Festival. The forty-third edition of the Asian Studies Hall of Fame will showcase the", "The next Biennial should take place in the winter of 2021–2022, and should include a selection of works by '40s and '50s American architects, who are represented by the Biennial Museum.The main exhibition space will be moved to the Westin, which has space for 150,000 visitors per year, and will host a number of experiential programming in addition to its main exhibition, including the exhibition of the work of the artist Gary Garrels, which will be followed by a retrospective of the work of the same name, which will be supported by the Foundation for Contemporary Art, and an exhibition of the work of the late American architect Frederic-François Auger. The new venue will also boast a new public courtyard, a public plaza, and an outdoor plaza.The new venue’s architects are the Los Angeles–based firm Gensler, which created the marble and stone facade around the museum; and the New York–based firm Bechtel, which designed the building’s facade, interior, and facade, along with the hall and gallery, to resemble the building’s original exterior. The new structure will boast an exterior courtyard, a terrace and garden, and a new exhibition space in", "The next Biennial should take place in 2020.  The next Museum Research Initiative should take place in 2021.  The next Shanghai Biennial should be held in 2022.  The next Dusseldorf Biennial should be held in 2023.  The next Berlin Biennial should be held in 2026.  The next Paris Biennial should be held in 2028. The next Venice Biennale should be held in 2029. The next New York City Biennial should be held in 2032, and the next New Orleans Biennial in 2033.\n\n\nThe National Gallery of Scotland has announced that a new sixteen-acre building will be constructed to house the collection of the National Museum of Scotland, which is currently undergoing a $200 million expansion. The new museum will be built on the grounds of the National Museum of Scotland, in Edinburgh, and will be inaugurated by the opening of the museum’s 50th anniversary exhibition “The Future is Now.”The building will include a new visitor entrance, an auditorium, a gallery, and a reception space that will be designed by the National Galleries of Scotland and will be inaugurated by a performance by Kate Tempest, “The", "The next Biennial should open in 2021, and the museum’s collection will be expanded with new works by artists from the Palazzo Nazionale di Piero Manzoni. The Palazzo Nazionale di Piero is currently undergoing a major renovation, and the museum’s staff will be collaborating with two new digital initiatives: the museum’s online catalogue and the exhibition “NADA: The New Art of Recycling.”\n\n\nThe London-based charity Art Aid is launching a new initiative that will provide financial support and resources to artists working in the fields of design, performance, film, visual art, and literature. The program will initially focus on five categories of support: aesthetic, artistic, literary, and financial. It will then expand to ten additional categories, including health and wellbeing, education and training, and community and sustainability. The launch of the project comes amid growing concern over the economic crisis and the health risks posed by the coronavirus. According to the Art Newspaper, six in ten people are now living with Covid-19 and three quarters of businesses and institutions are shutting down. The World Health Organization (WHO) estimates that there are around one and a half million people infected and that the", "The next Biennial should have been held in 2020, but was pushed back by the pandemic. The exhibition will now be held in the Philippines in 2022.The exhibition, titled Future Present, will feature works from fifty-seven artists, including Bongriez, C. L. Na, Bittar, C. F. Cui, Dallison, H.A.R.S., HELA, and Akiko Nakamura.“I look forward to hosting the artists who have made such magnificent contributions to humanity and to expanding the exhibition with new works,” said Mina Tingnan, president of the biennial. The opening of the exhibition coincides with a campaign to raise awareness of the impact of the coronavirus and climate change. Geert Wilder, the director of the Biennale Los Angeles, said: “We have been working with the Los Angeles County Museum of Art (LACMA) to highlight the positive impact of climate change on creativity and the Arts. Climate change is already having an impact on the production, distribution, and performance of art. LACMA has created a new program that will bring artists, cultural producers, and", "The next Biennial should explore the role of performance in the filling of institutional voids and the promotion of work by women. It should also consider how art and philosophy intersect in the lives and work of many women artists. And it should offer advice on how to present work. The next edition of the biennial will take place in 2021.\n\n\nAmerican photographer and video artist Claudia Alba’s work is being repurposed into an upcoming exhibition at the Museum of Modern Art (MoMA) in New York. The show, “Claudia Alba: The Naked Sun,” will be presented in the fall of 2020. “Claudia Alba: The Naked Sun’s' collection of thirty two photographs, which are part of a series that began in 1978, is a snapshot in time,” said curator Jonathan Pershing. “It reexamines photography’s relationship to the sun, which has been a central and central figure in Claudia Alba’s work. The work also examines the relationship between light and the human eye, and how the physical body responds to light.”Previously titled, “The Sun, the Dog, and the Loft,” the exhibition", "The next Biennial should bring together artists from around the world and will include the first ever collaborative exhibitions in the Black Sea region. The exhibition will combine art and history, and will feature new works by artists from Belarus, Georgia, Ukraine, Russia, Belarus, Kazakhstan, and Moldova.“It is a very exciting time to be able to open a new Black Sea region,” said Massa, who was appointed as the director of the Biennial by President Alexander Lukashenko. “It should be the place where the artistic life of the Black Sea region is renewed, where creative and cultural exchanges can take place and where the public can see the works of artists from different Black Sea regions.”Biennial director Yuriy Galybnik, who has worked in the region for more than twenty years, said: “In the past, the Black Sea region was neglected, neglected by the West, neglected by the international community, never fully recognized by the State. We are now at a point where the region is finally being considered by the international community. We invite all who admire and respect the artistic and historical achievements of the past twenty-five years to come and witness the next chapter of the life and fighting of the Biennale", "The next Biennial should be held in 2021, and the 2019 iteration should be remembered as “biennial of the past.” In a review in the June 2, 2000 issue of this magazine, James Cuno, then director of the Metropolitan Museum of Art, called the exhibition “a return to form.” That year, the exhibition was marked by the first exhibition of work by Andy Warhol’s “Avant Garde” series, a collection that included artworks by artists such as Frank Gehry, David Hockney, and Frank Gehry’s son, Michael. Michael Warhol presented Warhol’s “Adolf,” 1974, at the exhibition. Michael Warhol and his wife, Anne, are also owners of the upscale art storage company, Sotheby’s, which has locations throughout the world. “The only thing that stops me from giving this a great review is the fact that I am writing it,” Warhol said in a statement. “I hope it is not too long before someone realizes that I took this photograph not as a hobbyist, but as a job. I hope that someone finds it interesting and doesn�", "The next Biennial should be held in 2022. The next edition of the Art Forum will be held in the UK next year. Artforum executive director Hal Foster added: “We are so very proud to contribute to so many outstanding artists, and to be able to showcase their work on our platform. It is our hope that the 2018 event will inspire and challenge new and talented artists, and further cement Biennial as a key pillar in the art world’s history.”  The 2019 edition of the Art Forum will be held in the US, and will be hosted by the San Francisco Museum of Modern Art. The exhibition will include more than 100 commissions by artists in the United States and will be offered in both digital and physical formats.\n\n\nA group of artists and collectors have sued the Art Newspaper over a photograph that it published showing a large crowd of people dancing at the London 2012 festival. The group is suing the British tabloid in an attempt to establish a precedent for defamation lawsuits against journalists, artists, and other prominent figures. The suit, filed in the London High Court on October 28, claims that when reporter Sophie June Anderson took a picture of the event with her mobile phone and wrote about it in a February 2013 issue of the", "The next Biennial should focus on the history of psychology in the West, and should include a presentation of the work of contemporary artists and the writer Tommy Carr. The next will also include an exploration of the relationship between artistic practice and the environment. The third will be a reinterpretation of the work of Baron Paul Cézanne, which is currently on view in the exhibition “The Blue Ribbon: The Art of Sleep,” at the Biennial, The Netherlands, until March 18.The new space will be inaugurated by a presentation of the work of photographer Jack Shainman, who will present a new project to capture the site of the iconic biennial in the city of Rotterdam. The installation will be on view until March 18.Cézanne’s work will be included in the upcoming exhibition “The Blue Ribbon: The Art of Sleep,” which is currently on view at the Biennial from February 26 to March 16, 2020. The work, which was created during the height of the AIDS crisis in 1976, will be included in the exhibition “The Cage: Body and Prescription,” which is currently on view at the Biennial from February 26 to March 12, 2020. The work will", "The next Biennial should be held in 2022.\n\n\nThe French artist and educator Yale Jones has died at age ninety-two at his home in New York City. Born in New Orleans in 1922, Jones started his career as a painter and sculptural works were exhibited at the Museum of Modern Art in New York from the 1940s until his death. After moving to New York to study under Ed Moses at the University of Pennsylvania, he began making his work in the 1980s. He was exhibiting work at the Whitney Museum of American Art (MoMA), New York, Coachella Valley, and the Brooklyn Museum and was commissioned to create a work for the Whitney Museum of American Art in 1989, but his project never began.Sharon Jones and Ed Moses. Photo: Harvard Art Museums. \nHe continued to make work for MoMA through the ’90s, exhibiting work that included his “The Empty House” (1995), an installation that engaged with the artist’s concept of the body, the anthropological across the world and the human condition in a way that was both personal and deeply moving. The work was chosen for the annual exhibition “In Defense of the Body” at the Whitney", "The next Biennial should take place on the island of Saipan, Japan, in 2021. The 2020 edition of the event, titled Art and the Body, spoke of the “immensity of life” and of the “multitudes who are made up of many bodies and whose lives and histories are interrelated.” The program will also include a retrospective of the life and work of American artist Robert Irwin, as well as a compilation of from the biennial’s inaugural edition, “Robert Irwin: The Art of Life.”The theme of the upcoming exhibition will be “Ear, Body, Soul: A Biennial of Art.” The exhibition will take up themes of consciousness, the body, and the soul in the context of a series of three exhibitions. Its first show will be “Ear and Body: A Biennial of Art” and its second will be “Ear and Soul: A Biennial of Soul.” The third exhibition will be a “Spirit and Body Biennial” and will be held in the city of Yokohama, Japan.The five artists who are co-producers of the biennial are Jackie", "The next Biennial should be held in 2019.\n\n\nThe Museum of Contemporary Art (MoCA), Chicago, has appointed Terry  as its new interim director.  Terry joins the institution from the Chicago-based nonprofit Art in the City, a police-focused nonprofit that promotes artists and their work through events and educational initiatives. “Terry is a seasoned curator and scholar who has accomplished more than his share of extraordinary things in his fifteen-year tenure,” said Christopher Boardman, MoCA’s interim director and chief curator. “In showing MoCA’s work at this year’s show, he engaged with the city of Chicago, the state of Illinois, the city’s neighborhoods, and the broader landscape of American art, and I’m confident his curatorial and research skills and enthusiasm will prove successful in bringing us new exhibitions, exhibitions, and other programming that better reflects the very best of the city.”Prior to joining Art in the City, Terry was a curatorial assistant at the Peabody Essex Museum in Salem, Massachusetts. His curatorial projects include “The Last Dance of Chihuly,” a series of performances and performances, staged by the Peab", "The next Biennial should focus on structural changes; on the ways in which artworks and ideas are invested with more urgency and relevance; and on the ways that creativity and reflection are threatened by a divided, atomized, and atomized world, one culture, and one language. We must continue to build on the incredible work of our artists and our institutions, and to create new exchanges between our communities. We must forge new paths, new narratives, and new ways of being. And we must continue to be imaginative and open to new possibilities.”The full list of participating artists is as follows:Friston Contemporary Art Gallery, Stratford, UK, August 18–September 16, 2019.FacebookConceptual Art, Bristol, UK, August 18–September 16, 2019. Ansley Borthwick Gallery, London, August 18–September 16, 2019. Benjamin Anderson Gallery, London, August 18–September 16, 2019. Benjamin Britten Gallery, London, August 18–September 16, 2019. Benjamin C. Johnson Gallery, London, August 18–September 16, 2019. Benjamin D. Jones, London, August 18–September 16, 2019. Bernard King Art Gallery", "The next Biennial should welcome the public in 2020 and will include the first public exhibition of work by artists from Cameroon, South East Asia, and the Caribbean. The curators hope that this new format will help the festival reach an audience that has not yet experienced the wealth of art on display in the gallery.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has appointed Sarah Chaudhari as the inaugural director of the Metropolitan Museum of Art (MoMA). She will be responsible for managing the institution as it prepares to reopen to the public in 2021.“Sarah has cultivated a thoughtful, visionary, and forward-thinking approach to museum-building and has demonstrated a deep understanding of the role of the museum as an incubator of new ideas and innovative approaches,” said Peter Scharf, president and CEO of the Met. “In the same way that the museum nurtures new ideas and new ways of approaching art, she demonstrates a deep understanding and commitment to the Met’s collection and archiving. In an age where the museum has often been at the center of an important public conversation, and when the museum is arguably more important than ever, I’m confident she will bring extraordinary breadth and depth to MoMA’", "The next Biennial should be held in the spring of 2020.”The Los Angeles County Museum of Art (LACMA) director, Joanne Chesimard, also expressed her belief that the next edition of the Seven Seas, the annual international art festival, would be successful. “I think that the future of the event is at least as good as it was last year,” she said. “I’m sure that we will be able to help it along and take it forward in other ways, but we will not be responsible for changing the future of the event.”Last year, the festival—which is hosted by the Los Angeles–based artist Sarah Polley—featured work by fifty-six artists.\n\n\n\n\n\nSarah Polley, 'Every Breath I Take,” 2018. Courtesy of the artist and the LA County Museum of Art. \n       \n\n\n\n\n\n\nThe Museum of Modern Art (MoMA) in New York is facing a lawsuit from an Arizona homeowner who claims it failed to protect its valuable collection of early twentieth-century works by Pablo Picasso, Henri Matisse, Claude Monet, and others by allowing the building to collapse during construction in", "The next Biennial should have taken place in 2020. The event, which will be held in the Stedelijk Museum in Amsterdam, will continue to be organized as planned, but will focus on the city’s downtown area, which has been the subject of a major renovation project since 2015. The event will include two part-time performances, as well as a series of exhibitions and workshops, and will be organized as follows: Saturday, March 9 through Sunday, March 11; Saturday, March 12 through Sunday, March 13. The 2019 edition of the event, which was held at the museum from March 14 to March 16, featured work by thirty-six artists, including Jakob Richter, Andreas Karakas, Ola Bojangles, Enzo Cattelan, Wangechi Mutu, and Ben Mebane. The 2020 edition, which will take place at the Amsterdam Art Foundation (A.A.F.), will take place in the same building as last year’s event, but will instead focus on the city’s waterfront, which has been transformed in the past decade by the Amsterdam-based nonprofit organization Østendijk Project. “The team at A.A.", "The next Biennial should be held in 2020. The full list of participating artists is as follows:Arts Museum LondonArts of London ArtsCenterArts of London (Arts of Life)Belfast Art GalleryArts of Life (BEL)Artists HouseBelfast Art Gallery (BGM)BGM: The BGM GalleryBGM: The BGM DeskBGM: South Bank Baker Street BGM: The BGM StudioBGM: South Bank Bridge BGM: The BGM Retirement HomeBGM: Southbank Arts CentreBGM: Southbank MuseumBGM, Southbank Mansion HouseBGM, Southbank Park BGM, Southbank TheatreBGM, Southbank Theatre BGM, Southbank Winter TheatreBGM, Southbank Winter FilmhouseBGM, Southbank World War One Centenary CelebrationBGM, Southbank, Tate BritainBGM, Southbank, Tate ModernBGM, The Black BoxBGM, The Black SeaBGM, The Black Sea Art MuseumBGM, The Black Sea, The Black SphereBGM, The Black Sphere, The Black Sphere Art MuseumBGM, The Black Sphere, The Black Sphere Art Museum, The Black Sphere Art Museum, The Black Sphere Art Museum, The", "The next Biennial should be held at any of the following locations:Art Museum, New YorkCityCentral Park, New YorkCityThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Gallery of Ontario, OntarioThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago, ChicagoThe Art Institute of Chicago", "The next Biennial should be held in the summer of 2022. The institution will also be renamed   and will be given two new artworks by the late artist and activist Soon Young-sang.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has announced that it will open its new headquarters in the Tisch Museum of Art in Santa Monica, California, sometime in the fall of 2020. The institution’s current campus, located at 1416 Seventh Avenue, opened to the public in the fall of 2021. “It was a very exciting and challenging project to bring our current museum and the Tisch Museum of Art together in the spring of 2021, and it’s been a great collaboration,” said Museum Director Christopher Campbell. “I’ve long admired the Tisch, and am tremendously proud to be an architect and to have helped make it a reality. I’m very excited to see where the new museum will lead the way for future generations of curators and scholars.”A new exhibition, “My Body,” will debut at the museum in October 2020. It will explore the history of women’s bodies, centered on the body, and will be", "The next Biennial should take place at St. Louis’s St. Louis Art Museum (SLAM) in September 2021; the first would have taken place in September 2022. The 2018 iteration of the event featured works by thirty-four artists, including James Alefantis, Mindy Alberts, Marta Bruguera, and Tala Al-Saadi, and was organized by the Public Art Fund.\n\n\nCatherine the Great, who ruled the Russian Empire from 1221 to 1228, was buried in the capital city of the Russian Baltic republics, Kaliningrad, on Thursday, March 18. According to ArtNews, the Russian Cultural Foundation, the region’s official arts museum, the tomb involved a five-hour construction period and involved the excavation of a 1,300-year-old, pre-Innsbruck, copper-alloy construction.The three-ton structure was constructed of thousands of prelapsarian and pre-Romanite stones imported from central and southern Russia. The construction team of twenty-seven men and fifteen women worked around the clock in a vast, underground complex that included a theater, a dance hall, a museum, a library, and a theater. The institution is scheduled", "The next Biennial should be held in the Spring of 2020. “We are thrilled to be able to share the vision for the next Biennial with our international community,” said Anouk. She added that the next edition will aim to “redefine the exhibition’s unique and international, modern and contemporary, perception.”\n\n\nA group of artists and collectors are suing the New York City Department of Cultural Affairs (DCLA) over its failure to respond to the growing public outcry over the destruction of at least four historic black cemeteries in the city. The lawsuits, which were filed in federal court in Manhattan on Monday, April 4, are part of a growing campaign to hold the city’s cultural authorities accountable for cultural preservation.Earlier this week, the artists’ group PEN American Center and a group of other cultural organizations sent a letter to DCLA director Daniel H. Pascual decrying the “incomplete, misleading, and specious statements made by several city officials regarding the state of our cultural heritage in order to advance their own personal interests and those of their city.” The letter also questioned the city’s decision to demolish and redevelop dozens of"]