["The next Biennial should begin this fall and conclude in 2020. “We are thrilled to be opening our new exhibition in London, and look forward to welcoming visitors to explore the remarkable exhibition space of the Swan. The new biennial exhibition is inspired by the themes of visionary art and the power of art,” said Bénédicte de Montlaur, artistic director of the Royal Academy of Arts, London.The inaugural exhibition, “The Minimalist Experience,” is currently on view at the SITE London, London.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed Jennifer Coverdale as its new associate curator of contemporary art. She will be responsible for supporting Laura Owens’s research and curating, and will begin her new position on January 7, 2020. “Laura’s contributions to contemporary art have been a joy to work with and she brings a wealth of knowledge and experience to the MoCA,” said Museum director Andy Berlant. “We are grateful to Laura for her leadership and vision in the field and look forward to her continuing to expand our collection and our curatorial practice.”Prior to joining the museum, Coverdale,", "The next Biennial should be held in 2020, the same year the exhibition will be inaugurated. In an interview with the Art Newspaper, Zoë Quinn, the director of Boston’s Center for Art and Architecture and the jury that selected the fifty-seventh Biennial, said that the exhibition “is a serious proposition.” Quinn added: “It’s not just for the museum, it’s for the city, and it’s a serious proposition that can be executed with the kind of craftsmanship and imagination that Boston’s always had.”\n\n\nThe Metropolitan Museum of Art in New York announced today that its exhibition “Ground Zero: The Bombing of Iraq” will return to the US capital in 2021. Titled “The Bombing of Iraq: The Gulf Wars, and Now, Iraq,” the show will present archival material in conjunction with screenings of the sixth, eighth, and twelfth seasons of The Wire, featuring performances by the likes of Pilar Otero, Ali Riza, and Nina Savitz, as well as the documentary Ain't Them Bodies Saints?, a three-part series, which examines the events", "The next Biennial should take place in 2021.\n\n\nThe Maneater Museum in the City of London will launch an online version of its popular walking tour, which has been offered for free since it was founded in 1974, in 2020. The institution, which has recently been working to make more of its interactive exhibits accessible to the public, was looking to raise $5 million to finish the redesign and expansion of its London outpost, which is currently being renovated by Sarah Lawrence Gallery. However, in a surprise move the museum revealed on Tuesday that it will launch the online view for free, with the caveat that the institution retain the right to charge fees for the right to display artworks.According to the museum, the decision to launch the online version of the tour was made in response to the demand for more information about the Maneater’s galleries. In a statement, the museum said: “We are delighted to announce that we will be launching online soon. We have been working hard to develop the redesigned and expanded online viewing rooms and to launch the online viewing rooms in the coming months. We are very much looking forward to sharing the Maneater with the world and to presenting the full breadth of its galleries and exhibitions in 2020.”Although the tour will not", "The next Biennial should be held in 2020 and will be hosted by the University of St Andrews.  In addition, the Biennial is collaborating with the University of the Arts to create a unique, immersive experience that will be built into the construction of the museum. The exhibition will be organized as a collaborative project between the two institutions and will present work by contemporary artists, including Marián García-Alÿ, Adrián Pérez, and Adrián Pérez-Chávez.The Biennial is also working with the National Galleries of Scotland to create a new conservation home for the Crufts collection. The institution will open an exhibition, “Hear the Crufts,” in the museum in 2021, and will then work with Scottish National Heritage to create a new National Museum of Scotland site for the collection. The new museum will unveil the conceptual design for the new National Gallery of Scotland in 2021.\n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) in Philadelphia is closing its doors to the public, announcing on Thursday that it is voluntarily laying off 80 percent of its staff, citing the “economy and the challenges of managing multiple institutions in a rapidly changing industry.”The Arts Council, which", "The next Biennial should take place in 2020.\n\n\nLinda Lawson will step down as director of the Museum of Contemporary Art (MoCA) in Los Angeles after serving as interim director for nearly two years. She will assume the post for the next twelve months when the institution’s board of trustees appoints a new director. “Linda has been a visionary leader for MoCA, guiding the museum through the challenges and successes of its twenty-fifth year and beyond,” board president Michael Govan said in a statement. “We are grateful for her dedication, leadership, and professionalism, and are confident that she will continue to be a force for good in the city of Los Angeles and the country.”The institution’s board president, Nick Hanauer, said that Lawson “has been instrumental in transforming the Museum of Contemporary Art as we have known it over the past twenty-five years.” “She is the founder and chief executive of the investment firm KKR, and she is one of the world’s most successful business owners,” Hanauer said. “She has built a remarkable career by harnessing the power of art and design, and by turning the Museum of", "The next Biennial should be held in 2021.\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to open a new biennial in 2020, the Los Angeles Times reports. The venue will host the exhibition “New Space: Art and Atmosphere” at the Museum of Contemporary Art (LA), which is currently undergoing a $500 million expansion.The new venue will be built across from the original sculptural home of the Los Angeles–born, French-American painter Jacques-Louis-Xavier Biennale—the space currently houses the exhibition “The Concept of the West,” which was staged at the Italian Biennale in 1967. The new venue will replace the closed exhibition space “Treaties of the Two Senses,” a show that was presented by Jean-Luc Moulène, who curated the exhibition.It will also include an awareness group for people with dementia and a resource center for the homeless. “We are thrilled to open this new chapter with this exciting exhibition,” said architect Adam D. Weinberg, the architect responsible for the renovation of the building that houses the Langham Spa and the Langham Ranch, the private retreats of the", "The next Biennial should take place in the spring of 2021, in the city of Hamburg, Germany; its organizers have said that the event will be organized as a joint project between the institutions of the University of Stuttgart and the University of Hallett. The exhibition will feature around one hundred works by artists from around the world. The first showpiece, a sixteen-foot-wide (3.1-meter) figure of a head, was created by the Italian sculptor Cesare Prada. It is one of the works that made up the Biennale “a history of the future.”The first showpiece, however, was not actually created by Prada but was created by the American artist Ste-Hon Yuen for his first exhibition in Hong Kong. In a show at the Museum of Modern Art in Hong Kong, Yuen created a work that resembled the figure of a bird in the shape of a bullet with a black tip. The sculpture, titled “Be Foregoing the Bullet,” was exhibited at the Kunsthalle Basel and won the Golden Lion at the Venice Biennale in 2003. The 25th edition of the Biennale will be held in December 2021.\n\n\nThe", "The next Biennial should be in 2022. The final version will be hosted at the Museo do Rio de Janeiro and will be guided by a panel made up of the artist-in-residence, Mariana Celant, director of the Museo do Rio; the Brazilian playwright, Roberto Anna; and artist-actress, Marila di Marco. “The project is not only about re-creating a documentary history of Brazil, but also about exploring what makes the country special and unique,” Celant told the Art Newspaper. “This information will allow us to rethink art, to re-create the past, to re-create what it was like to be a child in Brazil.”\n\n\nThe Bechdel Test, a landmark 1993 law requiring that television programs with an average age of fifty-eight display one of the most pointedly feminist messages imaginable, has been ruled unconstitutional by a federal appeals court in New York. The ruling marks the latest victory for artists and cultural workers who were seeking the return of the half-hour sitcom Girls, a show that was created by Lena Dunham and Amy Sherman and stars Lena Dunham, Adam Driver, Adam Driver Jr., Kate Hudson, and Amy Poehler. The", "The next Biennial should be held in the spring of 2021, but the organizers are cagey about when it will open. The official answer is that the project will not be announced until the spring of 2021. Staged at the Museo de Cultura, Madrid, the exhibition will be the first of three in 2021.The first biennial, “El Destino de Barcelona” (Who Destined To Be The First Queen), took place in January 2020. The second, “El Neucoamericano de Barcelona” (Who Created The West), took place in February 2019. The third, “El Pueblo de Cordoba” (Greater Land Of Cordoba), will be staged in February 2021.The three-day event, cofounded by architect Ermolo Cipolletta and sculptor María Berrada, will run from February 14 to February 16. The festival will award $6,500 to the best design in the exhibition and will have the theme The Same City, Different World.\n\n\nThe Museum of the African Diaspora (MoAD) in Atlanta is planning to move forward with construction of a new fifty-story, two-million-square-foot museum", "The next Biennial should take place at the National Museum of Ireland in Dublin in 2020.”The Galleries of Ireland have also welcomed three new members to their board of directors: Benno Delahanty (South Africa), Peter Gleick (New Zealand), and Mark Hutchison (New Zealand).For the 2019–20 season, the institution will stage two exhibitions, “In the Company of Men: Armello and the History of Modern Art” (June 21–June 22) and “Wang Chung: The Art of the Three-Way” (July 3–July 6), and will also host two exhibitions of work by unknown artists, “The Vanity of Man” (July 19–July 21), and “Bénédicte Savoy-Bénédèche” (July 27–July 29).\n\n\nThe National Galleries of Scotland (NGA) announced today that it will cease operations at the National Museum of Scotland (MM) in Edinburgh in 2020, effective immediately. “The decision to end the National Galleries of Scotland and return the museum to the people of Scotland was made on the recommendation of the Royal Commission on the Future of Galleries and the National Archives after a", "The next Biennial should be held in April 2020.“The 2018/2019 season was marked by unprecedented new research, the exciting exhibition program, and the collaborative efforts of artists and curators from all over the world,” said Kate Woerner, chair of the board of trustees of the biennial. “I look forward to continuing to support the biennials and to overseeing the exhibition and exhibition program.”\n\n\nThe Ministry of Culture in Beijing and the China Academy of Art (CA) announced today that, for the first time, they will jointly present an exhibition of works by different Chinese artists at the same time in 2021. The announcement marks the first time that the two institutions will present an exhibition of works by the same artist in Beijing and the capital of China.The announcement came a little over a month after the two institutions announced that they would collaborate on an exhibition of works by Zhang Yilu, Huang Yue, and Zhu Wenqian, which will take up the themes of the exhibition “Zhang Yilu: Early Reversals” and “Huang Yue: Beyond the Early Steps” at the Guangdong Biennale in January 2021. The exhibition will open on March 24 and run", "The next Biennial should also examine the legacy of the Lewis-Bass Gallery and Museum, which opened in 1947 in a former candy factory in a former cotton factory in Quincy, Massachusetts; the Art Institute of Chicago; and the Autry Museum of American Art in Detroit.\n\n\nThe Bessies: The Artist-Operators Who Set the Standard for Modern Dance\n\nThe Bessies—comprising the choreographers, choreographers, choreographers, choreographers, choreographers, choreographers, choreographers, choreographers, choreographers, choreographers, choreographers, choreographers, choreographers, choreographers, choreographers, and choreographers—are worth celebrating as a collective cultural institution. They have shaped the modern art landscape, from the ballroom dance of the 1950s to the multidisciplinary performances and photojournalism of the 1980s, and their influence can be felt in every generation of dancers.Bessie Bostwick, who died in 1967, launched her career as a choreographer in New York in 1947 with the group The Bessies, which merged with the Verve. A year later, she became the first African American woman to choreograph for them, for whom she later became a cofounder. In 1958, she", "The next Biennial should be held in 2022.  The award ceremony will be held at the Museum of Contemporary Art Chicago in October 2022. Pretoria, in the state of Southern Africa, has elected to honor the memory of a late Zambian artist by creating a piece of art that will be exhibited in a biennial exhibition at the Museum of Contemporary Art in Boston in September 2024.The biennial theme for the institution’s inaugural edition was “Self-Collection: Art, Politics, and the Struggle for Civil Rights.” The exhibition will consist of ninety-four works, selected from a large number of sources. The exhibition will also introduce a series of works that will be exhibited in a special exhibition that will be held at the Museum of Contemporary Art, which is currently undergoing a $50 million expansion.“The exhibition will bring together work by a wide range of artists, including Johannes Schwabschaeger, Peter Bogdan, and Lin-Manuel Miranda, among others, to reflect on the themes of the twentieth century and explore new ways to engage with contemporary art,” said Dana Posen, director of the Art Institute of Chicago.\n\n\nThe König-Rothkuhl Museum in Cologne announced", "The next Biennial should take place in 2022, and the programme will be organised as follows:\n\nClosed until March 14, 2020. Closed until March 13, 2019. Closed through March 16, 2019. Closed until March 16, 2019. Closed until March 16, 2019. Closed until March 17, 2019. Closed until March 16, 2019. Closed until March 16, 2019. Closed until March 17, 2019. Closed until March 16, 2019. Closed until March 16, 2019. Closed until March 16, 2019. Closed until March 16, 2019. Closed until March 16, 2019. Closed until March 16, 2019. Closed until March 16, 2019. Closed until March 16, 2019. Closed until March 16, 2019. Closed until March 16, 2019. Closed until March 16, 2019. Closed until March 16, 2019. Closed until March 16, 2019. Closed until March 16, 2019. Closed until March 16, 2019. Closed until March 16, 2019. Closed until March 16, 2019. ", "The next Biennial should be held in 2021, with the announcement of the twenty-third edition to take place in the city in 2022.The design of the exhibition will be inspired by the Kukelbaku Palace, the last remnant of the original Congress of Arts in the capital of the Bashkir Empire of Uzbekistan, where Togli and Kuzmik were born in the late 1940s.\n\n\nThe Diadem Foundation and the City of London Corporation (Cochrane) have announced that Richard Mayhew, the British artist best known for his wide-ranging, multi-million-dollar sculpture projects, will receive an exhibition-style commission for his first solo exhibition at the institution in more than forty years. The show will take over the center’s existing space on the first floor of the London building, which is currently being renovated by the London-based firm WETA. The twenty-six-foot-tall, twenty-two-foot-wide installation, called “The Diadem,” will explore the historical legacy of the Diadem, the third-class residence in London’s Green Park, and will feature works by more than seventy artists, including Hélio Césarotti, Jai Ha", "The next Biennial should be held in 2020, and even then only if all the necessary measures are taken.”It will be hosted in New Delhi. The exhibition will also feature the work of KK Basu, a Malayali artist who is known for his multilayered paintings that embody polychromatic textures and textures of the world, and will feature the work of KPMG artists and critics.\n\n\nThe British artist and curator Sarah Lucas has been named the 2020 winner of the £50,000 International Art Writers’ Association (IWA) award. The prize is one of the most prestigious awards in the field. Previous winner Dan Brown, Sofia Andreeva, and Salman Rushdie were also nominated for this year’s prize.Born in Liverpool in 1938, Lucas studied at the University of East Anglia (UEA) in the UK until 1978, when she moved to New Delhi, India, and began her career as a curator. She has exhibited her works at the IWA and the Lalitpur Art Gallery in India and has had solo shows at the Joshua Cole Museum in New Delhi, the Kamala Baghramian Museum in Mumbai, and the Navaratri Art Gallery in Chennai.“Sarah", "The next Biennial should be called a “recuperation cycle,” and the first one should be held in 2021. The next edition of the Biennale will be held in Almine Rech, in the Altai Mountains of central Russia. The theme of the theme is “The future we want,” “the future we don’t,” and “future in transition.” Artforum has reached out to the exhibition organizers for comment.\n\n\nThe Taipei Fine Arts Museum (TFAM) has received a donation of sixty-six artworks from the private collection of Japanese billionaire Masaoka, who was the founder of the Tokaibatsu Group, the conglomerate that owns the Taichūdai, the Shizuoka prefecture, and is the world’s largest private collector of contemporary art. The donation includes works by Donal Ochman, Yoko Ono, Robert Irwin, Klaus Kala, and Mark Rothko, among others.The works were added to the collection by Taiwanese collector Katsu Ujikoshi, who served as executive director of the TFAAM from 2006 to 2008. He purchased", "The next Biennial should take place in 2020 at the Dusseldorf Museum of Fine Arts, Germany, and will be hosted by the Centro de Cultura Artes. The 2021 edition, titled Artes Manifestes, will be staged at the Museum der Moderner Kunstverein Stuttgart and will be inaugurated by a retrospective of the work of Svante Gabor (1921–1975) and Jean Du Monde (1902–1964). \n\nThe museums of the National Museum of Fine Arts (N.M.A.) and the Museum of Fine Arts, Houston (MFA), have announced that they have reached a tentative agreement that will see the museums reopen to the public in early 2021. The Los Angeles County Museum of Art (L.A.CA), which has been closed since March 13 due to the Covid-19 outbreak, and the San Francisco Museum of Art (S.F.M.A.), which was forced to cancel a forthcoming edition of its Zine Year in March, have been negotiating for more than a year. The San Diego Museum of Art is also working toward a deal that will see the museums open in early 2021. On Monday, the museums announced that the negotiations", "The next Biennial should be held at least twice a year, with the aim of increasing the exhibition’s international profile. The inaugural edition, held in June 2018, featured work by twenty-seven artists. In the run-up to the event, artists from twenty-six countries were invited to present work.The biennial, which was organized by the New Foundation for Contemporary Art (New Foundation), and curated by Dirk Wittig, received a $10,000 grant from the Josiah and Mary Forsyth Foundation in the sum of its “20th Anniversary” in June 2019. The foundation is also planning to launch a new scholarship program, a museum dedicated to the art of twentieth-century East-Central Europe, and a new prize.\n\n\nHard Rock Café in New York has appointed Cynthia Albright as its next executive director. Albright will be based in New York’s Greenwich Village and will work in collaboration with the New York–based artist collective Danni Wild, who is also the founder of The New Conflict, an artist collective that produces works that challenge the boundaries of the artist’s practice.“Cynthia’s vision for the institution is to present a welcoming", "The next Biennial should kick off in October 2020 and will feature forty-eight works by twenty-six artists and collectives. The theme of this year’s iteration is “Paradigm Shift: How the Body and the Planet are Re-Creation.”The Architecture of Dreams, 2018, an exploration of the notion of the architectural dream, is currently on view in the exhibition’s new location at the Biennial, the London galleries. It is also being staged in the United States, Mexico, and the United Kingdom. Inaugurating the Biennial this year were seventy-five works by thirty-six artists.The inaugural exhibition of the two-day event, “Blue, Blue, Blue,” at the Museum of Modern Art, New York, was cancelled following the pandemic.The inaugural exhibition at the Museum of Contemporary Art, Los Angeles, was postponed indefinitely, and the Biennial’s seventh edition, “The Future Is Now,” was also pushed back. “This is a challenging time for art, and we are grateful to the organizers of the 2019 and 2020 Biennials for their understanding and cooperation with us during this difficult period,” said MCA director", "The next Biennial should be in 2021, and the event will take place in the city’s land-based museum, the city’s expanded Science Museum, and the city’s new Art Museum. Art New Orleans has announced that the fifteenth edition of the biennial, Art in the City, will be held in 2020. The theme of the festival is “Human Observability,” and the fifty-ninth edition of the event will focus on how art can even increase our awareness of the world around us. The venue will be the historic Gass Saint Louis, with a grand opening ceremony on November 9. The twenty-first iteration of the event will be held at the Louisiana Museum of Fine Arts in New Orleans in 2021. “As we work to reimagine the future and how arts and cultures are used to shape and expand it, we must be mindful of the art and culture of the past and of how it informs and informs us and our world today.” Among the works that will be on view are works by Maria Alegria, Claudia Bianchi, Sara Chamberlain, Andrea Catellani, Diana Graziano,", "The next Biennial should take place at the X-Club in the Hudson Valley in New York in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released the list of forty-eight artists who will participate in its fourth edition, “Art in Progress: The Art of Art,” which will take place at the Museum of Contemporary Art Downtown Los Angeles (MCA) from March 15 to March 19, 2020. Titled “Away from home: art in the moment,” the exhibition will highlight the work of forty-eight contemporary artists who have relocated to cities and communities throughout the United States. It will also engage with issues of mobility, urban planning, energy, and the environment.Holly Sklar, chair of the 2018 group show’s curator of contemporary art, said: “Hannah Cook’s work is deeply rooted in contemporary ideas about what it means to be a contemporary artist. Her recent projects with the Oregon Art Museum and the Los Angeles County Museum of Art, as well as her previous projects at the Brooklyn Museum, reflect a sense of urgency for those who have a critical stake in the future of art.”The thirty-three-person curators are: J", "The next Biennial should take place in 2019. The following year, the National Board of Art in the City of New York will hold a special meeting to consider the possibility of the exhibition, titled The Biodiversity of Life, in the museum. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has issued a statement regarding the museum’s decision to pull the plug on the upcoming fifty-eighth edition of the Museum of Modern Art (MoMA) New York. In a memo sent to staff on March 31, DCLA director Monica Mather wrote that the decision to shutter the institution was made following a survey of the institution’s collection and exhibitions and the work of two independent analysis groups that looked into the museum’s holdings.The groups’ findings were not favorable to MoMA, which has yet to publicly respond to the findings. “We are deeply concerned that the New York City Department of Cultural Affairs and the Museum of Modern Art have chosen to close MoMA to avoid a thoughtful and open discussion about our collection and exhibitions, and to avoid engaging in the important and necessary exchange of ideas and expertise between our teams,” Mather wrote. Although the group that conducted the", "The next Biennial should focus on “The Sea and the Trees,” an exhibition of 20,000 photographs by Charles and Mona Hatfield. In the first part of the show, a group of fifty-eight artists will explore the relationship between landscape and the natural world through a series of localized camera portraits and installations; in the second part, the seventy-seven-person jury will present an award ceremony.The show will be hosted by Kim Eun-kyung, Kim Eun-kyung’s husband; Kim Seo-kyung; and Park Jong-in, director of the Seoul Biennale Foundation. Director Kim Eun-kyung said: “I am really looking forward to participating in the Biennale’s next editions to explore the relation between landscape and the natural world through a series of photography experiments. The house has become very warmly anticipating the opportunity to create a new exhibition for the Biennale. Their current exhibition has inspired us to create a new initiative that will focus on the sustainable interaction between photography and the natural world.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has announced that it is preparing to welcome visitors back to the museum on May 30,", "The next Biennial should be held in 2020 and includes a selection of work by contemporary artists, including a group exhibition of work by American and international artists that will open in the Autumn.\n\n\nThe Metropolitan Museum of Art (the museum) has welcomed Sara Cwynar to its staff. The museum’s assistant curator of European art, Christa Cooper, has also been promoted to assistant curator of modern art.Cwynar, who has taught at the museum since 2010, will begin her new position on January 21. Previously, she worked as a curator at the Museum of Modern Art in New York from 2012 to 2014, and as an independent curator in California from 2014 to 2016.“As a scholar-in-residence, I see a great opportunity to expand Sara’s expertise as a curator and to bring her work to the museum and to the community,” said principal curator Daniel H. Weiss, who has curated the museum since 2008. “Her deep, interdisciplinary research will enhance and expand our existing collections and create new perspectives for our exhibitions, our programs and our exhibitions. I’m excited to have her on staff and to continue to be inspired by her exemplary curatorial practice and her willingness to push the", "The next Biennial should take place in 2022, and the inaugural one in 2024.”Gulliver will be honored at the 2018 Venice Biennale, where he received the Panache Groupe’s nomination for the exhibition “The Dawn of the Modern World.”\n\n\nThe Museum of Modern Art (MoMA) has appointed Kate Elliott as the new director and CEO of the Boston-based nonprofit the Museum of Fine Arts (MoMA) Boston. Elliott will begin her new position on January 6, 2020.“Kate’s visionary leadership and cultural strategy for bringing new and exciting exhibitions, programs, and events to MoMA through her leadership of the new institution and her excellent curatorial approach have already set the Museum apart from many other contemporary art centers,” said Elizabeth Adams, the museum’s interim CEO. “She will continue to shape MoMA’s mission and focus for years to come, and we look forward to working with her to advance the institution’s mission, her curatorial vision, and her uniquely art-centric approach to the collection, exhibitions, and exhibitions.”Previously, Elliott served as director of the National Museum of Women in the Arts in Washington, DC", "The next Biennial should have a new exhibition format geared toward reflecting the recent past, and should be organized in a way that will engage the local economic and cultural and social realities faced by the city. Modernism is no longer welcomed in a city where the number of symphonies and the number of art exhibitions have fallen by leaps and bounds over the last thirty years. “We are ready to face this challenge and prepare for the future,” said Mayor Paul García, who chaired the biennial’s opening ceremony last week. “This is a city that has many things going for it—great schools, great hospitals, great museums, and great arts and cultural centers—but it is also one of the most polluted cities in the world.”According to the New York Times, the toxic waste generated by the factory in the city of Mulhouse, near Albany, is dumped into the waters of the surrounding area. The site of another of the factory’s plants, in Ellsworth, New Hampshire, is also filled with hazardous materials, including heavy metals. The factory’s wastewater treatment plant, on the other hand, only dumps about a quarter of the factory’s wastewater into the nearby Bradley River.The former", "The next Biennial should be announced in the spring of 2019. Curator Gernot Pollock said: “The hope is that the exhibition will provide a moment of clarity to this week’s work. It is my goal to produce a work which will be both a celebration of the work of the past, but also reflect on our current circumstances.”The 2018 exhibition “Avant-Garde in the Age of Mechanical Reproduction” explored the art of the laboratory and the ways in which artists can replicate the effects of artworks. The exhibition was staged at the Portikus, the Plantation Museum in the Bahamas, and the National Gallery in London. The 2019 exhibition “Eccentric Machine Reproduction” will be on view from April 4 to April 7 in the Biennale of the Netherlands. The exhibition is curated by Johannes Eijtzema and will be accompanied by a book, “Avant-Garde: Evolution of an Idea,” and a digital and physical exhibition.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is reopening to the public next month, following a temporary closure due to Covid-19. The institution, which", "The next Biennial should focus on “The Art of Manliness” (2019), curated by Peter Hujar and curated by Simon LeBlanc, the next edition will focus on “The Art of Modern Life” (2019), curated by Paula Scher, the next edition will focus on “The Art of the Fellowship” (2019), curated by Astrid Stiegler, and the new edition will be organized, according to a statement, “within the framework of a contemporary ,” a “greater,” a “modern,” and an   a “new,” the Art of the Fellowship will be held in the Museum of Contemporary Art, Los Angeles (MCA) from January 20 to February 22, 2020. The following day, the next edition of the Art of the Fellowship will be held at the Zentralarchiv, Vienna (Zurich), and will be held at the Museum of Modern Art from March 15 to March 19, 2020.\n\n\nThe Spanish Ministry of Culture has announced that the thirty-fifth edition of the Biennale Barcelona will be held in Madrid from March 22 to March 29, 2020. The event will be financed with a €2.", "The next Biennial should be held in January 2020.\n\n\nThe Fine Arts Museums of Victoria (FAM) in Melbourne and the National Gallery of Victoria in Perth have commissioned artist-designed works by acclaimed Australian conceptual artist and educator Michael Rosenblum. The works, which were created as a way to respond to the geographical and cultural diversity of Australia, will be on display in the first show of his six-year tenure at the museums.Rosenblum will teach his first interactive work at the National Gallery of Victoria (NGM) in Canberra, which opened in 2019, the same year he graduated from the school. The show will feature works by twenty-four artists, including Paul Al-Khalili, Nima Khalili, Yael Al-Sawy, and Jodi Throckmorton, and will highlight the work of emerging and established artists. The works will be presented in the form of a series of interactive videos that will be played in concert with the works of the artists in a way that requires the participants to physically interact with the works.“I have long been an admirer of Rosenblum’s work, which is grounded in a conceptual vision of the world that is a joy to watch unfold in front", "The next Biennial should take place in 2021 and will be hosted by the Museums of Fine Arts in Paris. The annual event will gather thirty-six artists and will run for a total of twelve months. The theme of the upcoming edition will never be set in stone. Art historian and theorist Krzysztof Kieslka has commented: “The project of the Biennial is to create an exhibition that will reflect both the past and the future: a portrait of the artist’s future, but also a present that will be organised as a reflection of the past.” Commenting on the theme, Kieslka said: “The Biennial is a history of art, a history of symbols and a history of ideas. It is a history of the way a group of artists construct the world they live in, the ways they communicate and their relation to the world. It is a history that we are privileged to be able to witness at the Biennial.” The biennial was founded by the French socialite and collector Brigitte Bière in 1932. It was moved to Paris in 1948 by a friend and is currently housed in the Musée d’Arles, where it continues to", "The next Biennial should be in early 2020, with the opening of the exhibition “Frida Kahlo: Ten Years,” which will open at the BIS Museum in Prague on September 28 and run until December 21, 2020. The new exhibition will include twenty-five works by Kahlo and will be curated by Nina Hsu.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has appointed John F. Kennedy as its next director. Kennedy will take the helm from Sue Marks, who has served as interim director of the MFA since November 2019.“John has been instrumental in our transformation from a nonprofit organization established in 1975 to a thriving, globally recognized institution that is admired and admired around the world,” said MFA director and CEO Morgan Ward. “In this critically important moment in our history, Morgan Kennedy will assume a new role as director of a museum that was established with the express mission of promoting, protecting, and redistributing art. He will be a trusted mentor and advocate for our artists and staff and will be instrumental in making MFA Atlanta a world-class museum.”Kennedy succeeds Sue Marks, who has served as director of the museum since 2007. During her tenure, she has worked", "The next Biennial should be held in 2021. While the Smithsonian requested that the upcoming edition of the museum be postponed to 2021 to accommodate the coronavirus outbreak, the museum has stated that it is still assessing the safety of the institution and its visitors.The upcoming edition of the Biennial will focus on the legacy of the late artist Lazarus Frank, whose work, which explores the relationship between the artist and the institutions that represent him, is currently housed in the MFA Galleries in New York City. Since the massive coronavirus outbreak began in Wuhan, China, in Wuhan’s Wuhan district in December of 2015—the same area where the sculpture \"Lazy Lady\" is located—the Museum of Modern Art and the Whitney Museum of American Art have denied that the sculpture is currently located in any of their exhibitions.Commenting on the museum’s newly launched online platform, director Nicoletta Nolen said: “We are committed to testing new and innovative ways to make a meaningful contribution to the museum’s collection. By tapping into our collections and by building partnerships with local, regional, and national artists, we are designing for the future. We understand the challenges and concerns that artists face. And we are committed", "The next Biennial should be held in the spring of 2021, which would be the end of the first year. The exhibition would go on to celebrate the divisions of the exhibition between Scotland and Wales and the exhibition of Italian art, which was organized concurrently with the Biennial.  New York’s Metropolitan Museum of Art is also currently working to come up with a new set of guidelines on how museums should handle objects in storage that are consistent with the American art historian Yoko Ono’s famous advice that objects should be stored in cool, dark places. This article is part of a series on the preservation of the late American art.\n\n\nThe Obama administration awarded a $3.7 billion aid package to arts and cultural institutions across the US on Thursday, as part of a $1.2 trillion federal stimulus package that attempts to mitigate the economic fallout as a result of the coronavirus pandemic.The arts and cultural sector has been the focus of several key rounds of federal stimulus funding, which has been used to help small to mid-size US cultural institutions such as the Metropolitan Museum of Art and the Whitney Museum of American Art, and to push for changes to the tax code. The investments have helped reinvigorate", "The next Biennial should focus on organizing programming that addresses the ongoing threat of climate change in the United States.” The list of participating artists that is set to be unveiled is as follows:Tania BrugueraAntonio MedranoSimon LaibMichael LuberdijnMatthew DykhuisRobert MapplethorpeMichael KillenArmando de Mora, Jr.Joachim MeijerMichael Meijer-Bakhtiar-Khan OmaricAnthony L. Williams/Sandra St. JohnScott SmithArtist/Documentary:The Gollum Effect (2017)Oscar Pires/Kenichi TakedaSara Takeda/Simon Piquemal/Bianca Pimentel/Alexandra PimentelLane Turner/Tanya Van Damme (2017)Emerald Gate: The Embassy (2017)Laboral & Filifera (2017)Sarah Pfeifer (2017)The Hollow (2017)The Art of the Impossible (2017)The Holidays (2017)The Merchant of Venice (2017)The Artist’s Place (2017)The Ladybird in the Garden (2017)The Ladybird in the Sky (2017)The Ladybird at", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has launched an online fundraising initiative to help the local community recover from the flood of Covid-19 cases across the United States. Beginning on September 1, the institution will offer free admission to everyone who comes to the museum for one hour on Saturday, September 29, 2019, in commemoration of the first day of the pandemic.“Through our online program, we are working together with the people of Los Angeles to share their stories with one another and to have a meaningful impact on one another’s communities,” said Bruce Moholy-Nash, the director of the museum. “The next Art Basel is here, and we are excited to see where it takes us as we continue our work to foster a more social and connected world. We thank our guests for their understanding and cooperation in this effort, and we look forward to seeing how they respond to the invitation to come visit us in person.”The museum is asking those who want to give back to the city to donate items, such as art, artmaking tools, or other valuables, to ‘The People’’s Fund", "The next Biennial should be held in 2018. The 2018 edition, entitled Art and the Body, was organized by the Los Angeles–based studio L.A. Antenna, and will be hosted by Wangechi Mutu in Nairobi.  The 2019 edition, entitled The New Forms, was organized by the London-based studio Leeds. The 2020 edition, entitled “The Future Is Present,” will be hosted by the New York-based group Biennial.The 2020 edition will include two exhibitions, one of which will be a “tribute” to William S. Burroughs and the other a “statement on the significance of John Lennon.” The 2020 edition will also feature a biennial-style program of performances, residencies, lectures, seminars, and other events. “Charles and Irene, we are so proud to be collaborating with such talented artists,” said Wangechi Mutu. “We wanted to create a new way for the world to experience the work of these artists by engaging them directly and directly in the biennial. Charles and Irene are highly regarded for their acute understanding of the needs of contemporary art, their", "The next Biennial should be held in 2020. The 2020 edition will consist of twenty-four works from the collection previously unpublished. The set of programming will begin on March 25, 2020 and run through June 24, 2020. This year’s inaugural biennial, “Life and Art,” was curated by the contemporary artographer Susan Johnson and was presented at the Los Angeles County Museum of Art.\n\n\nThe Museum of Chinese in Europe (MCE) in Beijing has appointed Yan Afshar as its next director. Born in Beijing in 1962, Yan is a curator and scholar who served as MCE’s director from 2007 to 2011. Born in Beijing in 1962, Yan is a curator and scholar who served as MCE’s director from 2007 to 2011. “I have been selected for this role by MCE’s board of directors, which comprises twelve members, including director Ming Qiu, chairman of the board of directors, Zhang Kan, director of the Beijing art center, and Ma Xu, founder and director of the Beijing Art Museum,” Afshar said in a statement. “I’m eager to begin my new role, which will be based in Beijing", "The next Biennial should take place in 2020.\n\nThe Museum of Fine Arts (MFA) in Boston is planning to open in 2021. According to the Boston Globe, the new venue will be named for the poet Hannah Benjamin and the venue will be located in the city’s historic Adams-Moniz garage. The museum will host five exhibitions a year, including “The Work of Art,” which will explore the human body and its connection to art; “Letters from the Body,” which will present letters from Benjamin; and “Letter from Benjamin: A Biennial,” which will be a ‘living monument’ to the work of the poet.Speaking about the new space, curator Joachim Kummel said: “We are creating an exhibition space for Hannah Benjamin’s letters on the condition that the museum will honor her legacy by developing the collections and exhibiting the works in the collection. The museum will have a unique role in the reopening of Adams-Moniz and in the reopening of the city. We believe the work of Hannah Benjamin to be a defining instance of the Early Modern Romantic movement.”\n\n\nThe Art Newspaper has revealed that the fifth edition", "The next Biennial should be held in 2021, with the exhibition marking the 50th anniversary of the event. The pavilion will be inaugurated by an exhibition of works by female artists from the Ivory Coast and the African continent from 2019 to 2020. The theme for the 2019 edition, “Unconscious Orientations,” was “the ways in which beauty and sexuality intersect in our society,” and the exhibition previewed the 2020 event, “Eden” in which the artists will be given the opportunity to create works that confront the contemporary realities of our time.” The artists who were chosen for the 2020 Biennial are Fotopo, Fotopo, Aneka Akunyili (South Africa), Almeida Akunyili (South Africa), Vitekha Akunyili (South Africa), Mona Akunyili (South Africa), and Buhlebo-Buhlebo (South Africa).Commenting on their entries, Aneka Akunyili said: “I am ecstatic to be chosen for the 2020 Biennial. In the past twenty-five years I have staged my first solo exhibition in Moscow and have received international acclaim for my art.", "The next Biennial should take place in the city in 2021 and will be led by the museum’s director, Alexandra Hootson, and executive director, Judith Dawson, and will include work by no fewer than ten artists, including the Oakland Museum of California, the Cincinnati Art Museum, and the Detroit Institute of Arts.\n\n\nGerman artist Bertrand Delacroix, the pioneer of contemporary art whose films, sculptures, and paintings, as well as those of Jasper Johns, Riccardo Debussy, and Robert Frank, were among the first to embrace electronic and computer culture, has died at age ninety-nine.Born in Berlin in 1940, Delacroix moved to the United States with his family when his father died, where he enrolled in the University of California, Berkeley, and studied at the Art Institute of Chicago, the University of Minnesota, and the Museum of Modern Art in New York. Following a stint at the Art Institute of Chicago, Delacroix returned to his hometown in 1959, but continued to live and work there, creating works such as the film The Robot and the Ghost (1966). Delacroix’s first major retrospective at the Museum of Modern Art, which opened in 1973, was staged by", "The next Biennial should take place in 2020. “The theme of the 2020 edition of ART is resilience,” said Audram de la Garra, president of the International Society of Art Historians (ISAW), in a statement. “Inaugurating the tenth edition of the Biennial, ART will celebrate the history of the Art and the history of art in the United States. We welcome the opportunity to continue the work of the past and to bring new and original ideas to the exhibition.”\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has received a gift of four works by Icelandic artist Gjusbjørn Thormann. The works, which were donated by his wife, Gili Stefansson, and the Italian collector Stefano Relland, were all given to the institution in exchange for a series of works that were previously on display in the artist’s studio in Milan between 1989 and 2008.The gifts include the Water and Flame series, which was created in 1988, and the Tidal Waves series, from the same year, which were shown at the artist’s studio in 2013 and 2013, respectively.The works were donated to SFMoMA in exchange for the residency", "The next Biennial should be held in 2021 and is currently on track to run from October 6 to October 10, 2020.\n\n\nThe Metropolitan Museum of Art in New York has announced that it has received $1 million in donations in the wake of the terrorist attack on the museum on December 3, 2016 that killed twelve people, injured fifty-nine, and left sixty-three others injured.The terrorists, who were also killed in a shootout with police, broke into the institution and killed a security guard before they shot museum director Daniel H. Weiss in the head and killed a security guard in the stairwell as the director entered his office.Five months later, the museum received $2.1 million from the federal Coronavirus Aid, Relief, and Economic Security (CARES) Act, which has been administered by the CARES Fund since 2011. The funds will assist the Met with the reorganization of its pension fund and for other programs.“After a thorough review of the circumstances of the attack, the Met determined that several options were available to reduce the risk of a recurrence, and we chose to implement a cost-effective and expedient strategy,” said Metropolitan Museum of Art director and CEO Patrick F. Ryan. “", "The next Biennial should take place in 2022, and the opening of the exhibition “The Modern Ghetto” will take up the theme in 2024. Following the Biennial, which will also include an exhibition of Korean art, a new South Korean pavilion will open in the Beijing Art Museum. It will host a South Korean artist in the art center, and the Biennial will continue to run as scheduled. The pavilion will also continue to host events, special exhibitions, and other programming, although it will be closed until March 14. The pavilion’s chief curator, Kim Sun-Kyung, told the Art Newspaper that the museum will “continue to cultivate a deep and wide-ranging understanding of the Korean tradition with the exhibition of a wide range of contemporary works by both experienced and emerging artists.”In an interview with the Art Newspaper, Kim noted that the pavilion’s opening ceremony, which was held in March, was also held in a “modern” museum. He noted that, because the pavilion was built in a modern building, a gallery was added to the pavilion in 2020. Kim said that the pavilion’s closing party would have been the first time the pavilion had been open", "The next Biennial should be held in the spring of 2021.\n\n\nThe Guggenheim’s Timur Guggenheim Museum in Berlin has opened its doors to the public for the first time in a ceremony on Saturday, March 16. Opening on the fourth floor of the museum, which was renovated in collaboration with the Guggenheim and the Haus der Kunst, the museum has constructed a new exhibition space for the exhibition “The Guggenheim Collection: The Future is Present,” which will explore the collection and exhibition history of the institution’s artists and how it has recently been undergoing a major renovation. The reconstruction of the museum involved the purchase and restoration of more than 1,500 objects, the acquisition of land adjacent to the Guggenheim’s collection building, and the remodeling of the building, which is currently home to its first exhibition of work by Emily Hall, an exhibition dedicated to the French Impressionists, and the museum’s main entrance.“Timu Guggenheim: The Future is Present” will serve as a centerpiece of the museum’s reopening, which will coincide with the reopening of its new building at the end of", "The next Biennial should have been dedicated to the art of the Pacific in 2020. Instead, it is being forced to cancel the event, and it will be forced to scale back the content of the event. Michaelangelo Antonioni’s “The Last Picture Show,” released in 1987, is being removed from the exhibition catalogue and will not be rescheduled. The Italian director was targeted by an angry mob of some ten thousand people protesting the exhibition’s exclusion of a “realistic” work by Italian contemporary artist Renzo Piano. The warning was made on the eve of the exhibition’s seventy-ninth edition.When the show’s organizers announced the cancellation earlier this week, they said that the decision to remove the “unacceptable” work was made after an internal review. “We take the decision in the interests of the show, of the Museo de Arte Contemporanea di Milan, and of the audience,” said Stefano Coccia, director of the Museo di Arte Contemporanea. The move has caused outrage in Italy, where the exhibition had been held since 2011. The Pirelli Artis office in", "The next Biennial should take place at the Museum of Contemporary Art San Francisco. The 2020 theme will be “Pain and Vision: An exhibition of work on the Modern Painters,” and will be “Pain and Vision” (2019) with the following artists: Luz, Sara J. Davis, and Elissa Jakobson. The 2020 theme will be “Pain and Vision” (2019), with the following artists: Aparicio Martin, Catherine Oxtoby, and Luiz de la Sierra. An exhibition of work on the modern painters will be presented at the end of 2020. Art historians will present works by ​Bourgeois, Oskar Kiarostami, Michelangelo Antonioni, and David O. Russell. The Award for Lifetime Achievement in Art History will be presented by Pete Kupka, who will serve as the museum’s director of public and culture. The 2018 James A. Farley Award in Art History will be presented by Christopher Wool, who is chair of the Farley Foundation’s board of trustees. This year’s award, which honors the achievement of an artist who has made", "The next Biennial should also feature some of the most exciting work from the Los Angeles– and New York–based artist-activists. The exhibition will be curated by the artist-in-residence, Borja Báez-Pérez, and will open in September. The museum is currently working on a new slate of exhibitions dedicated to the late American painter John Akomfrah; Akomfrah’s works are currently on display in the museum’s newly constructed exhibition space, “John Akomfrah: The Biennial,” which is currently under construction. The exhibition will open in March 2020 and will run until November 2020.\n\n\nThe Metropolitan Museum of Art in New York announced today that artist-in-residence Nicole Berglund has been selected as the recipient of the 2020 Pulitzer Prize for her art, “Shelter.” Berglund, who is currently a senior at the University of Rhode Island, will receive a $50,000 prize in the fall. The prize jury comprised Kasper Koenig of the Museum of Modern Art, New York; John Krasinski, director and chief curator of the Walt Whitman–designed Whitney Museum of American Art; and Joseph", "The next Biennial should be held at the Grand Central Station, which is currently under construction, in the City of New York, next spring. The project will be funded with a $1 billion federal grant, and will be led by the architectural firm Gensler as part of the city’s $500 million Comprehensive Plan for Rejuvenation, an ambitious effort to make New York City’s urban fabric more resilient to the ravages of climate change. \n\nThe Goldsmiths, University of London, has appointed Kate Massey as its new associate director of contemporary art. She will be responsible for fostering and advocating for the goals and design of the Goldsmiths Modern Art and Architecture department, which is led by Kate Spilker and consists of fifteen artists, including Rachel Whiteread, David Hockney, Jimmy Wales, and Billie Condon.“Kate is a visionary and gifted communicator whose ability to articulate deeply felt emotions and creative insights in compelling visuals will be central to our work at the Centre,” said Oliver Bove, director of the Goldsmiths. “We look forward to her powerful leadership role in shaping future plans for the department and the future of the museum.”Mascitta joins", "The next Biennial should be held in the spring of 2020. The biennial will also be followed by an exhibition of works by artists not represented in the triennial, such as Robert Mapplethorpe, Oskar Eustis, and Gregory Benford’s The Great Silence. The 2020 biennial will include a selection of work by artists whose work was selected by a jury comprising Artforum editor-in-chief Rana Foro, Tate Britain curator Joachim Novitskova, artist Sophie Paul, and Gerald Knaus. The 2020–2021 editions will be held in Hong Kong and New York.\n\n\nThe Metropolitan Museum of Art in New York has appointed Kamiar Zohar as the next director of the museum. Zohar comes to the museum from the Smithsonian’s National Museum of African Art in Washington, DC, where he has served as interim director since December 2019.During his tenure at the institution, Zohar has worked to ensure that the Metropolitan’s collection and exhibitions are positioned to address contemporary social and cultural concerns. He expanded the museum’s collection by adding new galleries, led by Enrico Rognotti, and developed partnerships with local, regional", "The next Biennial should take place in Cairo in the spring of 2021. If the festival cannot move forward as planned due to the ongoing impact of the coronavirus, it is planning to bring the first edition of the Oxford Biennial to Oxford St, London, in the spring of 2021. The event will be hosted by the Central Library, Oxford Circus, and the Turner Contemporary Art Institute.\n\n\nThe Skarstedt/Münster Foundation in Germany has received a boost in funding for its research in the field of media art and technology, which was founded by the late German photographer and theorist Klaus Skarstedt in 1964. The organization received $53 million from the German Federal Association for Culture (DA), which comprises the German Federal Chancellery, the Federal Chancellery Bund, and several state governments, and announced today that it has received another $42 million from the Kunsthalle Heimat in Berlin. The German Federal Institute for Media Art (BAM) is also anticipating another $19 million in support from the Kulturstiftung d. Bildung Berlin (the German state assembly), which represents Berlin, the city of Cologne, and the city of Leipzig.The KUNST-Bild, an", "The next Biennial should be held in Kuala Lumpur in 2021 and will offer a new, contemporary presentation of the work of the artist in the collection of Rizal Maksud, the chairman of the Sifang Art Museum in Seoul. The gallery will also develop a new digital platform for the exhibition and will curate a new exhibition in partnership with the Hong Kong pavilion.The first edition of the exhibition will open at the Sifang Art Museum on August 21, 2020 and will run until March 22, 2021. Upon completion of the exhibition, the sculpture and installation will be returned to the artist. The exhibition will also open to the public at the Hong Kong pavilion, Hong Kong’s largest arts complex, in March 2021. The second edition of the exhibition will be held on March 28, 2021 and will be presented at the Hong Kong pavilion in October 2021.\n\n\nThe Museum of Contemporary Art Houston released the list of thirteen additional artists who will receive the $500,000 Houston Artists Award in 2021. The award is the largest multi-year award given by the Houston Museum of Art and will honor the work of artists who demonstrate a commitment to the Museum’s collection, programs, and exhibitions.Museums have", "The next Biennial should take place in 2021. The key to the biennial will be the collaborative approach of artists and institutions to create a new cultural moment through the collection and exhibition of works by some of the world’s most distinguished performers, including Joachim Neugroschel, Bernd and Maud Kitter, and Anselm Kiefer. This exhibition will also feature work by emerging and established artists in the works of works by celebrated artists of the twentieth century, including Harald Szeemann and Rainer and Rainer and Rainer, and will showcase the work of thirty-six artists who have been selected from a pool of ten applicants. The seventy-four-year-old museum is preparing for a possible closure as a result of the coronavirus.\n\n\nThe Italian artist Cinò Prada, whose mass-produced, color-saturated sculptures – often based on portraits of his ex-girlfriends, but often involving imaginary or literal images of their own bodies – fused surrealism and abstraction in the late 1960s and early 1970s, has died at age ninety-one.Born in a small town in the northwestern city of Genoa, Italy, in 1937, Prada, who often", "The next Biennial should focus on transparency and the importance of participation in the museum’s collections and on the role of the museum and collections in the public imagination,” said Tan.; Wasing was set to present the work in the forthcoming exhibition “Art and Human Rights,” which will take the form of a retrospective, “of the work of one hundred artists.”\n\n\nThe French government has approved a sweeping cultural reform that will allow French museums greater flexibility when it comes to funding and how it distributes large-scale events. The bill, which was passed on Monday and now goes to President Emmanuel Macron, would allow French institutions to raise funds from the private sector or from city budgets and reinvest the proceeds in culture.“This is a historic moment for France,” said Culture Minister Franck Riester, who said that the government has been working for some time on how to respond to the current economic crisis, which has forced France to take a series of measures, from cancelling large-scale events, such as the G8 summit in Northern Ireland, to distributing tax-free funds among France’s various cultural institutions.Riester said that the government has been examining the legislation for some time, and", "The next Biennial should be held in 2021.   In an interview with Artforum in 1997, Miriam said: [My] goal is to have a project that will last twenty-three years. It is a long-term project. I have never said, nor have I ever done, that it should be an annual event. I have said that it should be about thirteen years of work.  It is a work that must be carried out in an environment that is both hospitable and safe. I can understand that a great deal of work has to be done in order to re-create the atmosphere of the nineteenth-century, but one thing is clear: this is a project that will not be easy.”\n\n\nPROJECT SCHEDULE\n\n\nMIDNIGHT CREATIONS, the Brooklyn-based nonprofit that spearheaded the original residency program, will begin hosting a biennial of works by Los Angeles–based artists in 2021. The event will run from January 21 to February 13, and will be curated by artist and teacher Mimi Yang. Frank Gehry and Paul Gauguin were among the first to collaborate on a residency program in the United States, but it wasn’t until 1961 that it", "The next Biennial should be held in 2020, and hopefully the first in 2030. The museum’s current exhibition, “The Body in Art,” will remain on view through February 24, 2020.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) is planning to move the exhibition “Punk: A Retrospective,” featuring more than seventy artists from the 1970s to 2020s, to a museum that has not yet been selected. The move has been made in an attempt to preserve the “original vision of the exhibition,” Artnews reports. The museum will officially announce the location of the exhibition at a later date.The museum has been working on the redesign for six years, beginning in 2015. The team presented the exhibition—designed by Hal Foster and composed of twenty-two works—at the New York Institute of Technology (NYIT) in March of 2015. The redesign was inspired by a “pueblo atmosphere” the museum experienced while in a Native American site in northern New Mexico. The design was also inspired by the Museum of Modern Art’s Rabat–based outpost, the Mural, designed by Jesse Lerch, and its current home,", "The next Biennial should be held in 2020. \n\n\nThe Oxford Art Museum (OAM) in Oxford, England, is planning to shutter its doors for a period of two years as part of a major revamp of its collection, which will include a new generation of works by contemporary artists. The museum expects to have the entire archive restored by the end of the year.In a statement posted on Instagram, the museum said: “The sixteenth edition of The Oxford Art Museum will be a significant and challenging experience for all concerned and we look forward to the future with a sense of urgency.”The museum is also co-financing the initial reinstallation of the museum’s new collection with the Resting Fund for Contemporary Art, the UK’s charitable arm for arts, architecture, and heritage. The cash infusion will allow the organization to begin the construction of the new building that will house the collection, the Oxford Museums (OMA), and the installation of new works by contemporary artists from the collection.The announcement follows a multiyear initiative led by the nonprofit Art Fund to build a new collection dedicated to contemporary art in the UK. The partnership between the two organizations will now allow OAM to present a series of six exhibitions", "The next Biennial should be held in 2021, and the twentieth in 2022. The decision to cancel the 2019 event has been made in consultation with the artists, the city council, and the Waterfront Corporation, the City of London Authority, the London Assembly, and the London Assembly in partnership with the artists. After completing the planning for the future of the Tate, the trustees were asked to write to each of the artists to express their views about the upcoming biennial. The letter, dated August 29, 2019, reads: “We, the trustees of Tate Modern, and the City of London, express our appreciation to Mrs Clarke, who has been our guiding hand in this process, for her unwavering dedication to supporting Tate Modern’s mission to celebrate and present vital contemporary art. We wish her success in the next biennial.”Since the letter was circulated, Tate has released a statement saying that it is aware of the letter but that it is not aware of its content. It also notes that the event was planned and approved by the Corporation, which is run by the City of London, and that the decision to cancel the event was taken in consultation with the artists. Tate’s London Gallery Fair", "The next Biennial should include a selection of works by artists working in the exhibition ‘A World of Our Own’ and will open to the public at the Museum of Modern Art, New York, on October 29.The full list of participating artists is as follows:Artists Konstantin Orlov and Osei (Russia)Artsakhiv Alexander (Russia)Christian Beyer (New York)Artists Oleg Baranov (New York)Artists Tanya Baranov (New York)Artists Ilya Bragin (New York)Artists Vladimir Brown (New York)Artists Rina Chikov (New York)Artists Nuria Cibelle and María Elena Cáceres (Mexico)Diana De Vries (Germany)Deana Diné (New York)Artists Urs von Rydings (New York)Artists Rina Dziewior (New York)Artists Rudolf Grosz (Germany)Krzysztof Kieścieś (Poland)Artists Marcin Lek (Poland)Artists Victor Lobkowicz (Poland)Artists Roman Željko (Poland)Artists R", "The next Biennial should take place in 2021, and the twenty-fifth in 2023.\n\n\nThe New York Academy of Art (NYAC) announced today that Lorenzo Ferretto has been promoted to its curatorial staff. He will assume his new responsibilities on March 25 and will be responsible for the development and presentation of the museum’s exhibition program.Ferretto, who is currently working as a full-time assistant curator at the Museum of Modern Art, will assume his responsibilities at the museum during a two-year period. During his tenure, the museum will host eleven exhibitions in its current location at 88 East Twenty-Second Street in Manhattan and will showcase an exhibition of works from the collection in its new home, the Bergen Street Armory. An avid collector of antiques, Ferretto will also oversee the reopening of the gallery in his new role.“The New York Academy of Art is looking forward to working with Lorenzo in his new role, and the exhibition series he will create for the institution will complement and expand the work of the curators at the Museum of Modern Art and the Museum of Modern Art in New York,” said Andrew Schoelkopf, chair of the board of trustees. “We", "The next Biennial should be held at the Düsseldorf Academy of Art in Germany, in March 2020, as the 2020 issue of Artforum. It will be inaugurated by a selection of works by the award-winning sculptor Bronislaw Lem, and will feature the work of the twenty-six artists selected for this year’s edition, who will be presented with the prize at a ceremony at the Düsseldorf Academy of Art on December 8.\n\n\nThe Museum of Arts and Design (MAD) in New York City has received a major donation of over $1 billion from the Andrew W. Mellon Foundation, which will allocate $1 billion over the next ten years to support cultural and cultural organizations operating in the metropolitan area. Since its inception in 1999, the grant program has supported the restoration, renovation, and expansion of over five thousand arts and cultural spaces.“The Andrew W. Mellon Foundation was founded to support and encourage the arts in America,” said director Christopher Bedford. “It’s been our goal for decades to secure the museum’s permanent home in Central Park, and we’ve accomplished that goal by supporting the arts and cultural initiatives that have helped make MAD a", "The next Biennial should be announced in the first week of September, with the exhibition slated to run from March 11 to March 20. The series will feature more than seventy artists, including Salah Makhlouf, Ava Duvernay, Carrie Mae Weems, and Tania Bruguera, as well as plant-based artists such as José Antonio Hernandez, Agustín Pérez, and Mairead Maguire, among others. The biennial will also feature a chapter on the art world and a section on the art of the body, with a focus on the exhibition of artist performances.Entitled “Art and the Body in Contemporary Art,” the sixth edition of the Global Creativity Festival will be held at the nearby Port of Barcelona from April 2 to April 4, 2021. The event will also be held within the confines of the city of Barcelona, which is located in the Azurino region, and will feature a number of other special projects, including a digital platform and a workshop for the general public.The inaugural edition was founded by the Catalan-born, New York–based artist María Berrada, and her husband, David, in 2012. The duo created the exhibition in partnership with Cin", "The next Biennial should be held in Dubai in 2022. The museum would then relocate to the United Arab Emirates, where it would host the next iteration of the international exhibition, The World is Flat: Architecture and the Material World. The new format would include a program of lectures, talks, and exhibitions, which would open on the biennial’s opening day.\n\n\nItalian architects have won the right to design the Colosseum in Rome, Italy, in a four-year, $4.8 million contract. The construction of the monument, which will commemorate the centenary of the birth of Christ, has been entrusted to the firm of Alessandro Catellani and Gio Ponti, and will take place between December 21 and March 19, 2021.Architectural drawings of the structure were produced by the Italian firm Artimatico & Catellani and the Milan-based architect Silvana Pagani, and the design was developed in partnership with the Italian government. The winning design was selected by a group of experts who included architect and curators Enrico Cipolletta, Fabio Cipolletta, and Gio Ponti.Inaugurating the new collection of Italian art is a new exhibition, �", "The next Biennial should be held in 2021, and the date for the 2021 edition is yet to be decided. \n\n\nUnited Kingdom. (Photo: Richard Eadie.)  \n        \n\n\n\n\nThe National Galleries of Scotland announced today that its board of directors has voted to end its relationship with the private collector Arts Council, a move that will likely result in a loss of more than $1 million in revenue for the National Gallery of Art, which relies on the council for around $1.5 million annually. The move follows the departure of several senior executives at the museum and a growing number of artists who joined the collection-building firm in recent months.Its board of directors chair, MSPs Simon Williams and Ruth Grant, said: “We had hoped that the appointment of Richard Eadie as director would provide positive momentum for our collection-building business. However, as the circumstances surrounding his departure become clearer, it became increasingly evident that he is not fit for the role.”Eadie, who has represented Georgia in the International Exhibition Group (IEG), the UK’s largest international art fairs, has also represented Israel in the International Galleries Exhibition (", "The next Biennial should be held in the first half of August and should be composed of fifteen artists. The biennial will be open to the public from July 28 to August 2.\n\n\nThe sixth edition of the Berlin Biennale (BAM) has announced that the event will now take place from September 7 to September 12. On Thursday, organizers announced that the event would now take place from September 17 to September 19, and that the event would now be run by the Berlin-based nonprofit Moja, which has been serving as the biennial’s artistic director since 2013. “We have been working hard to create a series of events that will provide a unique platform for the artists who have made this year’s Berlin Biennale possible, and for which they can collaborate and express their art in new ways,” said Moja president Ralf Buß. “This year’s Berlin Biennale is now at a turning point as we reach a milestone: the fifty-fifth edition. The Berlin art scene is still in a moment of great transformation. Our artists are now more visible and familiar with the city and its spaces, and we are able to present them in a more intimate way without compromising their", "The next Biennial should also be a great success. ”  \n\n\nThe Museum of Contemporary Art (MoCA) has welcomed Alberto V. Arana to its board and is planning to launch a new initiative to support the curatorial excellence of emerging and established artists. Arana was selected by a jury made up of Museum Director Dana Gund, art historian Benjamin D. Gins, and curator emeritus Sara Donovan, and will assume his responsibilities in April.“I’m so excited to welcome him to the board, to work with him on a day-by-day basis to strengthen MoCA’s existing relationships with communities and artists by providing them with a new way to connect directly to the collections and exhibitions that are currently understudied or are currently being stored, and to begin developing new opportunities for dialogue with our communities,” Gund said in a statement.  Commenting on his new role, Arana said: “I’m thrilled to work with the Board and the MoCA staff to build on MoCA’s strong history of championing young and emerging artists with an emphasis on high-quality research and curating. I’m eager", "The next Biennial should be held in 2021, in the hope that it will inspire others to continue on with their careers and explore their artistic visions. “This is a chance for everyone to see Biennials as they really are,” said Deborah Johnson, president of the Biennial Foundation. “We are honored to have the opportunity to present these works on a very important platform that reflects the extraordinary breadth and depth of the Biennial program.”\n\n\nThe Flemish National Museum Ursula von der Leyen, a longtime curator and artist whose work incorporates works from Greek, Roman, and Renaissance civilizations and whose paintings—including a monumental reconstruction of the Olympia, a Roman sculpture that reassembled parts of the planet to create a gigantic, spherical aquarium—has died at age eighty-eight. Von der Leyen’s art, which includes works from the Marquis de Sade to Gertrude Stein, was on display in the museum’s first exhibition devoted to the history of the art of the twentieth century. The exhibition, called “Pursuit of Beauty,” and its accompanying book, “The Journey of Ursula von der Leyen: From Cubism to Paradise,” will be", "The next Biennial should be in May 2020, and the project will be an extension of the Biennale, which opened in Milan in March 2019 and ran until March 31. “The next Biennale is a participatory and a collective project of many artists, including João Pires (Brazil), Maria de C. Alessandro (Italy), Luta Albani (Italy), and Adrienne Edwards (United States),” the organizers said. “The project ‘Fight Back Good Fight Back,’ will elevate the fight for human rights and freedom.” The next edition of the Art Basel Hong Kong was canceled after protests from artists and activists over the weekend. “Imbalanced Art: Art in Balance” will be staged at the upcoming ArtPlace Beijing in the middle of the capital, rather than in the city, which was under lockdown on Tuesday. On Wednesday, the organizers announced that the show would be rescheduled for October 8–October 11.Organizers said the decision to take the event online was made following an exploration of how the exhibition might have been staged differently, or even canceled, had the Hong Kong Art Museum (HAM), which is currently undergoing a $1.", "The next Biennial should be held at the institution in 2021. In a statement, the university said: “The property currently occupied by the Radcliffe Museum of Art is undergoing significant redevelopment and we welcome the opportunity to create new and engaging experiences for visitors through the collection.” \n\n\nThe National Gallery of Art in Washington, DC, has appointed Michael L. Ford as its new director. Ford currently serves as the director of the Museum of Contemporary Art (MoCA) in Los Angeles, where he will assume his responsibilities on January 6, 2020. The appointment was made through a recess appointment process, which allows members of the National Council to appoint the next director. Ford currently serves as the director of the National Gallery of Art in Washington, DC. He is also the founding director of the lesser-known Bishop Museum of Art at New Orleans’s Trinity Episcopal Church.Ford’s new role comes amid a national campaign against racism and police violence. Following a series of brutal graffiti daubs by artists Black Lives Matter and Black Power on the Lincoln Memorial in Washington, DC, in January, Ford issued a statement condemning the actions of the protesters and urging them to desist. The remarks sparked outrage from politicians, civil rights leaders,", "The next Biennial should take place in 2019. The 2020 edition will be held in 2021.  The theme of the event will be “Outsider in the House: Art and Politics in an Age of Extremism” and will be: “The Structure of the Future” and will be presented by Malaysian artist and theorist Linda Chuang. Chuang, who was born in China but immigrated to the United States at age seven, said: “I am honored to be participating in the Eighth Biennial. I am especially grateful for the attention and support from the board and the artists. They have been amply supportive of my professional development and have shown great interest in my work. I am truly honored to be working with such an extraordinary team.”\n\n\nThe National Gallery of Ireland (NGA) is planning to raise €1.4 million for the institution in a nearly $2 million campaign. The funds will go towards establishing a new endowment, which will provide funding for future exhibitions and the acquisition of new works by artists.“In order to undertake this ambitious project, the NGA needs to raise the funds in the next twelve months, and we are working through", "The next Biennial should arrive in 2020. The plan is for the 2020 edition to be on view in the Fall of 2019.\n\n\nFrench president Emmanuel Macron and Berlin chancellor Angela Merkel announced today that the museum’s renovation project is on schedule and will open for the 2020 edition in March. The exhibition is being organized in collaboration with the city of Berlin and the Friedrich-Alexander-Schlumpf-Institute for Contemporary Art. The exhibition builds on the theme of “A Room of One's Own” and introduces the artist’s most recent installation, “Tit/Tit: Zen and the Art of Painting” (2019), which balances a white cube with an image of a parting of the fingers in a glass-enclosed chamber. The exhibition will be hosted in partnership with the Heinrich Bode Museum and the Bode Museum Galerie in Krefeld, which already has a significant collection of works by the artist. In the works’ first exhibition, the museum will present “Tit/Tit: Zen and the Art of Painting” as the first major exhibition dedicated to the artist’s work in Paris. The next show will be offered outside of France, at the Rome Bienn", "The next Biennial should take place in the United States in 2020, and the following year in a third country.” The move follows a US–Germany security agreement that will provide $8 billion in aid to the world’s second-largest economy in the form of $6.2 billion in aid for small and midsize businesses, and $10 billion in aid for medium and large enterprises, as well as a set of international climate negotiations that will take place in Paris in December. The first exhibition of the international biennial, “The Future Is Present: The Art of Climate Action” (2019), opened at the Art of Change, a partnership between the Art Institute of Chicago and the Stedelijk Museum in Amsterdam, and will run through March 21. The biennial’s founder and director, Harald Szeemann, said: “The world currently faces unprecedented challenges. But the future is here, and it will persist, with or without us, to meet these challenges and more. The next biennial will be the occasion for our collective vision, to see how the art of climate action can inform and shape the future. We are in the midst of a great project, and we are eager to", "The next Biennial should take place in 2020 and the first in 2021. If all goes to plan, the new exhibition will open in the spring of 2021 and will run for twelve years. The new venue will be located in the heart of the city, in the Vilnius University, and will boast an exhibition space for thirty-six works by fifty-six artists.\n\n\nThe Pérez Art Museum Miami (PAMM) has received a gift of forty-one artworks from the Pérez Collection in Mexico City. The works were donated by collector Chura Rodriguez, the founder of the German-born luxury design company LVMH and a wealthy collector of Pablo Picasso, Michelangelo, Renzo Piano, and Thomas Hamilton.The gift includes works by Pablo Picasso and Luis Buñuel in the gallery in the Pérez Museum, as well as works by both Giovanni Benito Magallanes and Pedro Almodovar, and is one of the largest acquisitions made by the Pérez family. Rodriguez previously purchased thirty-three works from the Pérez Collection in 2015, and in 2018, the museum acquired forty-two works in an exhibition organized by the Pérez family.The gallery has also pledged to donate twenty", "The next Biennial should take place in 2020 and will be inaugurated by a new work by the artist, Pia Camil, who was selected for her first solo exhibition at the 24th Biennial in Paris in 2016.\n\n\nThe Pérez Art Museum Miami (PAMM) has appointed Daniel José Villalobos as its next executive director. Villalobos has served as the Miami-based representative of the artist group Pérez Art Museum for five years. He succeeds Hannah Black, who departed the institution in January 2019 to head the New York Museum of Modern Art.“Daniel José Villalobos is a passionate advocate for the arts and a person of exceptional integrity,” said Mary Ewing, PAMM’s vice president of programs and director of programs. “He has helped PAMM become a strong advocate for local, regional, and national artists through his unique and forward-thinking approach to curating that has fostered a deep and wide-ranging appreciation of the art world.”During his tenure, Villalobos has organized more than a dozen exhibitions, including “Alfred Kiefer: A Retrospective” (2018) at the Hawaiʻi Museum of Art, Hawai", "The next Biennial should be held in 2020.  In a letter dated January 3, 2018, the Director General of the Art Museum Hamburg, Hildegarde Krijn, addressed the decision to suspend the exhibition and wrote, “The exhibition has been suspended since February 8, 2018. [The show] has been repositioned for 2020. The forthcoming exhibition ‘Justice or Justice’ is therefore postponed.”Recently, the Museum of Contemporary Art (MCA) in London announced its intention to stage two more exhibitions focused on indigenous art in 2020. The next exhibition is entitled “New Frontiers,” which will be staged in late June alongside “Art and Faith:” and will be held at the gallery located in the former East German plant, the Honkbalnitza, in Frankfurt am Main. The second exhibition will be staged in October.The MCA did not reveal the dates for the 2019 edition of the exhibition. \n\n\nFrench president Emmanuel Macron has appointed a new defence minister, Jean-Yves Le Drian, who previously headed the MoD, as head of the country’s armed forces. Le Drian will assume his post on January 6, 2021", "The next Biennial should be held in 2021. \n\n\nThe National Gallery of Ireland (NIA) in Dublin has released the list of eleven artists who will participate in the National Gallery Ireland (NGA)’s fourth edition at the Curragh Art Museum in downtown Dublin in 2021. The artists are:Cécile Barlow, Ânneko dalalziel, Michael de Palma, Francesca DeCaprio, Anna Dziewior, Lillian Flynn, Suzy Ganz, Susan Jane Gillett, Lori Howard, and Charlotte Minow. The event will take place at the museum from September 19 through September 21, 2021. Commenting on the upcoming exhibition, NIA director Tracey Morgan said: “We are delighted to welcome the artists and their families to the NGA in 2021 and are eager to see their work on display. We always welcome new artists to the National Gallery of Ireland and look forward to welcoming them to the institution.”\n\n\nThe Science Museum Dublin (SMD) has appointed Caroline O’Leary as its new director and CEO. O’Leary comes to the institution from the Solomon R. Guggenheim Museum, where she has", "The next Biennial should be held at 509 West Twenty-Third Street, New York, in 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift from a group of California collectors whose collection includes works by the late Oolite Postmodern artist Burton Dennis. The donation, which was made by Daniel Johnston, a Los Angeles native and collector, and Mary Elizabeth Oxtoby, a longtime LACMA collector and friend of Johnathan Johnston, included eight pieces by Dennis.“We are honored to welcome Johnathan and Mary to LACMA, which is a major cultural hub and a major cultural destination for thousands of Angelenos,” said Sarah Campana, director of LACMA. “Oolite Postmodern is a true pioneer and one of the first artists to create a conceptual tool for the modernist painter, and we are proud to support his legacy with this incredible gift.”The gift also includes forty-eight pre-existing works by Dennis, including twelve sketches, twelve paintings, and four videotapes. The works, which were made in 1981 and 1986, are part of a series featuring works by the artist that is currently on view at the museum. \n\n\nThe British", "The next Biennial should take place in the summer of 2021.\n\n\nAmerican Ballet Theater (ABC) is still struggling to come to terms with the sudden deaths of Cynthia Nixon and Alexander Gilkes, the theater’s principal and first artists-in-residence, who were found dead in their apartment on March 14. Both were sixty-three years old.The Washington Post reports that the deaths of the beloved duo have been ruled accidental and that the cause of death is asphyxiation—a result of a combination of alcohol, narcotics, and suicide.“In the last few weeks, we’ve had conversations with some of our colleagues and other animation colleagues and they are aware of the possibility that this could have been a tragic accident,” said Russell Berman, who has served as an executive producer on the duo’s shows since 1992. “As a company we are all devastated and are hoping that this is just a case of prolonged post-traumatic stress, and we are confident that in the coming weeks and months, we will be able to move on and continue to work with our artists.” While the deaths of both men have been ruled homicides, the Los Angeles County coroner ruled their deaths “undetermined�", "The next Biennial should be held in 2020.   The 2019 & 2020 editions were held in Tübingen, Germany, and Beijing, China; the 2019 show was curated by Felix Kaplan and featuring works by sixty artists. The 2018 edition was held in Venice, Italy, and featured the first exhibition of work by Igor Simões; the 2020 edition will be hosted by the city of San Francisco, which will host a new series of events in commemoration of the tenth anniversary of the Biennial. \n\n\nThe Palestinian Museum of Treblinka, which opened in the city of Tarkiba in 2015, is facing a lawsuit from a group of descendants of a woman who was executed by the Nazis in the gas chambers of the Auschwitz concentration camp. The civil lawsuit was filed by a group of four hundred descendants of Hamida Shalom, a twenty-seven-year-old Palestinian girl who was executed for refusing to join her mother and sister in a forced march to the gas chambers in March 1942.According to the lawsuit, the four hundred descendants alleged that their mother was executed by the Germans as a “poster child” for refusing to convert to their religion in order to save her sister, who was murdered shortly", "The next Biennial should take place in April 2020 and will be hosted by the museum in conjunction with the local city government in order to improve accessibility.  According to a statement by the Biennial, the upcoming exhibition will offer an \"up-close look\" at the Middle East, with work by artists such as Maha Taha, Adrienne Atget, Shimon Danielewski, Eva Fung, and others.Commenting on the upcoming exhibition, biennial director Frank Gaffney said: “We are delighted to be able to unveil the first exhibition dedicated to the Middle East at the Museum of Contemporary Art. The exhibition will offer a unique interdisciplinary perspective through works that were created in the Middle East by 120 artists. Art historians, curators, artists, and scholars will be able to engage with the exhibition on an unprecedented level.”\n\n\n\n\n\nIgor Popov-Savic, the director of the Stedelijk Museum in Amsterdam, has been appointed the successor of the institution’s current curator, Anna-Sophie Olsson, who has led the museum since 2011. In the new role, Popov-Savic will become curator of “Xavier Hiltjo:", "The next Biennial should open as soon as possible and will give the public a chance to experience the exhibition again, with a view of the exhibition, the Turin Palazzo di Rivoli, and the famous Turin Water Tower, which was constructed in 1931. The exhibition will also take advantage of the city’s extensive public space and offer a variety of educational and academic programs for children and young families. “The 40th Venice Biennale is an ideal opportunity to present the work of the iconic artists of the city, two of the most important pioneers in the history of Italian modernism, Giacomo Maestro Ligotti and Piero Manzoni, as well as the last sculpture of a Renaissance master, the great Sandretto Re Rebaudengo,” said Biennale director Lucio Cipoli.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed David C. Driskell, who currently serves as director of the institution’s Center for European Painting and Design, as its next president. Driskell will take up the post on January 12, 2020.“His appointment marks an important moment for the Museum of Modern Art as we celebrate the centenary of the", "The next Biennial should be held at the same location as the first, in the same year, and should draw a total audience of twenty-eight thousand people. The new exhibition will feature thirty-one works by forty-six artists, including the four finalists: Minou Yoshida (Japan), Ishita Sugimoto (Japan), Mana Kawamura (Japan), Koji Inada (Japan), Matthew Lee (Australia), Richard Sumner (United States), and Laura Owens (Australia). The exhibition will also feature new works by the finalists, who will receive a prize of $10,000. The first Biennial, titled Biennial B, opened on October 27 and runs through March 11.\n\n\nThe Italian government plans to establish a new $60 billion fund to compensate cultural institutions in the country that have lost revenue as a result of a severe drop in sales following the coronavirus pandemic. The funds will be held by the Italian Cultural Heritage Fund (Cineme), a new $35 billion initiative dedicated to promoting the preservation and promotion of cultural heritage across Italy, and will be created by combining the funds from the Italian Ministry of Foreign Affairs and the Italian Ministry of Culture.“We are", "The next Biennial should be held in 2021 or 2022. “It is extremely important for the arts to be able to reach people in all parts of the world,” said Zainab Akhtar, chair of the trustees of the prestigious foundation. “As events such as the coronavirus and the pandemic unfold, we are hopeful that this year’s is one of the many years when the arts can reach every part of the world.”\n\n\nOn Saturday, the Los Angeles County Museum of Art (LACMA) came under fire for removing a series of works by the Japanese artist Tadao Ando, who is widely recognized in the United States as one of the first modern Japanese contemporary artists. The museum, which was working on a major renovation project in its Tenderloin location when it decided to remove the works without the author’s consent, was deluged with angry e-mails and text messages from critics who criticized the move as a violation of Ando’s privacy.The institution decided to give the artist a month to remove the three works, which were part of a series entitled “Abandon All Your Thoughts,” no later than July 25. The", "The next Biennial should focus on the history of art in the city’s public spaces, and should focus on how the city’s museums are reshaping their collections to reflect the local needs and aspirations of their cities. A Special Exhibition should be staged on the themes of urban life and the landscape, and the exhibition should be curated by an independent curator.The new biennial organizers made it clear that the theme of the event will not change from the old biennial, but it will evolve according to the needs and views of the city’s residents. While the exhibition will be divided into ten sections, each section will begin with the theme of the event and will end with the theme of the artist. The new section on The Waters, which will be curated by Konrad Bode, will explore the connections between water and life. “The theme of the Biennial is not to change art, but rather to create a new dialogue between art and the city,” said MOSCHINE. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Gerald Celente as its next director. Celente joins the institution from the Santa Monica Museum of Art (SMO), where he has served as interim", "The next Biennial should take place in the spring of 2020.\n\n\nThe Yuz Museum in Berlin, which is currently closed due to the Covid-19 pandemic, is planning to reopen in March 2021. The reopening will mark the first time the museum has been open since March 13, 2021. The plan is to move all of its exhibition programming and the entirety of its collection to the museum in an attempt to minimize the spread of Covid-19. It is also limiting the number of visitors to the museum as much as possible. After all, the majority of the museum’s current audience consists of museumgoers who have not yet developed symptoms of the illness.According to the German daily Die Tageszeitung, the plan will allow the museum to welcome as many as sixty thousand visitors next March, and will also allow the institution to temporarily close its doors to the general public. In an attempt to avoid overcrowding, the museum is giving visitors the option of staying in the same room as the exhibition space. The new Yuz Museum has yet to release a figure for how much it will cost the institution to reopen, but said that it will be able to open in the same fashion as it did before the pandemic began.", "The next Biennial should be held in the summer of 2022. The institution is also considering the possibility of holding the exhibition in the winter, but it is not yet certain whether this will be feasible. “We are always discussing how the exhibition can operate in different ways and simultaneously promote the message of the museum, and how to create a new kind of creative experience,” said Maeva Keller, the director and chief curator. “This is one of the main challenges for the new exhibition.”The Biennial will be inaugurated with a public exhibition at the museum in the summer of 2022. The Biennial will also include a private exhibition of works by the artist in the fall of 2022. The full list of participating artists is as follows:Andreas Becker (Netherlands), 2018(First New Works)/Autumn/Autumn/Spring/SpringEdition, 2018(First New Works)M.A.P. (Germany), 2019(First New Works)Mariane Boehm (Germany), 2019(First New Works)Marianne Brodbeck (Germany), 2019(First New Works)Maud Comin (France), 2019(First New Works)Marianne Cammock", "The next Biennial should be convened by the end of the year, and the theme should be “The Dynamics of Revolution.” The first iteration, “Revolution and Revolution,” was staged at the Rabkin Museum in Paris in September 2018.\n\n\nThe Metropolitan Museum of Art in New York has appointed Kate Slocum as its next director. Slocum succeeds David Kojak, who has led the museum since 2013 and will depart on January 8, 2020. She succeeds John Catapano, who announced his resignation on January 5, and will take the helm from him on January 6.“Kate brings with her a wealth of experience and knowledge in the field of contemporary art and is well-positioned to lead the Met through this challenging and challenging time,” said John LaBate, the museum’s director. “Her record of success—she has led the museum through the most recent iteration of the Met’s annual exhibition ‘Rebuild Your Life,’ as well as the current iteration of the Met’s ‘One Hundred Years of Art” series, and the museum’s most recent major reopening project, “The Met,” which opened in", "The next Biennial should take place in 2022. The Biennial will then hold a retrospective of the work of Lévy Gorvy’s Olivier Assayas, which is currently on view in the French city of Paris. The exhibition will also feature the work of Joël & Jean-Luc Gnat, the brothers whose Gorges Gallery in Paris is currently preparing to open a branch in the city. The Biennial will be held at the Museum of Modern Art and will run from March 21 to March 23, 2022.\n\n\nThe National Endowment for the Arts (NEA), the National Council on the Arts (NCA), and the Architectural Association announced that they have reached an agreement that will allow the public to keep five artworks for every new building constructed in the United States. Under the terms of the $3.2 trillion stimulus package, the buildings’ construction and upkeep costs are being held accountable for the amount of revenue generated by the works. Under the terms of the agreement, the NEA will receive $2.7 billion for revenue-generating activities, including recruiting, preservation, and conservation, and the NCA will receive $2.5 billion", "The next Biennial should be held in the autumn, in the city of Algiers. You can also organize a tour of the museum in your area by visiting the “Algiers Biennial” page on the museum. The next iteration of the fair will be held in October. The exhibition will be held at the Museo de Arte Contemporáneo in Barcelona. The artist-run fair will continue to operate under the title Algiers Archiv in the city of Aradiza. As of October 13, the exhibition had 5,650 participants including artists, collectors, and institutions.\n\n\nThe Christie’s auction house announced today that it is expanding its Hong Kong office worldwide. In a move that will likely alter the trajectory of the region’s auction house, the Hong Kong branch will now be able to participate in the prestigious Hong Kong Fair as well as the Hong Kong Art and Culture Summit. The announcement follows Hong Kong’s receipt of a special $1.25 billion gift from China\u0097the first time the mainland Chinese government gave the region a direct investment piece of the $4.8 trillion, or 60 percent, Hong Kong business district\u0097that was wrapped up this", "The next Biennial should take place in the summer of 2021. The institution will be moved from the city of Detroit to the Charles C. Evans Art Museum in Bloomfield Hills, Michigan, and will inaugurate the new museum, which will be inaugurated by artist Jonathan Pryce.\n\n\nThe University of Washington in Seattle announced today that Elizabeth A. Farquharson, who has served as a senior curator at the museum since 2004, has been promoted to associate curator of art history. Farquharson comes to the institution from the Seattle Art Museum (SAM), where she has worked since 1985. She succeeds Catherine Miller, who retired in 2016 amid accusations of sexual misconduct.“For more than two decades, Elizabeth has proven herself as a gifted curator with a strong record of challenging the boundaries of what it means to be a curator,” said Michael Helmer, director of the Seattle Art Museum. “In the current climate, she is uniquely qualified to continue that work. Both in her ability to bring new ideas to the table and in her ability to inspire. We look forward to her continuing to advance the museum’s mission to present the best contemporary art.”During her tenure at SAM, Farquharson helped develop the", "The next Biennial should be held in 2022.The program was established in 1984 by artist and curators John Lobb and Robert Irwin to address the retreat of the art world from the United States. The concept was borrowed from the art world’s retreats in Europe and the United Kingdom. The artist-run exhibit was inspired by several years of photographing people at art institutions.More than 150 artists, including Tanya Huffman, Carolee Schneemann, and Pierre-Auguste Renoir, have come to the Venice Biennale for its 150th edition, which runs from March 26 to March 28. The exhibition will be accompanied by a host of projects that are being organized in collaboration with local, international, and national institutions.“Since the 1970s, the Biennale has been a platform for the dissemination of the work of artists who are universal in nature,” said Benedetto Cattelan, director of the Schirn Kunsthalle Basel. “The event is thus a great challenge for the artists working in the field. I am convinced that, together with the artists, this year’s Biennale will be an unforgettable one.”\n\n\nCultural figures", "The next Biennial should begin in 2020. The roadmap for the upcoming edition is as follows: 1. New Art, 2. New Places, 3. New Cultures, 4. New Categories, 5. New Acts, 6. New Photos, and 7. New Television. The theme this year was HEART. Wang, a Beijing-based artist, described his yearlong project as an attempt to do “something different” in his art. Wang added that he hopes the series “will be a kind of springboard for others to begin their own projects, or to develop their own narratives.” Wang has yet to receive any financial support from the Museum of Contemporary Art Beijing, and his exhibition in the exhibition hall this year was co-organized by the Beijing Art Museum and the Beijing Art Museum.The Biennial, titled “Away from the Stage,” is part of Beijing’s plan to open a new art museum. The city has been working on revamping its Minsheng Art Museum since 2006, and the Minsheng Art Museum’s first exhibition, “WHY ART?,” was staged in April 2007. The show was inspired by questions posed by a", "The next Biennial should focus on the history of art and design in New York City and its impact on the city’s landscape and people. The exhibition will also showcase the work of contemporary artists whose work has been previously overlooked.This year’s event, “under the direction of s/he/it,” will inaugurate a new platform, the Bolshevik Biennial, which will present thirty works by artists from twenty-eight countries. The inaugural exhibition, “Art After Chernobyl” is slated to open in the United States in late April. The Bolshevik Biennial will be hosted by the Museum of Modern Art in Moscow from March 15 to March 22 and will be comprised of approximately eighty works from twenty-four countries.The biennial will also be organized as a collaborative project between the Museum of Modern Art, the Los Angeles County Museum of Art, and the Metropolitan Museum of Art. “It is through the biennial that we hope to seek the contemplation of the themes that have never been considered before in art history,” said biennial director Jassim Sarkis. The exhibition will be presented without predetermined curators and will focus on themes of the day—for example, the", "The next Biennial should focus on the history of the art, its production, preservation, and exhibition in the city. The schedule for the exhibition should incorporate contemporary artistic practices, as well as New York’s history of art and architecture. The biennial should draw on the work of contemporary artists, including Kristen Stewart, Eva Hesse, Justin Hurwitz, and Mark-Paul Motta, as well as from across the globe.\n\n\nThe International Confederation of Fine Arts (ICFA) in Naples, Italy, has promoted the return of twenty-seven works by American artists in the Italian capital. The works, which were on display in the exhibition “Los Angeles” in 2016, were exhibited at an exhibition on “American Art” organized by the Grand Avenue Museum of Art in Los Angeles in 2017.According to the New York Times, the exhibition was protesting an exhibition that criticized California’s cultural sector, and in doing so, it drew a sharp rebuke from the state’s attorney general, Kamala Harris, who declared the exhibit “without foundation and without foundation.” In 2017, the exhibition was the catalyst for the city’s reopening of the Los Angeles County Museum of Art, which was", "The next Biennial should be in the spring of 2020. The new venue will be attached to the Zurich Art Museum, and will be inaugurated by a biennial exhibition of art in collaboration with the Royal Academy of Fine Arts (RAFA).  \n\n\nAs the number of people living with HIV in the United States continues to rise, the number of states that have legalized medical marijuana in some form is on the rise. While the drug remains illegal under federal law, the number of states that have made some form of concession to the movement—or have already made some form of progress on this front—is on the rise.The twenty-seven states that have made some progress on this front—Arizona, California, Colorado, Florida, Illinois, Nevada, New Mexico, and Texas—are collectively projected to tally more than one hundred million people by 2026. While the drug is still illegal under federal law, the number of states that have made some progress on this front—Arizona, California, Colorado, Florida, Illinois, Nevada, New Mexico, and Texas—is on the rise.The states that are projected to have the greatest percentage gains in the number of people living with HIV are North Carolina (10%), followed by Ohio (9%), and South Carolina (", "The next Biennial should be held in 2020, and the first in 2021.\n\n\nThe Östlund-Platz Museum of Art in Karlsruhe, Germany, has been awarded the $28 million Göttingen Art Prize, which came after it commissioned artist and theorist Irena Haiduk to create a new work on its grounds in December 2019. The prize was awarded jointly by the museum and the Südwestdeutsche Zeitung (SAZ) in a ceremony held in the city of Göttingen on January 19.“Irena has created a new work for the Göttingen Art Prize that is both beautiful and challenging,” said Alexander Krüger, the city’s deputy mayor. “We are very happy with the result and think it will be a great addition to the Göttingen Art Prize collection, which is very strong.”Haiduk's work, which was commissioned by the city of Göttingen in collaboration with the artist Henrik Fjellström, was selected for the special exhibition “From People to Places: The Politics of Place,” which explores the concept of re-location—with the artist in partnership with", "The next Biennial should take place in 2020. Prior to joining the university, Larson was associate professor of fine arts at the Rhode Island School of Design, where she worked on the exhibition catalogue for the 2003 exhibition “We Care’ More,” and has held fellowships at the Perrotin Gallery in Paris (2009); the Sherwood Art Museum in London (2011); and the Museum of Modern Art in New York (2015).\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Carolyn J. Pigott as its next director and CEO. Pigott succeeds Nancy Spector, who has led the institution for more than twenty years, and will be responsible for driving the museum’s transformation, beginning in the fall of 2020.“We are delighted to welcome Carolyn to the Guggenheim,” said Guggenheim director André Samuel. “Her professional expertise and personal commitment to philanthropy and community-building make her an ideal leader as we work to transform the Guggenheim into a more inclusive, sustainable, and inspiring public space.”Pigott joins the Guggenheim from the Metropolitan Museum of Art, where she had served as deputy", "The next Biennial should showcase the work of the artists whose work engages with social justice issues in a meaningful way,” said the festival’s executive director, Cindy Sherman. “The Biennial will be a time for the exhibition of the work of the most important artists of our time and a place for the exchange of art.” The 2019 edition of the biennial will take place at the New Art Museum in New York. \n\n\nThe Los Angeles County Museum of Art (LACMA) is planning to throw its annual Theater Workshop, a free event that was held last year, in January 2020, in an attempt to ease the financial strain on the Museum of Modern Art (MoMA) following the events of September 11, 2001—a day on which MoMA reopened only a month later. The move comes amid a multiyear $100 million renovation and expansion of the arts complex.“The Museum has been in a holding pattern for the last two years,” director Michael Govan told Artnet. “We have been discussing with our staff a few times about rescheduling the workshop, but we are not prepared to move forward with a workshop that will disrupt the continuity of programming at MoMA every day", "The next Biennial should be held in 2022, with the first exhibition at the new venue to open in the spring of 2024. The 2019 event was co-organized by the museums and was directed by Alberto Burri, director of the Museo de Arte Contemporáneo at Barcelona.Dubbed By the Ocean, the exhibition was curated by Cindy Ho, director of the George A. Lucas Museum of Art in San Francisco; Jose Almena, director of the Mary Boone Gallery at the University of Kansas; and Katsu Naito, curator of contemporary art.\n\n\nThe Indian American Museum (IAS), a historic New York institution that has been a hub for cultural exchange between the city and state, has announced its retirement. The museum, which currently has a permanent collection of more than 3,500 works and exhibition replicas, shuttered its doors on March 31 and laid off 120 staffers in an attempt to reduce costs as it works to preserve more than four hundred works from the collection. According to a release, the museum will begin the process of removing the works from its premises and moving them into storage facilities and will oversee the restitution and conservation of works by racial and colonialized groups, including the", "The next Biennial should take place in November 2021. The course will include a selection of works by women artists from eighteen countries and the US and will consist of a series of lectures, an exhibition, and a public lecture program.\n\n\nThe Chinese artist Zhang Yaxuan has been selected as the winner of the 2019 Visual Arts Prize. The forty-six-year-old Chinese artist, whose work spans painting, sculpture, photography, and video, was awarded the prestigious $100,000 prize for his contribution to the field of Oriental art from the same institution, the China Arts Museum (CAM), in Beijing.The award ceremony took place on Thursday at the Beijing Art Museum. Zhang was also awarded the 2019 CAA’s Artist’s Prize, which is the largest award for Chinese artists in the United States, and the 2019 TWT China Arts Prize, which is given to the top ten artists from China in the United States. Zhang’s work will be presented in an exhibition at the CAA’s Hong Kong branch later this year. The artist’s collection includes works by Wang Jianzhu and Qiao Wei, both of whom won the Lanshan Art Museum’s Artist’s Circle Award", "The next Biennial should be presented by the museum in 2022, and the first exhibition should open in the spring of 2023.\n\n\nThe French ambassador to the United Kingdom, Patrick Drahi, has been invited to London for a new exhibition, “France: From the Birth of the Nation,” in February 2024. The show will be a sequel to the annual event held at the Museum of London, and will include new works by artists such as Pierre-Auguste Renoir, Michelangelo Antonioni, and Jean-Michel Basquiat.In a letter sent to the collection this morning by Jean-Pierre Sender, the deputy director of the Musée d’Art Contemporain-Paris (MCA), the exhibition will follow a three-year exploration of the history of photography in France. The work, titled “Péditions de l’autruche: Les mantains négociés,” will be accompanied by a digital reenactment of the medieval cathedral in Paris. The MCA will stage the show March 14–March 18, 2020.“As part of our mission to present the world’s paintings and sculptures, we choose to engage with contemporary art", "The next Biennial should be held in 2021, and the event’s executive director, Frances Achenbach, told Artnet that a new iteration of the exhibition would be organized in collaboration with the artists whose works will be included in the next iteration. The 2019 edition marked the last exhibition staged by the Drax Museum in Amsterdam. \n\n\nThe Fine Arts Museums (FAMs) in Ljubljana, Slovenia, and the Museum of Modern Art (MoMA), New York, have joined forces to organize a major $110 million restoration project for the former Bolshoi Ballet theater in New York. The $100 million project, which will include the overhaul of the theater’s interior and exterior, is part of the consolidation of the two institutions in the city.The partnership between the museums comes at a crucial juncture for the two institutions. Ljubljana’s proposed $74 billion expansion, which was approved by the city council in December, is expected to be completed this spring. The construction of the Lena River in the city of Ballet Rock, which will bring new public spaces and restaurants, and the construction of the Bolshoi is currently underway. The expansion project is aimed at revamping the", "The next Biennial should be unveiled in the coming months, and the exhibition should open in mid-January 2020. The next edition should be led by Karl Lagerfeldt, an internationally acclaimed curator and an internationally acclaimed director of the Künstlerhaus Berlin. The pavilion will be decorated with new works by three international artists, two of whom will also be featured in the exhibition “Koenig & Lagerfeldt: #1, 2017.”\n\n\nThe Pérez Art Museum Miami (PAMM) has added two new artists to its roster, J. Paul Getty and Mary Cassatt, in a move that aims to further engage with the local cultural and historical landscape of the Deep South by highlighting contemporary art and its impact on the community. “The Pérez Art Museum Miami is continually recognized as one of the most important institutions in the region,” said PAMM director Andrés Manuel López-Sánchez. “It is precisely this commitment that has led me to select these two artists to represent us at the Pérez in 2020. We are pleased to be able to present them at such an important cultural institution, which has a significant role in", "The next Biennial should be held in 2020. In a letter to the organizers, Baroness Anelay said: “We are pleased to have been selected as the first biennial to showcase the work of the distinguished artists who have made significant contributions to the study of the biennial’s theme. We are especially grateful for the support of the partners of the first biennial and for the participation of the public in the new edition of the Biennial, which is currently underway.”\n\n\nThe Rosenwald Museum of Art in New York has received a gift of sixty-five works by forty-six artists\u0097later this month will present an exhibition featuring the work of thirty-nine artists\u0097in its fourth season, the Museum of Modern Art (MoMA), in New York, which will reopen to the public on September 26. Titled “Born in the Image of the Self: Artists in the Lives of Others,” the exhibition is curated by Carla McDonald and will feature work by artists such as David H. Larsen, Barry Alberts, and Robert and Barbara Kruger, as well as work by artists whose work has yet to be placed in an exhibition. The event will also introduce a new", "The next Biennial should be held in 2022. “Our current plans are to present the exhibition in 2021, and to continue to present the show in 2021, but there is a possibility that we may reconvene this year, ‘therefore the twentieth,” Adam Gass, chair of the board of trustees of the Biennial, told the Art Newspaper. “I think it’s important for us to keep our options open,” he said, “and to consider what is next.” Among the performances that will be staged in the exhibition’s rebuilt location is “Theater of Operations: The Gulf Wars 1991–2011,” which was staged at the Nineveh Museum in Iraq from 2002 to 2011 and was staged by a team of seventy artists. The exhibition is organized as a series of multi-platform commissions, which will each take up the themes of the exhibition, including “The Gulf Wars 1991–2011: War and Peace” (2017), “After the Fall: Scenes from a War Cinema” (2018), and “After the Bomb: The Bomb and the Bombings in Vietnam” (2019). The show is curated by Ara Nusseib", "The next Biennial should be held in 2021. We look forward to working with you.\n\n\nThe Hogarth Museum of Art in New York has launched a new digital platform that will allow visitors to view and purchase artworks from the museum through a range of digital and physical means.The platform, called Hogarth Live, will feature over 2,500 artworks, including works by artist-in-residence Anne-Marie Dougall, whose recent exhibition, “Nothing is Real,” at the New York Museum of Modern Art opened on June 3; works by American artist John Khan; and a selection of works by artist-in-residence Anna Atkins. The website will also include a digital gold mine of rare works by the curators of the upcoming edition of the Hy-Vee Biennial, which will include works by artists such as Nick Cave, P. K. Klotz, Hal Foster, and Janet Cundie.Hogarth Live is not a replacement for the Hy-Vee Biennial. The platform will introduce new ways that visitors can experience and purchase works by artists and will help people understand the importance of learning more about art history by visiting collections online and learning by watching videos, reading reviews, and listening", "The next Biennial should have been staged in 1858 where after the slave trade was abolished, the work was destroyed. The decision to postpone the event was made by the organizers because they were concerned about the reopening of the Slave Markets in the United States and Europe. “We needed time to think about it, to rethink it, to consider it,” said Jane Eyre. The upcoming triennial will be a “strong expression of the biennial’s commitment to both the exhibition of the exhibition and its future. . . . We are currently in the process of developing an online version of the exhibition. We are also working to create a biennial of contemporary artists that will take place in Istanbul over the next few years.”The Biennial of Work, launched in 2008, has hosted work by twenty-nine artists, including Nari Ward, Carlton Pearson, Josh Smith, and John Williams, among others in its eighty-five-year history. In a review published in the May/June 2019 issue of Architectural Record, David Cone wrote: “The show, which is housed in an exhibition space in an industrial park in central Istanbul, will include work from an assemblage and textile arts complex in the K", "The next Biennial should be held in the spring of 2021. “Surreal fiction is a perennial source of inspiration for me,” the artist said. “The art of making art is most important and is my constant task. I am grateful that I have been able to develop this way of working for the last twenty years, and that it remains a core of my practice. I hope that this exhibition will prove to be a catalyst for critical reflection and a source of inspiration for others.”Though art has been a staple of her stage career, the California native is best known today for her ethnographic descriptions of her childhood in the small town of Chihuahua, near Los Angeles, the birthplace of the artist-in-residence, Ella Chetwynd, and the Contemporary Art Museum of Los Angeles.  “The history of the exhibition is a tribute to the way it reflects the authentic and lived experience of the Sonoma Valley,” said Michael McHugh, the director of the Contemporary. “Ella Chetwynd is the embodiment of the '70s counterculture, the central figure in the development of the Biennial, and the visionary foundation for the show.", "The next Biennial should focus on the history of the exhibition, which was held at the museum since 1985. The first iteration of the event, which took place in June 2019 and was broadcast on PBS Frontline, featured work by thirty-seven artists. \n\n\nNew York City–based artist Taylor Rinaldi, whose work combines body and form through geometric geometric and sculptural devices, has died at age fifty-eight at his home in Dorchester, Massachusetts. The cause of death was pneumonia, but the cause of death was also pneumonia due to complications stemming from a viral outbreak.Rinaldi, a New York–born, Massachusetts–based artist and member of the line-drawing group Ateliers International de Ligne (AiL), was born in Cyprus in 1939. When he was four years old his family relocated to the United States, and Rinaldi soon learned that the family could go to Canada to live and work in peace. Instead, he began his career as a sculptor. Rinaldi went on to study at the School of the Art Institute of Chicago, the University of Pennsylvania, the University of Minnesota, and the University of Texas at Austin. He returned to New York in the early 1950s to pursue a career", "The next Biennial should be in 2020. Andrea Bienni, the director of the Museo de Arte Contemporáneo Bienal (MASB), wrote about the condition of the exhibition in the Art Newspaper on March 31, 2020, when the exhibition was still in its initial planning stages. She said: “The fight against racism and inequality is not an event confined to one country. The fight is a global one, and it must be fought on every continent.”\n\n\nThe Institute of Contemporary Art (ICA) in New York has appointed Peter and Louise Haag as its next principals. Peter Haag comes to the ICA from the New Art Institute (NAI), where he has served as director of exhibitions since 2016. He succeeds Richard Mayhew, who departed the ICA in April 2019 to become the executive director of the Art Institute of Chicago, and will take the reins of the ICA through the end of the 2020 year.“We’re in the process of vetting a candidate for the ICA leadership, and Peter is a leader in the field who brings an excellent record of strategic vision, deep expertise, and ability to bring communities together,” said James Cuno,", "The next Biennial should be held in 2020 and is currently collaborating with the Institute for Contemporary Art in the City of New York. Simone Biles, the president and director of the French biennial, told France24 that the institution would like to organize the next edition in 2019, but that the current schedule is not possible due to the ongoing health crisis. Horacio García-de-Souza, the director of the Biennial de Triennale, told the New York Times that the next edition will take place in the spring of 2021. This year’s exhibition, “The Painted Palace,” was given a retrospective at the Spanish Biennial in Madrid last month.\n\n\nThe Museums Association (MA), a United Kingdom–based advocacy group for museums, announced today that it has received twenty-six applications for the 2020 Rome–based prize, which honors outstanding contributions to art in the city. The collaborative award, which honors the achievements of five artists and will be handed out at a ceremony at the Italian capital’s Palazzo Arti in March, is one of several initiatives that the organization offers to support contemporary art.“The 2020 Rome Prize is a great honor and a great responsibility,", "The next Biennial should be launched in April 2020. \n\n\nThe Mall of America in New York has appointed William Paull, its former director of communications and curator of contemporary art, as its next director. Paull comes to the institution from Art in America (A)T, where he has served as associate director since 2015, and will assume his responsibilities in early February.“We are thrilled to welcome William to the Mall,” said Kasandra Kuzma, director of the Mall. “Although he has not previously held a position in communication or contemporary art, he brings a fresh perspective and keen interest in the intersection of art and history, particularly with reference to the Mall. We plan to work closely with him to ensure that the artistic and historical legacies of this iconic institution are fully met.”During his tenure at A)T, Paull worked as a curator and writer, and curated exhibitions centered on the artist-created Las Vegas megastructure at the Art Institute of Chicago and at the Art Museum of Chicago; wrote books on early modernist, post-Impressionist, and French Surrealism; and curated a number of exhibitions. He also served as the director of the Museum of Modern Art in New York", "The next Biennial should take place in 2022. The American Society of Cinematographers (ASCO) has released a statement condemning the exhibition as “incomplete and misleading” and calling for it to be withdrawn. “At a time when the threat of violence against artists and activists has never been greater, it is essential that international discussions and fairs focus on dialogue and cooperation, not confrontation,” the statement reads. Michael O.Noll, president of the Association of Art Museum Directors, expressed his solidarity with the artists impacted by the Covid-19 pandemic. “Covid-19 has made clear that we are not where we should be in the United States. We must now focus on forging new partnerships with local, state, and federal governments to continue to support the nearly three million art workers in America.” A full list of exhibitors is as follows:Art Basel\n\nBlackRock, the asset management titan, which has suffered massive losses as the global health crisis worsens, is suing the United States for $1.4 billion in the form of a tax on overseas profits that could be passed on to consumers. In a complaint filed in the Southern District of New York on May", "The next Biennial should take place in 2021 to coincide with the 100th anniversary of the biennial. The Art Newspaper reports that the institution will hold the exhibition on May 13–April 1, 2022.The exhibition will be curated by Mathieu Bergé, director of the Bonaventure Gallery in Paris; Jacques-Henri Huillard, director of the Museum of Modern Art, New York; and Olivier Fauvre, director of the Museum of Contemporary Art, Paris. Bergé will work closely with director Nathalie Berman and curator Nathalie Berman-McIntyre, who is currently producing the exhibition for the museum in collaboration with the Museum of Modern Art, to ensure that the exhibition reflects the full range of contemporary art, with a particular focus on the work of women artists. The catalogue will also feature works by artists whose practices are within the current Academy Modern Art Japanese Contemporary Art Awards (AMAS), the biennial’s predecessor.\n\n\nThe Museum of Modern Art (MoMA) in New York is suing the New York City Department of Cultural Affairs (DCLA) over the deletion of a two-hundred-year-old collection of works by American artist George Nelson, who was tragically murdered by the NYPD in 1994. In a", "The next Biennial should be held in the year 2027. To date, the show has not been held in a city outside of the United States.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has released a statement regarding the death of artist and philanthropist Julius and Etta Stryker. The Strykers created the celebrated Stryker’s Abstract Expressionist canvases, which combine geometric shapes such as the cube, pentagon, and half-circle. For the last twenty years, the art-world institution has been co-sponsoring an exhibition dedicated to the family. The exhibition, “Atlas: The Stryker Family,” opened in London last January.The Met is currently working on a new retrospective of the family’s art. A digital exhibition of the work is currently on view at the museum. In a statement, the museum said: “Julius and Etta Stryker are celebrated artists whose work has been in continuous production since 1931. Their work has gone beyond the limits of the medium to affect transformational and transformative social and political realities. There is an unshakeable and powerful connection between the human experience and this work.”\n\n\nThe national museum in", "The next Biennial should be held in 2021, said Cecilia Alemano, the president of the Italian Fine Arts Museum, which is housed in the Museo dAllavile in Rome. Other timescale estimates for the 2020 edition vary between 2021 and 2023. The CANCELED FILMMAKERS’ ANNUAL SALE is a reminder that you can still buy films and TV series from the exhibitors—and from the very best foreign filmmakers. We hope you will join us for the 2018 edition of the WEFE, and for the future of cinema in Italy—and for an equal celebration of the work of Italian and foreign filmmakers at the Venice Biennale this year.Regard\n\nThe Art Newspaper has revealed the list of fourteen artists who will be featured in the twenty-third Venice Biennale, which will take place in 2021. The event will be staged in the city of Venice, the historic site of the ancient city of Venice, from March 12 through March 15, 2020. The twenty-second edition of the yearlong event, “Taciturna,” will be held at the Palazzo Veneto in Florence from March 18 through March 20, 2020.Fabrice Lé", "The next Biennial should also have a more inclusive and representative selection of the works that represent Australia, rather than a monolithic image of art.”The 2019 edition of the Venice Biennale will take place at the Venetian city of Venice, and will be held in December, 2020.\n\n\nThe Salvage Institute in Halifax, Nova Scotia, Canada, has received a gift of forty-five masterworks from the Sackler family. The works were displayed in a comprehensive exhibition at the institution, titled“The Complete Works of Amis du Sasso” (The Complete Works of Amis du Sasso, 2019), which was organized by the collection. The exhibition—which features more than 500 photographs by Pierre-Auguste Sasso, including Barbara and Jean-Luc, and includes works by F. W. Mabini, Chery Bisho, Abraham Zap, and Willy Leyendecker—was curated by Carol Lissak and Paula Achille, who recently received the commission to produce the first exhibition devoted to the collection. The works will be included in the upcoming exhibition “The Works of Amis du Sasso” (2019), which will run until May 20,", "The next Biennial should be held sometime in the first half of 2020, and the 2019 event is still on track for its first half in December. The exhibition will feature works by fifty-three artists, including Audrey Achenbach, Ann-Marie Barber, and Hao Yinan, as well as a selection of new works by female artists.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced the inaugural artists-in-residence in the museum’s new arrangement with the City of New York, which will offer residencies and provide financial support to artists in its collection.The funds will go towards the acquisition of works by forty-three artists, including Anton Chaitkin, Barbara Granick, Jane Helmer, and Marie Kondo, as well as three works on paper by an unknown artist, a work by Paul Gauguin, and a recent exhibition by Peter Hujar.“MoMA is proud to partner with the City of New York to help these artists achieve their ambitious exhibition goals,” said Christopher Bedford, MoMA’s executive director. “Our next handover, which will take place in November 2020, will involve the artists returning to the museum for a series of new exhibitions that", "The next Biennial should be held in the spring of 2021.\n\n\nThe French government has released a long-awaited set of regulations for the exhibition Art Basel Hong Kong. Developed by French architect Bénédicte Savoy and funded by French and Chinese officials, the new law will require the show to establish an operating budget, maintain a stable gallery, and pay employees.“By reopening in April, the exhibition will be able to more easily manage its physical space and will have had more time to consider the necessary adjustments to the exhibition,” reads a statement issued by the French Ministry of Culture, Culture, Science, and Sport (FranceMoCA). “This will enable us to create art that will be representative of the entire world.”The proposed changes were made after a March 2018 report by the French National Assembly on Culture, Art, and the Modern World found that the fair’s retail space was overcrowded and that the number of participants was far too low. The March report also stated that the Hong Kong pavilion was not showing enough modern art. In response to the findings, Art Basel said that it had listened to the demands of the French government and that it had strengthened", "The next Biennial should be held in February 2020. \n\n\nSydney’s Art Gallery and the City of New South Wales (New South Wales) are teaming up to launch a new mobile platform that will allow visitors to see and purchase works on site. Called the Art Gallery Viewing Rooms, the initiative will help the city’s art dealers by connecting them to more than twenty thousand potential buyers to help drive sales.“Sydney has a long-standing and successful art-world tradition of providing a unique and exclusive contemporary experience for people visiting our city,” said Mayor Mitch O’Brien. “This is a great opportunity to extend that tradition by bringing new and significantly-enhanced opportunities to people visiting our galleries.”The platform will be powered by a new service called the Art Gallery Connector, which will continuously monitor and transmit the location of available works by artists, galleries, and other curators. Users will be able to set their own time and place preferences, as well as create customized groups\u0097including artists, galleries, artists friends, and other similar categories. The platform will also include a number of search tools that can be used by individual collectors, large and small, to find the artist", "The next Biennial should be held in 2020 and will seek to present a new idea of human history through a combination of art and science. The exhibition will also include the works of ninety-three artists from fourteen countries. The theme will be “The Present.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Sherrilyn Iasi as its new curator of contemporary art. She will begin her new position in April. Prior to joining the institution in March 2019, Iasi served as the gallery director at the historic Tudor Revival site in Los Angeles.“Sherrilyn is a charismatic curator whose exhibition-driven approach has created a strong and enduring legacy as the creator of the influential and acclaimed shows ‘CULTURAL SOLUTION’ and ‘SUBJECT,”” said Tom George, chair of the museum’s board of trustees. “Her work has been central to the museum’s evolution as an institution dedicated to the study and exploration of the rhythms and rhythms of history and culture, and her curatorial vision will continue to shape the museum as we present more contemporary art by and about contemporary artists.”Since her appointment, Iasi has curated a number", "The next Biennial should be in 2021, and the first exhibition should be held in 2022.\n\n\nFrieze London and Frieze Biennial have announced that the upcoming edition of Frieze London will take place in December. The event will be organized as a biennial in the vein of the Art Deco era, with a budget of $34 million and a run time of three months.It will also feature a smaller number of works by artists such as Alexander Calder, Cynthia Gordon, Gia Lavigne, Marcin Mares, and Joao Miranda, and will be supported by the Frieze Foundation.“Since its inception in 1983, Frieze has represented the art of modernism and has won numerous awards,” said Frieze director Nandi Chaudhari. “We are thrilled to support the next editions of Frieze London and Frieze Biennial with a new kind of architecture: an expression of the spirit, conceived by artists and designed by artists, to reflect the spirit of the city.”The 2016 edition was held at the Barbican in London, and featured works by forty-four artists, including Ana Mendieta, Svetlana Lukashenko, and Svetlana Shagal, and was", "The next Biennial should be held in 2021. A selection of newly commissioned works will be presented by awardees across the globe.\n\n\nThe National Gallery of Canada has appointed Miko Carthy as its next executive director. In the position created by the government of Canada in 2019, Carthy will oversee the organization’s permanent collection and exhibitions, as well as its digital-only, on-site exhibitions and events.“Miko’s CV and track record of success speaks for herself and will serve as a strong foundation for the museum’s future success,” said National Gallery board chair Sarah Ahlquist. “Her leadership, vision and ability to build upon and improve upon the National Gallery’s existing collection and exhibitions will be crucial in helping the National Gallery to deliver on its promise to serve as a true model for the world.”Carthy comes to the institution from the Smithsonian American Art Museum (SAAM), where she has served as director since 2014, and will assume her new responsibilities in March. Known for her collaborative and thoughtful approach to curating, Carthy also helped the institution develop the new 200-seat, 360-degree platform for contemporary art and the National Gallery’s Digital Program, which", "The next Biennial should focus on the exhibition of work by a select group of artists, including Andy Warhol, Robert Irwin, and Jasper Johns, who collectively won the first edition. The theme for the second edition of the exhibition is “The Great Gatsby.” The twenty-third edition of the exhibition will also feature paintings by artists including Francis & Paul, Bruce Nauman, and Diana Naro, and will include a selection of works from the show “I.C.E.N.”—a show organized by CNA, the New Art Explorations group, and the Gagosian Foundation. The third Biennial will focus on the exhibition of work by artists whose work has never been on public view, such as Robert Irwin and Alfred Stieglitz. Its fourth iteration will be organized by the show “W. H. Norton & Sons.” The show opens on May 3.\n\n\nThe Tate’s board of trustees chairman, Hamish Anderson, has accepted a new five-year contract with the museum. For the past two years, the artist-run institution has been run by a board of directors comprising two women and one man. In a statement, he said: “", "The next Biennial should be held in 2022. “In the meantime, we are pleased to be able to present the exhibition of the first year of the new Biennial in Stockholm, which was staged in September 2019, with the greatest exhibition of the new generation, which was staged in March 2020,” Helsinki’s mayor, Martti Ahtisaari, said. Founded in 1987 by Martti Ahtisaari and Jari-Kristina Raynals, the exhibition was inspired by the Nordic art project “The Games of Life” and the upcoming seventy-fifth edition of the Art Basel Asian Biennale, which will take place in Beijing in August 2022.The exhibition will present some three thousand works by thirty-four artists. Its inaugural exhibition, “Abandonment in the Garden,” is just one of the many projects that have been established to address the growing global health crisis. In February, the United States announced it would divert $1 billion from its Cadillac tax--its largest infrastructure package since 1986--to address the crisis. In June, the European Union pledged to spend an additional $1 trillion on strengthening the region’s resilience", "The next Biennial should be held in 2020 and will be the largest exhibition of work by the artist at the Galerie V-Et and the following year will mark the thirteenth occasion when the theme of the year will be 'The Principles of Painting, Architecture, and Drawing'. In the twenty-first Biennial, the exhibition will be organized under the control of the collection and will feature works by the artist and his colleagues. The biennial will be hosted at the newly created Museum of Modern Art (MoMA) in New York and the Museum of Modern Art and its sister institutions in New York, Paris, and London. The forty-fifth Biennial will take place at the Museum of Modern Art in the same venue in 2020.\n\n\nThe Metropolitan Museum of Art in New York has appointed Diana Marx-Reeder as its next director. Among the museum’s board members are David K. Tanenbaum, chair; Stefanie C. Halperin, vice chair; and David S. Goodman, vice chair. The appointees were chosen from a group of five finalists that included Michael Nagy, William Gibson, Joan Miró, Billie Tsien, and Hannah Wilke.“We are thrilled that Diana has been selected", "The next Biennial should be held in 2021, with the designation of a permanent location for the fair.The exhibition will follow the theme of “Transhumanism: From Socialism to Transhumanism”--a four-part exhibition organized by the German artist and theorist Thomas M. Kuhn\u0097in which the artist proposes a transhumanist utopia based on the scientific study of biological and physical evolution.The exhibition will draw upon materials from the life and work of ecologist, designer, and futurist Svetlana Alekseyeva, who is considered one of the greatest Russian futurists; writer and artist Kulkarni, a proponent of early modern science fiction and a proponent of the utopian ideals of the late Russian mathematician Mikhail Lermontov; and contemporary artists such as Michaël Lucas and Isamu Noguchi.The exhibition, titled “Going Beyond Limits,” will be organized by the Art Gallery of New York and will be co-organized by artist and philosopher László Nemcova and the MIT Media Lab. The exhibition will debut at the Museum of Modern Art in New York on October 8, 2020 and will run until November 22, 2020. The inaugural Biennial will cover", "The next Biennial should focus on “the multifaceted role of visual art in our society. It should explore the interconnection of visual art and our contemporary lives.”The more engagement the festival is able to provide, the better. It has already proven a successful vehicle for artists whose work is in critical need of critical attention. Artists such as Richard Avedon and Jean-Michel Basquiat, whose work is currently on display in the museum’s fifth Biennial, and the likes of Pierre-Auguste Renoir, Pierre-Auguste Du Sarthe, and Pierre-Auguste Courbet, whose work is currently on display in the museum’s sixth Biennial.\n\n\nThe Institute of Contemporary Arts (ICA) in Prague announced that Joachim & Maria Morgenstern, the founders of Morgenstern Gallery in Vienna, have been selected as the next board members of the Association of Arts and Design. The award for best new organization was given by the Ljubljana Design Award in recognition of their growth in the art world.The first award was given by the Ljubljana Design Award for best new organization in 2006. In 2008, this year’s award"]