["The next Biennial should take place in 2020, but the timing is uncertain. IHR has expressed interest in hosting an international exhibition of work by some of the most talented artists in the United States, including Lisa Sommer, Marciano, and Barozzi, in 2020.\n\n\nThe Tate’s board of trustees has appointed Michael Hoberman, the chief executive of the firm Witherspoon + Barbet, as director. He succeeds Richard Betts, who retired in June after twenty-five years at the museum, and will take up the post in November. “Michael is a visionary, committed leader who has built his career on innovative and ambitious approaches to curating, operating and developing curatorial projects as a global team,” said Christopher Henry, chairman of the trustees. “We are proud to support him as he takes on these challenges and more as we continue to support Tate’s growth and success. Michael will be a fantastic director.”Hoberman has worked in the field of contemporary art for twenty-four years and is based in London. He is the former CEO and director of the online platform Artnet and the former president of the International Art Gallery Network (Iag)", "The next Biennial should be on the history of French avant-garde painting, with an emphasis on the contributions of Creole artists of the 19th century and ’50s. The next exhibition should be on the history of New York art, focusing on the contributions of African American artists of the Chicago-based Generation Project, which celebrates its fiftieth anniversary this fall.\n\n\nThe Kochi-based artist and philanthropist Arne Glimcher has been appointed director of the National Gallery of Art (NGA), India. The appointment was made by director K.V. Singh. Glimcher comes from the Gautram family, which also owns the British Petroleum company, and is currently the founder and CEO of the Gautram Group, which owns the French luxury goods chain Saint Laurent Group, and SONY-AMG, the Japan arm of Japan's SoftBank Group.Glimcher, who is seeking a new five-year contract, will take up the post on September 1. During his tenure, Glimcher will be responsible for spearheading a major restructuring of the NGA’s operation, which will be led by president and CEO Jana Krishnamurthy. The announcement comes after the N", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is partnering with the California Darkness Foundation (CCF) to develop a special exhibition featuring works by sixty artists and collectives in the city. Developed with the assistance of MoCA staff, the show, which will sit in the museum until January 31, 2021, will be free to the public but will not feature theatrical performances, large public events, or locations where food or beverages will be served.The 2019 edition of the event, “California Darkness: The Artist’s Legacy,” was curated by Harvey V. Anderson and featured works by thirty-nine artists, including Brandon, Calderón, and Karolina Wojtas, as well as works from artists such as Eric Hovde, Faujara Jamil, and Yvonne Rainer, as well as works by lesser known and more established artists such as Adrian Piper, Tanya Stein, and Joseph and Mary Pritzker.The exhibition will feature a selection of works from the museum’s collection that have been on display since 1958 and will include a discussion with Alex Katz, curator of the exhibition, about the legacy", "The next Biennial should aim to take up the theme, “The City and the River,” and will organize an exhibition of works by artists in the city, including Maria Iannone, João Cuervo, Eduardo Cesarco, and Ricardo de Castro. The exhibition will address the city’s rich cultural heritage and the city’s current urban planning, and will utilize a mix of contemporary and historic materials. The pavilion will be surrounded by sculptures and works on paper, and will include installations by Federico Pérez-Perez, Yaya Faraj and Léa Seydoux, and Olu Oguibe. “This is truly a moment of great change,” Iannone said. “The city of Rome is preparing for a major renovation, and we are already witnessing the culmination of the work of the city’s cultural and creative institutions: the reopening of the Palazzo della Scala, and the reopening of the the Forum. The Biennial will reflect this exciting moment and reflect the vision of the visionary architect Vittorio Cattelan. It will also renew the city’s relationship with the", "The next Biennial should be held in the fall of 2021. The museum hopes to raise $150,000 to carry out the renovation and to reopen in the spring of 2022.\n\n\nThe fifth edition of the Budapest Art Biennale has announced its lineup of participating artist-in-residence. The 2019 edition featured twenty-eight artists from twenty-six countries and territories, including Russia and India. The 2018 edition, curated by Sarah Loyer, featured twenty-four artists from nineteen countries and territories. In addition, the exhibition also featured a selection of world works, selected from a list of sixty-eight.The full list of participating artists, which comprises thirty-eight artists, can be found on the exhibition’s website. The 2019 edition of the festival, entitled Budapest 2020, was organized by BAM, the German public cultural organization, and was held at the Bálinta Center in Budapest from February 3 to February 26. The exhibition featured a retrospective of the work of artist-in-residence Valentin Fischer, who was selected from a shortlist of thirty-eight artists in March 2019. The artists chosen for the 2019 exhibition were Gertrude Bernat, Jakob Boeke, Mí", "The next Biennial should take place in the summer of 2022. The museum will also organize a special exhibition dedicated to women artists in 2020, an exhibition of work by women artists from 2018, and reopening the Museum in 2021 will be a priority.\n\n\nCécile B. Rinder and the Los Angeles County Museum of Art (LACC) have launched an initiative to increase the visibility of African American artists in the California dream. The initiative, called the “African American Arts Initiative,” will offer grants and will partner with local, regional, and national arts organizations to engage with African American communities and organizations in Los Angeles, the San Fernando Valley, and the East Bay.“I want the African American Arts Initiative to be a catalyst for change for the betterment of the Los Angeles region and beyond,” said Rinder. “The African American Arts Initiative will give local arts and cultural organizations a critical platform to engage with local, regional, and national artists, strengthening the local community and diversifying the LA region’s artistic landscape.”The initiative will also include the launch of the African American Artist Residency program, which will provide $500 grants to individuals who live in the greater LA area and are committed to supporting", "The next Biennial should be held in 2020. Even so, as the biennial “gets closer to completion,” the museum’s director Peter Galani said in a statement, “we are constantly assessing how we can best take our exhibition and exhibition program to meet the demands of changing times and to ensure the future of the exhibition, exhibition, and exhibition program for future generations.” \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Glenn Burke the director of its new outpost, the Art of the Party, located at 644 Fifth Avenue. Burke will be responsible for working with the Solow-run museum’s curatorial team and coordinating programming across the museum.“The Art of the Party’s team is truly extraordinary, dedicated, and driven,” Burke said in an statement. “Their style of curating reflects a deep understanding of the Art of the Party’s mission to transform the museum into an enabling environment for the arts. I’m thrilled to support this team’s creative vision and to shepherd the ART of THE PARTY exhibition through the next year.”In addition to Burke, two new artists have been commissioned to create works", "The next Biennial should take place in the autumn of 2020. The project team is currently working on a new exhibit format.\n\n\nAfter a year of organizing, the Museum of Contemporary Art (MoCA) in Los Angeles has come out with a new set of guidelines for exhibiting works by artists whose work is currently on display on the grounds of the museum. The guidelines, which were released on Tuesday, October 31, and were organized by MoCA director Christopher Wool, aim to make the institution “more transparent and responsive to community feedback.”The guidelines outline three steps artists can take to improve their exhibitions: 1) Create an online version of a work in the museum or online version of the work; 2) Maintain a relationship with the artist and/or the institution; and 3) Create a presentation for the public.Two will be chosen by the curators at the institution and the artists chosen are Marlene Arundathi, whose exhibition “Hard Times,” which will run from September 27–October 29, 2020, and Cindy Sherman, whose exhibition “Past Present,” which will run from December 16–January 13, 2021.“This new exhibition approach will enable MoCA to", "The next Biennial should be held in 2020, and the ten finalists for the 2021 edition have now been announced. The exhibition will mark the centenary of the signing of the Declaration of the Rights of Man and the Citizen (1908). The theme of this year’s edition, “Alliance between Man and Nature,” is “Building Bridges Across Time,” and will focus on how the biennial will contribute to the fight against climate change, with a view to promoting ecological awareness and a broader sense of community. The 2019 edition, “The Ecosystem,” was held in London, and the 2019–20 edition, “The Ecosystem 2.0: Changing Habits,” will focus on the actions and the ways in which the Paris Agreement can be further strengthened.The next edition of the Berlin Biennial will be held in 2022.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the proposed $1.2 billion expansion of the Museum of Modern Art (MoMA), which will add more than 1,300 works from the Metropolitan Museum of Art and the Whitney Museum of American Art to its collection. The plan will also add more than 1,400 works by", "The next Biennial should be inaugurated by a speech by the late Iranian artist Farsoon Saeedi, whose work explores themes of migration, the environment, and language and ethnicity. The theme will be “They Came to Conquer Us,” the title of an article by the artist which was published in The National the same year as the exhibition. The winner of the $250,000 prize will receive $170,000. The grand prize will be awarded during an award ceremony at the Oxford Museum of Art in the UK on March 30.\n\n\nThe Museum of Fine Arts (MFA) in New York announced today that it is planning to close for an indefinite period of time, beginning March 16, 2020, as part of a multiyear $100 million renovation and expansion project. The announcement comes on the heels of a wave of graffiti and painting activity in the city during the summer months, when the museum is closed, and coincides with the opening of MFA’s new permanent collection, MURPHY: THE AORIST, which opens on March 13.“The MFA has been galvanized by the energy and innovation of New York City residents for many years, and this renovation reflects that", "The next Biennial should take place in 2020. \n\nIn a letter dated January 5, 2020, the Art Newspaper in London wrote: “After a long and difficult consideration, it is decided that the next Biennial will take place in 2021. We call this decision ‘no longer a biennial,’ it is now an art project.”The letter continued: “The decision to end the year as we have had it since 1959 is not a decision taken lightly or quickly. It is a decision based on the fact that the twenty-fifth edition of the Biennial will not take place until 2022, and the twenty-eighth will not take place until 2023. We are committed to working with you, our creative partners, to create a new platform for art and artmaking in the future.” The full list of participating artists is as follows:Art Museum, New YorkArtists’ InternationalSara Benito & Ana Paula, BrazilRenan McCarthy, Ireland, USAStephanie Dewitt, UKCécile Bénétière, France, France, France, New York, North AmericaRené Bivoli, France, France, France, New York, North America,", "The next Biennial should take place in 2020. On Monday, Brazilian president Jair Bolsonaro tweeted that the year 2019 was the worst year for Brazil and the country’s art history. The comments were in response to a question about whether the year 2019 was a positive one. Bolsonaro said that his administration is committed to working with the federal and state governments to help Brazil continue to thrive. The biennial will examine the legacy of Brazilian art and will be hosted in the city of Matos, in the state of Pernambuco, and will be accompanied by a major exhibition. The biennial will also present a special exhibition, “Brazil: Beyond the Present,” at the Museu de Arte de São Paulo (MASP). “The event will be inaugurated by an exhibition of three hundred drawings by artists from across Brazil,” reads a statement from the museum. “The show will inaugurate the following year with a presentation of twenty-five works by the same artists.”\n\n\nThe Bessies, a New York-based nonprofit that supports artists and arts workers who are fighting for higher pay and improved working conditions in the visual arts, has received a", "The next Biennial should take place in 2024. The exhibition will feature a selection of work by artists who are in or close to the history of the exhibition, as well as some of the most significant works of art from the twentieth and twenty-first centuries. Each pavilion will include a digital installation by the artist and will be accompanied by an exhibition program that will follow the same format as the exhibition.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Steve Chiu as its next chief curator. Chiu comes to the institution from the Venice Biennale, which he has helmed since 2013. He succeeds David Marin, who retired in April after twelve years at the helm of MoCA following a three-year stint as director of the Los Angeles County Museum of Art (LACMA), and will assume his responsibilities in October.“Steve’s record of curating over eight thousand works since joining LACMA in 2013 is unsurpassed, and his ability to prioritize, foster, and develop new creative approaches and methods for exhibiting works is unparalleled,” said Mark Levine, chair of the museum’s board of trustees. “We are proud to support his visionary leadership of the museum and to witness all", "The next Biennial should be held in the spring of 2020.\n\n\nThe Lester Bangs Museum of Art in Cincinnati has appointed Allison B. Hunt as its next executive director. Hunt comes to the institution from the Museum of Contemporary Art, Houston (MCA), where she serves as the associate director of curatorial affairs and is currently working on an appended documentary about the city’s Black Lives Matter movement.“Alison brings a wealth of experience, expertise, and knowledge to the Lester Bangs,” said director and CEO Anna Molina. “Her leadership and vision to expand our public collection and public programming is critical as we work to develop the next generation of curator and organizer. We’re excited to learn more about her experiences, and her vision for the future of the museum, which is so much a part of what makes the city of Cincinnati special.”Recently named one of the 100 Most Influential People in America by Time magazine, Hunt most recently served as the curator of “Piercing the Veil: Art from the Black Radical Imagination” (2017–18), which explored the radical history of modernist painting and was presented at the inaugural Pérez Art Museum in Miami Beach in 2018. In", "The next Biennial should be held within a year.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Mike Rosenblum as its new associate curator of photography. Rosenblum currently serves as curator and director of curatorial affairs at the New Museum. He will assume his new responsibilities on November 7.“Mike is a decisive and thoughtful curator, whose work will ensure the collection’s relevance and impact on the contemporary art world,” said Mark Layden, director and chief curator of the museum. “His achievements in advancing the field and his dedication to the museum’s mission make him a strong candidate for the position of assistant curator.”\n\n\nThe Lincoln Center for the Performing Arts (Lincoln Center) announced today that Rebecca Williams has been appointed its next assistant curator of music and dance. Williams joins the institution from the Institute of Contemporary Art (ICA) at the University of Pennsylvania, where she has served as the chair of the department of dance and performance since 2011.“Rebecca’s research into the art of modern dance and her work at the Lincoln Center for the Performing Arts is as important today as it was when she launched her career in 2013,” said director", "The next Biennial should focus on the historical and artistic significance of the project, and will aim to present a series of performances, films, artifacts, and other works in which the artists create their own histories from the interstices of history. The exhibition will be organized as a way of bringing together the various contemporary artists of the Flemish region and the broader world. The programme will be curated by Meriem de Kooning. The inaugural event will take place at the Flemish Cultural Center Schädel's new location on January 20, 2020. The exhibition will be curated by Veronique de Hamilton. Last year, the Flemish pavilion was presented in honor of the promotion of Flemish artworks in the art world. The new venue will have a capacity of 5,000 people and will be inaugurated by a retrospective of the work of Oskar Heimer, which will showcase the work of twenty-six artists over a twelve-month period. The show will also feature a number of new works created by artists from the West and the East. The Flemish pavilion will be followed by exhibitions of work by artists in the Flemish Region, which comprises most of the", "The next Biennial should take place in 2021 and will be hosted at the Kunsthalle Basel in Switzerland. The selection committee will consist of Carol Anne-Marie Dengel, Celia Oxtoby, Amanda Roper, Paulina Schaffner-Ross, Thomas Schlegel, and Suella Zavits.  The exhibition will include a new work by Christopher Wool, a contemporary artist based in New York, and will be curated by Peter Grote, art director of Kassel-based artist-run space Opus.  MeyerArt and Luhring Augustine are the gallery and foundation partners behind the new exhibition, The Next Big Thing, which will open in March 2020.  The show will follow the inaugural exhibition of the artist-run space 八嗝園園 in Maastricht, and will consist of two iterations: First up was “The Subsurface,” a forty-minute installation by the Swiss artist Martine Blom, which was exhibited in the exhibition “Peoples of Planet Earth: The Subsurface” (2017), and “The Microscale,” an installation by", "The next Biennial should have a fully interactive exhibition space designed by Kohn & Bartos. ©2018 Kohn & Bartos, Inc.All rights reserved. The artist’s title is protected under the copyright laws of the United States and its territories. With the permission of the artist, Kohn & Bartos will use the artist’s artwork for promotional purposes, including in print and online media, and we will provide the artist with a royalty-free digital version of the exhibition. We hope that the exhibition will help strengthen the artists’ relationship with the Spanish National Museum, as well as promote art in general and the Spanish diaspora in general.Thanks to the Spanish Ministry of Culture and the Spanish National Board of Directors for their support of this exhibition. It is our hope that the work of the exhibition can encourage the artist to continue her work in the country and abroad.\n\n\nThe Museum of Fine Arts (FMA) in New York is taking action against a right-wing nonprofit that cut ties with the institution over its support of Palestine. The institution found itself in the middle of a controversy after the nonprofit, the American Friends of al-Aqsa Martyrs’ Cemetery, announced that it would no longer accept institutional funding", "The next Biennial should focus on the history of art, which is a topic that Panzo had already addressed in some detail in his book Art and a Body (1961). He suggested that the exhibition should focus on the symbolic relationship between sculpture and life: the history of art is a history of ideas, and life is the history of ideas.\n\n\nEdith Heath, the director of the Museum of London, has ordered the scrapping of a major retrospective of the work of American artist Salvador Dali. The exhibition was due to open in London in November 2020 but was pushed back by the Covid-19 pandemic. On Thursday, Heath announced that the exhibition will now return to the United States for its next iteration, which will take place in March 2021.The decision came after Heath and the curators of the exhibition expressed disappointment that the event will not take place in March. The exhibition, titled “The Art of Man” and curated by Michael Caine and Joachim Neugroschel, will now run alongside the full-scale renovation of the museum, which will be inaugurated by the exhibition “The Joy of Painting” (2019). “We are so delighted that The Art of Man will now have its twenty", "The next Biennial should be held in 2021, and the last in 2022.The biennial, entitled “The Importance of the Biennial,” was organized by the South African Museum of Fine Arts (SAMM), the National Gallery of Art, and the National Museum of African Art, in Washington, DC. Its theme was “The Importance of the Biennial,” and it featured work by seventy-three artists from twenty-six countries; fifty-three finalists; and ten artists whose works were selected to represent the entire continent.The biennial, which was founded in 1993 by a group of curators from South Africa, was supported by the British South African Museum of Art (B.SA.M., South Africa’s national museum), the National Museum of African Art (N.Mo.A., Cape Town), and the African Museum of Fine Arts (ABMA, Johannesburg), among other venues. The first edition of the biennial, “The Importance of the Biennial,” was staged at SAMM in October 1993. The second edition, “The Importance of the Biennial and the World,” was staged at the National Gallery of Art in Johannesburg in 2001", "The next Biennial should focus on the history of the art, and perhaps the work of the artist, and should feature both interviews and performances by the artists in the project, which is called Biennial 4.  The exhibition will open in the National Museum of Fine Arts in Tokyo in October.\n\nWorkers in China have been building a massive new anti-aircraft defense system in an attempt to stem the growing threat from the country’s homegrown terrorist group, the Islamic State (IS), which is attempting to carve out a new Islamic caliphate across large swaths of the globe. Chinese state media has painted a dire picture of the future for the army, which has been beefed up with new tanks, fighter jets, and surveillance planes, and warned that the country’s air defenses could be overwhelmed by the number of attackers.On Thursday, the State Administration of Science, Technology, and Communications announced that it had successfully tested the stealthy new ground-based anti-missile defense system in an attempt to deter the radical group. According to the New York Times, the Chinese military tested the new system in December 2017—a month before a group of North Korean soldiers executed two South Korean sailors, one of them a doctor, and took their corpses", "The next Biennial should take place in 2021, after which a new exhibition should open the same year. The new editor-in-chief, Ron Gidley, will serve as director of the next biennial. A selection of the biennial’s works will be presented by the artist in the form of a “miniaturized museum.”The biennial’s theme is the interdependence of all things and the life and death of the body, with a view to the future of life and death. The biennial will take place at the Guggenheim in the city of Rome, across the Adriatic from 3 to 7 September, 2020.The first edition of the Biennial was held in 1967 and featured work by over ninety artists. In the following year, the exhibition traveled to the Palazzo Vecchio, and Biennale Sant'Anna (1965)—originally titled “Panorama”—received the same designation. In 1967, the following year, the museum became the host for the first edition of the Biennial Ermanno Cattelan (1967), which was followed by “Panorama II: The Last Supper” (1976), “Panorama �", "The next Biennial should be held in June 2020.\n\n\nThe nineteenth edition of the Berlin Biennale, which was held in the city’s Federal Historical Museum (Berlin FIM) from March 21 to March 23, 2020, has announced the opening of two new online platforms. The first, Berlin Presse, will run for twelve weeks and will choose the winner of the $20,000 Prize for the greatest achievement in art or design. The prize will be presented at a special event at the museum on Tuesday, May 28. The second edition of the show will be held in the Museum for three weeks and will feature the work of fifty artists.The first Berlin Presse platform, presented by the German company Sintgalerie, will host the final exhibition of the biennial on Wednesday, May 29. The exhibition “shall be a study in the history of architecture” and will present the work of three hundred architects and will be organized in a virtual environment. The second platform, presented by design studio Gendron, will present the work of fifty designers. The exhibition will take place at the curatorial center of the company, the Kunsthalle Bremen, and will invite the artists to present their projects in the museum.", "The next Biennial should focus on the history of drawing in and the maintenance of that heritage. “The exhibition ‘Drawing Today: The Last Century’ will provide an opportunity to reflect on the art of drawing from a historical perspective with the aim of reintroducing the practice into contemporary life,” reads a statement on the exhibit. Art historian Mukul Taylor, who curated the London-based exhibition “Drawing Today: The Last Century” alongside Martin Amis, said: “It is a great honour and privilege to bring the exhibition to London. The exhibition is a rare treasure of art history and I am excited by the exhibition ‘The Last Century’ as it will allow the art world to understand the impact of drawing on the history of art.”Alexander Lebedev, chair of the department of art history at the State University of New York, said: “The Last Century’ represents a new way of looking at the past that is centred around drawing. Drawing today is about to change the way we live our lives, and the way we view the world. It is a way forward for drawing that will engage with the history of art, with artistry and with the history of", "The next Biennial should focus on the art of collaboration, the creative process, and the connections that can arise from it, as explored in the exhibition “Five hundred Years of Sa-Ra” (2017–18) at the Grand Porte de France. The Biennial will also make available, free of charge, the works of the artists represented in the exhibition. The 2017 edition of the Biennial attracted an audience of over 105,000 people, making it the most popular exhibition in the history of the organization. The inaugural exhibition was “The City of Helsinki,” curated by Yoko Taro, which ran for ninety days and featured fifty works by twenty-nine artists, including the French painter Francois Péladeau, Egyptian sculptor Samer Khilji, and the Swiss-based artist Max Beckmann.The fifth edition of the Biennial, “The Future is Not What We Dream It Is,” will be held at the Grand Porte de France in Paris in 2022. \n\n\nThe museum’s board of trustees has approved the sale of the entire collection of forty-six works by sixty-three artists that have lived at the institution since its founding in 1825. The", "The next Biennial should take place in late May or early June.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced that it plans to open to the public in early March, following construction on the newly constructed Arts and Culture Center (ACCC), which is currently under construction at the same site. The museum will not be able to anticipate how the building will respond to a terrorist incident, but it will consider the possibility and will implement emergency measures to prevent vandalism and theft.According to the Los Angeles Times, the authorities arrested five people, including two suspects who attempted to set fire to a building at the site of the new museum. The building, which will be constructed in a former auto body shop, is expected to house roughly 1,500 works by approximately 130 artists and collectors from twenty-six countries, including France, Italy, Norway, Sweden, and the United Kingdom. A sixth suspect, Alejandro Villalobos, was arrested on suspicion of attempted murder, but he was not charged.The building, which was completed in 2016, is being constructed in the former factory district of Downtown Los Angeles. During its construction, MoCA paid $52 million to the state of California and $34 million to Art+City, which is currently working", "The next Biennial should be held in 2021, and the first in 2022. The next event should take place at a venue that would be selected by a jury composed of Nobel Laureate Professor Panagiotis J. Georgopoulos and Professor Yoko Ono, and should aim to suggest a new path for art. The next iteration of the UNESCO Biennial will be held at the Palazzo delle Papeschi in Venice, and will be hosted by an Italian architect and a Swiss curator.The 2020 edition of the Venice Biennale will take place in July 2020 and will draw an audience of twenty-nine nations. The theme of the event will be “Life on Earth,” and the artist who will represent Italy at the event will be Giulia Sofi, who was chosen by a jury comprising Hanna Rosimi, a director at the SculptureCenter in Venice; the curator Gio Ponti, a longtime supporter of the institution; and artist Stefano Oricon.The Venice Architecture Biennial (SAB) will be held in the Italian city of Venice from May 21 to May 29. The event will be led by architect and Salfit-based architect Enrico Castellani and will showcase the work of", "The next Biennial should be held in 2021. ❖\n\n\nThe Estée Lauder Companies in London and New York announced today that the two-day, thirty-fifth edition of the Biennale d'Art et d’Art’s inaugural exhibition at the Renaissance and Design Museum in London will take place concurrently next year. The event will also be held at the new museum’s curatorial premises in a premier location, in a new building, and at a new date.“The partnership is an extension of the company’s commitment to the Renaissance and Design Museum, which we view as a key platform for delivering the highest-quality design experiences to millions of visitors annually,” said Stephen Ross, president of the Mamosamura Group and Hirshhorn & W.W. Ross. “The new $34 million institution, which forms part of the Renaissance in London, is a new kind of museum, capable of delivering both the excitement and the challenges of a Renaissance through the art world. The partnership between the two companies is an exciting step in our ongoing journey to build a platform for the collection and exhibition of designer works in a unique and distinctive location.”The partnership between", "The next Biennial should be held in the Spring of 2020.”\n\n\nThe Dusan Bicherez Collection in Budapest is planning to reopen with the artworks “Amoris Laertica” (Alberto Lazaretti). For approximately two hundred years, the work has been housed in an exhibition at the Museum of Modern Art. The exhibition was closed due to the Covid-19 pandemic for approximately thirty days. Bicherez’s other works are also slated to return to the museum.The collection is currently under construction and will be inaugurated in the spring of 2021. The exhibition, entitled “Dusan Bicherez: The Life of an Artist,” will present the artist’s work in a new location and will focus on the legacy of the artist who is best known for creating monumental works of art. The biennial will run concurrently with the Dusan Bicherez Foundation’s ten-year celebration of the artist’s life and will also feature the artist’s works in a number of other settings, including in the museum.“By opening the exhibition in the spring, the Dusan Bicherez Collection can set", "The next Biennial should be held in 2021. Griffith’s Los Angeles–based group, the Los Angeles Biennial, will stage the first exhibition devoted to El Salvador in the United States. The show will also include the first-ever performances in the country by new and established artists.The biennial will be based at New York’s Metropolitan Museum of Art, which is currently remodeling its building, and will be organized as part of the museum’s ongoing project to engage with contemporary issues and contemporary art. Among the themes for the biennial’s fifty-third installment, “Dreamers of the Americas,” are the subversions of dreams once affirmed by the American state and those that are fought against. The theme will also consider the intersections of art and politics in the United States. Exhibitions will include “Art & Politics in the 20th Century” (2019) and “The Power of Paintings” (2019).\n\n\nThe Pérez Art Museum in Mexico City, which prided itself on championing Mexican artists over the years, will open a new exhibition dedicated to Carlotta Caracci, a prominent modernist whose work was inspired by her experiences in the United States. The show", "The next Biennial should be released in 2020.In a statement, the Department of Culture and Arts said: “The upcoming edition of the biennial will focus on the theme ‘inclusive growth: a language to share the richness of our world. It will take place across twelve cities and will showcase artists from all over the world. The adventure of our future will be to re-imagine our future through art and art-making.” \n\n\nThe National Geographic Society’s board of directors voted unanimously to oust long-time director Willa Cather, who was embroiled in a controversy two years ago over her use of a $4.4 million personal library to house her forthcoming exhibition “Faces Places,” an exploration of the ideas and concepts of place and the environment, in Washington, DC, and New York City, in favor of a larger agenda, including conservation and sustainable development.“We are deeply saddened by the loss of a visionary leader, a valued colleague, and an avowed supporter of National Geographic,” said board president Robert D. LaBoe, chairman of the board of directors. “We are grateful for the contributions she has made to our mission, and look forward to the future", "The next Biennial should take place in the spring of 2021.\n\n\nThe Smithsonian’s National Museum of African Art (NMA) in Washington, DC, has appointed Jennifer Elze, a curator at the New York Museum of Modern Art, as its next director. She will succeed Charles A. Birnbaum, who retired in April after a decade at the institution.“Jennifer’s success over the last three decades at NMA has been a great inspiration to us all, and she has demonstrated an exceptional ability to bring our vision of the museum to life for our guests and our community,” said director Michael Schatz, who has helmed the museum since it opened in 1974. “In addition to her deep understanding of the history of African art and her wonderful curating skills, she is a talented organizer and a champion of the arts.”Schatz also praised Elze’s leadership throughout the institution’s thirty-year history, which includes three National Board of Curators (NFC) chair-chooses, the award of a National Medal in 2017, and the establishment of the NMA Biennial in 2019. The museum recently completed a major renovation of its Centennial Gallery, which will be inaug", "The next Biennial should be in December 2020. The festival will be hosted by the Museen des Beaux-Arts in Paris, which is owned by the French government, and will be co-organized by Michel Houellebecq (director of the Musée d’Art et de l’Homme in Paris), an Argentinian curator based in Paris, and Paulo Antoni (director of the Karlivongru in Beijing), a director of the Kunsthalle Basel.The next edition of the exhibition will be staged in the museums of the National Museum of Modern Art in Brussels and the Fonds de l’Art et de l’Homme in Paris.\n\nAs the number of Americans who are infected with the novel coronavirus continues to rise, the number of hospitals treating the illness has exploded, and the number of people suffering from the illness has remained stable. On Tuesday, the Centers for Disease Control and Prevention (CDC) reported that the number of counties that are infected with the virus has jumped to twenty-nine states and the District of Columbia. According to the New York Times, the number of people who have died from the virus is now at one hundred and twenty-eight.The outbreak started in December", "The next Biennial should be held in 2021. \n\n\nThe French artist and educator Slavs-and-Life-Forms Andronikos is planning to leave the Congo in the coming months to return to India. The artist, who has exhibited internationally at the Kunsthalle Basel and the Manchester Art Gallery, has been absent from the country since March 21, after he was poisoned by a poisonous ivy branch in his home city of Goma.According to French daily newspaper Le Figaro, the artist will leave the country on July 9 and will return to Paris on July 10. The article also cites a letter from Andronikos to the French minister of culture, Bernard Cazeneuve, who states that he intends to stay in India \"until the end of the year.\" The letter, which was written in May, is dated June 17 and states that the artist intends to leave India for the last time before the end of the year (June 20).Cazeneuve confirmed that the artist has been granted a yearlong leave of absence but only as part of a general leave of absence, not as the artist is undergoing treatment for a long-term disability. According to the New York Times, the artist had been working", "The next Biennial should focus on the history and development of the two major art centers in the city: the Pantheon and the Museo de Arte Contemporáneo, along with attempts to develop a new work by the artist Manuel Gomes, whose abstract sculptures and paintings focus on paradoxes of form and image. The biennial’s project page, which is organized by kind, describes the series as “a history of the relationship between the Pantheon and Museo de Arte Contemporáneo.”\n\n\nThe Oakland Museum of California (OMC) has appointed Sarah Kenney, a curator and educator based in Los Angeles, as its next director. She will take the helm from Chris Doll, who retired in January 2019 after a decade at the helm of the museum.“Sarah’s proven ability to grow the OMC’s curatorial staff, her commitment to expanding the museum’s contemporary practice, and her demonstrated ability to bring audiences and projects together make her a strong choice to lead the OMC through this challenging moment,” said museum director and CEO Paul Mpagi Sepuya. “Her ability to create new and compelling programs to support the new strategic vision", "The next Biennial should be held in 2021, the organization said.\n\n\nThe Kentucky Historical Society (KHS) is planning to hold a biannual exhibition of works by sixty-two artists next spring. The theme of the event is “The Past, Present, and Future of the Kentucky Environment.” The event, titled “The Past, Present, and Future of the Environment,” will be organized as follows:Considered one of the most important exhibitions of its kind in the United States, ‘The Past, Present, and Future of the Environment’ will showcase fifty works by sixty-two artists across thirty galleries in Lexington, Louisville, and Nashville. The exhibition will run from March 15 to March 20.“This is a critical time for all of us,” said KHS director and CEO Dr. John O. Wilson. “Kentucky has been and still is at the forefront of the fight against climate change. We are working hard to adapt to the changing climate, and to become energy independent and climate-smart. We are also investing in the future of our landscape and our artists to help them better understand the impact of climate change and what we can do to limit it.”The artists participating", "The next Biennial should be held in May 2020. The panelists include:Charles A. Birnbaum, director of the Elizabeth Art Gallery in London; Kevin Button, director of the J. Paul Getty Museum in Los Angeles; Richard Cuno, the former curator of the Museum of Contemporary Art in London; and Terese Fennella, the director of the Museum of Contemporary Art Los Angeles.\n\n\nThe Tate’s board of directors has voted to delay the opening of the forthcoming biennial by two years, which was originally set to take place in May 2021 and to which it has committed itself by citing the need to re-examine the future of the exhibition. The decision was made in a meeting chaired by chairman Hamish Hamilton at a meeting of the Tate’s board of trustees on Wednesday (14 February).“The board takes seriously all suggestions and suggestions of any nature, including from members of the public, and especially when such suggestions involve the future of Tate,” Hamilton told the Art Newspaper. The board is also concerned about the cultural, scientific, and social implications of holding the exhibition, he argued, and has asked the Tate’s science and technology director, Pilar Beretta, to advise it on how", "The next Biennial should focus on techniques and creative practices and should include an exhibition of work by artists that have not yet been presented in the United States. It should also include a new section on Women Artists, which will be at the center, and a new forum to provide an opportunity for dialogue and discussion. The next iteration of the Whitney Biennial will be held at a location that will be determined by the artists and will have a budget of $125,000. The Biennial will be held every two years.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has appointed Molly O'Sullivan as its next director. O'Sullivan comes to the institution from the Baltimore Museum of Art (BMA) where she has served as interim director since October 2019. She succeeds Susan DeCarlo, who departed the BMA in January 2020, and will assume her responsibilities in January 2021.“Molly’s background and track record of success in organizing and developing gifted and talented artists and her ability to inspire and guide our new team members will be instrumental in growing the Museum’s ability to foster and present the art of the future,” said MFA director Mike McKean. “In addition, her history directing gifted", "The next Biennial should focus on the future of the collection, and the restoration, care, preservation, and transportation of the personal art of the past. The exhibition should also include a project to create a digital catalogue of the collection.The 2020 edition will take place at the museum from December 13 to February 3, 2020. The Art of the Gathering will also receive $1.5 million from the American Alliance of Museums and the National Endowment for the Arts. The funds will go toward maintaining a permanent collection of works by twenty-eight international artists, including Eddie Bergen, Ed Ruscha, Cecilia Vicu, Tod Williams, Wangechi Mutu, Shilpa Singh, Tirunel Modi, Shashank J. Gupta, Kathy Lo, Andrea Paolozzi, and Mary A. Cole. The Art of the Gathering will continue operations at the Art Museum, where it has been for more than fifty years and where it will present its first exhibition of work by an Italian contemporary artist, Ligia Cecilia Vicu. The Milan-France-based company, called Ligia Cecilia Vicu,", "The next Biennial should be held in 2020.\n\n\nAs the first major retrospective of Pablo Picasso’s work to be held in New York City since 1966, the Pereira Museum of Art in the Bronx announced today that it is planning to close its doors for a period of sixty days to allow the exhibition of the artist’s work during the city’s historic Art Deco revival. The exhibition will run from March 20 to March 23, 2020.“After a thorough review of the museum’s current and former exhibitions and programming, the board of directors voted unanimously to take the necessary action to preserve and protect Picasso’s legacy for future generations,” said museum director Christopher Doyle. The museum also elected to purchase ten works by the artist for the institution’s collection.\n\n\nThe CNEAM Collection, a major collection of photographs by artists such as Richard Avedon, Edgar Degas, and Pierre-Auguste Renoir, has been acquired by an Antwerp art dealer. The 18,000-piece collection comprises photos from the series “Art of Light” (1903–1908), which was released in 2009 by Antwerp-based art collector Christian DeBois", "The next Biennial should take place at the LAXART Museum in 2020, and the next at the Museum of Modern Art, New York; the Los Angeles County Museum of Art, in 1962, and the Los Angeles Municipal Museum of Art in 1966.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Mary Ellen Koons as the next director of the museum. Koons comes to the institution from the American Israel Museum (AIP), which she helmed from April 2015 to February 2021. She succeeds David H. Koch, who stepped down from the helm of the institution in January 2019, and will take up the post on February 8.“Mary Ellen Koons is an exceptional leader and a superb curator,” said David B. Reich, chair of the board of trustees. “Since joining the AIP in 2006, she has been instrumental in shaping the institution’s curatorial agenda and in recognizing and challenging the exhibition-driven practices at the museum. She is a devoted champion of the more than three hundred artists who have had residencies or exhibitions at the museum since it opened in 2010 and who have contributed to the AIP’s reputation.”The two-time Tony-winning curator will continue", "The next Biennial should be held in early 2021. It will be organized as follows: “The Future is Present”\n\nFor nearly two decades, the Pérez Art Museum in Mexico City has housed Artmex, one of the largest private collections of Picasso and Matisse. The institution announced earlier this month that it will move the works, which comprise a complex of eighteen buildings, including the Punta de Arte de Mexico and the Ponce de Leon, in January 2021. In a statement published on December 17, the museum said that it was collaborating with the government of Mexico City and the National Endowment for Culture and History (NECAH) to establish an exhibition program for the Picasso Museum and the Ponce de Leon and that the Palacio de Cultura de Mexico City will redesign its building through the summer of 2021. The rearrangements, which will also involve the construction of a new entrance and a new courtyard, were made to accommodate the construction of the new museum. The Pérez Art Museum’s previous plans for the space were to close in 2020 and relocate its collection to the 18th century. The Pérez Art Museum, which encompasses more than 1,500 works and is located at", "The next Biennial should bring together the various strands of contemporary art to create a new kind of experiential platform for South Asia’s regional and global art.”The 2018 edition was curated by P.J. Mallalai, curator of contemporary art at Kunsthalle Basel; Marc Glimcher, curator of early modern art at the Museum of Modern Art, New York; and Mark Selwyn, curator of contemporary art at Tate Britain. The 2019 edition was curated by Sarah Weedon and Amy Stan.\n\n\nKirsten B. Dewey, the director of the Center for Inquiry at the City University of New York, has been appointed the next chair of the National Museum of Women in the Arts (MoMA). Dewey joins the institution from the University of California, Berkeley, where she has served as associate director of the Graduate Center’s Center for Applied Arts; associate director of the Museum of Modern Art, New York; and, most recently, director of the Center for Inquiry at Columbia University. “We are grateful to Kirsten B. for her many years of service to the Museum of Modern Art and to MoMA for her leadership throughout our twenty-six-year tenure,” said Peter Levine", "The next Biennial should be held in 2021, the museum has said. In the meantime, the Biennale Paris will remain on view through March 31.\n\n\nThe Künstlerhaus in Vienna is seeking a new director after the death of its head curator, Ann-Sophie Berger. Berger’s immediate successor, Maria Christina Löhner, was appointed in January, but the appointment has not been ratified by the board of directors. The Künstlerhaus’s board of directors met in March and voted unanimously to seek a new leader. According to the New York Times, the board is currently discussing the possibility of instituting a “substantial change of leadership.” Berger, who came to the institution from the Swiss Institute for Contemporary Art (KW Academy) in Kassel in January 2019, is survived by her daughter and son-in-law. Commenting on the upcoming Künstlerhaus, Lüders-Alexander and Alexander told the New York Times: “We are very happy to have Ann-Sophie Berger as our new curator. She is experienced, motivated, and talented. Our board members, the board president, and all of us", "The next Biennial should take place in January 2021 and will explore the interplay between the local and global zeitgeist through a series of exhibition-based projects in partnership with international artists. The biennial will be organized in collaboration with the artists and their collaborators at the Anais Biennial, the Cuba Biennial, the Sao Paulo Biennial, and the Copenhagen Centennial.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it will begin amending the city’s Human Rights Law to include gender-neutral terms in order to ensure equal treatment of men and women in city government. In a statement, the DCLA said that the landmark legislation does not explicitly address the issue of gender-based discrimination, but rather defines it as “where a person’s behavior or response is viewed as being in opposition with the best interests of the community.”The department will write a new section of the Human Rights Law that clarifies how gender-neutral terms should be defined and how they should be applied in order to implement this change. According to the New York Times, the department will also propose a set of new guidelines for city government and will submit them to the", "The next Biennial should be held in the Fall of 2021. “We are committed to working with local artists and community partners to provide an immersive experience for future generations,” said Markus Neumann, director of the Biennale Berlin. “We are also at the same time working to develop a new program for the exhibition that will be more open and will be more flexible, focusing on both individual and group projects. The new Biennale will be much larger and will be organized in the city of Berlin. ”The biennial will include a large-scale installation by artist Andrée Chedid, a new work by the Chilean artist Gio Ponti, and a presentation of works by French and Italian artists. The Barcelona art world is also growing rapidly in size and scope. In May 2020, the museum will stage a new exhibition of work by the Italian artist Ricardo Campisi.\n\n\nThe Carnegie Museum of Art in Pittsburgh has received a gift of forty-three works of art from the Works by Carol Ann Duffy, whose work was recognized in 2014 as the year’s winner of the $10,000 National Medal. The gift includes works by twelve artists whose work was included in the exhibition, �", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released the list of fifty artists who will participate in its next edition, “CalArts.5.” The event, set to run from September 3 to September 9, 2020, will focus on the art of the Americas and will draw approximately 160,000 visitors. The exhibition will feature works from twenty-six countries and will be hosted at the Museum of Contemporary Art (MoCA), which was founded by architect and businessman Norman Foster in 1975. Tickets for the 2020 event go on sale September 3.The twenty artists chosen for the event are: Alejandra Alarcon, Arts + Design, Brazil; Berenice Abbott, Arts + Design, Lincoln, Massachusetts; Fernando Barbera, Los Angeles; Fernando Baldessari, Basel, Switzerland;  Fernando Bonis, Los Angeles; Fernando de la Torre, New York; Fernando de la Torre + Rishikee, The Contemporary, New York; Fernando Pereira, Los Angeles; Fernand", "The next Biennial should be held at least ten years from now.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles organized a major revamp of its campus last month that will bring more than 1,500 new works by artists from around the world. The renovation effort, which involved the removal of eleven full-scale replicas of the original building, was funded with $290 million from the Museum of Modern Art’s endowment. The renovation of the museum’s current exhibition spaces, which are located on the third floor of an old steel and glass skyscraper, was completed in June. The museum also rebuilt the ground-floor retail, conference, and visitor experience areas, and added more than 1,500 square feet of gallery space.“We are thrilled with the result,” said museum director Andrew Kreps. “This is a critically important building, one of the last in its immediate vicinity, and we are confident that it will continue to engage audiences and serve as a wonderful launching pad for the work of the next generation of MoCA curators.”Kreps said MoCA is currently in the process of revamping its existing exhibition spaces, which are located in", "The next Biennial should take place in 2020, the organization said. The first edition, which was organized by the Italian nonprofit Dario Biennale in Milan, opened on June 25 and ran for six weeks. The second edition, which debuted in May, revealed a long-overdue overhaul of the exhibition and saw its first performance by an artist from the African continent. The exhibition was held for ten days, from March 16 to March 17, and featured work by nearly sixty artists, including Simone Leigh, Hélio Oiticica, and Juleh Saad, as well as works by contemporary painters from the African continent, including Stephen Klein, Maria Luis de Crespo, and Kamila Kwame Nkanga.\n\n\nThe neo-Confederate monument honoring Confederate soldiers and civilians that has stood in Richmond since 1865 has been removed, and the city is preparing to welcome visitors to the site once it reopens. The seven-ton bronze effigy of General Robert E. Lee, the second president of the Confederacy, was toppled by a Confederate soldier in protest of the city’s decision to remove the monument.The statue of the general was erected in memory of Lee’s birthday in 2015 and served as", "The next Biennial should be held in Helsinki in 2021 and should be the first to showcase the work of the entire collection to the public. The exhibition is currently on display in the museum Althing, the former residence of the Swedish royal family in the city of Tartu, and will continue to be organized in the museum until the spring of 2023.\n\n\nThe University of Iowa, in partnership with the Estate of the New York Public Library, has awarded three new fellowships to artists for its 2019–20 academic year. The ten-year fellowships were chosen for their creativity and innovation, their ability to merge visual and nonvisual arts, and their commitment to engaging with the institution and its collection through their own artistic practice.“The fellowships reinforce the importance of the University of Iowa to the broader art world and the arts ecosystem in general, and their breadth of experience and expertise in various disciplines,” said executive director Mary Morgan. “Thank you to our fellows for inspiring and inspiring us all.”In addition to the three fellowships, the institution also established an award of $15,000 to the artists who demonstrate excellence in their respective areas of study in the coming academic year.The 2019 fellows include:Marwa Asghar,", "The next Biennial should be held in the Fall of 2020.  The 2017 exhibition, entitled “Art and the Body,” was held at the significantly expanded Art Institute of Chicago. It is still unclear whether the new event will incorporate elements from the original exhibition, which was held at the museum in the same location from 1931 to 1939, and focus on the work of artists in the late twentieth century. Copyright © 2018. All Rights Reserved.\n\n\nAfter a grand jury in South Africa declined to indict a white nationalist, who was convicted of murdering a black student five days after he allegedly punched a protester in the face, the country’s president, Jacob Zuma, announced that he would pardon the man, George Lax, on Wednesday. Lax was sentenced to eighteen months in prison and four years of hard labor for the crime of second-degree murder, which was the same charge that was used against Timothy McVeigh, the Oklahoma City bomber who killed 168 people at the Oklahoma City Federal Building on May 20, 1995.Adnan Yildiz, the lawyer representing Lax, told the Art Newspaper that he expects the president to grant him political asylum. He also fears the country will become a platform for extremist ideas. “The", "The next Biennial should aim to integrate the work of international artists to create a new type of research, based on the concepts of well-being, international exchange and community, and the study of contemporary art, as an expression of this new international time.”\n\n\nThe Museum of Modern Art in New York has announced that it is planning to begin hosting visitors from China in 2021. In a statement regarding the forthcoming year, board chair Henry W. Luce Jr. said: “We are confident that the new opportunities, challenges and opportunities presented by the rapid pace of change in China will prompt us to re-examine our long-standing policy of non-resident Chinese visitors to the institution.”Currently, the museum is planning to begin welcoming visitors from China in 2021—the program has been in place since 1973 and is considered one of the most successful in the United States. However, in the past, the institution only invited visitors from mainland China to the institution, which is located in the former factory district of Chinatown, and would not issue visas to visitors from other parts of China. “We are continuing to do our best to ensure that we are a welcoming and sensitive platform for visitors from China,” said David L.", "The next Biennial should be held in the second half of the year. I am still hopeful that the space for a new exhibition of the work of MCA will be established in the next biennial. I believe it is the only institution in the world that is devoted completely to MCA’s collection, and I expect that this new institution will be able to present a very special exhibition. On the other hand, I am afraid that an exhibition of the works of MCA and of the Italian National Gallery will be postponed. My hope is that the biennial will be able to continue after the fall of the current government.”In a letter dated November 5, 2017, the twenty-six-year-old artist said: “I am very happy that I have been given the opportunity to present my work at your biennial, for the first time since I was twenty-six years old. I am very much looking forward to the exhibition of new works by the artist and to the exhibition of this exhibition at MCA. The exhibition archive is full of such works, and my work is preserved there for future generations. The exhibition will also be under my direct care, and I would like to see it return to the MCA in a permanent exhibition", "The next Biennial should be held in the Netherlands in 2020. Its first iteration will take place in the Netherlands in March 2020 and will run for twelve weeks, comprising a total of fourteen exhibitions. The event’s theme: “Deconstructing the Body.”The art of the body has been a central element of Theodore Shoemaker’s goal to create a new poetry-and-fiction style by changing the underlying object of the work. The biennial will be a continuation of the artist’s published work. Shoemaker’s memoirs of his travels, which include the work of a horse, a canoe, and a canoe from the Hudson Valley, New York, will be chronicled.The biennial’s opening ceremony will be hosted by the Foundation for Contemporary Art in New York City and will take place at the Chelsea Piers on September 24. The event will be centered around an exhibition of work by the artist’s son, Ivan Shoemaker Jr., alongside a performance by the artist’s daughter, Helena Shoemaker. The show will be held at the Museum of Modern Art in New York from September 21 through October 22.The event will include two online viewing rooms, a digital edition of the", "The next Biennial should include a performance by the Israeli-born, Brooklyn-based artist Nader El-Khoury, who made the short film The Rooms in My Room in 2006. The show, which will be held at the Brooklyn arts space the Museum of Modern Art, will also feature works by artists such as Peter Andre, Eileen Campbell, and Wangechi Mutu.The announcement follows the Biennial’s selection of a new collection of artworks by Nancy Lieberman, a British-born, Tel Aviv–based artist, for its twentieth anniversary. The selection was made in partnership with Tate Britain, in collaboration with David Nyman, the director of the Tate, and Harold Osamura, the head of the Los Angeles County Museum of Art. The event will run from March 3 to March 5.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has received a gift of forty-two works by African American artists, including six works by artists who have contributed to the development of the city’s art museums, from the Metropolitan Museum of Art in New York and the Whitney Museum of American Art in the Bronx.The donation, made by collector and philanthropist Nathan Barbour, a cofounder of", "The next Biennial should take place in 2020, the organizers said. The 2019 edition of the event, which grappled with questions of race and history in a city that had yet to be founded, was cancelled due to the Covid-19 pandemic. According to the Los Angeles Times, the 2020 event will be a “new beginning.”\n\n\n\n\n\nArt Museum Toronto (AMTO) has appointed Sara J. Taveras, the director and CEO of the Architectural Heritage Foundation, as its new deputy director. She succeeds Alexander C. Wilson, who has served as the director of the institution since 2013, and takes the helm from Brenda Chiu, who will retire in May.“Sara’s appointment represents a strong and long-term commitment to the museum,” Wilson said in a statement. “Sara’s tenure will be filled with growth and innovation, driven by a clear vision to make the AMTO a strong and relevant arts and culture destination for Toronto.”Linda C. Jones, chair and president of the AMTO, said: “This is a truly exciting time for the AMTO. We are very excited to welcome Sara to the AMTO family as we", "The next Biennial should be held in 2020. The winning design was selected from a shortlist of three entries, which included Bijan Brown’s Sky Tower, which is scheduled to open in 2022, and the work of Paschal Corbett and David Kordansky, who were chosen to create a new monument commemorating the United States’ participation in the Second World War.\n\n\nThe National Gallery of Art in Washington, DC, is preparing to welcome visitors back to its campus on September 9—as long as the Metropolitan Museum of Art in New York remains closed due to the Covid-19 pandemic. The institution says it expects the reopening of other museums and other parts of the government, including schools and government buildings, and that visitors will be able to visit the National Gallery on September 10.According to a letter sent to the Smithsonian Institution by chairs of the board of trustees and general managers of the two institutions, the Metropolitan Museum of Art and the National Gallery of Art are not prepared—and may be forced to—to close if the Met does not provide additional funding to offset the cost of revamping its existing galleries and modernizing its basement. \"The Met’s study of the future must begin now with a sound", "The next Biennial should also focus on remaking the art of the city, with a new exhibition of work by the artists of the city, curated by the CNE, and a new series of talks by artists and curators.“We are currently one of the most important platforms for the art of the city, and we will continue to be so,” said CNE director Simon. “The new biennial will reinvigorate and expand the current exhibition series, while showcasing the full range of the CNE’s international artistic offerings. We look forward to presenting the first shows devoted to women artists in 2021.”\n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to raise $30 million for its expansion and renovation. The funds will allow the museum to create new spaces for its collection and preserve the existing building. The funds will also allow it to open up two additional galleries in the building, which is currently scheduled to open in 2025.“We are thrilled to receive an additional $30 million from our investors,” said director Karla Epstein. “This investment brings the total sum to $100 million, and represents a significant milestone in the museum’s history. The new galleries", "The next Biennial should be held in Paris in 2020.<|endoftext|>The Museum of Fine Arts (MFA) Philadelphia is moving forward with a reopening of its doors in March 2020, following a massive renovation and expansion project that added more than 1,800 square feet of museum space in the former Blackstone building, a $80 million expansion of the museum called the Renaissance Center. The reopening of the museum is being organized as part of a larger vision for the city of Philadelphia to reevaluate its cultural footprint. “The Renaissance Center will simultaneously celebrate its centenary and celebrate the city’s rich history with a new permanent collection, a new outdoor plaza, a new public art installation, and a new public sculpture garden,” said Liz Freed, director of the museum.  The museum will also add six new works by American artist William Eggleston, who was a founding member of the New York City crime family and worked to popularize the ''nineteenth-century black experience.” The first works by Eggleston, each themed around a different Black American tradition, will open in March 2020. A full list of participating artists is as follows:Friedrich BüchnerBoutros Boutros (London, United", "The next Biennial should be held at the New Art Museum in Auckland in 2021. The 2019 event, titled New Objects, was held at the Museum of Modern Art, New York. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed Eugene Kooner as its next executive director. Kooner comes to the institution from the Los Angeles County Museum of Art (LACMA), where he has served as chief curator since 2012. Previously, he served as director of the Museum of Contemporary Art, Los Angeles (MCA) from 2009 to 2012.“We are thrilled to welcome him to LACMA and are proud to be working with him,” said museum director Paul Popper. “Kooner is a scholar-and-amateur whose talents and knowledge enable us to grow the museum into a leader in contemporary art, and create all the possibilities for the museum’s future that can be imagined.” Kooner’s curatorial project, “Objects,” explores the museum’s relationship to and exploration of reclaimed materials, including wood and metal, and also includes the creation and management of biennial exhibitions, including “Remains of a Children�", "The next Biennial should be entitled “Justus’s Body,” which will focus on the body of Christ in the context of contemporary life, and will be curated by Damien Chazelle. The museum will stage the event at the same location as the exhibition.\n\n\nThe prestigious Rotterdam Biennale at the Rotterdam Museum of Contemporary Art (RMCA) has announced that it will suspend the remainder of the exhibition “Justus’s Body” and will open a brand new exhibition, “Conceptuals of a Body: Plywood and the Body” on September 10, 2020. Plywood, which was created in the late 1970s to test whether wood can be synthesized into a highly effective material for structural replacement, was donated by the artist to the museum in 1998. The wood sculpture, created in collaboration with artist-collector Jud Braammans, will be exhibited in “Plywood and the Body” during a five-day retrospective at the museum in January 2021.“Plywood’s structural form, its mode of transformation, his relationship to that form, and his relationship to wood itself are intimately linked to the concept of a", "The next Biennial should be held at the Venice Architecture Biennale in 2021 and the Venice Architecture Biennale in 2022. \n\n\nPlans to install a monument on the grounds of the Museu de Arte Contemporáneo in São Paulo, Brazil, have been scrapped because of the coronavirus. The work, a bronze sculpture commemorating the nineteenth-century Brazilian artist Lina and her cousin, the Brazilian artist Paulo Lima, was supposed to be unveiled in March. The bulldozers completed a massive cleanup of the site earlier this month, but the monument, which was meant to be the home of the artist’s studies, was never finished and never even arrived at the location of its construction.“It is a pity that the festival was not held at a high level of artistic and cultural activity,” Paulo Lima told the Art Newspaper. “The combination of Lina and Paulo Lima is a very special and powerful artistic experience. I am very proud of being able to collaborate with them in this way.”The controversy surrounding the sculpture has been ongoing for more than a year. The work was selected from a shortlist of three finalists by an independent jury made up of artist-activists, the director", "The next Biennial should be held in the spring of 2021. The date was originally set for May 2020 and the opening will be marked biennale. \n\n\nThe Solomon R. Guggenheim Museum in New York has received a gift of more than 4,500 works, including a selection of paintings by Rafael Viñoly, the late Cuban-born architect who pioneered the practice of Surrealism, from the Guggenheim Foundation. On Friday, the Guggenheim Foundation released a statement regarding the gift, which was made by the late collector and collector-designer Nelson Lichtenstein, the founder of the Los Angeles–based estate firm W.L. Eisenman & Partners, which also represents the late American painter Joan Miró. The statement read:The collection, which represents more than two hundred works by Viñoly, comprises works by works by artists such as Willem de Kooning, Miró, and Robert Irwin; as well as works by artists such as Mark Boster, Edward Hopper, and Robert Irwin, among others; and a selection of works by avant-garde artists such as Pablo Picasso, Douglas Adams, and Peter Paul Rubens. The collection also includes works by contemporary", "The next Biennial should be held in 2020 and will be hosted by the SS Museum Stuttgart and will be organized in accordance with the theme “The Future of Art.” The festival will be hosted at the SS Museum Stuttgart from March 14 to March 18, 2021.\n\n\nThe National Gallery of Art in Washington, DC, has announced that it will shutter after six years as part of an ongoing restructuring that will focus on restoring the museum’s collection through the sale of works by artists who have been long-disputed, and will rehire or sell works that have been excluded since the museum’s founding.The restructuring, which was announced in March, will involve the elimination of more than one hundred positions and the departure of 120 workers. The museum’s current collection, which comprises some six hundred works by fifty-one artists, will be transferred to the Smithsonian Institution. The institution will also begin the process of selling works by artists whose works are currently on display at the museum.In a statement, the National Gallery of Art said: “The changes we are making will enable us to move past our current exhibition-centric model, and pursue new and creative ways of working with art. The future of the National Gallery", "The next Biennial should be held at the Institut de Trockel, in the Brussels suburb of Neugrad, in December 2022, and will be organized as a series of interviews with experts. The exhibition will also include a new painting by Mark Leckey, which will be on display in a new exhibition at the Museum of Modern Art (MoMA), in Manhattan, and a new sculpture by Elin Gaber.While no immediate plans have yet been announced for a new exhibition at the Biennial, Artnet reports that a new MoMA exhibition dedicated to the artist-in-residence will open this fall.\n\n\nThe Carnegie Museum of Art in Pittsburgh, Pennsylvania, has received a gift of more than 1,500 photographs by American photographer and activist Charles and Ray Eames. The remarkable collection includes works by Eames that were published as part of the first book of the series, The Eames Walk: Photographs in a Feminist Revolution, in 1960. It also includes works by other female photographers, including Elizabeth Bishop and Mary Martin, and is part of the newly established Charles Eames Center for Art and Politics at the Pittsburgh Art Museum.“Charles Eames and the Walk was a milestone in the history of photography,", "The next Biennial should be held in the spring of 2022. Özalp, who has also presented work at the Venice Biennale and the Sydney Opera House, is planning to move to Boston to continue work on the exhibition.\n\n\nArt historian William Wegman was appointed a curatorial fellow at the Museum of Fine Arts (MFA) in Boston. He will assume his post on September 1, 2020.“Will is a gifted curator, a master of the craft who is committed to the principle of experimentation and experimentation with artists, curators, and the museum,” said museum director Christopher Bedford. “I’m thrilled that Will will continue to create new opportunities for exploring and engaging the world’s most important art by engaging and challenging the most important ideas about art and art history.”Wegman will be based in Los Angeles. He has served as a curatorial fellow at the MFA for six years and currently works as a consultant for the museum. In 2018, he organized the show “Update: Three Decades of Modern Art” (2017–18), which showcased the work of thirty-seven artists and featured the work of thirty-three curators. He also curated “An", "The next Biennial should take place in 2020.\n\n\nThe Museum of Fine Arts (MFA) in New York has announced the opening of a new digital platform that will allow the public to explore a selection of artists’ work for free. Launched by the MFA Digital Media Lab, the platform will be hosted by the museum, which recently initiated a new online program that will run concurrently with the biennial. Dubbed the Art of the Digital Age, the initiative will include a multitude of free artworks and will showcase the work of artists whose practice spans from the digital to the physical.“The digital lives of so many of our artists and publics are rapidly changing, and we are committed to supporting their creative and personal practices in the digital age,” said David Bauman, a cofounder of the museum. “We are excited to bring the Art of the Digital Age to people, and to reveal how the museum plans to use the Art of the Digital Age to inspire, engage, and educate.”The Art of the Digital Age will be available in the fall of 2020 and will focus on the work of thirty young artists, including Kai Noda, Adam Dallesandro, and Alex Toth, who are part of", "The next Biennial should take place in 2020. The Town Hall Art Center will also be renovated to make room for a museum that will be dedicated to the history of American art. Its current exhibition spaces and stage will be relocated to a half-dozen additional spaces in the museum, which will be repositioned a few hundred feet from the main building. The museum, which has been open since 2003, will launch a new program that will showcase the exhibition space’s collection of American art.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is creating four new positions for artists working across the museum, the Los Angeles County Museum of Art (LACMA), and the two buildings next door, the Modern Art Museum and Palacio, and will invest more than $750,000 into the development of new opportunities for artists.The four positions will be created through a process that will unfold over the next twelve months. The museum will invite fifteen artists to LACMA, which was founded by artist and teacher Richard Diebenkorn in 1965, for a four-month residency. The museum will invite a second round of artists to LACMA for a second residency in the building of Donatella Versace in 2021", "The next Biennial should be held in 2022, when the exhibition will reopen to the public. The Bénédicte Savoy, a large hall in Paris, will be redesigned in honor of the Biennial’s seventeenth anniversary. The museum will also improve its security by installing new security cameras, installing more exhibition spaces, and reorganizing the interior of the building.The institution is also adding two new venues: the foyer of the Bénédicte Savoy will be transformed into a gallery and the gallery space of the Palais de Tokyo will become a restaurant. “The museum is committed to offering you a new way of experiencing the Biennial,” said Gayatri Spivak, the director of the museum. “This new biennial will look forward with a new vision and new innovative projects. I cannot think of a better partner to be the new home for the Biennial than the Bénédicte Savoy.”\n\n\nThe National Museum of Scotland has received a gift of twenty-eight historic illuminated manuscripts, including the first edition of the Six Lectures of Caligula in 1804, which is now on display in the museum’s National", "The next Biennial should be held in 2021. “Art is essential to building and maintaining a healthy, vibrant and flourishing city,” said Mayor Randall Woodfin. “We are committed to bringing the greatest breadth of contemporary art and design to San Antonio, and I look forward to working with the creative community and the community at large to develop an exciting and meaningful collection for the city’s collection.”\n\n\nThe California Historical Society (CHS) in Oakland has appointed Joseph Corrigan as its next executive director. He succeeds Ann Werner, who retired in June 2019 after twenty-five years at the helm of the society.“I’m excited to be re-elected to this important role with the CHS,” said Corrigan. “I am grateful to the board and staff for working with the board and staff to plan for its future and to help them shape the CHS through an open and transparent process. I’m hopeful that we will continue to thrive under your guidance, and I want to thank our members for their tremendous work in electing me.”“Incorporating contemporary art and design into urban environments is integral to the future of modern design,” said Cor", "The next Biennial should be held at the Michaelis Art Museum in New York, and the first should be held at the Helsinki Opera House, Finland.  The 2019 edition will center on the life and work of Hans Mondrian, and will be hosted by biennial director Pedro Almodóvar at the The Center for Contemporary Art in Madrid. For the 2020 edition, which has yet to be announced, the biennial will focus on the life of painter Anton Kern. \n\n\nThe Museum of Fine Arts (MFA), Boston, has named Jodi Throckmorton as its new associate director of contemporary art. Throckmorton comes to the museum from the Sutton-Dorsch Center for Contemporary Art, where she previously served as the director of exhibitions and education. During her tenure at the Sutton-Dorsch, she oversaw the reopening of the William H. Macy Building, the Museum of Fine Arts, and the new ground-floor retail space the Sutton Arts Center.“Jodi is a proven leader in contemporary art,” said David F. Kennedy, chair of the museum’s board of trustees. “Her ability to work across disciplines, including heraldry", "The next Biennial should take place in the fall of 2020, and will consist of the exhibition of artist-made works and their recordings in the form of a twenty-minute solo concert. The exhibition will feature works by forty-four artists, including Paul Gauguin, Jean Piëtte, and Ed Moses. The show will be organized as a biennial, but will be divided into 10-minute sections. The biennial will open in late April and run until October 6, 2020. During the exhibition, the Biennials will display work by artists from Algeria, the United Arab Emirates, Egypt, Georgia, the Philippines, and Senegal. The fifty-ninth iteration of the event will be held in October 2022. The exhibition will be organized in concert with the Biennial of American Artists. The Biennial of American Artists will include performances by artists such as Linda Evangelista, Mierle Kallistä, and Alain Guiraudie, as well as the biennial of an American musician, Todd Rundgren, which will be held in January 2020. The biennial of a fashion designer, Lina Tutti, will be held in March 2020. The Biennial of Hungarian Artists", "The next Biennial should take place in 2020. Its preliminary agenda is as follows: 1. Introduction 2. Diversity 3. Gender 4. Art and Identity 5. The Body 6. Spirituality and the Body 7. The Ethic of the Body and the Soul 8. Love and Loss in Art and the Body 9. Politics and the Body 10. Art and Life in the Art of Life and the Body 11. The Landscape and the Landscape of Life 12. The Body and the Body of Culture 13. Arts and Meaning in Life and Life in Art 14. The Environment and the Environment of Life 15. The Body and the Body of Culture 16. The Body and the Body of Literature 17. The Body and the Body of Culture 18. The Art of Life and the Body of Film 19. The Body and the Body of Film 20. Biennial to Host in 2020, 9/27/2020, and 10/3/2021—the next editions will be held in 2021 and 2022. The first edition was accepted by the FIM in April 2017, and the second incarnation will be staged in November 2019. \n\n\nThe Mayor of London Boris Johnson announced today that the City of London Museum (CML) will be able to keep", "The next Biennial should take place at the Museum of Modern Art (MoMA) in New York, which is currently undergoing a multimillion-dollar renovation. Commenting on the mission of the upcoming exhibition, Stefan Molyneux, director of the Biennial, said: “We at the Museum of Modern Art are committed to celebrating the history of photography in art and in life, and to exploring the relationship between photography and art. The Biennial celebrates that history, and the immense contribution it has made to our world.”The inaugural exhibition, “The History of Photography,” was curated by Maureen Condon and will run from March 13 through March 15. The exhibition was curated by Joost Meunen and will present seventy-four works by sixty-eight artists, including Paloma Esmar\u0097who won the Agency to the People, the prestigious $250,000 prize in 2017\u0097Sara Cwynar, Joan Miró, Tanya Meta, Mark Rylance, George Rose, and Pilar Otero, and will be on view through October 4. “The History of Photography is both a celebration of the history of photography and its significant influence on our present experiences,”", "The next Biennial should be held in 2020; the 2019 edition was held in February 2021. The 2020 edition will consist of the work of 120 artists, including Alex Quintana, Curator Nacho Benavides, and Emmanuel Lévy Gorvy; the 2019 edition was hosted in the critically acclaimed city, which was also the birthplace of the French intellectualist Georges Pérez, and will—in addition to the exhibition—also include a lecture series, a book club, and the biennial’s first street party, which will take place on February 8. The show will also feature a documentary about the themes of the exhibition, titled The Village of Pueblo, and will be hosted by Pablo Berrada, Julián Zuniga, and the Uruguayan director Miguel Álvarez Aznar.\n\n\nThe New Museum in New York has given the city $1.2 million to help it mitigate the impact of the coronavirus. Almost $600,000 has been allocated for the immediate needs of the city’s public health authorities, which include implementing public health measures, providing medical care and treatment, and preparing for evacuations. The funding also includes establish", "The next Biennial should take place in 2020, but it is currently undecided whether the festival will take place in 2020. The exhibition will have been moved from the central location of the Art Museum Vienna to the KW Institute for Contemporary Art. The KW Institute for Contemporary Art will house the museum’s collection for two years, and the Art Museum Vienna will host the exhibition for four years.For the first time in its history, the painting and sculpture festival will also stage a program of lectures, performances, and other events. The programme—which will be curated by Markus Küng, the curator of contemporary art at the Museo Nacional de Arte Contemporáneo in Mexico City—will be divided into three parts: “Origins and Dynamics” (March 25–March 28), “Prospects of Art and Art History” (March 29–March 31), and “The Art of Pain” (March 31–April 4).The 2019 edition of Art Basel Hong Kong was canceled due to the Covid-19 pandemic. Artforum caught up with Mika and Markus Küng, the curators behind the exhibition “Origins and Dynamics” at", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MCA) in New York has released its list of exhibitors for the third edition of the Brickmap, an annual international art fair that takes place in the city every April. The event, which was originally held in 2021, will now take place at the New Museum in 2020.The 2019 edition featured work by thirty-four international artists, including Manal Alhaj, Juraj Ahuja, Ismaila Cergil, and Iris Georgiadis, as well as local favorites including Alison Pillow, Adam Himmelbawm, and Amy Lincoln, among others in the art world who have participated in the fair in the past.In the September 2018 issue of Artforum, Paul Zenz, who curated the fair in the early 1990s, said: “The Brickmap is a cultural phenomenon, a somewhat odd hybrid of art and commerce. It is not for everyone but for those who know how to connect and to have fun. I have been involved in the art world for thirty years and have been a visitor every year since its inception in 1988. I look forward to working with the talented artists, exhibitors, and staff who come", "The next Biennial should take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) is once again under fire for denying a Los Angeles native artist a $10 million grant in support of his work in conjunction with the upcoming Museum of Contemporary Art (MoCA) LA 2020, which is slated to open later this year. On Thursday, the institution announced that it will continue to withhold funds from the artist, Isamu Noguchi, who uses charcoal, drawing, assemblage, and sound as an organizing principle in his work, SIT , and has faced mounting pressure to take the funding himself. “We are deeply disappointed in the decision,” said Museum director Martin B. Lee in a statement. “At this pivotal point in our history, it is incumbent upon us as a society to consider and consider alternative approaches that can bring more people and more cultures together. The best way forward for the institution is to continue to evolve and thrive as an open and welcoming museum.”The museum also announced that it will invite Noguchi to participate in a series of exhibitions, including a section devoted to his work in 2020, titled “Noguchi: A Time to Blasphe.�", "The next Biennial should be held in the spring of 2021. This will be followed by a major exhibition of works from the collection in the spring of 2022. The collection will then return to the museum for a twenty-fifth edition, which will be hosted by the artist Central Saint Martin, in the summer of 2022. The venue will also host a second biennial of the late artist Suebkina in the fall of 2022.Inaugurating the new museum will be a monographic exhibition dedicated to the life and work of the late Italian architect Lorenzo Cattelan, which will explore the connections between modernism and the artist-influenced architecture and design that is so strongly represented in his drawings, sculptures, and paintings. The show will also present several rare works from the late artist’s collection and will showcase the work of the artist’s descendants. The show will feature work by descendants of the late artist Ligia Cattelan, Lorenzo Cattelan II, Ligia Cattelan III, and Lourdes Cattelan-Carmen, among others.During an open-air ceremony on Friday, March 19, three years after the", "The next Biennial should focus on the history of art in the South African Museum of Art and introduce new works by artists such as Almeida de Vira, John Dendrick, and John Smith.\n\n\nFrieze announced today that Alison Frank has been named artistic director of Frieze London. Frank joins Frieze from New York’s Park Avenue Armory, where she serves as artistic director since 2011. She succeeds László Nemžek, who has helmed the fair for fifteen years, and will take up the post on September 30.“We are thrilled when we welcome Alison to Frieze London as an enthusiastic and talented emerging talent,” said London’s Frieze chief executive, Marc Glimcher. “Her insight and passion for art and architecture will strengthen our team and we look forward to her continuing to champion Frieze’s reputation as a global leader in the creative industries.”Frank currently serves as the sculpture program director at the private Philadelphia institution the Israel Museum, where she works with artists such as Anita Alkadar, Andrew Calder, and Ann-Marie Haelle. She also previously worked as the sculpture director at the Museum of Modern Art in New York and as the", "The next Biennial should be held in 2021, and the exhibition should aim to return to the themes of the previous two years. It would also be the first time the exhibition was hosted by South Africa, which is currently undergoing a phase of transition. The United States, Britain, France, Germany, and Italy have yet to commit to hosting the exhibition.At the forefront of the upcoming exhibition will be the work of artist Jimmy Choo, who is known for his installation The Tree of Life, which depicts a massive cottonwood tree surrounded by a band of wildflowers and topped by a large, circular, faceless, serpentine building. The work, which is part of a series titled “Chimneys” that combines Chinese, African, and African traditions, is currently on display at the National Gallery of Art in Washington, DC, and will soon be on display in a large-scale installation at the Museum of Modern Art in New York.In a statement, National Gallery of Art director Marc Glimcher said: “The next five years will be extremely challenging for us in many ways because of the flooding in the United States, and we are mindful of the many artists whose creative practices have been affected by this crisis, but we are also mindful", "The next Biennial should be held in the city in 2020. The next triennial will also be hosted by the artist-run and grassroots venue Fotopostal in the city of Pustov, Russia, in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has adopted a new set of guidelines for the display of works by women artists and artists of color in its upcoming exhibition, “Women Artists,” which will run from March 8 to March 10. The guidelines were released by the museum in response to the growing focus on art by women.According to the guidelines, located on its website, where it is currently live, the museum will display “no less than four works by a single woman,” including works by Miriam Assante (1975), Tilda Swinton (1979), and Amara Pindell (1979). However, the museum will not display an artist’s work unless it is a work by a woman, and will not display a woman’s work if it isn’t her own.“We believe that the best way forward for women in art is to be seen as part of a community,” said museum director Maria Balshaw. �", "The next Biennial should be held in 2019.\n\n\nGerman artist Alfred Stieglitz has died at the age of eighty-two. Born in Berlin in 1925, Stieglitz studied under the legendary architect Bechold Kamm and began his career with a scheme for a giant glass and steel sculpture called the Deutschland Kunstverein in 1960, which took three years to complete and was finished in 1967. In this monumental installation, the artist creates an atmosphere of glass, smoke, and steam that reflects both the 'crunchiness of the American Southwest and the final stages of our industrial revolution.”Born in Leipzig in 1933, Stieglitz moved to Mannheim in 1943 and became a member of the Künstlerhaus group, which included Klimkouts and Oskar Kok, before the rise of East Berlin in 1947. In 1952, Stieglitz moved to Prague, where he eventually established his own show, the Künstlerhaus In Prague, in 1952. In the following years, he collaborated with a number of artists, including Max Beckmann, Pertti Aalto, and Ulrich Oechsler, and worked on many projects, including his most recent", "The next Biennial should take place in Fall 2020 and will be curated by Amanda Glen of the Victorian Institute of Art. \n\n\nIn early December, the State Library of Victoria in Melbourne, Australia, will hold a special exhibition dedicated to the art of photography. Titled Photography: From the Age of Kodachrome, the exhibition will feature approximately two hundred photographs by artists such as Mies van der Rohe, Pierre-Auguste Renoir, Jean-Luc LaBouy, and Alexandre Meneau, and will also feature a selection of works that have never been exhibited before.“This exhibition is an extension of our theme of photography from the early twentieth century,” said the curator of the show, Anna-Sophie Aldridge. “This is a rare opportunity to be able to present this work in its entirety in the gallery, as well as to use the images to create an experience outside the catalogue.” The exhibition will be organized under the theme “Photography: From the Age of Kodachrome” and will run for twelve weeks. The art historian and curators will show the work of forty artists and must include at least ten photographs of subjects who are part of the exhibition", "The next Biennial should have been held in 2021. The organizers decided to postpone the event because of the coronavirus. According to a statement by the Arts Council of England, the event will now be held in 2022. The event will include a retrospective of Herman Hesse’s work Hegel’s Metamorphoses, a selection of photography’s first ten years of exhibition, and a presentation of works by Herman Black and Elvia Aspinall. Since the pandemic began in Wuhan, China, on December 8, the number of cases in the United States has dropped by 200%, and the coronavirus has spread to four countries: China, Hong Kong, Italy, and Spain.  As a result of the ongoing support from cultural institutions, Artnews reports that the coronavirus has now spread to all fifty states. As new cases are confirmed in the United States, the number of coronavirus-related deaths in the country has grown to 58. According to the New York Times, President Donald Trump signed an emergency spending bill on Thursday that will allow the government to continue funding social services through March 15, at which point ", "The next Biennial should take place at the Metropolitan Museum of Art, New York, in the spring of 2022. The next iteration of the Berlin Biennial will be held at the Museo de Arte Contemporáneo, Mexico City, in the fall of 2022. \n\n\nThe Museum of Contemporary Art (MoCA) in Oakland, California, has welcomed Alicja Zwick and Pieter Baartman to its staff and board of directors. The pair will work as the interim cochairs of the institution until a permanent successor is appointed.“We’re thrilled to welcome them to the team,” Mark Loewen, chair of the board of trustees of the museum, said. “Alicja and Pieter’s experience and talent for bringing diverse artists together makes them uniquely positioned for this critical role.We look forward to their contributions and counting on their leadership to ensure that the Museum of Contemporary Art becomes a force for social change and an incubator for new ideas. We are grateful for their extensive involvement in the development of our current project with Stanley Donohoe, the organization’s inaugural collaborative project with artist-run spaces in the Bay Area, and the future of the institution.�", "The next Biennial should be held in 2021.  Michael Collins, the director of the J. Paul Getty Museum, said: “For more than three millennia, the Getty has provided audiences with a unique panache of artifacts from the ancient world, bringing together the finest works from the collections of the Getty and the Museum. This show will carry the same spirit and essence as the inaugural, and will extend its remarkable collection to include new works by an unprecedented number of artists, spanning from the fifteenth century to the twentieth century.”\n\n\nThe DePaul University Art Museum (DUM) has announced that it will receive more than $500,000 from the Turner Prize next month. The institution said that it is “very excited to receive the $500,000 from the Turner Prize.” DUM is one of five organizations that will receive a total of $500,000 in support of their conservation efforts, and the Turner Prize is one of the largest annual awards in the museum’s history.DUM director Martha Trumbull said: “We are honored to receive the Turner Prize in recognition of our collaboration and commitment to preserving and presenting the work of the Museum’s distinguished curators, including our own curatorial", "The next Biennial should be held at the Museum of Fine Arts, Boston, in 2022. Claudia Bruguera, a contemporary art historian and critic who served as director of the museum from 2011 to 2016, has been appointed director of the collection. She will assume her responsibilities at the museum on September 11. While the board of trustees of the Biennial Association lobbied for the museum to hold a biennial for its collection in 2018, there was no consensus on whether a biennial was necessary. \"I believe that it is, in fact, the only reasonably feasible and practical way to conduct a biennial, since the museum is already a major collection center with an international network of partners, with a strong institutional memory, and with locations that attract visitors year-round, and the exhibition of work on paper remains a hallmark of the Biennial,\" said board chair John Sweeney. The selection of a new director will depend on whether the board approves the proposed reorganization of the board of directors. Commenting on the board, board president Sean Mullally said: “Since our founding in 2004, the biennial has grown and diversified into an organization that can serve as a model for how an international collection center could work. We are", "The next Biennial should be staged in the city in 2021.\n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles has announced that it has received a gift of more than 1,400 artworks from the Los Angeles–born, California–based collector and philanthropist Michael Walker. The donation includes works by contemporary artists such as John Baldessari, James Turrell, and Deborah Enos; as well as works by more than 100 non-California artists, including Billie Holiday, Joan Miró, and Jasper Johns.“The gift of this incredible collection is a great honor for the MCA and signifies a new chapter in the collection and a new era for the museum,” said Audrey Hilgemann, director of the MCA. “Michael has been a champion of contemporary art since he began collecting in the 1980s, and we are thrilled to welcome this rich trove of work to the museum.”The gift includes works by artists such as Jonathan March, David H. Koch, Jim Jarmusch, and Marina Abramović. In addition, the institution also received a selection of works by two other Los Angeles–born collectors: Ed Moses and Douglas Barlow. In addition, the institution received a gift of", "The next Biennial should be organized in 2020. Cultural historian and anthropologist Adam Marshall, who curated the seventh edition of the biennial in Hong Kong in 2008, called the festival a \"mini-Germany, a mini-Taiwan, an altogether mini-China.” In his presentation of the exhibition “The Eurasian Art Museum (2011),” Marshall invited three decades of exhibitions and talks to the United States\u0097“The Present,” an exhibition of works by the artist-in-residence Masha Ulmanova; “Japanese Art,” a retrospective of 30 Japanese works in 2009; and “Jing-dai: Rest and Rebirth,” a symposium of essays by three artists that took place in July 2012.Commenting on the new exhibition, Masha Ulmanova said: “I am delighted to join the American curator and his team, and to be part of their future plans for the exhibition and exhibition program. I look forward to presenting new work in the exhibition and exhibition program that has been shaped by the immense diversity of artists and their diverse practices within the contemporary history of art.”\n\n\nYale Union, an independent arts space in Hollywood that was launched", "The next Biennial should take place in the fall of 2021. The art community is invited to submit proposals for the exhibition on its website.\n\n\nFrance approved an unprecedented $78 billion package of austerity measures for the country’s public sector on Monday, cutting the salaries of top executives and slashing social spending in an attempt to mitigate the country’s economic crisis. The European Union and International Monetary Fund (IMF) have urged the French government to act quickly to avert a recession and a rise in the number of deaths from the pandemic. The measures, which were passed by France’s National Assembly on Monday, will slash the salaries of executive directors Jean-Louis Potvin, Christophe de Margerie, and Christophe Mandelbrot, as well as the annual salaries of head of department François-Maxime Linth-Chenebault, and Jean-Luc Moulène, and step down from their boards of directors. They will also assign ​individuals to tenured positions, in an attempt to slow the pace of the company’s restructuring. The French Ministry of Culture said that the cuts would “induce", "The next Biennial should be held in Los Angeles in 2022. \n\n\n\n\n\nWang Wei sits in his living room in Beijing, China, with his wife, Wang Xianli, and their two sons, Lei and Max. A self-taught artist who makes his living as a designer and tells the stories of his children through paintings, sculpture, sound, and photography, Wang is an important figure in Beijing’s art scene. \n\n\nArtCenterAsiaPacific, the Hong Kong-based nonprofit that works with emerging and established international artists to promote their work and raise awareness about the region and the world, has announced that it is expanding its programs in Southeast Asia through a new, yearlong initiative. The program, called ArtAsiaPacific Summer, will run from March 16 to April 27 and will be modeled after ArtAsiaPacific: The Future Is Now, a free art fair that launched in Singapore in 2007 and was a major success.Set to open in September 2020, ArtAsiaPacific: The Future Is Now will bring together thirty artists from Asia for an exhibition organized by ArtCenterAsiaPacific, which was founded in 2008 as a platform for sharing and discussing art. The event will highlight the work of emerging and established artists in Southeast Asia.", "The next Biennial should be held in 2021.\n\n\nThe Pérez Art Museum Miami (PAMM) has appointed Sabrina C. Martin as director of the institution. Martin comes to the museum from the Museum of Fine Arts, Houston, where she is chief curator and director of exhibitions. She succeeds Derek de Castro, who retired in February 2019 after more than three decades at the helm of PAMM, and will take up the post on January 20, 2021.“Sabrina and Derek are part of a unique group of curators, scholars, and organizers that has been a model for innovation across the arts,” said Sabrina Diaz, PAMM’s director and CEO. “I’m excited to welcome Sabrina and celebrate her new position as director. She’s an excellent selection of people, who is dedicated to the art of Mexico’s state, and an excellent administrator.”De Castro, who helmed PAMM from 2015 to 2016, was succeeded by Steven Mufson, the current director of the New Museum in New York. De Castro was also a founding member of the Pérez Art Museum’s board of trustees.\n\n\n", "The next Biennial should launch in October 2020, the organizer said.The event will feature work by seventy-five artists, including Claude Monet, Louise Bourgeois, Robert Frank, Arne Glimcher, Piet Mondrian, Pierre-Auguste Renoir, Pablo Picasso, and Louise Bourgeois’s husband, Jacques, and will be held at the Museo de Arte Contemporáneo in Madrid. The exhibition’s inaugural edition, “2017,” will be held at the Museo de Arte Contemporáneo from September 10 to September 12.\n\n\nAs the number of people exposed to Listeria monocytogenes in California grows, more states are enacting emergency regulations and are preparing for more people to contract the virus. On Monday, California became the third state to pass a law that requires testing for the bacterium and has since been working with local health officials to determine if people should be vaccinated. The legislation, which was signed into law by Governor Jerry Brown, was met with swift opposition from agricultural interests, businesses, and health officials, who warned it could hurt the state’s economy.Though the outbreak has been linked to Disneyland and other large public gatherings,", "The next Biennial should focus on the development of a new generation of legal scholars. With this in mind, I have appointed Catherine Olschläger as the new board chair. Through her expertise, she will help shape the new exhibition and program, which will begin with a retrospective of the work of the twentieth-century’s leading artists, and will collaborate with the board and the international community to push for greater understanding and appreciation of the work of the past.”The biennial will be organized as follows: September 10–September 12Dear friends, I am writing to let you know that the 2019 edition of the Art Biennale Berlin, which was originally titled “A Century of Art,” has been postponed due to the Covid-19 pandemic. The 2019 event will now open in Helsinki in March 2020.Mari Wimmer, the co-president of the Berlin-based art research institution the Museum für Bildung des Deutschen Kunstes (BND), said the event will now be held in late March or early April. In a statement, the BND said: “The BND is not surprised by the postponement. It is merely confident that the 2020 edition will be a", "The next Biennial should take place in the fall of 2020. The first artist to present a work in a biennial is Nari Ward. The artist will be back in the fall of 2021. Artnet reports that the 2020 event “will include work that has not yet been exhibited, which is a reflection of what we are going to see in 2021.”\n\n\nThe Royal Academy of Arts (RA) in London has appointed Holly Valerly as its next chair. The Scottish artist will be based in London and will begin her position at the academy on May 1.Born in Glasgow, Valerly studied at the school and the Museum of Modern Art before moving to the University of Edinburgh. She has exhibited work at the Royal Academy of Arts, the National Museum of Scotland, the Brussels Biennale, the Biennial de Lyon, the Biennale d'Orsay, the Museum of Contemporary Art in London, the Museum of Contemporary Art in Rehovot, the Museum of Contemporary Art, London, and the Tate. In 2017, she was selected as the winner of the Rabkin Prize, which honors the work of an artist who has made a significant contribution to the arts. Her work was previously featured in the documentary film ", "The next Biennial should focus on “the social and political issues that are most relevant to the people who are living in and creating in Puerto Rico’s urban environments,” said Mayor Duyguil, who also praised the biennial’s curators for organizing the event in the city.Cultural organizers hope the exhibition will draw attention to the ongoing cultural revitalization efforts in Puerto Rico and draw in new audiences for the classical art and design, as well as for Latinx, indigenous, and women’s rights movements and issues. The project will also feature a retrospective of veteran Puerto Rican artist João Pessoa, who was a key organizer of the 1959 revolution, and will examine the role of the island’s indigenous people in the fight against Spanish colonialists and the U.S. military.The exhibition will be themed “Puerto Rico: History of an Identifying Region” and will be hosted at the Museum of Puerto Rican Art in San Juan, Puerto Rico, from July 12 to July 14.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is expanding its work in the field of contemporary art beyond its traditional realm, making its next iteration, “", "The next Biennial should take place in the fourth quarter of 2020, at an undisclosed location in the city. The event will be hosted by the city of Copenhagen, in collaboration with the Copenhagen Art Museum (C.E.A.M.), the National Museum of Denmark, and the Museum of Modern Art. Last year's exhibition, “The Big Picture,” was staged at the Museum of Modern Art in the city of Copenhagen. The exhibition explored the paradoxes of the human experience through the medium of painting and sculpture and the exhibition was organized by Kjetil Magnusson, the curator of photography and art at the Aarhus Art Museum in Denmark.\n\n\nThe New York–based nonprofit artist, whose vibrant and vivid studio paintings evoke images of architecture, landscape, and objects from the artist’s past, has died. She was seventy-eight years old.Born in New York City in 1941, the daughter of a white American father and a black mother from Georgia, she began drawing at the age of six. From the age of seventeen, she began painting at the urging of her mother, who was a devout Catholic who insisted on the use of papier-mâché, glass, and other natural materials in order to", "The next Biennial should be held in 2022 and should be held in the city of Johannesburg.  Andersen will receive a sum of S$5.7 million from the city for his services.\n\n\nAs the work of art that celebrates and defends Indigenous Rights gains momentum across the globe, organizations and individuals in China are increasingly pressuring China’s state art museums to take a more robust line against cultural appropriation and historical reparations. In an unprecedented move, the National Museum of Fine Arts (NMA) and the Beijing Museum of Art in China have committed to paying back Malcolm McLaren, a twenty-three-year-old black American artist who was forced to apologize for a work by him that was exhibited at the NMA in 2006 and was awarded a bronze by the museum in 2009. In the apology, McLaren claimed that his work was created with the intent of pushing Western ideas and values and that he “did not mean to offend anyone” and that he is “pleased that this is the first time that we have publicly admitted to the matter.”While the NMA and the Beijing Museum of Art do not plan on repaying McLaren, they have indicated that they value the apology and are committed to working with the artist to", "The next Biennial should consist of not one but two sessions, of which the first will be a public lecture-cum-workshop and the second will be a short, but to the point, discussion-based workshop.”\n\n\nArt historian Bernard Bachelet has died at eighty years old. Bachelet was born in Montreal in 1926. He moved to the city again in 1964, when he was forty, to study at the Art Students League. He returned in 1975, a year before his daughter was born, and then again in 1982, when he was fifty-nine. In 1981, the museum’s philosophy department was formed. The museum reopened in 1989, after it spent ten years in a hotel in Paris. In 2016, the institution was awarded the Order of the Saint-Domingo.In a letter addressed to the Royal Society of Canada in 2016, Bachelet wrote: “It has been a privilege to work with the Royal Society of Canada since 1986. It has given me an opportunity to expand my creative horizons, to make direct contributions to its collection and exhibitions; to learn from many of the world’s leading artists; to be inspired by their work; to be inspired by their stories; and to be", "The next Biennial should be in 2020, and the first in 2022.  It will feature twenty-eight works on paper by forty-four artists, including Ricky Carman, Thomas Dulac, and Alberto Moro. Cultural scholars say the exhibition will examine the future of art and the natural world in a manner that has not been done before.\n\n\nIn a historic landmark ruling, the Supreme Court of the Philippines has declared the opening of the Diller Scofidio + Renfro–Leo (Diller Sculpture Garden) in Manila an infringement of the rights of several indigenous groups, including the Jalapa and the Malayali communities, on the ground that the construction of the park was an act of ethnic cleansing.The court found that the dismantling of a ten-thousand-year-old ceremonial site at the garden, which was constructed by the Spaniards in 1611, was an act of colonial violence. It also declared that the construction of the park—the first indigenous cultural site in Manila to be conceived by the country—violated the rights of the local population, which numbered between twenty-five thousand and sixty thousand people when the park was completed.The case arose from a centuries", "The next Biennial should be held in 2020. The decision to cancel the third iteration of the event was made after organizers received a letter signed by twenty-six artists who expressed their desire to continue the event, but were concerned about the upcoming US presidential election. “The invitation to the 2020 event is not an endorsement of Donald Trump or any of his policies, but rather an invitation to engage in a dialogue with artists and to consider alternatives,” said artist Courtney Lovell. “Our love of the arts is rooted in our belief that art, as a powerful force for good, should not be compromised by political agendas.”\n\n\nThe Museum of Fine Arts (MFA) in New York announced today that it is planning to open an expansion in its basement in 2020. The museum currently houses more than 20,000 works by fifty-eight artists, but plans to move the collection closer to its headquarters in Manhattan. The project, which will involve the restoration and renovation of the former Bessie and Allen’s space, will also involve the building of a new outdoor courtyard. The museum will be able to accommodate up to six thousand visitors in 2020.The expansion, which will also include the restoration of the museum’s existing building", "The next Biennial should include a selection of the best contemporary art from the last twelve months, curated by a group of curators who have collectively won five awards since the program began. The show will travel to New York in 2020 and will return in 2021.The 2019 show, “The Sublime,” featured work by thirty-seven artists and was presented by the Chicago-based collective MOSAS. The Biennial will have a new theme this year: “The Unhuman.” The project will focus on how humans have shaped the natural world and the environment since 1909. The twelve awardees chosen for the 2019 show include Javier Téllez (Spain), Sinead Carter (Ireland), Zoya Juma (Mexico), Emiko Tsuru (Japan), and Lucy and David (Australia). John McAllister (South Africa), Tabitha Waddington (Australia), Málaga Barba (Spain), and Ushio Takemoto (Japan) will be represented by the Hong Kong-based firm Diller Scofidio + Renfro. The exhibition will take up themes of the twentieth century, including the Global South and the history of art and the environment, and will be", "The next Biennial should be held in 2021. In the meantime, the museum will continue to display •This Is Not a Painting: A Trans-Europeus' Series, a first-person retrospective of the artist’s art, curated by the Greek curator Panagiotis Lapavitsas. The exhibition will be on view until October 21.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the removal of historical monuments and cultural artifacts in public spaces in the city, including the Metropolitan Museum of Art and the Brooklyn Museum, in an attempt to reduce tensions between the city and the museum. Called for a complete shutdown of public events and activities until at least November 24, the guidelines require that the city begin by removing fifteen historical monuments, which were constructed in the city’s boroughs of Manhattan and Brooklyn, and sixteen more monuments commemorating African Americans, Native Americans, and Indigenous peoples.The monuments are:The Battle of Prospect Park, where twelve monuments commemorate the Confederacy (three of which were already taken down before the city’s March 22 request for their removal was considered, and one of which was resized and relocated);The Jericho Project, a six-mile-long", "The next Biennial should be held at the Museum of Contemporary Art, Miami Beach, in May 2019. “Although it may seem counterintuitive, an exhibition in a museum is actually a very brief experience,”  said Michael Newcomer, executive director of the Biennial. “The physical experience of the work and the exhibit is something that we can recall over and over again, and that we can look forward to again and again.”\n\n\nThe Swiss Ministry of Culture has approved the sale of the Y-1, a public artwork by Peter Paul Rubens\u0097a pioneering male-artist whose exhibitionist behavior was sometimes violent, suggestive, and exploitative, and whose work was often criticized for being anti-social, “Animal House\u0097to the Ministry of Education and Research, a branch of the Ministry of Education and Research.” The institution will then begin the delicate but crucial process of restoring the work, which was reburied in 2001 and is scheduled to be brought down to the museum in 2020.The ministry said the sale was approved by the Committee for the Protection of the Separation of Church and State, a committee comprising Jean-Jacques Bénédicte de Villettaï,", "The next Biennial should be held in 2022 and the exhibition should be hosted by the Museum of Contemporary Art Dubai.\n\nThe Qatar-born Bahraini artist and activist Maryam Al Saadi, whose Earth Art project addresses climate change and social justice, has won the 2020 Petra Almqvist Award, which was established in support of international artists. The $25,000 prize, presented by Petra Almqvist, is one of two Best International Artists Awards.The other awardee, a contemporary art pioneer and educator in the United Arab Emirates, is Australian Kym Schallert, whose work addresses gender, migration, and the environment.Schallert, who was founded in the Gulf state of Abu Dhabi in 1978, will receive $20,000 in support of her work, “In the Beginning,” in the exhibition “September/October 2022.”“We are delighted to announce that both Maryam Al Saadi and Kym Schallert have been chosen as winners from a shortlist of eighty artists nominated by Petra Almqvist,” said Petra Almqvist. MCH Group founder and CEO Artautů Rusnak added: “The prize panel was made up of Petra Almqvist, Ros", "The next Biennial should focus on the history of the exhibition and its current exhibitions and programs, and the administration of the exhibition’s collections. It should consist of an extension of the Lecture Hall, a four-thousand-seat venue that has served as a platform for the exhibition since 1954. The structure—which was designed by the Swiss architect Bernardo Borthwick—is currently being renovated.“The exhibition is still here, but its exhibition, which was all about interaction and collaboration, is far away,” said Biennial director Marc Wilmar, who also added that the institution would be looking to build on the theme of the exhibition, which was inspired by the convergence of modern and traditional art.  “It would take a special kind of exhibition to do that, and it would have to be something very new, something that would change the way we see the museum.” The next biennial will be held at the Biennial House in Munich in 2021, with the first edition of the event slated to kick off in 2022. The 2019 edition, titled Future Perfect, was delayed due to the Covid-19 pandemic, which began on January 6, and the exhibitors are currently working on a new", "The next Biennial should be held at the Museum, which is currently undergoing a $135 million expansion project. The museum has faced backlash over the cost and schedule of its next iteration, and over its decision to cancel a 2019 exhibition “Sensitive Art: The Mosaic Revolution” and a 2020 event “Société des Arts et l'Histoire,” both of which were scheduled to open the Museum’s new space, the new Simón-Hilton, in the spring of 2020. While the new museum will hold more exhibitions and events, it will limit the focus of the show to the Western Renaissance, the Renaissance, and the Renaissance Art, and will not include the collections that make up the Museu de Arte de São Paulo, the Museum of Modern Art in Buenos Aires, or the Museu de Córdoba, the Museum of Modern Art in Lisbon. The 2019 event was moved to the Exposition International d'Art Contemporain de Louvain (EIA), in Paris, and the 2020 event has not yet been determined. The upcoming edition of the exhibition will be curated by Tania Del Valle and scheduled to run from January 25 to March 21, 2020.", "The next Biennial should be held in 2022, and if the new contract is ratified by the artists and the organizers of the Exhibition, the 2019 event will be restarted. If the new partnership is not honored, the twenty-fifth edition of the Prince‐Louis II Biennial will be canceled.The art world has faced many challenges in recent years. While the coronavirus vaccination campaign in China was successful in 2014, the pandemic resulted in a sharp drop in sales. In May of next year, the New York art scene was hit by yet another knock, this time in the form of a cold. While the United Kingdom is still on track to have its first rainless winter in seventy-five years, the Royal Shakespeare Company canceled its winter tour and the American Institute of Art in New York cancelled its inaugural triennial.\n\n\nThe Broad Museum in Harlem, which was forced to move the third edition of the National Book Award ceremony from the city this spring, is planning on returning the event to the state. According to Artnet, the move is in accordance with a new agreement between the city and the Broad, which will now stage three more National Book Awards in 2020: “The Broad Museum and the City of New York will continue to collaborate", "The next Biennial should open in 2021.\n\n\nThe Amsterdam-based artist Bénédicte Savoy, whose work explores concepts of memory, memory, and memory, has been selected to work at the 2020 edition of the Venice Biennale. The artist, whose work often explores notions of memory, memory, and memory, is one of the few living artists who continues to make work in the guise of memory. Savoy’s work is now available for purchase in the United States as the first exhibition of her new solo exhibition, “Memory, Memory,” at the Museum of Modern Art (MoMA), in New York, which will open on September 28. “Memory, Memory,” was selected by a group of directors, curators, and organizers who comprise the nonprofit Maestro Galería de Arte Contemporáneas (MAS), an education and research center. The committee comprised art historians, architects, historians, and psychologists; artists, members of the curatorial staff who worked on Savoy’s exhibition and spoke on behalf of the jury; and Savoy, who has been producing works in her studio in the Bibliothèque Nationale in Paris since 2008.�", "The next Biennial should be held in March 2021.  The next International should be held in February 2022.  These dates are both in keeping with the current programme of events that was announced by the respective institutions, which is to say that they are extending the life of the biennial to March 2021 and February 2022.  The pavilion will thus be ready for the first exhibition in January 2023, the same as the exhibition that opened in January 2021. According to the President of the Royal Institute of British Architects, Lord Hendrick, several hundred architects are committed to making the pavilion operational and will be working with its design team to achieve its ambitious design and to ensure that the pavilion can accommodate the largest number of visitors possible. The pavilion will be situated in the heart of London, at the southern end of the Thames, and will host seventy exhibitions and events in its first year. The 2019 edition, titled Buildings, featured twenty-three works by sixty-five artists and was curated by Barbara Coates, a curator at Tate Britain and the architect of Tate Modern in London, and Mark Borthwick, director of Tate Modern.\n\n\nThe Fine Art Museum of Chicago (FAM) has received a gift of more", "The next Biennial should take place in 2021. The future of the exhibition is currently uncertain following talks between the institution and the artist over a new contract that expired in March 2019. The museum’s board of directors are still negotiating over a new contract, and a decision is expected this week. \n\n\nThe Thirsty Project, an artist-led conservation project founded by collector and philanthropist David Throckmorton in the late 1990s, has won a $500,000 prize at the 2019 Venice Biennale. The $500,000 award is one of the largest ever awarded by the Thirsty Project and is the third-largest donation ever made to the museum. The $500,000 also marks David’s fifty-fifth anniversary of founding the organization, which was founded by artist and collector Thomas Dane. David established the program, an initiative that provides temporary relief to artists in need, through the Thirsty Project, in 1998. The organization now provides support for six hundred artists in the United States and more than sixty countries.“Thirsty Project brings to light an important chapter in the artist’s and collector’s history by championing the ethical practice of mass assistance—a practice that is generally", "The next Biennial should take place in 2022 and is said to be on schedule to begin next spring.The grand opening of the exhibition will be held in March 2020.The exhibition will run alongside the 2021 edition of the Berlin Biennale, which is slated to take place in March. The biennial’s first round, “Ümei bild: und die phänischen und die kunst,” will kick off in April and run until May. The second event, “Erik Ekman: Life and Art” will be held from May 28 to May 30. The opening of the exhibition’s second exhibition, “Alfred Stieglitz: Existential Art” will be held on May 29. The biennial’s third edition, “Sensuality: Transhuman Society” will be held in March 2021 and will run until March 23. The inaugural exhibition of the biennial, “Erik Kappos: the Unconscious” will unfold at the Bregenz Museum in March 2021, the Art Residence in March 2022, and the Museum of Contemporary Art, New York in March 2020.\n\n\nThe Metropolitan Museum", "The next Biennial should take place in 2021. The exhibition, titled “Sequences,” will also present exhibitions of work by artists such as Naomi Campbell, Paul Gauguin, and Pierre-Auguste Renoir. The biennial has partnered with the Rotterdam Museum of Fine Arts and the British Museum to create a digital exhibition of the exhibition series “The Third Wave: The Biennial of Rachmanin” (2019–2020). “I’m excited to be working with the artists and designers who have made such significant contributions over the years,” said Audrey Baylis-Low, chair of the board of trustees. “The Biennial of Rachmanin is a powerful creative platform for the development of new conceptual and visual artworks and for the promotion of contemporary dance in the Middle East and North Africa. We look forward to continuing this relationship through ‘The Future of Dance’ and to creating new opportunities to engage and inspire artists and designers, as part of a dedicated exhibition program that showcases their work in an exhibition-like setting.”\n\n\nThe David-and-Goliath sculpture-maker Frank Gehry, whose sprawling, twenty-eight-ton concrete works transformed urban", "The next Biennial should take place at the Kensey Arsht, Germany, in May 2021. The project will utilize cutting-edge technology and the latest digital and acoustic techniques to create a new type of performance art experience, based on the Greek myth of the ceto, which is a cage made of fire and cypress trees.In addition to the new exhibition, the project will introduce new creative platforms and interactions for local communities, including a public sculpture garden and a program for singers, pianists, and dancers. The exhibition will be organized as a series of presentations of selected works that intersect with the themes of the Biennial. The Coachella Valley Music and Arts Festival will also undergo a major renovation, with the addition of a new stage and an expanded festival. The project was announced by festival organizers in an email sent to festivalgoers on May 16.“The new platform will bring together the best contemporary artists, curators, and producers in the US and Europe, from the most recent gen, and for the first time they will be able to post their works on Instagram and take part in the online conversations,” the email read. A digital version of the exhibition will be presented at the Museum of Contemporary Art, Los Angeles (", "The next Biennial should focus on the history of the institution’s collection, its collection of modern art, and its museum-like climate made possible by a bold new vision for the building, the museum, and its collection, which is currently housed in a former sugar factory near the city of Burgos. It must also receive a boost from the lifting of a veil over the collection, which remains closed to the public, and a new public experience, a museum-within-a-museum.“The program had great potential to develop new and enriching relationships with audiences from the Americas to Europe and Asia,” said Osei-Merz. “The Biennial has emerged as a model for programs that reflect the values of the Arts and Cultures Department of the Ministry of Culture in designing a program that will engage with audiences across Brazil and the world.”The exhibition that was scrapped was “Brazil: the Mummy,” a show that would have focused on the country’s indigenous art and culture. The show was scheduled to open in September 2020 and was set to feature several thousand artifacts from the Amazon basin. The show was supposed to begin in October but was pushed back to March 2021, when the Brazil", "The next Biennial should take place in Monaco in 2022, with the exhibition opening in the city in late July. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it is working with artist and educator Walter De Maria to commission a new work by the rapper T.I. The museum will make the commission at a future date and will propose the work at a future location.De Maria was inspired to create a commission from his extensive collection of works from the late American rapper and producer Common, who passed away in July 2019, by a conversation he had with a friend in Los Angeles about art. The friend suggested that the work, which will be on paper and will be made from polyester resin, should be from the late artist’s own compositions. De Maria agreed and commissioned some of the artist’s most iconic images, including his famous painting of the pair of him and Common in a car, and the “House of God” at his home in the Santa Monica Mountains, which was painted in his garage, in 2018.The artist will recreate the Los Angeles house in a number of ways, including by removing the city’s three-story structure, which was built in 1951 to", "The next Biennial should feature the work of ten artists, selected from a pool of sixty, in addition to forty-nine works by fifty-five artists from the previous year. The 2020 edition will be held in September, while 2020 will mark the fifty-fifth anniversary of the inaugural exhibition.The 2020 theme is 'The Glorious Transgender Century: From Fear to Opportunity and Back Again, from the Gender Revolution to the Gender War.” Preceded by a portrait of the late independent Bulgarian artist Alexei and his wife in a green Nadia Sofya–style pavilion, the 2020 exhibition will feature seventy-two drawings by twenty-six artists, including François Truffaut, Michelangelo Antonioni, and Renzo Piano. The program will also display twenty-six works by women and fifty-five by men. The work of twenty-four artists will be presented by thirty-four curators, including Oksana Levina, Oksana Malanek, and Zoë Tenenbaum.Among the artists who will be represented are Yefimov, Chereb.V.S., Zhugely Mardin, Ali, and Rosiland Seroussi. “The exhibition will provide a platform for contemporary Bulgarian artists to", "The next Biennial should be ready by April. In the meantime, the museum will continue to host programming that engages with the institution’s history, exhibitions, and exhibitions, including: Art and the City: From the Archives of the Getty, 1947–1965; Mission Statements: Art and the Way of Life; A Community of Artists: New York, 1941–1945; and The Triumph of the Artist: Biennial Art in America. The 2020 event will mark the final Biennial of Arts and Culture, which launched in 1987. \n\n\nThe Polidnaya Museum of Art in Moscow has announced that Jana Petrovich, the director of the Vnesheconombank in Belo Moscow, has been promoted to the rank of deputy director. Petrovich takes the post from Alexander Kharitonov, who has been named director of the Vnesheconombank since 2015. There she will work closely with director Andrei Zivtsev, who was appointed director of the National Gallery of Art in Moscow in June.“Petrovich’s appointment marks a new era at the Museum of Modern Art,” said director Anatoly Zakayev. “She has demonstrated a clear,", "The next Biennial should be in September 2021. \n\n\nThe American Civil Liberties Union (ACLU) in New York City filed a complaint on Monday with the state attorney general in an attempt to hold the New York City Police Department (NYPD) accountable for violating the National Labor Relations Act (NLRA) by furloughing and deporting thousands of workers during its six-week manhunt for Dzhokhar and Ismaaiyl Abdullah Nusseibeh, the New York City brothers suspected in the triple shooting of two NYPD officers on Tuesday, October 2, that left one officer dead and five others injured.According to New York Times, the police department laid off more than eighty civilian employees on Wednesday following a three-day strike, and on Thursday, the mayor announced that the city would remain closed through at least October 27. While the closure means that people will have to go without necessities such as food and water, it also means that some ninety thousand workers may be without a paycheck for at least four weeks.The ACLU complaint states that “[T]he City unlawfully closed the public works on Tuesday, thereby depriving thousands of New Yorkers of essential food and essential personal items, and millions of New Yorkers of income during a period of", "The next Biennial should take place in the spring of 2020. The second, which will take place in the fall of 2020, has yet to be determined. A third exhibition, entitled “Beyond the Art of War,” will open in the spring of 2021.\n\n\nThe gallery which recently held the DiGiorno Triennale in Italy has announced that it is planning to move the exhibition from Milan to the city of Turin. The announcement follows the news that the exhibition will be moved from Milan to Turin, which has been taking place since 2009, after the works’ closure.The DiGiorno Triennale is currently closed until March 23. However, according to the South China Morning Post, the exhibition will move from Milan to the city of Turin as soon as the approval process for the construction of the exhibition’s new home in Italy has been completed. The exhibition, which will be inaugurated by “Hiroshima: A Photographic History,” will also be moved from Turin to the city of Turin, the Fondazione Romano di Trentino, and the Turin Art Gallery. It will reopen in March 2021.The diGiorno triennale, which was", "The next Biennial should be held in 2020. Debbie Rutter, the director of the annual festival, said: “The next Biennial will be about the voyages and the exploration of art and what it can be and how it can be used. The next Biennial will be about the artists and the art, not about the art.”\n\n\nThe Bahrain Museum of Art (BMA) in the capital, Manama, has announced the opening of a new digital platform, the Biennial of Bahrain, which will be hosted by the BMA Bahrain, in mid-June 2020. The new digital platform will be powered by Microsoft Cortana, Amazon Web Services, and Amazon Cloud Services.The new platform will be set up with an online database of more than 1,500 works by more than 1,500 artists and curated by a team of curators, including Karima El Samerraie, Faheem Fahim, Hamza Haidar, and Samerraie Kula. It will also include a wiki, what are called platforms, where visitors can upload new works and contribute to the database. The platform will be available for free to Bahrainis and will be hosted by the BMA Bahrain.“The B", "The next Biennial should take place in 2020, and it will be hosted at the Institut National des Arts et Lettres (INAC), Paris.The exhibition will be led by artist Jean-Christophe Herzog, curator Mira-Leonor Taveras, and the provocateur Yoko Ono, among others. It will take the theme \"Blood and Blood-Related Media: From the Painted World to the Digital\" and will present two thousand works on the topic.The exhibition will be held in both the private and public galleries of the Museu de Arte de Paris (MASP), and will run for thirty days. During this time, the exhibition will feature works by seventy-two artists, including Yoko Ono, Pablo Picasso, Lars Von Bengt, and Ai Weiwei.\n\n\nTwo years after the first film, a documentary, titled The Artist in the House, premiered at the Fifty-Seventh Venice Biennale, the organizers of the event have suspended the event\u0097it was supposed to run from March 14 to March 20. The move followed complaints from the artists who participated in the event, including Pierre-Auguste Renoir, whose documentary The Artist in the House (2017) premiered at", "The next Biennial should take place in the United Arab Emirates in 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed John LaRocca as its next director. LaRocca comes to the institution from the Boston-based firm of Perry Speales and Michael Oster. Speales and Oster previously served as curators of the exhibition “The Family Tree: The Art of Early Modern Art” (2017–18), which opened at the Museum of Fine Arts in 2018 and ran until June 30, 2019.“John has a long history of strong leadership and innovative thinking at MFA that has translated into a curatorial approach that is innovative, forward-thinking, and forward-looking,” said museum director Christopher Ryan. “A world-class curator who is committed to making MFA a destination worthy of the city of Boston and the region. I’m thrilled that John’s ambition will bring a new generation of works by talented and contemporary artists to the museum.”Commenting on his new role, LaRocca said: “It is a great honor to lead the MFA as it enters a pivotal moment in its history. The exhibition ‘The", "The next Biennial should take place at the Museum of Contemporary Art in London in 2021, and the exhibition should coincide with a major British biennial. The six artists chosen for the upcoming event are Brian Eno, Mark Rylance, Timur T.A. Haroon, Yoko Ono, Jackson Pollock, and Glenn Ligon.\n\n\nThe National Gallery of Art in Washington, DC, has received a $500,000 donation from the Carnegie Foundation for the Arts (CFA). The gift, which is part of a yearlong gift cycle that began in 2017 and ends in 2020, includes a collection of historical works by artists such as Nicolai Potot, Lesley Manville, and Adrienne Moser, as well as an exhibition of contemporary art. The donation represents the endowment of an original, four-volume set of drawings by the artist Mary Cassatt, a collaboration that earned her the nickname Cassatto. Previously, the Museum of Modern Art has given the artist an annual grant of $500,000 for the cycle. The National Gallery of Art, which is scheduled to reopen in 2020, has also received a $500,000 donation from the CFA. The institution will re-open in 2021 under its", "The next Biennial should take place in the city in 2021–22.\n\n\nThe British Museum (BMI) in London announced today that the institution will soon celebrate its sixtieth anniversary. The announcement follows a yearlong celebration in January 2021 that witnessed a major exhibition of new works by leading artists, including William Shakespeare, Jane Austen, and Franz Kafka.The biennial will be inaugurated with a solo exhibition of work by the British artist Reva Jodi, which will be followed by a major celebration of the centenary of the institution, which will celebrate the milestone with a special exhibition of works by artists who were working in the sixties. The event will also include the launch of the museum’s Digital Museum, a new interactive experience, and a series of events that will present the full range of the British Museum, including tours and talks.The biennial will also feature a new exhibition of work by the American artist Edward Hopper. The show will open on January 8, 2021 and run until February 29, 2021. The exhibition will bring together twenty-six works by thirty-eight artists working in the sixties, which will include works by Marianne Bish, Mary Cassatt, and Ed Ruscha. The show will also include", "The next Biennial should be staged in 2021.   The BMA and the National Gallery of Art are currently negotiating the terms of a special exhibition, “The Future of Art: Design and the BMA’s First World War Collection,” which will open in 2021 and continue to run through 2022. The institution is also negotiating a new contract for the museum’s main exhibition space, which is currently scheduled to open in 2020, and is considering renaming the museum after Alice Biagini, the Italian American architect whose work is widely considered one of the first modernist monumental buildings.\n\n\nThe London-based arts organization the Salomon Smith Foundation, which has been embroiled in a controversy over its ties to the London-based Islamic extremist group Islamic State (formerly ISIS), has announced that it will suspend donations to the organization until it complies with a number of new anti-terror legislation enacted by the United Kingdom and the United States. The new legislation—the Protection of Terrorist Organizational Targets Act, or POTA, which was passed on Thursday and now defines terrorist organizations as “any group or individual designated or authorized by the President or a UK government department or an international organization’s body’s to engage", "The next Biennial should also bring an opening to the exhibition of work in the exhibition. “The exhibition is only a tool, a means of the work,” Takashi Kawane, the artistic director of the Biennials, told the Art Newspaper. “The artist will always be at the heart of the exhibition. And we should cultivate that in the new show.”The opening of the Biennials will take place no later than March 18. The event will be hosted by the National Museum of Japanese Art (NMA) and will be held at the Waltzamatōmoku, Tokyo.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it has granted a revamp of the city’s public art museums, which were left without a complete overhaul because of the pandemic, with a $200 million upgrade designed to improve accessibility, expand the collection, and improve the exhibition space. The project, which involves the reinstallation of the entire museum, “Museum of Modern Art’s expansion, and the redesign of the Central Library,” began in 2021 and will run through 2024.The city’s cultural district revitalization plan"]