["The next Biennial should be held in 2021. The biennial will include works from the collection of Lévy Gorvy, Paris, France; Finnish curator Hermann H. Vaarsen; and Toledo-based artist Eileen Fitzpatrick. According to the New York Times, the museum expects around $18 million of the $23 million it is currently funding to be diverted to the Fight for 15 movement, which aims to improve the conditions of Black workers. “The goal is to have the art stolen from us, transformed into a museum piece, and sold, which is what the museum is supposed to be about,” said Lionel G. Young, chair of the trustees of the fellow New York institution, the Museum of Modern Art. “That will be the theme of the next biennial.”\n\n\n\n\n\nSophia Alborán (1931–2007), one of the women artists who pioneered the field of contemporary art, has died at the age of eighty-seven at her home in Madrid. Alborán’s work, which explores the relationship between the body and the body of the artist, has primarily been exhibited at the", "The next Biennial should be on May 20 and will be co-chaired by Jusuf K. Saeed, the director of the Art Institute of Chicago, and Charles White, the curator of Contemporary Art at the Museum of Contemporary Art in London. ,Art Forum, acronym of the Festival, has announced its representation of the Museum of Contemporary Art (MoCA) in Los Angeles. According to the Los Angeles Times, the institution is considering moving the exhibition to a different venue—presumably the Museum of Modern Art, where it will be featured in a second exhibition, “Art After: Genocide,” that also features works by the artist Joshua Helmer.Helmer, who was born in the Soviet Union, studied at the Academy of Fine Arts in Moscow before moving to London and eventually to New York. In 1996, he moved to Paris, where he would live and work for the next fifteen years. Helmer would establish his first residency in the US in 1999. The following year, he became a master at the Art Institute of Chicago (AIC) in London. In 2003, he moved to the Museum of Contemporary Art in St. Louis, Missouri, and the Museum of Modern Art in New York", "The next Biennial should mark the reopening of the museum. These days, the institution is a hub for exhibitions, talks, and readings by curators and intellectuals. It is also a major international destination for visitors from the United States, Europe, and Asia, and is supported by a long-standing grant from the Rockefeller Foundation. The 2018 edition kicked off with a public lecture by Hilma A. Geller, the director of the Museum of Modern Art in New York, which was followed by a special exhibition of works by German artist Ulrich Mies van der Rohe. Other presentations included the two-hundredth anniversary celebrations of the Monopol Group, which owns the British newspaper the Times, and the first major exhibition devoted to the late Belgian painter Marc Chagall. Previous events have introduced Biennials to an array of artists and intellectuals in the United States and Europe, including a group of scholars and artists at the University of California, Los Angeles, and the Museum of Modern Art in Los Angeles, and to a wide range of cultural figures in the former Soviet Union, including the late writer and philosopher Vladimir Medinsky. Hole, who moved to New York in 2017 and had previously opened an outpost of the institution in Washington, DC, in", "The next Biennial should take place in 2020, and the second in 2021.\n\n\nThe New York–based museum that opened in a former brewery in the old West Brighton neighborhood of New York City has been acquired by the Galleries of Modern Art. The acquisition, announced on Friday, October 4, in the Manhattan boroughs of Manhattan and the Bronx, marks the culmination of a yearlong collaboration between the Galleries and the Museum of Modern Art, which aims to engage with the lives and works of contemporary artists.“The acquisition of the Galleries of Modern Art is a powerful development for our partnership,” said Adam D. Weinberg, the director of the Museum of Modern Art and the Galleries. “The acquisition opens new opportunities for our partners. The Gallery of Modern Art has always been about engaging with and celebrating the creative life of the city. This partnership represents a new chapter in this journey, and we are honored to be able to share it with our partners and the city of New York.”The Galleries of Modern Art, which recently celebrated its sixtieth anniversary, began hosting artist residencies in 2013. In 2016, the institution moved into its current space in the former factory building, which was completed in the early 1970", "The next Biennial should take place in September 2020.\n\n\nThe Art Newspaper in New York has released the list of eleven artists who will participate in the sixth edition of the Shanghai Art and Design Biennial, which will run from March 18 to March 21 in the Chinese city of Kunsthalle Basel, which is only a stone's throw from the Museum of the Communist Party in Beijing. The inaugural event, artopolis, was canceled owing to the Covid-19 pandemic, and the exhibition has been moved to a new venue.The invitation-only event will be staged in a climate controlled building at 850 Fifth Avenue in Manhattan, next to the Museum of Modern Art, and will feature works by sixty-eight artists, including Simón Barba, Gabriel García Márquez, Mark di Suvero, and Robert Irwin, as well as ten new commissions by artist-in-residence Kristina Yu. “In the past twenty years, we have built an enviable platform for presenting the most important contemporary artworks from China,” said Su, who is also cofounder of the American Art Museum Shanghai. “The new venue will allow more artists to showcase their work locally and allow visitors to experience a true", "The next Biennial should take place in May 2022.\n\n\nThe Los Angeles County Museum of Art (LACMA) has signed a major five-year lease with Public Art for 70 percent of its space, part of a larger development plan. The lease agreement between LACMA and Public Art will set the stage for a new partnership between the two organizations.“When we first announced our plan for the museum, in January 2018, we were talking about creating a new kind of museum with a new kind of space. The new LACMA will be a contemporary museum, with a modern and contemporary aesthetic, and will additionally focus on the relationship between art and landscape. The museum will also be a creative platform for engagement with Los Angeles’s urban fabric and its people.”Long-time patrons of LACMA include artists such as William Eggleston, Jules and Lorraine O’Neill, Robert Irwin, Robert Irwin Jr., and Carolee Schneemann. In addition to its literary, performance, and visual arts spaces, LACMA will house the Los Angeles County Museum of Art. The institution also has a former zoo and a former school for artists and sculptors, and plans to develop a new public gathering space called", "The next Biennial should welcome over fifteen thousand visitors in March 2020 and feature performances by thirty-seven artists in the inaugural exhibition. The museum also revealed that it plans to transform the grounds of the museum into a digital platform for the collection of cultural artifacts. Museum director and chief curator Tia Ghose said: “The new architecture of the museum will offer a new dimension to the exhibition, a new interaction between the exhibition and the audience. The introduction of the digital platform will allow the visitors to experience the exhibition in a new way.”\n\n\nArt historian and curator Bradley Scudder, who served as artistic consultant for the London staging of the seventy-fifth edition of the Venice Biennale, has been hired as curator of the fifty-ninth iteration of the prestigious Swiss fair in Kassel. Scudder will be based in the city of Kassel, a city of less than four thousand inhabitants, from January 7 to February 24, 2020. The fair will be organized as a mix of solo presentations and curatorial projects. Scudder will also curate a number of other international exhibitions, including the biennial “Yeasttown: Avant-Garde, Art and the Twentieth-Century” (2019)", "The next Biennial should open in 2021. Art Basel has asked the Grand Prix to delay the opening of the show by six months. The event will not be held in the United States, the United Kingdom, or Hong Kong. The Grand Prix will also introduce a new prize of $100,000. Organizers are also raising the attendance-count of the biennial to 50,000 from the current 25,000. UK pavilion holders include Mark Norman, Paul Mpagi Sepuya, and Ruth and Peter Schäfer. Artforum has reached out to the Galleria Mediterranea for comment.\n\n\nThe Museum of the Fine Arts (MA) in Boston has received a gift of fifty-eight works by thirty-seven artists from the Mansfield-based artist-collective Midway Art.The gift includes twenty-seven works by John Akomfrah, the founder of the show-within-a-show, and one of his collaborations, which was exhibited at the exhibition “Maniacal Magic: The New Art of Michael Faraday” (2017).The gift also includes three works by the late Chicago native Rina Banerjee; a painting by the late American expatriate", "The next Biennial should be held in 2022, and the event will return for a fourth edition, the inaugural event. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is teaming up with the San Francisco Museum of Modern Art (SFMoMA) in California to install new sculptures by artist David Smith, whose work is currently on view in the exhibition “Smith/O” alongside works by artist Rintoul, painter John Mitroff, and sculptor George Nelson. “With the development of the San Francisco Museum of Modern Art, the work of David Smith and other contemporary artists is once more being celebrated in a museum that represents the heart and soul of California,” said Laura Mulholland, director of the MoCA. “The work of Smith and Nelson is a perfect match for MoCA. Working together, they draw attention to how art and design intersects with the cultural landscape in Los Angeles. We are thrilled to be able to present this partnership in the form of a sculpture to the museum, and we are confident that this new partnership will further the museum’s vision of becoming a destination for contemporary artists to explore the possibilities of art in the Los Angeles region.”In addition to", "The next Biennial should take place at the Leicester Square site in November 2021, with the aim of reopening the museum in the spring of 2022.The museum, which was built in 1924, is currently closed until at least July 28, the date of the upcoming exhibition, which is titled “The exhibition of the work of the artist . . . as well as of the work of the art.” The museum will reopen in the spring of 2022. “In this twenty-first century world, it is particularly important to have the most robust exhibitions, both in the arts and in the bi-cultural sector, in order to create the most excellent opportunities for cultural exchange between the United Kingdom and the rest of the world,” said Elizabeth Onyewuenyi, the secretary of the Department for Culture, Media and Sport (CMS). Onyewuenyi added that the museum would also continue to host artworks and performances from around the world, and would make the transition to a new 25,000-seat venue in the city. \n\n\nThe Metropolitan Museum of Art in New York has hired William P. Ooster, who has served in the museum’s art department for more than twenty", "The next Biennial should be held in 2020. The twenty-fifth will be held in 2023. The festival’s next edition is scheduled to kick off in March 2021.\n\n\nArtnews in London has released the list of the seventy-nine artists who will be featured in its fourth edition, “Art and the City,” taking place at London’s Tate and marking the 50th anniversary of the Tate’s opening. Titled “Art and the City,” will be on view until March 19 and will be curated by John Akomfrah, the director of the Tate. “We want this event to be an opportunity for art lovers from all over the world to come together and connect,” said Akomfrah. “The first part of the show will focus on how art can change the way we see the world and the second part of the show will be a discussion about how art can transform the city.”The event’s 2019 winners include Alice Aycock, Emma Bell, Cyrus Black, David Chipperfield, Simone Preston, and Wallace and Gromit. Commenting on their achievements, Bell commented: “I am truly honored to be nominated", "The next Biennial should be held in the spring of 2021.\n\n\nThe Somerset House Foundation, the Somerset Museum, and the Royal Festival Hall have partnered to create a new annual prize for cultural heritage in the form of a biennial award. Named after the Somerset House, a former mill on the River Somerset, which served as a site for many of the institution’s landmark works, the prize was established to acknowledge the contributions of cultural heritage to the community and encourage the exchange and research of works of cultural heritage for the benefit of the wider community.“We are enormously proud of the support this year has received from the community and especially the artists who have been selected, and we are especially grateful for the support from those who have chosen to make their lives and careers possible by giving their work here, and our environment a new lease of life,” said foundation cofounder Nic Dakin. The prize—which will be given by the director of the arts and cultural heritage charity the Arts and Culture Fund, Henriette Atzanoy—is one of several major new initiatives launched by the partnership between the two institutions in order to boost the cultural heritage sector in the UK. The other new prizes are the £250,000 Arts Council Challenge for Cultural Heritage", "The next Biennial should have been held at the same venue, the Museum of Contemporary Art, Los Angeles. It was moved there in 1966.According to Time Out, 'In the early stages of the investigation into the exhibition, artists were allowed to use the museum as a space to explore their own practice. But after a number of young artists were selected to represent the United States at the Venice Biennale in 1976, the institution shuttered. “The decision to close the Arts Hub was made in part as a way of giving artists an alternative way of making work. It was also to shift the focus of the institution away from what was then considered somewhat extraneous,” said museum director Joseph Lubin in a statement. The museum was also forced to move the exhibition “Queer Thoughts: Contemporary Art from the AIDS Epidemic to the Arts,” an AIDS research and art event that was held in the same building as the Biennale, to avoid arrests for demonstrators.The move followed a wave of anti-American Black Lives Matter protests across the US, and the attempted reinstallation of an oppressive white supremacist regime in South Africa. Lubin said that the museum did not “intend to undo", "The next Biennial should be held in 2020.\n\n\nNigel Lloyd-Darnall, the former director of the National Gallery of Scotland, has been appointed the next director of the British Museum. Lloyd-Darnall has been working as director of the National Gallery of Art (N.M.) since April 2019. He succeeds Christopher Le Brun, who retired in April 2020 after a decade at the helm of the institution.“Nigel has been instrumental in bringing the N.M. to where it is today and has led the museum through a process of transition and transformation, building on its strengths as a leading contemporary art museum and introducing new and exciting exhibitions, concerts, lectures, and much-needed investment,” said Baroness Black. “We are very much looking forward to working with Nigel, and to having him as director.”During his tenure, Lloyd-Darnall oversaw the appointment of his long-time successor, Adrian Wootton, as N.M.’s director; oversaw the expansion of the museum’s collection and exhibition program, which has undergone several expansions; and introduced new programs and exhibitions. He also oversaw the introduction of new programming.“Nigel will inherit an institution", "The next Biennial should be held sometime in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is preparing to hold a retrospective of Chilean producer, painter, writer, and educator Arturo Pérez-Girón’s work, Constructivism and the American American Landscape, in 2020. Constructivism, a form of a radical, pictorial-based design that was championed by Perez-Girón and influenced by Neoproubian and post-Oedipalism, called for a new way of life that would simultaneously reinterpret and represent the world, while maintaining a traditionalist aesthetic.“This is an important and crucial moment in history to be conceived and created in the fields of art and the landscape,” said Jorge Roca, the architect and founder of the firm Lumen Architects. “Over the course of his work, Pérez-Girón has developed a stylized, contrapuntal landscape that is uniquely his. He has created a way of thinking about the world in a way that is directly relevant to today’s situation.”The series of exhibitions organized by the firm will feature works that examine the legacy of Pérez-Gir", "The next Biennial should take place in the city of Rietberg, Germany, in the autumn of 2021. The museum is currently negotiating with a local partner to stage the exhibition and is working with a team of specialists to develop a unique environment that will allow visitors to enjoy the works in a controlled environment. The exhibit is being organized by a team consisting of architect Anna-Sophie Gaillard, curator Anna-Maximilian Heuschlüter, curator Heino Ose, editor in chief Peter Nemer, and curator Marta Hölzl.\n\n\nThe Paintings on Paper Foundation, the New York–based nonprofit that supports the visual arts through the sale of artworks, is launching a new initiative that will allow artists and collectors to share a database of twenty-five thousand works by contemporary and famous artists across the world. The initiative will gather data from forty-eight auction houses, including Christie’s, Sotheby’s, and the National Gallery. The first iteration of the Paintings on Paper initiative will launch in the fall of 2020 and will involve offering a digital version of the artist’s catalogues that will be searchable by artist, category, and medium. The database will then be made", "The next Biennial should be set in the city-state in March 2020. Namdi said: “A biennial is a time for reflection and reflection is a time for action. We have the possibility of a great deal of healing in the city of Biennale. We have been healing the city of Biennale for forty years and we will continue to do so until it is healed and free of violence.” The fifth edition of the Biennale will take place at the Stedelijk Museum in Amsterdam from March 18 to March 19, 2020.\n\n\nThe City of New York has dismissed the position of director of the Metropolitan Museum of Art (MoMA) following a tumultuous two-year leadership and fundraising campaign, which ended with the museum’s reopening in December of last year, reports Artnet. Michael J. Ryan, the director of the institution, said: “In the wake of the tragic events of last year, I’ve decided it is not the right fit for me as director. I thank Liz, my board of trustees and staff, and MTA staff for their strong support during this difficult period, and I am confident that we will come out of this campaign with a new", "The next Biennial should open in 2021, but the date has yet to be determined. According to the New York Times, the decision to expand the 2019 event will be made by the 2020 iteration, which will be led by the Chinese artist Zhang Yaping.\n\n\nThe Italian government approved a bill that would allow the government-owned museum in Milan to continue to operate during a planned shutdown due to the coronavirus outbreak. It also approved a bill that would suspend construction and transportation activities and allow the museum to reopen as long as necessary.The legislation, which only addresses the city’s museums, and does not address museums in the country’s far-flung regions, such as Lazio, Diurne, Bologna, and Reggio Emilia, the news agency Corriere della Sera reports. It also only specifies a three-month suspension of the annual legislative session. The Museum of Modern Art (MoMA) and the Fondazione Prada, a private contemporary art museum in Venice, are currently closed due to the coronavirus outbreak.“The bill is not aimed at institutions, but at the entire public, which is the main problem,” Prime Minister Enrico L", "The next Biennial should take place in the year 2020, and will be hosted at the Los Angeles County Museum of Art, the Los Angeles Public Library, and the Los Angeles County Museum of Art (LACMA). The event will also feature a retrospective of the work of Marc-Olivier Gissen, a Belgian master known for creating works that draw from pictures, sculpture, painting, and sculpture and from the history of cinema.“The LACMA Biennial will not only include new artists but will also show how the Los Angeles area has developed into a center of creativity and innovation,” said LACMA director Timothy Potts. “It is an exciting time to think about the art of the digital. We hope that our visitors will be inspired by the work of the first group of artists in the city, from the LACMA Biennial 2020, and encouraged to pursue their own interests in experimentation and experimentation in art.”For the biennial’s inaugural iteration, the theme of the event was “the future of art.” Projects will include “Marc-Olivier Gissen: The Weird Life” (2019); “Marc-Olivier Gissen: The Evolution", "The next Biennial should announce its selection in May 2020 and will host an open house in the autumn of 2020. The exhibition will consist of a selection of works by ten artists selected for their respective specialties from the following categories: Architecture, Beauty, Biennial, Contemporary, Contemporary Art, Fashion, Prints, Photography, and Television. The exhibition will be inaugurated by the exhibition “A R I S E L I D E,” which opened in the opening of the Biennial in Amsterdam, and will conclude with a lecture series on the history of the Biennial in March 2021.\n\n\nThe Monterey Biennial, which has been open since 1993, has announced that it will not resume its current programming following the 2020 edition, which was canceled after a gunman entered the exhibition and began shooting at a pop concert in the United States on March 13. The Los Angeles Times reports that the 2020 event’s last day in San Francisco will be March 22. The event’s online version, which was scheduled for March 20–March 22, will remain open through March 29.The 2019 edition of the biennial featured work by seventy-five artists, including Jeanne-Claude, Tom Friedman, Daniel Holmberg, Alexander Khimki", "The next Biennial should be held in the spring of 2021.\n\n\nThe National Museum of Fine Arts (NMFA) in Washington, DC, has welcomed seven new members to its board of directors: artist and artist-in-residence Charles A. Martin, the founder and director of the monastic community in New Hampshire, which is beginning to reopen after a $50 million expansion made in 2017; artist-in-residence Laura DeSousa, a New York–based artist and former director of the Whitney Museum of American Art in New York; and artist-in-residence Amanda Hess, a Minnesota native who lives and works in New York.“The board is excited to welcome these new members,” said board president AoM Member and CEO Lizzie McNamara. “Charles and Laura are dedicated to supporting art through their practice and are committed to expanding the museum’s educational mission. We are thrilled to welcome them to the board and their respective communities.”The board also welcomed Richard Gere, a longtime member of the museum’s board of directors who has served on the NMFA board of trustees since 2007, to the board. He will be the third board member to helm the institution since", "The next Biennial should be held in the summer of 2021. It is now being organized by the Exhibitionist Alliance, a nonprofit organization whose board includes Albert Gijsels, president of the Belgian Association for Contemporary Art; Harriet Weems, director of the Institute of Modern Art in London; and Joseph and Joanna Gass. The 2019 event, entitled A Vision of the Future, was held in the underground Bauhaus in Hamburg.\n\n\nThe estate of the late British architect Frank Gehry and his son Michael have purchased two hundred acres in the foothills of the Annunaki in the central New Zealand town of Manukau. The acquisition of the land, which was once home to the Gehrys’ family’s granaries and the gardeners who grew the family’s signature loaves, was made in a deal that also yielded the estate a large majority stake in the New Zealand architecture and design industry.According to the New Zealand Herald, the Gehrys’s estate is now funding the acquisition of work by artists such as Peter Sellous, Leila Al-Saadi, and Bernard Rossin, as well as by museums and historical sites, including the Nelson Mandela South African Museum", "The next Biennial should come as no surprise to anyone who has followed the series over the years. It was founded by Hans-Ulrich Bienn and Hans-Ulrich Karlsberg in 2009 to focus on the biennial’s encyclopedic breadth. In order to achieve this, the exhibition will be held in three locations: Berlin until April 11, 2020, and Munich from April 14 to April 16, 2020. The third edition of the Biennial will be held simultaneously in Hong Kong, Shanghai, and New Delhi.\n\n\nTatjana Van der Heide, the Dutch artist whose work combines urbanism in form and landscape, has died at age forty-eight. After receiving her master’s degree from the Sorbonne in Paris in 1938, Van der Heide became a member of the group of artists whose works were featured in the show “Het Reap,” which opened in Paris in March 1939. In the series “Peregrinations” (2011), she sketched an urban landscape in which the central building, the Institute for Human Development, was located in the middle of a sprawling park, and the museum was housed in a massive national library. Her works have been acquired by", "The next Biennial should take place in 2021’s iteration of the festival, which is also sponsored by the government of the Republic of Togo and the state of Equatorial Guinea. The next edition will be held in the capital, Manaus, and will aim to draw 3.5 million visitors from the continent.\n\n\nThe Art Newspaper reports that the European Court of Justice has upheld a temporary ban on new works by Josef Althi. Althi was detained in Austria last June for allegedly violating copyright law by uploading a work that was not a work protected by copyright law. The Court found that the ban was justified on the grounds that the work did not comply with an exemption for performance that was made for the purpose of facilitation of a work, which is one of the grounds for the blanket ban.Althi was arrested when he attempted to take a work by German artist Heinrich Kupchak—which was on display in the exhibition “Virg the Saint: Ritual of the Dying'” at the Museum Ludwig—out of Austria, where it was being displayed, and was detained for four days before he was released. The court ruled: “The ban is justified on the basis of a clear and present", "The next Biennial should take place in 2019.  In May 2019, the Museum of Contemporary Art (MoCA) in Los Angeles will host a new iteration of the exhibition, “Small Art, Big Picture.” The exhibition will culminate with a retrospective of the work of the artist Desmond Sattel, which will also open at the Museum of Contemporary Art in New York next month.\n\n\nThe 2020 edition of Art Basel Hong Kong will be held at the Hong Kong Convention and Exhibition Center (HKCEC), a city-funded facility located in the city of Hong Kong, from November 3 to November 6. The third edition of the fair, “Art in Asia,” will also feature new works and will be held in collaboration with the Hong Kong Art Museum (HAM). The event will take place at the Kunsthalle Basel in the city of Basel from November 4 to November 6, 2020.The fair will be held at the HKSAR Contemporary Art Centre in Seoul, the HIFIMATE Art Museum in Helsinki, and in the renovated Kunstmuseum Freiburg in Hanover. The second edition of the fair, “Art in Asia,” will take place at the Hams", "The next Biennial should be held in two years. The British artist, whose works are based on his experiences as a student in the US from 1957 to 1959, has been featured in the Biennial twice before. His first exhibition, held in the city of New York in 1961, received twelve thousand visitors. This was followed by his first solo exhibition in the city in 1963. Throughout the years of his exhibition, Brown has been featured in numerous annuals, such as the 2007 show at the Museum of Modern Art in New York, which re-created the exhibition in the studio of Anne Tenenbaum, and the 2011 show at the Museum of Modern Art, which was staged in his home.Brown’s work—which encompasses paintings, drawings, sculpture, photographs, printmaking, and video art—is currently on display at the Art Institute of Chicago. In a 2018 Artforum interview, Brown said: “I am a block of what I call gravitas. If I were to paint it, it would be a gravitas painting, but I don’t know how to paint, and I don’t want to paint. I want to be around things, and I want to", "The next Biennial should be an exhibition of works on paper,” the artist said. “Entirely different from the previous one, this one should be well organized and should include some drawings, an abstract form, and lyrics.” While the artist is working on a new exhibition, the work will be on view in the exhibition “Notes, 2019,” which will run from January 28 to March 20, 2020. The exhibition will feature new works by the same group of artists that will be participating in the past two editions of the Biennial. The group is now represented by Art in the Time of Crisis.\n\n\nThe Python Museum in Calgary, Canada, has received a gift of more than 4,000 photos, films, and video clips from artist and activist Ai Weiwei. The donation includes works by artists such as James Turrell, Ngaire Murray, and Thomas Newton, which are currently on display in “The Motion Picture” (2019) and “The Color of Space” (2019), respectively.“Otobong is a powerful tool for political resistance, for demonstrating that we are capable of better, more complex, more nuanced, more ambitious, more visionary things,” ", "The next Biennial should be held in Tokyo in 2020. The venue will be a larger and more ambitious version of the museum, which is currently housed in the same building as the museum of modern art in central Tokyo. The extension will add more galleries, a theater, a library, and a park, and will also include a new building for the exhibition program, a new collection, and a new venue for educational programming. The renovation of the museum was started by Fumio Matsuda, a former curator at the institution, and his son, Takashi Matsuda, who is now the museum’s director. The museum was originally scheduled to open on February 22, 2020, but was pushed back to September. “These are challenging times, and I am deeply concerned by the crisis in Syria,” Matsuda said in a statement. “As the museum’s director, I have worked hard to make sure that the future of the Biennale is at risk. I am aiming to find ways to connect to and strengthen the contemporary art of our time through programming dedicated to artists and their work, art that is inspired by regional, national, and international identities, and art that is made in the spirit of international exchange", "The next Biennial should be held in 2020. \n\n\nThe Metropolitan Museum of Art announced today that it is reopening in the spring of 2021 following a $50 million expansion project. The museum will begin welcoming visitors, and will hold a Summer of Art event for students and families in the fall, and will reopen in the spring of 2022.The project was made possible through the generous contributions of four individuals: Joel Katz, the former CEO of the private investment firm Apollo Global Management; his wife, Barbara; and his sons, Tyler and Michael. The total investment is around $75 million.Funded by a private-sale, the new $65 million building, which is being built on the site of the former Burnett Glass Building, opened to the public in March 2020. The new museum will also boast a 1,500-seat theater, a bookstore, a gallery, and a restaurant. Its format will remain the same; the event space will be expanded to a 1,500-seat venue, and the museum will continue to operate as an educational institution.“Our vision for the Met is to become the preeminent contemporary art museum in the United States,” said Met director Christopher Campbell. “To accomplish this, we are doubling down", "The next Biennial should take place in 2021, and the first in 2022. The 2021 event will be organized in Madrid and will promote the theme “Time for Change”\u0097a reference to the 1979 uprising in Tunisia that led to the removal of dictator Ben Ali. The 2022 event will be in New York, and it will be the last for the exhibition, which has been on view since 2002. “The museum is committed to a number of creative, educational and artistic projects that engage with our collection and life as well as with the city of Madrid,” the institution said in a statement. The full list of participating artists is as follows:Bradley Davis (United States)Bradley Davis (United States)Bradley Davis (United States)Bradley Davis (United States)Bradley Davis (United States)Bradley Davis (United States)Bradley Davis (United States)Bradley Davis (United States)Bradley Davis (United States)Bradley Davis (United States)Bradley Davis (United States)Bradley Davis (United States)Bradley Davis (United States)Bradley Davis (United States)Bradley Davis (United States)Bradley Davis (United States)Bradley Davis (United States", "The next Biennial should be held in 2020, with the penultimate exhibition to take place in 2021, and should be a follow-up to the 1971 exhibition, “The Last Days of the Earth on Paper,” which was organized by Richard Avedon and which was hosted by the University of Texas at Austin. The 2019 exhibition was staged at the Museum of Fine Arts, Houston. It closed on December 26, 2018.\n\n\nNancy Sinatra was awarded a lifetime achievement award at a ceremony held at the Los Angeles County Museum of Art (LACMA) on Monday, February 21. The Los Angeles native, who was one of the first artists to be granted the honor in the United States, was presented with the award for lifetime achievement by director Klaus Biesenbach. The MoMA director selected the award for its “untiring efforts to advance the art of female autonomy and the role of women in society,” concluding that Sinatra is “the artist whose work embodies the best of all possible approaches to the art of beauty.”Born in Burbank, California, in 1936, Sinatra first met her future husband, Klaus, at a 1974 Los Angeles Art Book signing. They married in 1969 and boarded a plane", "The next Biennial should take place in 2019. \n\nThe Centre d'études de Japan offers independent exhibition space in Tokyo until March 2020. The Centre d'études de France (CFF), Paris, March–April 2020, and the Centre d'études de Italy (Cejl), Milan, April 2020.The Centre d'étudies de France (CFA) in Paris will remain closed until March 2021.\n\n\nThe Museum of Fine Arts (MFA) in Cincinnati has received a gift of seventy-two works from the collection of the late sculptor Erma and her husband, the late artist John Akomfrah. The gift includes work by forty-six artists, including Charles-André Assai, Dennis Bujold, Joel and Gale Allison, John Ahearn, Odilon Boyajohn, Herman H. Blum, Lévy Gorvy, Joel Kipchak, Orientalist Yinka Shonibare, and many others from the collection of the legendary American architect Frank Gehry.“We are extremely proud to present these sculptural works to the world,” said MFA director", "The next Biennial should be held in 2020.\n\n\nFrench president Emmanuel Macron has ordered the closure of all public museums in the country, including the Louvre, the Palazzo Nazionale di Modena, and the Louvre Chemin du Cinéma. The announcement comes after a series of incidents involving visitors to Paris who were mistreated by staff at the two institutions—the Louvre and the Palazzo Nazionale di Modena.The incidents occurred in January, February, and March. In January, a twenty-four-year-old Palestinian tourist from Beit Hanoun, near the northern West Bank city of Ramallah, was arrested for trying to enter the Louvre by climbing a security fence and was arrested by French police for violating a number of social distancing measures. Following the incident, the French Ministry of Culture launched an investigation into the complaints, and the Louvre was forced to close its doors for two months.The Palazzo Nazionale di Modena, which has a capacity for more than nine hundred thousand visitors each year, confirmed that all staff, including curators, had been let go but said that the institution would continue to operate as normal. “The decision to co-operate with the", "The next Biennial should take place in the spring of 2021. \n● Art Basel Hong Kong: Originally scheduled for March, the 2020 edition is now postponed. The event will now be held in March 2022. “We are still assessing the situation, and we are confident that we will be able to present a strong exhibition in the spring of 2021,” said Art Basel, in a statement. \n\n\n\n\n\nThe Museums Association (MA), the UK’s professional trade association for museums, has released guidelines regarding the display of works in its annual World Museum Exhibition (WMFE), which was originally scheduled for March 20–March 21, 2020. The document outlines how institutions may display works during the September 2020–March 21 event and outlines special considerations for galleries and non-commercial exhibitions.MA president Rosalind Reid said: “This is a moment of tremendous change for museums. We are committed to making the WMFE 2020 as exciting and engaging as possible for visitors and collectors, while continuing to protect vital cultural assets, such as the art, science, and architecture of the future. We recommend that institutions carefully consider the exhibition format, display and exhibition material, exhibition location and audience and exhibition budget before", "The next Biennial should be held in 2020.”Both Andrew Kreps, the director of the Metropolitan Museum of Art, and Rebecca Reich, the senior vice president of the Museum of Fine Arts in Los Angeles, said that they expect to institute new initiatives and new programs that will address the health, safety, and well-being of visitors to the institution. The new initiative, called the Automatic Biennial at the Museums, will focus on the care and prevention of visitors to the Musée, including how to prevent the spread of Covid-19, how to prevent hospitalizations and how to prevent the spread of the virus.The new initiative is being developed by the Smithsonian’s Diller Scofidio + Renfro and the Los Angeles County Museum of Art’s David Geffen and is being piloted by staff at both institutions. The museum will have additional staff on staff to help with the rest of the exploratory program, which is being financed with an endowment from the family of John D. Rockefeller, the founder of Standard Oil. The institute will also have an endowment from the Rockefeller Brothers Fund.In an attempt to reduce the risk of Covid-19 returning, the institution is capping the number of", "The next Biennial should take place in the autumn of 2020. Until now, the upcoming exhibition will have been a codirectorship-driven project. The project will now take its place alongside the forthcoming retrospective of the work of the Los Angeles-based artist Remo Le Brun, which will open in November 2020. Its theme is “Change and its aftermath.” “The future is a construction of our future,” said curator and curator of contemporary art Thomas Merton. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released a statement regarding the ongoing protests in the city over the past few days, wherein residents have been demonstrating against the management of the museum and the cultural district. While the institution has stated that it’s “aware of the recent protests and passionate about preserving and championing the arts and the community, it’s a ‘matter of routine for us.”The statement reads: “We are focused on building a more just and inclusive world, and we’ve been working to implement changes to improve the way we do business, while continuing to give our artists and staff the opportunities and opportunities to transform lives through the arts. At the same time, we respect", "The next Biennial should take place in the city in 2020. The Biennial will be based around the theme “Human Rights.”\n\n\nThe Chicago-based nonprofit Chicago Art Museum (CAM) has received a gift of more than five hundred works on paper by award-winning artist David K. Gallant. The gift includes more than 300 works by the artist from the collection of the artist’s longtime collaborator and business partner, John Gallant. Gallant is known for his devotion to the body and his practice that employs art objects such as glass, puppets, and dolls to bring his stunningly detailed works to life.The organization is currently working to add more than three hundred works by Gallant, who died earlier this year, to its collection. The work-at-home exhibition will debut at the museum on February 14, 2020.“David Gallant is a great human being,” museum director Chris Graham said. “His art has been used to help us become better people, to help us move forward, to help us make the most of the marvelous world. We have been inspired by his work since he first began making it with John in 1989, and we are grateful for this guarantee.”The gift", "The next Biennial should be held in 2021 and will be organized in cooperation with the Museums Association of the Republic of Armenia, the President of the Republic of Armenia, and the Executive Committee of the Association of Arts. The exhibition will be organized as part of the Joint Programmes for Research and Innovation (JPRI), the country’s science, technology, and culture (STC) program, and will be organized at the National Gallery in Tbilisi.Commenting on the discursive potential of the exhibition, The Saint Petersburg International Film Festival director Pavel Gusev said: “The exhibition ‘Unseen: The World's Most Dangerous Surveillance,’ will raise awareness and a lot of important issues for new audiences. We are presently working on a new position for the exhibition, which will bring together some of the most important artists and will focus on the history of surveillance and its development. It is our ambition to present a project, not to organize the exhibition, but to present a collection of works that will stimulate and attract new audiences.”The exhibition will be divided into three parts: “The First Video Surveillance,” “The Second Video Surveillance,” and “The Third Video Surveillance.”\n\n\nThe", "The next Biennial should be held between July and September 2021. The next Prince of Wales Biennial will be held between July and September 2022.  The next Biennial of British Art will be held in October 2020. The next Royal Academy of Arts Biennial will be held between February and May 2021 and will be held between March and April 2021. The next Royal Shakespeare Company Biennial will be held between February and November 2021. The next Royal Opera House Biennial will be held between March and April 2021 and will be held between March and April 2021. The next Royal Festival of Music Biennial will be held between March and April 2021 and will be held between March and April 2021. The next Royal Opera House, the Theatre of Life, and the Tate are all currently closed. The next Royal Shakespeare Company will be held at the Metropolitan Opera House from March 15 through March 19, 2021.  The next Royal Opera House, the Theatre of Life, and the Tate are all currently closed. The next Royal Opera House, the Theatre of Life, and the Tate are all currently closed. The next Royal Shakespeare Company will also stage a new production of King Lear at the National Theater of England through October 20, 2021.", "The next Biennial should focus on themes such as the legacy of the museum and the city of Chicago, and the importance of preservation, Hamilton said. The museum has already received a gift of $8 million from the Chicago Foundation for the Arts, and the Chicago City Council has pledged $1.5 million for the project.“We are thrilled that the city of Chicago and the Chicago Foundation for the Arts have agreed to fund a new Biennial of Art to honor the city’s rich history,” said Elizabeth Armstrong, chair of the board of trustees of the Chicago Foundation for the Arts. “This is an unprecedented year for Chicago, and we are eager to launch a new Art Museum with a strong and dedicated team. Working closely with our trustees, we were able to establish a long-term strategy that includes both a significant renovation and a new museum in the city’s historic Grant Park neighborhood, and we are confident that the new museum will continue to thrive over the next nine years.”The new museum will be built on the existing site of the former General Motors assembly and tire plant in Chicago’s Little Village neighborhood, which sits on the northwest corner of the city. The museum’s inaugural exhibition, “The", "The next Biennial should be held at an appropriate location in the city of Tokyo in 2021. Games and exhibitions should focus on the themes of historical memory, the people, and the art, and the city should be a major setting for the exhibition. As the theme of the next edition of the Biennial was “Memory and the Future,” Hiromasa Takahashi, the president of the Tokyo branch of the association of visual arts, said, “We are working hard to make the next edition a success. We believe that a new kind of image-making will emerge from the exhibition. Influenced by the invitation to the exhibition, we are preparing to present the exhibits on the theme of the exhibition in 2021.”\n\n\nThe Pérez Art Museum in Mexico City, which opened in 1916, has announced that it plans to close its doors permanently in 2025. The museum, which is currently undergoing a $7 million expansion, has been closed since March 31, and plans for the future of the institution have been uncertain owing to the Covid-19 pandemic.The Pérez Art Museum’s director, Bernadette Rocca, told the Art Newspaper that the museum would “continue to function as an institution", "The next Biennial should be an Irish effort, but also an international effort. We are sure that a lot of people are interested in the history of our country, and how it relates to the rest of the world.”\n\nThe National Museum of Ireland (Nima) in Dublin will no longer be a part of the upcoming biannual event, which was rescheduled for the second half of June. The announcement comes in the wake of a wave of protests against the institution, which was founded by Irish-born economist Brendan O'Neill in the capital in 1972, from all over the world.Since the demonstrations began in March, attendance at the museum has plummeted, and it has remained shuttered since March 20. Many have blamed the museum for exacerbating the current global health crisis by keeping open its recently closed gates even as the number of new cases of the coronavirus continues to grow.The Contemporary Art Museum Dublin (CAMD) has also been criticized for its handling of the coronavirus. Its director Paul Coetzee claimed that the institution “did everything it could” to contain the outbreak, but he admitted that the increase in cases is the “result of an under-resourced, overworked, and under", "The next Biennial should be held in 2021.  “The construction of the exhibition and its future planning are the responsibility of the institution, and it is our task to focus on the most relevant aspects of the exhibition, such as the distribution of the collection, the presentation of the work, and the listening of the public,” said Kuehnel. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has received a gift of more than one hundred works by eight artists from the collection of Williamie and Nancy Soto, who passed away at the age of eighty-two last year. The works, which were donated to the institution in 2017, are Tania Bruguera, Todos Santos, Dina Satterwhite, Marcelo and Reinaldo Ferrer, Diana Juarez, Nancy Lee and Thomas, and Julia Merz, who was known as Juana. Diana Juarez is currently on display in “Diana Juarez: The Space Between Worlds.” Joel and Edna Zucker, who jointly purchased the works in 2017, said: “These two lifelong friends and collectors will continue to work closely", "The next Biennial should focus on the topic of 'Why are modern and contemporary art historians so different?'. The theme should be “Theoretical Thinking,” which will incorporate all strands of contemporary art history; biennial organizers suggest that the exhibition should start with a “process of thought and not a project of artwork.”The workshop will be moderated by Quai Jean-Jacques, a curator and writer based in Paris, and will start on January 27. The inaugural exhibition “The Biennial of Modern Art” will take place at the Museé de la Biennale in Paris on January 29–February 27. The event will send the theme “Theoretical Thinking: A History of Art” to the Paris Biennial of Modern Art as well as the inaugural exhibition “The Biennial of Modern Art: The Poster Concupiscope” at the Musée National d’Arles. The work will be presented in the museum's original location in the City of Parma for the first time in 2019.The opening of the exhibition “The Biennial of Modern Art” will be at the Musée National d’Arles from January 26 to January 29. The exhibition", "The next Biennial should be held in 2020, with the date to be announced at a later date. \nJanuary 18, 2019: Artnews, the leading art news and information website in the United States, reports that the city of Berlin has announced that it is planning to demolish the neo-Nazi and xenophobic Stasi–Österreichische Kunstverein (SPK) complex, which houses several hundred thousand artworks from the Nazi era, to make room for a new Bund, named the Bundestag Bundeiterum, or Bundestalle. The new venue will be inaugurated by an exhibition of works by the German artist Adam Mänster, an early polymath who experimented with materials including glass, ceramics, and even human skin, in the summer of 2019.The renovation of the iconic building, which was completed in 1933 and opened in 1932, was completed in 2013. The redevelopment plan, which was approved by Berlin mayor Klaus Wowereiter in 2015, proposes to completely restructure the museum, overhaul the grounds, and build a larger, modern, and more accessible exhibition space. In doing so, the city hopes to make way for Tumelerstrasse, a new museum dedicated to", "The next Biennial should be held in late October or early November. Booboo was appointed as the director and curator of the event. According to a release, the new director will be tasked with “developing and implementing a new and unique way of organizing the Biennial,” and will “utilize the Biennial’s rich collection of contemporary art and design to reveal the voices of emerging and established artists and designers.” The new role was created by the appointment of Booboo to the board of trustees of the Biennale de Lyon (BLOOM) in March 2018, following its dissolution in March 2019, and was ended by the board of directors in June 2020.In his new role, Booboo will be responsible for promoting and organizing the exhibition “Amore Lumi,” a new film by Shinichiro Nishimura, which will visit the museum and the galleries that housed the collection for the first time during the exhibition, and will collaborate with the UCCA to develop “Amore Lumi,” an exhibition that will explore the relationship between Lumi, a floral print by Sylvia and Alejandro Barozzi, and the city of", "The next Biennial should have been the first one that focused on the work of men in the arts, and we are disappointed that the decision was made to focus instead on male artists.”\n\n\nFrieze has announced that it is launching a new initiative, the Artist/Collector Forum (ACFC), which will focus on connecting art collectors and artists. The eight-week event, which will be held at the Frieze London headquarters in London, will invite artists to share their experiences and discuss the art they are currently exhibiting.“This is an unprecedented and challenging time for collectors and artists, and it is essential that they engage with one another, discuss and discuss,” said Frieze London managing director Maria Balshaw. “The Artist/Collector Forum will allow collectors and artists to gain insights into one another’s practices and to share their collections in a timely and meaningful way. We are committed to supporting collectors and artists in their ongoing work to build relationships and to support one another in our diverse world. The Artist/Collector Forum will be very much in the spirit of the Gallery, and in keeping with Frieze’s mission to present the most daring exhibitions and to showcase the most innovative work.”The", "The next Biennial should take place in 2021.\n\n\nBritain and France signed an agreement on Monday that will establish an international platform for curating and exhibiting works by artists currently residing in the former colony of Mauritius. Titled the Fiscal Regime for Contemporary Art, the program will offer grants of up to $10,000 to artists in the United Kingdom, France, and the United States, who will have five years to establish and run their own institutions.“In the wake of the devastating fire that took place at the Grenfell Tower in London last week, and the evacuation of large swaths of London and other major cities, the British and French governments are determined to work together to support and encourage the development of new live art and creative practice,” said British Culture Secretary Sajid Javid. The document establishes a three-year grant cycle for artists whose works are currently on display at Tate Britain, Frieze London, and the Serpentine Galleries in London; a five-year grant cycle for artists whose works are currently on display at the Serpentine Galleries, Tate Britain, Tate Modern, the National Galleries of Scotland, and the National Galleries of Ireland; and a one-year grant cycle for artists whose works are currently on", "The next Biennial should take place in 2021, and the first in 2022.  MORRISTON, THE ARTISTS: A NEW SUMMER ARTISTS COLLECTION IN THE CITY OF NEW YORK Reissue of the first museum-focused edition of MORRISTON, THE ARTISTS, which opened in December 2019. The biennial will also introduce a new summer performance series and an expanded literary program. Geneva-based artist-run space i5 will launch a new residency program. The Loft Art Center will reopen with a new line of installations, sculptures, and performances at 10 AM on Friday, August 8. The opening of the venue was postponed due to the Covid-19 pandemic. The space will also host a new artist-in-residence program, a solo exhibition, and a series of events and lectures. NEW YORK TIMES BEST-SENIOR ARTISTS: NEW ORLEANS 2017–18BEST-SENIOR ARTISTS: The 2019–20 school year marks the first time that the institution has staged a retrospective since it was founded by Horace Dazeley in 1949. The exhibition will feature work by thirty-four artists, including Mar", "The next Biennial should be held in the spring of 2021. In the meantime, the organizers have released a statement on the museum’s website that reads: “We extend our deepest sympathies to the family and friends of the late curator and great collector Nari Ward, and to the many wonderful people who have lost their lives through the senseless terrorist attacks in Paris.”Ward was one of the mainstays of contemporary art in France and was founded in 1970 by her parents, Georges Ward, a painter, and architect, and her brother, Jacques. She was a prolific writer and commissioned many works by artists such as Pierre-Auguste Renoir, Pierre-Auguste and Serge Gisèvre, Jean-Luc Godard, and Jean-Pierre Jeanneret, among others. Her first book, Tourette (1977), is a sort of companion piece to The Lost Symbol of Art , a 1993 retrospective organized by the Museum de Paris. The exhibition, titled “Between the Sun and the Moon,” featured works by such notable French artists as Ed Moses, Yves Klein, and Pierre-Auguste Renoir. In 1968, she went on to organize “Ce de l'Art et", "The next Biennial should focus on the history of modern design, with a particular reference to American art, and a focus on the United States, and should invite a discussion with a view to providing a framework for a future edition in the city. In a letter to the curators of the upcoming edition, Guggenheim director Christopher Knight wrote: “We are aware of the commission of a new exhibition, ‘The Future Is Present,’ in the city next month, but it is a new exhibition, and it is not our intention to present it.”Nominated by curator and activist Craig Thompson, the show will be curated by the curator of contemporary art, Diane Arbus. It will be led by a group of leading contemporary art thinkers spearheaded by John Knight, who was appointed director of the museum in 2017. The inaugural exhibition will focus on how contemporary art has impacted the lives and health of millions. The exhibition will be organized through an eclectic array of performance, installation, photography, performance, and other media, including video games, video, books, film, and printmaking. \n\n\nAfter the 2017 Australian pavilion at the Venice Biennale, a group of artists and cultural figures issued an open letter", "The next Biennial should take place in 2022. In March an online petition was launched to save the exhibition from its closure and to secure the future of the exhibition, which was one of the last works by the late artist Pierre-Auguste Renoir. The petition garnered more than 3,500 signatures and was submitted by a number of individuals, including Pierre Huyghe, the former director of the museum, who described the show as a “great inspiration. . . . A masterpiece of the visual arts.” As part of the effort to save the show, the museum began reopening on April 10. The conservation group the SculptureCenter, which is affiliated with the museum, launched a fundraising campaign to help prevent the show from closing permanently in April. Peter Smart of the SculptureCenter said that the organization has received support from the MIDWESTAKERS Association, the New York City Department of Cultural Affairs, and the New York State Department of Cultural Affairs. A statement posted on the organization’s website reads: “The Art Newspaper is very supportive of the SculptureCenter’s efforts to preserve the exhibition. We appreciate the support of the museum and the public and", "The next Biennial should take place in the Spring of 2020. The twenty-third and twenty-fourth editions will be held in the spring of 2021. The program’s inaugural exhibition, “Concerned Citizens: Environmental Justice in a Time of Crisis,” will be staged in the fall. The 2019 edition, which was organized by the French-based organization the Centre d’Art Contemporain (CAC), featured work by sixty artists, including Hayao Miyazaki, Elia Mauduit, and Adam D. Gibson, and was held at the Bourse de Commerce in Paris. “The exhibition was definitely a step forward for the exhibition program at the CAC,” said CAC director Catherine Dubois, who is also the CAC’s director and CEO. “The exhibition was an opportunity to present new works by artists who are at the forefront of challenging the current political and cultural model of the arts. . . . The exhibition was a great success and the program was even better. We were fortunate to get the full support of the CAC, the National Theater of France, the Musée d’Orsay, and the National Galleries of French Art.�", "The next Biennial should be a celebration of the life of the late Japanese artist and thinker Takashi Takeda and the exhibition should begin with a discussion of the international and cultural exchange between Japan and the rest of the world. In addition, the exhibition should include the exhibition of the work of the artist Saotome (1923–2009), the work of the artist Sadakazu (1928–2009), and the work of the artist Kihara (1903–1977).The years from the end of the Second World War to the beginning of the twenty-first century have seen a marked increase in the number of exhibitions and other educational projects in Japan dedicated to the history and culture of the Orient. The capacity to do this is a reflection of the modern and contemporary way of thinking about Asia, and a reflection of the vitality and beauty of the region. The new exhibition should highlight the interrelationships between art and architecture, art and architecture, and art and art and history.The theme of the exhibition should be “Origins of Modern Art,” and the exhibition should take place in the context of a series of lectures organized by the artist Chikako Nakajima. The series will explore the roles, histories, and developments of ", "The next Biennial should be held in the spring of 2021, with a new venue in the city’s Art District, and the exhibition should aim to reflect and mobilize the best and most cutting-edge creative practices within the city. In a letter to the Art Archives which should go to the board of trustees of the museum, Rosemary and James Larmon, president and cochairs of the foundation, wrote: “[T]he exhibition will also be an opportunity to see exhibition-quality work in the company of world-class artists and thinkers in the city’s Art District and Art Museum. We believe this exhibition will be a landmark in the creative lives of the city’s residents and neighborhood, and we hope that it will be an inspiration and a source of inspiration for future projects.”The Biennial will be organized as follows: 1) The official opening for the exhibition, which will run from March 3 to March 7, 2021, at the St. John’s Episcopal Church in Brooklyn, New York. 2) The exhibition will begin with a group performance by Colton Barnwell at the Brooklyn Academy of Art in Queens, New York, on March 3, 2020. The rehearsal will then", "The next Biennial should arrive in the United States at the end of September. The exhibition will consist of fifty works by twenty-seven artists from forty-eight countries. The first exhibition will focus on the artist-soldier relationship, and the second on the concept of the mass.In the lead-up to the upcoming exhibition, CNA are encouraging the public to use the hashtag #art_style’s, #art_of_s , and #artists’s to encourage a greater awareness of the many outstanding artists of the twentieth century. In its place of art, the hashtag “artists” will be stimulating the public’s curiosity about the work of the present generation.“We are eager to see how the art world will react to the settings of the exhibition,” an artist-spokeswoman for the biennial told the Art Newspaper. “It will be a wonderful occasion to re-create the world in which the biennials will come together in September.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has launched a $500,000 fund for exhibitions that are at least sixty years old but do not have a full-time curator. The program, which", "The next Biennial should be held in 2021. The first was held in 2006. Participating artists include Alan Serkin, who presented A Reply to Christopher So’s “Black and white” in 2013, and Suspended Animation artist Jonathan Sarkis.\n\n\nThe Museum of Contemporary Art (MoCA) has appointed Shunsuke Kikuchi, who has helmed the institution since 1995, as its next executive director. He succeeds Kiki Martinez, who is retiring after twenty-five years at the helm of the institution. “Shunsuke is a leading curator and educator who has been instrumental in the Museum’s journey to become an international leader in contemporary art,” said Museum director, Christopher York. “His vision and commitment to MoCA have been exemplary, and his leadership has continued to shape MoCA as a cultural destination for LA’s artists. We are grateful for his service and look forward to seeing where he leads the Museum in the years to come.”Kikuchi first joined the museum in 2003, when it was still known as the California Institute of Technology, as director of its Center for Contemporary Art. In 2008, he became director", "The next Biennial should focus on the history of the most recent works and the chances of collaboration with other works; on the history of the collection and its circulation in the museum; and on the contemporary art of the country. The selection committee said: “After carefully considering the recommendations and the requests from the public, we have decided to follow the biennial format, which includes a major exhibition, a public lecture, and a series of public lectures. The Biennial will be inaugurated with a presentation of the final work of the collection, ‘The Long Goodbye,” in the exhibition “The Future of Art” at the Kunsthalle Basel in January 2020. The X-Acto will be inaugurated with the exhibition “Hannah Wilke: Specters of Algiers” in the exhibition “The Glass House” at the Nationalgalerie in the autumn of 2020. The London-based organization, which will be housed in one of two buildings in London’s St Martin’s Place, will be inaugurated at the Museum of Modern Art in the city’s Regent’s Park on January 23, 2021.\n\n\nThe Museum of Modern Art (Mo", "The next Biennial should take place in Dubai in 2022. The Art Newspaper reports that the event will be hosted by the Royal Academy of Arts in London, and will have the theme “The Quest of a Lifetime: Contemporary Art from the 1970s to the Present.” The inaugural exhibition was organized by Deborah Carroll as the inaugural curator of the new initiative, “Repairing the Future: Contemporary Art from the 1970s to the Present.”The announcement follows a long campaign to support the Cork artist, whose work, which explores the relationship between the artist and the city, has since been shown in the Venice Biennale twice and has been included in the Art of Manliness Index: 1931–1932. The artist was awarded the Pala Cinéma prize in 2012, and was also included in the 2013 exhibition “Telling Stories: Stories of Art.”\n\n\nAmerican painter and sculptor James Niven (1896–1976) and his wife, the American sculptor Lois Stuart, were found dead of natural causes on Thursday at their home in New York, New York, at 7:35 PM on what is believed to be the last day of their lives. Both artists were sixty-one years", "The next Biennial should take place sometime in 2021. \n\n\nThe Metropolitan Museum of Art in New York is working with the Museum of Modern Art (MoMA) and the Whitney Museum of American Art to develop a public program for the museum that would entail creating works based on times and places in the future. The Met has already partnered with MoMA on a series of episodes exploring how art history reflects and responds to urban life and events, and the museum has also worked with the Louvre on a special exhibition dedicated to the French Impressionist master Georges Seurat.The exhibition, titled New Worlds and Old Worlds, will include work by artists such as Paul Gauguin and Édouard Vuillard and will be presented in conjunction with the traveling exhibition “Anales de Baptiste” this fall at the Metropolitan Museum of Art. The show will also include a documentary by the British artist and filmmaker Tom Hardy and will celebrate the centenary of the French occupation of Spain by presenting two videos by the artist and his colleagues Léonide Chedid and Wanda Stéré.“The Met has been developing a public program for years to explore the relationships between art and city environments,” said David McKnight, the museum", "The next Biennial should be able to cover all of these themes, and should be able to present new material that will not only reflect the richly historic, yet nevertheless reinterpreted, already-known biennials\u0097the history of the biennial has been hijacked by a few, and that has been turned into a fashion statement, a self-promotion, and a caricature.”The 2018 edition of the Biennial, titled “Merry Go Round,” featured works by fourteen artists, including Peter Hujar, Demian Diné, and David Goldblatt, and was held at the Museum of Contemporary Art Miami (MCA), in collaboration with Grace Hopper Gallery. The list of curators for the 2020 edition is as follows: Peter Hujar1. “Cincinnati’s Natural History Museum” (1941–1947)2. “Merry Go Round: The Biennial” (2019)3. \"L.A. at Home: A Museum for Modern Families” (2017)4. Ateliers Mondes: The Strand Manifestos” (2017)5. “The Mummy’s House", "The next Biennial should take place in 2020. \n\n\nPortuguese artist and educator Anselm Kiefer, whose influential and often surrealist paintings and drawings would influence the postwar era, has died at the age of seventy-eight.Born in Lisbon in 1942, Kiefer moved to the city of São Paulo, Brazil, in the 1950s and became a member of the Pambí, a group of artists based in the capital city who developed a sensibility influenced by the surrealist movement. Through the group, he was exposed to and influenced by surrealism’s avant-garde and neo-classical traditions. In 1967, the year Kiefer’s father bought him a drawing table, he became a member of the Pambí and began to receive regular visits from the group.The Pambí’s early works are associated with Kiefer’s work with the same movement as that of modernism and avant-garde. Among the artists who developed works inspired by Kiefer’s work is Luiz Rech, who worked as a groupie for the artist’s son at a time when Kiefer was creating his first solo exhibitions in the", "The next Biennial should be held in 2021. The first exhibition will feature the work of fourteen international artists, including Andy Serkis, Fabienne Lebon, and Hélène Moig. The second in 2022 will feature the work of sixty international artists. The third exhibition will be the first international show devoted to Salvador Dalí. The fourth exhibition is currently on view at the International Center for the Criticism of Art in Oslo through October 27.\n\n\nThe Carnegie Museum of Art in Pittsburgh has appointed Brendan McCarthy as its next executive director. McCarthy comes to the institution from the National Museum of Fine Arts in Seattle, Washington, where he previously served as deputy director of curatorial affairs. He succeeds Adam Gopnik, who retired in the summer of 2019 after twenty-five years at the helm of the museum.“The Carnegie Museum of Art is a vibrant and dynamic contemporary art museum. Our mission is to present the museum’s collection on a permanent basis. Brendan has been working at the museum for more than four years now, developing the museum’s collection and portfolio for the past fifteen years. His achievements and passion for art make him a clear choice to lead the institution into the future,” said museum director Matthew Te", "The next Biennial should take place in Paris, and the date for the event will be announced at a later date.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of twenty-five works by the artist Owen Barlow. The work, which was acquired by MoMA through a shared gift from the late businessman Michael Barlow, was sold to the institution for $65 million in December 2019.The works, which were donated by Michael Barlow and his wife, Joanne, are currently on view in the exhibition “Owen Barlow: Ten Years in a Day,” which debuted at the gallery in 2015. The work, titled “Ten Years in a Day,” explores what it means to be a parent and a parent-to-be, and the current state of the family unit.“Owen Barlow: Ten Years in a Day” features more than sixty works, including “A Medical Emergency,” “In the Name of God” (1936), a meditative, multi-layered, and interdisciplinary work, and “Paradise Lost” (2015), a type of spiritualism. The exhibition also", "The next Biennial should be in 2020. \n\n\nThe Allen Memorial Art Museum in Seattle has received a gift of twenty-seven works by the late California–based artist, activist, and educator David Goodman. The donation includes works by Goodman and Linda Rasky, the wife of the late neurosurgeon Peter Rasky, and is part of a larger fundraising campaign to support the museum’s display of Goodman’s work in the museum’s permanent collection.Introduced by artist and activist Hillel Albright, Goodman’s commitment to social justice led him to launch the David Goodman Foundation, a charitable organization that works with the world-renowned Qatari collector to advance the art of Goodman. The foundation aims to further the legacy of the late artist through a variety of arts and educational initiatives.The David C. Allen Memorial Art Museum in Seattle is now offering free admission to the museum during regular business hours. The admission will be free for members and $10 for members and nonmembers on major days. For families with members or nonmembers, admission is free for members and free for families.Admission will also be free for families with children under twelve on Saturday and for members and nonmembers on Sunday. To purchase admission,", "The next Biennial should take place in 2020, the first in 2021. The biennial’s theme, “Building Bridges,” will address historical connections between the two countries and will include the installation of a statue of Eugene V. Debs and a statement by poet and activist Albert Parsons that the biennial is “about revealing the moral and spiritual potential of our shared planet.” The 2020 edition will be held on February 25–March 21, 2020, the year of the Chinese New Year.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Molly McAlpine as its new deputy director and chief curator. McAlpine comes to the institution from the Museum of Fine Arts in Boston, where she has served as assistant curator of contemporary art since 2011. Previously, she worked as a senior curator at the Museum of Fine Arts in Chicago, where she helped organize the exhibition “Fashion in Motion” (2017), “Cosmopolitan: Art in Fashion” (2016), and “The Catalyst: Art and Sexuality” (2015), among other shows.“Molly brings a wealth of experience, a deep understanding of the museum’s complex and vibrant", "The next Biennial should be held at the same venue, in the same year, on the same dates. It should also feature works by artists from Africa and around the world.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is preparing to open its new venue, the Museum of Contemporary Art (MoCA), on September 1, 2020. The museum will be located at 3110 Wilshire Boulevard and will offer three hundred square feet of exhibition space and a ground-floor dining hall. The opening will coincide with the opening of the museum’s first free season, which will run from September 25–September 28.“We are excited to welcome visitors to MoCA in 2020, as we have established a strong reputation for creating works that reflect and expand on the museum’s rich collection,” said museum director Timothy Potts. “Thanks to the generous support of our supporters, we are able to open our new home in the spring and continue to present works that explore themes of identity, history, and place. We are hopeful that this first season will be the catalyst to encourage others to explore the treasures of our collection and the fascinating world of contemporary art.”The new museum, which will boast a concierge", "The next Biennial should be inaugurated by an exhibition of work by artist Barbara Walters, titled “Behind the Curtain” (June 9–June 19), at the Smithsonian American Art Museum in Washington, DC. The biennial will include a solo exhibition of work by Meryl Streep, at the Museum of Modern Art in New York, in May.  The 2020 biennial will be held at the Art Institute of Chicago (the Institute, which receives annual funding from the city of Chicago, is currently evaluating the request to use the city’s $3 million for the event); the museum will hold an open house on July 11, the evening of the closing date of the biennial.\n\n\nThe National Gallery of Art (NGA) in Washington, DC, has added three new members to its board of trustees: photographer Adam Brodbeck, who is based in New York, and filmmaker Laura Delano. The two will serve as the NGA’s board directors until June 30, 2020, when they will each be eligible for three years of tenure.“Laura is an adventurous and persuasive curator whose work is deeply rooted in the ways in which we might conceive of photography in the twenty-first century,” said", "The next Biennial should take place at the Museum of Contemporary Art (MoCA), which is currently remodeled into the Frieze New York hub, sometime this year. The museum will then open its new building to the public in 2021.\n\n\nThe British artist Anthony Atamanuik\u0097whose paintings and drawings are often inspired by the everyday world\u0097has died at the age of eighty-one. The works show a remarkable range of mediums from painting to sculpture, painting to photography, and photography to video. For almost fifty years, Atamanuik served as a consultant to galleries, architects, and museums in New York and London, creating exhibitions and projects for both, and teaching artists, architects, and designers in the process.Born in London in 1939, Atamanuik grew up in a diverse series of urban environments, encountering many artists from Britain and the United States. His visual interests developed as he moved between England and New York, becoming drawn to their \"terrariums of color and texture.\" Years later, he began creating works that evoke the natural world, including his show The Treehouse (1971), an aerial installation that consists of thirteen redwoods, each representing a different planet, and his work Monsters, 1989 (1987", "The next Biennial should be staged in October 2021. Namdi has also been appointed director of the Brooklyn Academy of Live Music, New York, and will assume his responsibilities on December 1. According to the New York Times, Namdi also has a son who is a musician and a filmmaker. One of his sons, Yatay, is the founder of the New York instrumentalist duo O.T.E. and P.O.S.I.N., which has sold more than 1,500 albums. Namdi also directed the American jazz group the Farm, which played the first series of concerts in New York for the Museum of Modern Art in 1968, and was the founding director of the New York jazz club the Fillmore, which he cofounded with his brother, the producer and musician Eric Clapton.\n\n\nDubai: The United Arab Emirates (UAE) has announced that it will suspend all events and public gatherings until September 25, citing the threat of a \"catastrophic\" climate emergency as the reason for doing so. The move follows the announcement of the United Nations' new climate emergency plan, which predicts that the world will be forced to curb greenhouse gas emissions in", "The next Biennial should take place in the autumn of 2022.\n\n\nConceptual artist Hélio Oiticica, whose practice encompasses paintings, sculptures, installations, and performances, has died at the age of eighty-nine at his home in Porto Alegre, Brazil. He was the third Brazilian artist to be killed by the Spanish police in as many years and, until his death, was considered one of the most important composers in South America. Oiticica’s work has been exhibited at the Venice Biennale (2017); the National Museum of Fine Arts (2016); and the Sao Paulo Bienal (2016–17).Born in Porto Alegre in 1929, Oiticica began painting in 1951, when he was only fourteen. After receiving his first commission from the artist, he was given a small workshop to create a sculpture for the Brazilian pavilion at the 1953 Venice Biennale, which inaugurated the collection of the artist’s works in Brazil. The following year, Oiticica was chosen to design the pavilion for the Brazilian pavilion, which was built in the same building as the Museum of Modern Art in New York. That same year, the artist became the first artist in the", "The next Biennial should take place in the Summer of 2021. For the past three years, the School of the Art Institute of Chicago (SAIC) has hosted the Biennial, titled “Art in Unearthed: 1900 to 1975”, which has attracted over one hundred thousand visitors to Chicago each year, including James Turrell, José Carlos Campos, and Jacques-Alain Resnais. The institution is currently working with architect Iñigo Villalobos to create a new sculpture garden at the center of the renovated historic building, which will also house a new scholarship center and the museum. The team is currently working on a new logo.\n\n\nThe police department in Houston has reassigned five officers to desk duty for allegedly punching a black man in the face in what has been described as a “standoff” in the parking lot of a local grocery, reports the Art Newspaper. The incident, which occurred on January 2, occurred after officers James Boyd and Raquan Randolph, who were patrolling an area near Sir John Alexander Parkway and Federal Highway in northwest Houston, encountered Thomas King, a twenty-seven-year-old black man, who was allegedly blocking traffic with his vehicle.According to the New York Times, the", "The next Biennial should be held in the spring of 2021.  Source: Artforum<|endoftext|>More than 1,500 civil rights protesters were arrested outside the Supreme Court on Monday in a massive show of solidarity with Black Lives Matter protesters across the United States as the nation considers new legislation to address police brutality.After the historic ruling, the throng of protesters chanted, \"No justice, no peace, no racist cops, no racist grand juries, and no war crimes trials.” Earlier that day, thousands of protesters gathered at the federal courthouse in Washington, DC, to protest the Trump administration’s crackdown on civil liberties. The action marked the culmination of months of organizing and led by activists across the country.“The recent unrest in America is not isolated to one community, it is a global phenomenon caused by a broken political system,” said US Civil Rights Commissioner J. Peter Phipps, who urged Americans to join the movement to hold the Trump administration accountable for dismantling decades-old policies. “We must work together to build an America where every American citizen is treated with respect and protected by our government, and where every American city remains free and vibrant.”The #MeToo movement, which aims to educate the public", "The next Biennial should be held at the Museum of Modern Art, which has a future exhibition scheduled for 2020, and should take place at least twice a year.Commenting on the upcoming event, the institution said: “I’m excited to work with the talented team of architects and curators at the Museum of Modern Art, and usher in a new era with the next iteration of its ambitious exhibition, ‘The Raimond’s Architecture of Illusion,” which will debut in April 2021. The exhibition will focus on the research and construction of the Raimond pavilion, “from the Arab and Ottoman eras to today. We will also re-imagine the pavilion’s exterior, with new interiors and new experiences, and will introduce a new kind of public space.” \n\n\nThe 2018 edition of the Venice Architecture Biennale, curated by Arthur Rinder and curated by Michelangelo Antonioni, is now available online. Titled “Remo Cattelan: The Eyes of the World,” the exhibition will be held at the Museo del Paraiso from January 6 to January 8, 2020.“It is a great honor to present the final works", "The next Biennial should have a larger budget and will also be able to translate its programming into a more accessible format, which will create a broader discussion around the history of contemporary art and its relationship to contemporary life. The Biennial of Works began with the exhibition “Future Present” (2019) and has since expanded to include exhibitions and other events with works by artists such as the Brazilian Rintoul, the Netherlands-based artist Malin Fernie, the British artist David Salle, and the American artist Philip McPherson.The upcoming foyer biennial, “I Live in a Cave,” will feature twenty-six works by artists and organizations from twenty-six different countries. The biennial’s first artist-in-residence, Perre ­Belle, will also return to the museum to present a solo exhibition in the foyer in 2020.The biennial of works will be held at the Biennial de l’Amitémie in Paris and will run from November 6 to December 17, 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Natalie B. Morrison as its new deputy director for collections and display. She takes the helm from Michael L.", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has hired Roberta Smith, a curator and educator, as its next president. Smith comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served in a variety of roles, including as director of program since 2014.“With over twenty years of museum teaching experience, she brings a unique perspective and a deep understanding of contemporary art as a means of deepening the creative and educational experience of museum visitors,” said David Cohen, chair of MoCA’s board of trustees. “We look forward to working with her to further develop the institution’s relationship with the community through innovative exhibitions and educational programs, and to being able to celebrate our 150 years of operations with a robust and exhilarating event.”Smith first began her career in Los Angeles as a curatorial assistant to the late director Wayne Koestenbaum, who was known for his bold reimagined view of how art should be presented in the city. She often argued that the art world had lost its connection to the city and that the 21st century was ushering in a new era of exhibition. She eventually became", "The next Biennial should be held at the new site within a year. “I can’t wait for another biennial to introduce my work to the widest possible audience, to celebrate the richness of the history of the artist’s body and its relationship with art,” said Lara Ditugel, a curator and director of the Frankfurt-based museum, who was appointed the inaugural director of the new biennial in September.\n\n\nThe Italian Pavilion at the Fifty-Eighth Venice Biennale has appointed María Berrada as its next director. Berrada, who has served as the head of the pavilion since 1972, will take up the post on August 1. Berrada succeeds Paolo Gentile, who resigned in February 2019 over his family’s involvement in a major land reform project, and will work closely with the team to prepare for the exhibition’s return to Rome in 2022.“I’m extremely excited for the role of the pavilion, for its new and harmonious interplay between technology and culture,” said Berrada, who previously served as the director of the design center Monza from 2017 to 2018 and worked as the director of the contemporary art museum", "The next Biennial should be held in 2021 and the first in 2022. However, due to the health emergency in many countries, events such as the upcoming Berlin Olympics were postponed and the 2022 edition will not be held. In an attempt to ease tensions ahead of the biennial, the Tunisian president, Beji Caid, declared that the event would be held in October. “The Tunisian people have spoken and the Tunisian government has listened,” Beji Caid said. “We will not let you down, and we will not let you hide behind your screens.”\n\n\nThe Merseyside Museum of Art (MAM) has announced that Kate Chiu will become its next director. Chiu, who is currently the head of the Shaves and Workshops programme at the museum, will assume her post on November 22. She succeeds Linda Roesler, who served as head of the museum until April 2019.“Kate represents the breadth of the Shaves and Workshops team, and I am thrilled to welcome her to the museum,” said museum director Sir David Haigh. “Her deep experience and passion for the work of the museum will enhance our strategy, our programming, and our engagement with", "The next Biennial should take place in the city in 2021.  \n\n\nThe United Kingdom’s Department for International Development (Dfid) has released two guidelines for the destruction of archaeological sites in Egypt’s Delta region that were drafted in the wake of the 2015  massacre of protesters in the Sinai Peninsula and were published on Wednesday.Dfid advised that foreign cultural heritage sites in the area, which includes Suez Canal, be cleared of excavators within thirty days. The sites will then be placed in storage until a decision is made on their restitution. The guidelines also outline the destruction of artifacts and cultural objects that might be used as evidence, such as the tomb of pharaoh Ramses II.“Destruction is an irreversible and time-consuming process, and there is currently no viable way of recovering or restoring lost archaeological sites,” a statement from the department said. The guidelines were drafted after a Dfid review of archaeological sites in the area conducted in February and March of 2018. The results were mixed. In a 45 to 50 percent majority of cases, the recommendations were implemented, but the guidelines are for a 'minimum of five weeks,” a Dfid spokesperson told The Guardian, and the", "The next Biennial should take place in 2022, but for now, the first exhibition is scheduled to open in the city of Bonn, Germany, on March 27. The exhibition will feature more than 300 works by fifteen artists and will be organized by the German government-supported organization 'Artsauertung. It will also feature a book by the artist and will feature a performance by the artist.The Biennial will be held at the museum in the city of Bonn from March 21 to March 27, 2022. The Biennial is an attempt to create a more collaborative and international network of contemporary artworks in the region. The event will also be hosted by the Bonn government and will be free for the public.\n\n\nThe Turner Prize, which honors American artists who have made significant contributions to their respective fields, has announced the winners of its eighteenth annual biennial. The 2019 honors include Kevin Delaney, a cofounder of the New Orleans–based artist collective Thee Oh Sees; John McAllister, an African American American artist who creates works that address issues including race and religion in his paintings; and Nari Ward, a French Canadian artist whose work integrates her experience as a queer artist with her family history in New Orleans.The prize jury", "The next Biennial should be held in 2020, the organizers said.\n\n\nThe Arab American Museum (AAM) in Queens, New York, has announced that it is partnering with the Greater NY–New Jersey Arts & Culture (GNN) to produce an exhibition titled 'Through the Eyes of a Demon.” The show will explore the relationship between Arab and Western art through performances, screenings, and archival research.The exhibition will take the form of a video exhibition, a digital installation, a performance, and a video installation. The first season of the exhibition will kick off on October 26 and run until March 26, 2021. The second season of the show, which will be organized as a series, will open on May 22 and run until June 6, 2021.“This partnership between AAM and GNN is an extension of our commitment to New York City,” said Arash Aryeh, director and CEO of the Arab American Museum. “Through this partnership, we hope that the Arab American Museum will be able to continue to present the history and the art of the region in New Jersey. It has been an honor to work with GNN and that is why we are excited to present this show.” The partnership between", "The next Biennial should take place in 2019, and the 2019 edition is currently being organised by Lévy Gorvy. The 2019 edition will be a tribute to the victims of the Paris attacks, which have left more than 230,000 people homeless since November 14th, and will consist of three different narratives, each based on a different artistic strand. The first narrative, “A Century of Biennial” (2019), will tell the history of the twentieth century and include biennial performances, exhibitions, and other activities. The second narrative, “A Century of Biennial” (2020), will be a historical reconstruction of the twenty-first century, incorporating selected biennial works by artists from the twentieth and twenty-first centuries. And the final narrative, “A Century of Biennial” (2021), will include reflections on the past twenty-five years of the biennial. “We are acutely aware that the upcoming exhibition Biennial 2020 will, in a way, be a commemoration of the twenty-fifth anniversary of the exhibition ‘A Century of Biennial’, and its effect on the contemporary world,” said Amantha Ghebaly, artistic director of the biennial.", "The next Biennial should be held at the Museum of Contemporary Art in Chicago in 2021. The next edition of the Exposition will take place at the Los Angeles County Museum of Art (LACMA), in 2021. The 2019 edition of the event was held at the Los Angeles County Museum of Art (LACMA), and the 2020 iteration will be hosted by the Museum of Contemporary Art, Los Angeles. After a decision was made earlier this year by the Art Newspaper to cancel the upcoming edition of the show, the Paris-based arts producer Aéro France announced that it would not proceed with a 2020 edition. The museum has since been accused of discrimination against a transgender artist, who was scheduled to perform a transgender tribute for the performer Lana Del Rey, who passed away in June. The controversy surrounding the exhibition\u0097and the exhibition’s location in an art museum\u0097has led French artist Manuela Els to call for a change of venue in the country’s capital. “The museum will present the third Biennial at the Île-de-France in 2021, but only in the city of Lyon,” Els tweeted. “The exhibition will be staged in the Museum of Contemporary Art in", "The next Biennial should be held in the spring of 2021.\n\n\nThe New York Philharmonic has announced that it is currently working on the acquisition of twenty-six works by thirty-six artists, including Laureys Louis, Edward Hirst, Damien Hirst, Lisette J. Magritte, Pierre-Auguste Renoir, and Jasper Johns. The acquisition was made by the Philharmonic through a partnership with the estate of the late collector James S. Robbins, the man behind one of the largest private collections in the country\u0097the Robbins/Saunders Collection, which is valued at $4.5 billion.The partnership includes the sale of works by French Proserpine Auguste Renoir, German artist Peter Cammock, English sculptor Michael Newcomer, German painter Heinrich Neukölln, and American painter John Henry Albee. The work of the Thirteenth Amendment to the Constitution, which was ratified on Saturday, March 3, and allows the institutionalization of the works in the Robbins/Saunders Collection.“We are delighted that our partnership with the estate of James S. Robbins has ended with the sale of these works,” said Marc Glimcher, president and CEO of the phil", "The next Biennial should consider moving to a virtual exhibition space, where the participants can meet real people and experiences and have real conversations. I believe that virtual reality is the future. I am optimistic about the possibilities of what technologies can bring to the exhibition business. I am optimistic about our role as an audience. I am optimistic about our role as curators.I am not sure what more I can say about this. Well done to all who participated. I look forward to seeing you again in 2020.\n\n\nThe Bonhams auction house in London announced today that the estate of Lewis Black, the British artist most famous for his monumental sculpture The Planet, will be reborn as an exhibition space for the Arts and Culture. The new venue will be built in a former brewery and will be located near the Oxford Circus, in the city’s trendy Mayfair district.“Lewis Black’s visionary work has defined the Arts and Culture landscape for more than sixty years, and will shape the future course of the university, the university campus, the university library, and the university library,” said auction house director Jonathan Bonhams. “The new venue will be a crucial element in connecting the world of Lewis Black and art for future generations.�", "The next Biennial should have articles and interviews with experts and scholars, as well as a selection of exhibitions. It should be organized in a way that will allow visitors to experience the works in their original contexts. We are still working on the budget and the schedule. We will share all our developments with you.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has welcomed Mira Furbush as its next director and CEO. Furbush will be responsible for leading the museum until 2020 and will assume her post in January 2021. Previously, she served as the senior director of the Willow Creek Art District in California and as the executive director of the New Artists’ Guild in New York.“Following extensive research, we were deeply impressed by Mira’s leadership qualities and her proven track record of successfully cultivating and nurturing artists,” said museum director Thomas L. Friedman. “Her appointment is a great honor and a great challenge. We are grateful to her for taking on this important and challenging role, and we know she will bring a wealth of new knowledge, expertise, and perspectives to the museum.”Friedman also praised the work of the curatorial team and staff at the museum; the", "The next Biennial should take place in April 2020.   The next edition of the Festival will be held at the Plaza de Mayo in Mexico City in May 2020. \n\n\nThe American Foundation for the Arts (AFA) has announced that it plans to raise $3.8 million in support of artistic and cultural workers in the United States affected by the coronavirus pandemic. The funds will go toward artistic initiatives such as paying workers at unionized retail, restaurant, and other service jobs, and will also go toward creating new opportunities for artists and cultural workers in the industries that are hardest hit by the coronavirus—food delivery, construction, construction and extraction, shipping, and warehousing—as well as creative and community-based recovery efforts.The organization is also encouraging local, state, and federal governments to enact emergency funding for workers who are facing unemployment, underemployment, or struggling in other economically harmful ways. AFA’s executive director, Maureen Armstrong, said: “The financial picture for artists and small business owners is dire. We know that every day that goes by makes it worse. We have an obligation to do all that we can to help them. But more than", "The next Biennial should be held at the museum in 2021, and the next will be held in 2023. The next iteration of the Danish pavilion, entitled Justus Lammers: Duske Lammen, will be held at the Museum of Modern Art, in New York, in 2021. The Danish pavilion, which was organized by the Danish gallery København, was selected from a shortlist of thirteen exhibiting artists by the Museum of Modern Art, which had previously announced it was extending the project to a second year. Curator Jo van der Poel will remain involved with the exhibition as a curator, but will step down from her role when the second edition of the Duske Lammen Biennial is over. The Danish pavilion was selected from a shortlist of ten exhibiting artists by the Danish curator Jo Stellm, who was nominated for the award by the Danish writer Martin Høgberg. In order to secure the award, the museum had to improve the relationship with the artists of the exhibition and further extend the exhibition, which was originally organized as a collaborative project between the Danish and Norwegian performance artists Dineo Duske and Lotte Brätsch", "The next Biennial should be docent-free, a meaningful end to the exhibition; and, most important, an opportunity to reflect on the interdependence of all living things on earth. In the biggest way, we can do this by hearing each other—and by reflecting on life on earth through the stories that have shaped our humanity\u0097and the future that we imagine.The next exhibition will be the first in the series, “Speech,” which debuted at the Art Gallery of Ontario in Ottawa in September 2018, featuring works by Holly Byron, David Chipperfield, Lawrence Ferlinghetti, and Kiki Smith. The 2020 iteration of the event will open at the Canadian Museum of Modern Art in Ottawa on March 3 and run through March 24.\n\n\nOn Monday, Prime Minister Shinzo Abe and his cabinet approved a massive $9.3 trillion stimulus package for Japan’s economy. The package will inject $195 billion into the Japanese economy through March 31, and will include $110 billion to help the manufacturing sector, $120 billion for small businesses, and $130 billion for the service sector.Although the financial sector was largely shielded from the financial crisis because of Japan’s strict anti-money-laundering legislation,", "The next Biennial should be scheduled for 2021. \n “The exhibition was founded as a universal platform for the exploration of the objects in our lives, and we are still committed to that mission today. We are working hard to strengthen the exhibition’s international reach and its artistic reach to reflect the diversity of the contemporary world.” \n\n\nThe Art Newspaper reports that the Museum of Fine Arts (MFA) in New York has received a significant donation from the National Association of Theater Owners (N.A.T.), which represents theater owners in the United States. The gift includes $15 million for the construction of the studio space and’s permanent collection, and will also include a new venue for poetry readings and a new bookstore. The gift was made by the Philip Johnson Company, which represents the interests of Richard Johnson, Michael Mayer, and David Thomson, among others, to the Museum of Modern Art (MoMA), which is working to relocate from its current home in the former headquarters of General Motors, where it had planned to build the new headquarters of the pharmaceutical company AstraZeneca.“The gift will allow MoMA to invest more in the careers of its theater artists and will provide them with the opportunity to continue to", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to close its doors in April 2020 amid a public health crisis caused by Covid-19. The California Department of Public Health announced that it was preparing to shut down the county’s entire public health system—including hospitals, schools, and other public buildings—to protect the public from the novel coronavirus.On Monday, the museum announced that it would reopen with an extra month of incubation, but only with a $500,000 budget cut due to the coronavirus. The institution also announced that it would begin charging visitors for admission, and that the museum would begin charging for parking. The museum is currently closed because of the Covid-19 pandemic, and it anticipates losing more than $100,000 in revenue during its first week following its reopening.“We are acutely aware of the challenges and challenges this outbreak presents to all of us,” said museum director Mike Richardson. “While we are fully cognizant of the public health crisis, we believe it is in the public’s best interest to minimize disruption to their lives and well-being.” In a letter", "The next Biennial should be held in 2020 and will be hosted at Shanghai’s National Museum of Art, the Beijing Institute of Art, and the Beijing Academy of Fine Arts. The next edition of the Artists’ Cities series will be held in 2021 and will focus on the “modern city.” The project will also include a new exhibition dedicated to artists and a new book. According to the art historian Andrea Gallop, in a joint statement with Diana Al-Rowland, the show will be “focused on the creative process in a city.” Previous editions of Artists’ Cities featured contemporary and experimental artists such as Lin-Manuel Miranda, Tilda Swinton, and Kira Els-Agrippa.\n\n\nThe Museum of Modern Art (MoMA) in New York has unveiled its list of thirty-seven artists who will participate in the second edition of the Museum Open for Artists (MOFA) as part of the Artists’ Cities series. Presented by the Contemporary Art Foundation, the event will inaugurate the new public art and design destination in the city’s Chinatown, a collaboration between the museum and the Chinatown Art", "The next Biennial should take place at the Museum of Fine Arts, Boston, in 2021, and will present a selection of the work of women artists whose work was recently restored by the museum. The museum will work with the National Gallery of Art, Washington, DC, to commission a work from the exhibition.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has announced that it is introducing a new form of exhibition that will allow visitors to experience the works of artists as they are being created. Titled “Art is a journey,” the new \"Tuteles\" series will be curated by the Smithsonian’s Peter W. Schäfer Center for Art History, which is located in the same building as MoMA in a former steel factory on Manhattan’s East Side. The show will feature work by artists such as Alejandra Almagro, Filippa Cooper, and Loring Randolph, among others, and will run for two months.“The show will be about the idea of creating art from the moment we are born,” said director Michael Hauptman. “We will place the work in the context of an ongoing cultural exchange between the United States and Mexico, focusing on the", "The next Biennial should be February 21–February 26. The inaugural edition of the exhibition focused on the anthropological and the social aspects of art. The second edition will have the same themes but will focus on the material world. The full list of participating artists is as follows:·Rasina Bhattacharya, New Delhi, India10. Glenn Ligon, New York, NY12. Emanuela Fitt, New York, NYL. ngela Moro, New York, NYL. guadalupe Sánchez, New York, NYG. njawomilani S, Cuyo, PRT. kamala Ramdas, New Delhi, India16. Sylvia Rosales, New York, NYG. njawomilani S, Cuyo, PRT. dharman samarth, New Delhi, India18. Vijay Sesham, New Delhi, India19. Bahar Osei, New Delhi, India20. M. K. Swaminathan, New Delhi, India20. Diana Zhang, New York", "The next Biennial should take place in the city in 2020, before the Olympics. “The Biennial is not dead,” said architect Boiko Mavinkov, president of the biennial’s advisory board. “It is alive and well in the eyes of the general public.” \n\n\nThe National Museum of Women in the Arts (MoMA) in Washington, DC, has launched a new digital platform that will help raise funds for the institution’s expansion. Called the MoMa Art Explorer, the platform will analyze art and uncover stories of women artists whose work was exhibited or exhibited at the institution, and will reward donors with digital content.The new initiative was created by German-born artist María Berrada, who was inspired to create works that explore women’s involvement in art by her husband, Jörg, a graphic designer and filmmaker, who is also the cofounder of the contemporary art lab the Frankfurt Art Museum (FAM).The platform’s inaugural cohort includes Rachel Chiu, who will curate a show dedicated to 1970s American artist Betty Parsons, and James Mayhew, who will present a retrospective of his work", "The next Biennial should comprise ten artists who are currently involved in the exhibition, which will be hosted by the Museo de Arte Contemporáneo in Madrid, and will be presented in the spring of 2021.Inaugurating the biennial will be the museum’s first major renovation since it opened in 2014. Dubbed the Museo del Trisulti, the contemporary art museum will boast a brand new 78,000-square-foot building designed by the architect Andrés Bolanos. The renovation, which is due to be completed by the end of the year, will include the restoration or remodeling of the museum’s existing galleries and will include the construction of an exhibition space. The new spaces will be inaugurated by a new exhibition titled Capital Pura, featuring Thierry Labbét, and a retrospective of the artist’s work and the work of twenty-five other artists, including Luis Buñuel, Jakob Foon, Christodoulouss, Tereza Gomes, Saara Hengstenberg, and Wangechi Mutu. Last year, the museum’s permanent collection was transformed by the French billionaire Georges St", "The next Biennial should take place in 2020. The work will be compiled by Dorota de Castro; Blaine Stutz, director of the Bay Area Biennial; and Lourdes Martínez, the curator of Contemporary Art. André Bazin’s Light, Gold, and the Silence of Time will be presented by Yoshitomo Imamura, director of the Bienal Alpes & Bienal Mediterranean, Mexico City; and Katsu Kondo, director of Shizuoka, Japan.\n\n\nArt museums in Osaka, Tokyo, and other major Japanese cities are being urged to prepare for a surge in cases of the coronavirus and the potential for large-scale evacuations as the city prepares for a major earthquake and tsunami on March 11. The threat of a second quake of magnitude 3.0 or lower is also being felt across the country, where the epicenter is in the city of Fuchu, about three hours southeast of Tokyo.Officials at six institutions on Monday issued emergency evacuations orders: the Aichi Prefectural Museum of Art, which already closed in March due to the coronavirus; the Institute of Contemporary Arts, which has yet to announce the fate of its artist-", "The next Biennial should not be a token gesture, but an engagement with the contemporary, and one that engages with, and demonstrates the potential of, the Arts.” \n\n\nThe Philippine Museum of Art (PMA) in Manila is planning to open a new exhibition dedicated to Queer Cinema, Queer Film, and Queer Cinema 2K15, a collaboration between the museum and the Queer Web Foundation, which is based in Santa Ana, California. The inaugural exhibition, “Gay and Lesbian Film,” will take up LGBTQ issues through the lens of Queer Cinema’s Oscar de la Hoya–produced film Gay and Lesbian (1986), in which the American director John Singleton plays the role of the gay and lesbian filmmaker.The retrospective will be organized by Maya Palomar, director of the Queer Cinema in Santa Ana, and will inaugurate the newly renovated Pilar Art Museum, which is also slated to open in 2021. Palomar told the Art Newspaper that the Pilar will feature “the work of the Queer Cinema’s queer artists, filmmakers, and playwrights.” The new exhibition will introduce Queer Cinema to the international audience, and will include biennial presentations of work", "The next Biennial should be held in the autumn of 2021—there have been some indications that the event will be pushed back—and the twenty-fifth will be put on hold until 2022. “Themes of resilience and questions of identity are an essential component of the theme of this year’s exhibition,” said Hetain Desai, director of the Van Doren Gallery in New Delhi and the venue’s curator. “It would be a shame if the twentieth Biennial was to be postponed, let alone canceled, for political reasons. The Parliament has given the go-ahead for the exhibition to proceed as planned. We hope that once this exhibition is over, it will be remembered as a moment of universal joy and hope.”Commenting on the Biennale, Hetain Desai said: “The show was meant to be the start of a new era for India’s art. It was not meant to promote or celebrate politics, but to offer a personal view of the world. We hope that it remains as a narrative of universal good and enlightenment, the truth that is beyond the political process, but rather as a powerful reminder that we are all born with the potential to be good.�", "The next Biennial should take place in 2021. The eleventh edition will also feature work by more than fifty international artists. The first exhibition of the twenty-sixth will open at the Tivoli in Venice on November 3.The new exhibition calendar will be announced by the State of Venice. \n\n\nThe National Art Museum (Namco) in Atlanta has appointed Paul C. Lewis as its next director. He will take the helm from John R. Collins, who has led the institution for more than twenty years, and will take the helm from Sheryl Stolpe, who has been the museum’s director since 2016.“John and Sheryl have been director and chief curator of the Museum of Art in Washington, DC, since 2004, when the museum was still a branch of the Diller Scofidio + Renfro–designed Metropolitan Museum of Art in New York City. They are highly regarded throughout the country and internationally for their innovative and committed curating, and have won numerous awards for their work, including the National Medal of Arts in 2009 and the Cooper-Hewitt in 2009.”Lewis’s responsibilities at the museum include developing and implementing new and expanded programs, including the newest exhibition program", "The next Biennial should take place in the year 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Alexis Georgiou as its next director. Georgiou has been serving as interim director since May, and she will assume her responsibilities on June 1.“The director of MoMA is an extraordinary board and a challenging situation for many reasons, but foremost among them is that Alexis has been a long-time supporter and collaborator of MoMA,” said David Addington, the institution’s board chair. “Over the years, she has developed and expanded MoMA’s collection and helped shape the design of the institution’s collection. She is now a trusted collaborator of MoMA, and we are encouraged by her ability to lead and navigate this complex and challenging institution.”In her new role, Georgiou will work closely with human resources and strategic directors Marie Ryan and Martin Pfeifer, as well as with several senior institutional leaders, to ensure MoMA’s future success, including its expansion into a museum complex and to develop programming that will engage with the museum’s diverse audiences and communities. She will also oversee the museum’s new urban farm, the", "The next Biennial should be held in 2020, and the first one in 2021.\n\n\nThe Swedish Museum of Modern Art (SMOM) in Stockholm has announced that it will postpone the seventy-fifth edition of the Swedish Contemporary Art fair, dubbed Art + Denmark, to October 21–23. In a statement, the institution said: “We are aware of the pressure to present a certain project in order not to be left behind by the major art fairs in the world. But this is one of the most important challenges for the institution and we will continue to work as a team.”The event will now take place in November. The twenty-second edition of the international fair was also postponed. The event will now take place in November 2020.\n\n\nThe City of New York Office of Arts and Culture (CAC) has released guidelines for how it will respond to protests and looting in the months leading up to the reopening of the Long Island Railroad (LIRR), the city’s subway system, in December. The guidelines, which were released on December 28, establishes a set of protocols for the local, state, and federal government’s response to looting and protests. The document outlines how C", "The next Biennial should be held in December 2021.<|endoftext|>Latest Updates: Details from the Chinese government are still sketchy on the extent of the pandemic, but officials have described the situation in Xinjiang as the worst they have faced since the disease was first reported in China in September 2019. According to the New York Times, authorities have banned large public gatherings, tightly controlled travel, and launched temporary rationing measures, but life expectancy is expected to be extremely low for China’s citizens and factories and businesses in the region are being forced to shut down.By Monday, the number of people infected had risen to 4,794, and the death toll had risen to 272. While many have blamed the coronavirus on eating food, it has also been suggested that the virus may be transmitted through close contact, such as through respiratory droplets.Authorities have declared a public health emergency in all five of China’s provinces, and in Xinjiang, which has been experiencing a severe health crisis since February. According to the Guardian, at least two-thirds of deaths in China have been caused by the virus; nearly one hundred people have died in the southern province of Guangdong. While the virus has been linked to at least twenty countries, including the", "The next Biennial should be held in 2021, and the first in 2023.  The first iteration of the exhibition will be staged in London in April, with the second iteration in June.  The three-day event will be held in the Big Ben exhibition hall, which reopened last year following the reopening of the Ben Franklin Institute (BFI), and will feature new works in the works of artists such as Michael Kordansky, Anthony Goldsmith, and Kiki Smith, among many others.\nThe 2020 edition of the Biennial, “Between Two Worlds,” will be held at the Musée National Picasso in Paris from March 29 to April 6, 2020 and will be organized as a “tour for the city of Paris,” according to Artforum. The exhibition will mark the fifty-sixth edition of the event, which will be held at the Musée National Picasso from March 21 to March 23, 2020.The full list of participating artists is as follows:\n\n\nThe estate of Philip Glass, the British painter and sculptor best known for creating works that often feature oddly shaped, illusory abstractions, has settled a wrongful-death lawsuit after he was killed by", "The next Biennial should have been a disaster—it was, after all, only a few days old when it opened and was already suffering from a crippling series of setbacks. The museum’s director, Kaya, and chief curator, Sarah Dulane, resigned in April 2019, and by September the venue had already lost two of its three exhibition sections, an adult contemporary art book and a children’s book section. The third section, a digital edition of the exhibition, was already offline when the museum opened on February 3 and was never able to re-open.In May 2019, before two of the sections were shuttered, the museum moved the exhibition, “From the Web to the Movies” (which would have featured films created by the museum’s curators), to a different site in order to “keep the doors open” and “live on as long as possible” as part of a deal worth $30 million with the Disney Family.The move led to some confusion over when the three sections would reopen, as the Disney Museum of Narrative Art, Los Angeles, announced that it would start welcoming visitors on Friday, April 7, and would re-open on Monday, April 8. The Walt", "The next Biennial should take place in the fall of 2020. The exhibition will feature work by seventy-six artists from twenty-seven countries and will include a number of introductions and demonstrations by selected artists. The twenty-man curators will also present the first exhibition dedicated to the collaborative practice of modernism in the United States and the first museum dedicated to the history of the cinema in the United States.A pianist, dancer, and photographer, Arashio has worked in a variety of media, including film and video, sculpture, and painting and was a curator at the Museum of Contemporary Art Chicago. She is currently a senior curator at the Metropolitan Museum of Art. She will curate the upcoming exhibition “Beyond the Zero: Modernism in the 1980s” at the Met, along with “Stevie Wonder: Beyond the Masses” and “Myths and Realities: Art, Politics, and Performance” at the National Gallery of Art in Washington, DC.\n\n\nThe National Museum of Women in the Arts (MoNA) in Washington, DC, has received a gift of twenty-nine works by thirty-six artists, including twenty-six from the Philippines, including the work of Anna-Marie Salced", "The next Biennial should be held in the spring of 2022. The decision was made on the basis that the museum is nearing completion of a renovation of the former wartime munitions factory in Brussels and is planning to open a new exhibition space in the center of the old munitions assembly plant in 2020. The first exhibition of the new initiative, “Revolution of the Eye” (2019–2020), is currently on view at the Museum of Contemporary Art, London.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it will reopen on January 16, 2021, following a $5 million facelift. The restoration project was led by architect James B. Cunningham, who was awarded the $5 million USD Prize for his work in the triennial by the American Institute of Architects (AIA) in April. The addition of the biennial to the city’s calendar follows the reopening of the Museum of Contemporary Art (LACMA), which will continue to operate under the theme “The Future is Present,” and the events of the weeklong celebration of its 150th anniversary. “MoCA has always been about bringing artists together to explore the world around us,” said Cunningham. “We", "The next Biennial should consider “the conceptual and practical implications of the latest scientific developments,” said the founder of Biennial. [Update: September 29, 11:00 AM] The February 20 edition, “The Future of Art and Art” (Haus der Kunst), has announced that it will take place at the Openair in Altenburg in September of 2020. The biennial will also feature works by artists and other curators from across the globe. It will be preceded by three exhibitions of work by the artists of Atlanta: “The Black Cat: The Art of Living in New Atlanta” (May 27–May 31), “The Space Between: Photos in a Time of Change,” and “Diana Al-Hadid: Art in Time” (May 29–May 31). The biennial will also present previously unpublished works by artists and other curators from the greater Atlanta area. “The future of art and art is not static,” said Artnet editor John Schlesinger. “Artists work continuously to undermine the existing order and create new worlds, and art is at the forefront of that action. We look forward to seeing what these", "The next Biennial should take place at the International Building, the Museum of Modern Art, in St. Petersburg, the Tango Bella Art Foundation in São Paulo, and the National Museum of Fine Arts in Miami Beach.  Next year will mark the centenary of the end of World War II in Japan, and the Museum of Contemporary Art Tokyo, the Contemporary Art Museum Hoenn, and the institute for Contemporary Art History in Tokyo.\n\n\nThe Ohio Art Museum in Columbus has received a gift of fifty-seven works by Dutch artist Rijn van Hofland, who was imprisoned in a Nazi concentration camp in Auschwitz. The works were donated by the American-born, Dutch-based collector Arne Glimcher, who founded a foundation in the late 1990s to preserve the artist’s art and became embroiled in the controversy surrounding the Holocaust in 2007. According to the Art Newspaper, Glimcher has named Jon Grubb as its inaugural director. Glimcher purchased the works from the Nazi concentration camp in Auschwitz in 2015, and the institution acquired them from the Glimcher Collection in 2002.During a press conference at the museum, which is located on the grounds of the Van Gogh Museum in Amsterdam and is run by the Van Gogh Museum", "The next Biennial should be held in the spring of 2022, and the fifth in December 2020.\n\nThe works will be announced later this month. The 2018 and 2019 editions, respectively, featured work by thirty-three artists and were scheduled to run concurrently. The 2020 edition will be held in the wake of the terrorist attacks on Paris, and will be organized as a “springboard” to “hope for peace and security.”The works will be curated by a group of artists based in the city, whom the Museum has named the “Artist-Makers City Council.” “The goal of the council is to create an environment for creativity, innovation, and experimentation within the city of Santa Fe, and provide opportunities for local artists to have their works exhibited at the Museum,” the Museum said in a statement.The 2019 Exhibition, “Wangechi Mutu: A Fantastic Journey,” run by the Los Angeles County Museum of Art, was postponed from March 13–March 21 to April 4–April 5. The exhibition was supposed to be a collaboration between artist-activist Wangechi Mutu and artist Nan Goldin.The 2020 iteration of the International, which will be hosted at the", "The next Biennial should take place in the coming months, depending on whether the scheduled exhibition of the work is rescheduled, cancelled, or postponed.\n\n\nThe London-based charity Art Fund has launched an innovative initiative to support the cultural sector in the UK by offering daily grant of up to $1,000 to artists and small to mid-sized arts organizations.Each participant will receive $500 for their first project, which will consist of organizing an exhibition and performing a work at a museum or other open-air event, and $500 for their second project, which will consist of selling artworks or artworks related to science and technology, art and design, and art and design. The fund also offers a $500 cash prize every day to an artist working in the arts. In addition, an artist will also receive a $250 cash prize every week for participating in the Art Fund Action Program. Next week, the fund will present Art Fund Awards in support of artists and their projects. “We are incredibly excited to launch this new initiative with the London-based charity Art Fund, the UK’s largest arts organization,” said Esha Gupta, executive director of Art Fund. “With our first", "The next Biennial should be held in 2021 and will be comprised of approximately twenty-nine artists. Dubbed the “Future Generations,” the exhibition will honor the “precocious, visionary, and direct” artists whose work is considered to be among the seminal texts of their generation.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that the institution will unveil its plans to reopen to the public in late spring after it was shut down since March due to the coronavirus. The announcement came on the heels of a letter from more than fifty artists, writers, and other cultural figures urging MoCA to reopen as the public health crisis continues to affect the United States.“The current lockdown has made it impossible for many of us to visit our favorite museums and galleries in our cities, and our favorite artists and curators are being forced to stay behind,” said Adam D. Weinberg, executive director of the Los Angeles County Museum of Art (LACMA) and a cofounder of the letter. “In the overwhelming majority of cases, the limited opening of galleries makes the programs of the museum more vulnerable to financial ruin and diminished attendance. The future of art museums in Southern California depends on them", "The next Biennial should take place in 2020.\n\n\nThe newly-formed Art Students Union (ASU) in Hong Kong has appointed Mary Royce, a recent graduate of the Art Students Union (ASU), as its new executive director. Royce joined the club in 2016 as a curator and will begin her tenure as deputy director at the university in a few months.During her tenure, Royce will work with the club’s board of directors to ensure the club’s long-term future. “We are very excited by the prospect of her taking on this important role,” said club director Kate Beckins. “While she will be working closely with the board to ensure the club’s future success, she will also be a strong advocate for the students she teaches and the students that come after her.” \n\n\nThe Metropolitan Museum of Art (Met) in New York has appointed Naima J. Keith as its next executive director. Keith comes to the institution from New York’s Museum of Modern Art (MoMA), where she has been a curator since 2015. She succeeds John L. Sullivan, who retired in the spring of 2020 after seven years at the helm of the", "The next Biennial should take place in the Fall of 2020. This is shorter than the current duration, but will still include a selection of the artist’s works. The artist’s next show will take place at the Brooklyn Museum in New York in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has completed the restoration of a 1930s-era space in the institution’s Bronx headquarters. The ambitious undertaking, which involved the installation of more than forty thousand pieces of American art, was undertaken with the help of landscape architect and urban designer Mark di Suvero, who designed the former Bronx shelter where the Metropolitan Museum of Art (MoMA) now sits.“The restoration of the toolkit was a major milestone in our carefully curated program,” said MoMA director Timothy Rub, who added that the project was a “perfect storm of history, technology, and execution.”The work, which also included the installation of more than 1,500 works by American and international artists, including Charles Atkins, Ray Davies, Alighiero Cattelan, George Cremer, Frank Gehry, and David Salle, augur well for MoMA’s plans to open a new", "The next Biennial should have a team of five artists and will be led by the artist Sam Smith. The team will work in collaboration with the artist to present a single work. The exhibition will be hosted by the new museum, which is currently being designed by architect Tanja Kassel, at a cost of €192 million, in the Wegmans-designed building in the former Bodega, which will be transformed by the city of Menorca.\n\n\nRemarriaga, a contemporary art center located in the affluent Santa Barbara suburb of Soledad, California, has closed its doors permanently after fifteen years as a volunteer endeavor. The Hauser & Wirth–designed space, which launched in a converted barn in 2010, was one of the last exhibitions housed in the struggling arts space. “We are very much looking forward to the next chapter of our life together,” Remarriaga’s founder, and longtime director, Joshua Remarriaga, said in a statement. “We will continue to support the arts and the community through education, promotion, and fundraising as we have done for fifteen years. We will always be grateful for the many wonderful years of creative partnership that we have had.”The", "The next Biennial should be in 2021, with the first exhibition being “Unscheduled: The Biennial” (2019) in 2021. The opening of the inaugural exhibition, “The Age of Development,” will be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Paul C. Kerkhof as its new curator of classical music. Kerkhof will be responsible for bringing classical music to life across culture and will take up his new post on September 1. Kerkhof comes to the institution from the Cleveland Museum of Art, where he has served as associate curator since 2017.“Paul’s work is rooted in and expansive in his ability to shape the future through the art of classical music, with a particular focus on the development of a new generation of composers in his home state of Ohio,” said museum director Frances Stedman. “His success in bringing classical music to life in America and Europe will be particularly meaningful in our current moment, as we look to future ideas of how music can be used to help us live better lives.”Kerkhof joins MoCA after working at the Cleveland Museum of Art, where", "The next Biennial should be held in the spring of 2020, to coincide with the opening of the new museum.The three-day event will be hosted by Danish director Anders Fjeldsjo and artist Lars-Ondal, who will exhibit the exhibition “Unfinished Business: The Biennial of Thomas Kienholme” in the summer of 2021 and a new exhibition of Kienholme’s work in the autumn of 2022. “Frederick Engels” will be presented by Fjeldsjo and Kienholme in the fall of 2022.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has added three new artists to its artistic program: Adrian Piper, who will represent the United States in the Rio Olympic Games, and Zoya Gomes, who will present the first time the Mary Boone Garden in downtown Savannah, Georgia, will host a major cultural event.In a statement, the MFA said: “Piper, who creates a landscape of togetherness that could be found in the form of a series of delectable, delicate, and luminous forms, is an exceptional artist whose work we are thrilled to support. We are also excited to welcome", "The next Biennial should be announced in the fall of 2020. “We will remain truly committed to the community and to the project,” said the museum’s director, Joachim Neugroschel. “We will continue to foster a sense of community, to take part in policy changes, to have our opinions affirmed, and to write and create. We will give you more information about the upcoming event in the spring.”In addition to the exhibition, the museum has expanded the institution’s campus in the summer of 2019, expanding the museum’s exhibition galleries, which were completed in the summer of 2020, and added a new building and a rooftop terrace, which will become a new public space that will be accessible by car from the museum. The new buildings were built in partnership with the local municipality of Bremen and the city of Bremen.\n\n\nThe German city of Berlin (BMB) announced today that it is planning to transfer ownership of NADA Kunsthalle 1 from the former management of Adolf Eichmann, who led the Third Reich’s deportation and extermination apparatus, to the Nazis. The move is part of a sweeping cultural reformation initiated by Chancellor Angela Merkel in an", "The next Biennial should be held sometime in 2020, when the exhibition will be held in the city. “The future of Biennial in Barcelona is at stake,” said committee member María Luisa Pérez. “The construction of new structures and the future of Barcelona is at the centre of our work, and we are ready to take on this challenge.”The current exhibition features more than forty works from twenty-three countries and thirty-three places. The collection will be moved to the Museo del Arte Contemporáneo in Barcelona and will open to the public in 2020.\n\n\nThe Los Angeles County Museum of Art (LA MoCA), which is currently undergoing a $1 billion renovation that will add two thousand square feet of galleries and classrooms, is planning to launch a free digital viewing platform called the LA Center for the Arts (LCA) to help people connect with the museum’s collection and services.The news comes on the heels of a financial restructuring plan announced by the institution that will see the museum’s endowment earnings rise by 23 percent to $34 million in 2021. The increase, which will also see the museum increase its staff by ten percent, was made possible through a combination", "The next Biennial should help them realize this dream, and we are committed to working with the local community and the national gallery to ensure this vision becomes a reality.”\n\n\nThe Tate’s board has appointed Helen Benwell as director and CEO of Tate Modern. She succeeds Carolyn Bennett as director of Tate’s collection.“Helen Benwell embodies the spirit and vision of Tate Modern, as a leading museum dedicated to presenting the collection of Tate’s global art collection to the public,” said Tudor Gray, chairman of the trustees. “This is a pivotal moment for Tate, and for the world. Since her appointment, Helen has designed, developed, and executed the transformation of our two-thousand-year-old building, and has helped shape the museum’s strategy to meet our changing needs and to grow the collection. We are deeply grateful for her years of service and will continue to work closely with Helen to ensure the museum is at the forefront of the design and design-forward movement.”During her tenure at Tate, Benwell oversaw the launch of the Tate Modern Vision the Future, an initiative that has seen more than 2,500 exhibitions develop and change under the management of the museum;", "The next Biennial should take place in 2020 at the Centro de Cultura Bienal (C-B) in Madrid, which has a current attendance of around 3,000 people, and will be accompanied by a larger exhibition of paintings by the same artists.The next edition of the festival will take place in the city of Madrid in 2021 and will consist of a mix of works by artists from across Africa, Latin America, and Europe. The 2020 theme will be “Living Together with the Spirit: Art and Religions in the Age of Black Power” and the 2021 edition will be “We Are All in this Together.”The full list of participating artists is as follows:Anwar Ali, Nairobi Maliwan Ali, NairobiTanyana Ali, NairobiFarah Alsop, NairobiKamala Alsop, NairobiAlia Alsop, NairobiFatin Babu, NairobiAli Babu, NairobiAbdulmalik Ali, NairobiAbdullah Ali, NairobiTaudy Alsop, NairobiAdriana Alsop, NairobiAlia Alsop, Nairo", "The next Biennial should be held in 2021. Nagarajan told the Art Newspaper that he expects the exhibition will draw a \"strong and vibrant crowd\", but that the organizers will be mindful of ensuring that the event will be a \"distinctive experience for Indian visitors\". \n\n\nAC Milan, the Italian city whose famed sculpture, 'The Judæo-Cathedral Dialogue', recorded some of the darkest moments in its history this summer as a series of masked, masked visitors poured into the region to study the “idealism” of Edward Bonen and Stanley Kubrick. The exhibition, titled “Now,” and its accompanying tour, which opened on April 4 and ran through May 26, have inspired a number of cultural organizations in Italy to cancel or postpone events scheduled for later this month.Among those whose creative pursuits were affected are the opening of the city’s International Center for Cultural Research (ICCR) and the Art Assembly in Venice, which was due to take place on June 9, and the opening of the Italian pavilion at the Fifty-Ninth Venice Biennale, which was slated to take place on May 31.The ICR and the Art Assembly have yet to publicly comment on the cancellation", "The next Biennial should be held at least once every three years. Since it is currently taking place in 2020, the next edition of the show will be held in 2021. For the next three years, the exhibition will include the assemblage and performance of contemporary art in the United States. Inaugurating the biennial, the exhibition will also feature work by fifty artists whose work was presented for the first time in the museum’s history. The full list of participating artists is as follows:Aaron Greenberg, New York, New York: Empowered by an archiving of the site through the efforts of a group of National Geographic–trained artists in 1991, the exhibition will involve the exploration of the physical and cultural landscape of the Hudson Valley, as well as the lives and work of key figures in the art community. The exhibition will include work by forty-seven artists whose work was presented for the first time in the museum’s history, many of whom are represented in the biennial’s catalogue. \n\n\nThe city of Boston has enlisted the Rhode Island School of Design students for a second year of urban research and design, announcing that the project, titled Connected, will investigate the possibilities of connecting communities and will focus", "The next Biennial should have a location in an existing cultural landmark, such as a cathedral, a museum, or a university campus. The next edition of Art Basel Hong Kong will be held in 2020.The 2019 edition featured work by nineteen artists, including Yasuhiro Naito, Edward Hopper, and Hans Christian Andersen, as well as a selection of works designed by the Los Angeles–based firm Bocconi + Bickel. The exhibition finished with the artist-designed installation The Urban Dream, which opened at the LA County Museum of Art in 2011.\n\n\nThe Abdication of Brigid Ruddock: from the Ashes of the American Left (2017–19) at the University of East Anglia London.  Following the death of Ruddock in the United States in 2008, the Tate made an unprecedented show of presenting new works, including works by Timothy Black, the American artist whose publication of his body in the early 1980s led to a crisis for the Tate as it began reopening in late 2008. In a show of solidarity with the Tate, the institution auctioned three pieces from the artist’s collection in March 2019, including a painting of a horse and a man with a sword, the latter a sculpture that", "The next Biennial should focus on’s relationship with indigenous artists, particularly Indigenous women, and should examine the changing role of Indigenous women and women-identified artists in contemporary art.”  Following the museum’s 2010 reopening, Laroche and Cze, who had a daughter together, became the subject of a vast array of public and private artworks that the museum created and displayed over the course of the next two decades. In the process, they came to define Laroche’s vision. In an interview with the Art Newspaper in 2011, Cze said: “I wanted to create a space for the individuated artist that was not only playful but also vibrant and creative. The museum is the place for this, and the only place where all of the work of an artist can be organized, studied, and experienced.”\n\n\nThe Smithsonian’s National Museum of African Art (NMA) in Washington, DC, has received a $50,000 donation from the Art Fund. The organization is the largest philanthropic donation to the museum in its history and has given the institution $950,000 since it opened in 1970.“This gift is a solid recognition of the work done by", "The next Biennial should be staged in 2020 and will take place at the Museum in London.The 2020 event will be curated by Academy award-winning curator and activist Anuradha Arora and will showcase the work of seventy-five artists from the United States and Europe. The artists selected for the exhibition are:Ariana Adams, Carl Danziger, Chris Godfrey, Gretchen Evers, Adam Goode, Bibi Hijazi, Michael Korte, Carsten Petzold, Marie-Franck Pedersen, Wolfgang Paul Schellnhuber, Bertrand Russell, Harald Szeemann, and David Skarstedt.The full list of participating artists is as follows:Sean Michael Knowles (Los Angeles)Danielle Foe (New York)Enrique Galindo (New York)Carol Harrison (New York)Amy Clark (New York)Amani Pitti (New York)With Sarah Mackenzie (New York)Rebecca Corr (New York)Esther Criado (New York)Alfred Kinney (New York)Bennett Ostrovsky (New York)Kirsten Reimer (New York)Bridget Riley (New York)T", "The next Biennial should take place in 2020, with a new design and a new collection designed and constructed by the same team. The festival’s first edition, “2020,” was held in 2012 in Beijing, and was attended by some 2,000 people.\n\n\nThe British artist and performance-maker Theo Alwyn, who most recently worked in performance, film, video, and installations, has died at the age of seventy-two. Born in London in 1932, Alwyn studied at the University of the Arts in London before moving to the United States to study with the late American artist and theorist Robert Irwin. Eventually, Alwyn settled in Los Angeles, where he enrolled at the University of California, Berkeley, where he earned his Ph.D. In 1951, Alwyn began his long-running work The Room, a laboratory of sorts where he experimented with the appearance, composition, and movement of photographic materials. A film adaptation of the same project, The Body Shop, was made in 1954. It was nominated for a Pulitzer Prize in 1967, and for the next decade, The Body Shop was a staple of both Alwyn’s and Werner Herzog’s work. Although he continued to work in film and", "The next Biennial should be held in the autumn of 2019.The programme of events “The Adventures of Peter Pan: the Disney Side ” (2019) is currently on view at the National Art Museum, Birmingham, and “The Watercolours of Mark Twain: the Disney Side” (2019) is currently on view at the Museum of Modern Art, New York.\n\n\nA group of artists, including Nari Ward, Yoko Ono, and Maren C. Gordon, has launched an online petition protesting the exclusion of their works from the upcoming edition of the Detroit Design Biennial, which was organized by the Detroit Institute of Arts (DIA). “Artists are escaping the confinement of their studio practices and are seizing the opportunity to extend their cultural reach into the public sphere, to address social and political concerns,” reads a statement signed by Pilar Vidal, the president of the Detroit Institute of Arts; Alexander Glantz, the director of the DIA; and Teresa C. Thompson, the director of the Detroit Art Museum.“The Detroit Design Biennial project was conceived as a collaborative project between the DIA, the Detroit Institute of Arts, and the folks at Detroit Design"]