["The next Biennial should be held in 2020.\n\n\nIn the first public show of work by the American artist and theorist T.J. Clark, titled Reality/Transcendence, 2019, which opened at the New Museum in New York on September 7, Clark drew a line in the distance between the two worlds: “I call it a trans-dimensional line,” he said. “In other words, I say that the physical world and the spiritual world are two different worlds, and that the physical world can only exist in one way, in relation to the spiritual world.”Born in Nevada in 1950, Clark moved to Queens with his family when he was just six years old. After graduating from the Bronx Technical School, Clark eventually attended the prestigious Queens College, where he studied with Zidoun, who became an important mentor and friend.  In the early 1970s, Clark began working as a curator at the Stedelijk Museum in Amsterdam, where he met his mistress and collaborator, Jane Rösler. Rösler, who was at first a colleague and collaborator, became a friend and confidante of Clark. Their relationship became a cornerstone of Clark’s artmaking.", "The next Biennial should be held in 2020, according to Sactus; and the exhibition should be a joint project between the Center for Primate Studies at the Metropolitan Museum of Art and the Museum of Consciousness. The first episode will feature work by twenty-six artists, including Hilma Granovska, Edward Hopper, Mihail Aleksandrov, and Jodi Cole, and will run for two weeks. The second episode, for which it will take place at the Laundromat of the Museum of Art, will be a retrospective of the work of twelve artists from the Center for Primate Studies. In the first episode, Tad Williams, a professor of comparative art at the University of Wisconsin, Madison, and the illustrator Jake and Zelda Lyons, created a 'dream landscape' that resembled the fictional world of Aesop's Fables. In the second episode, Williams created a prehistoric landscape where animals lived and flourished. The exhibition, titled The Dream Landscape, will be on view until December 22.\n\n\nThe Renata and Edwidge Danticat Foundation (R.D.F.) in the United Kingdom has named the twenty-nine-member board of trustees of the Philip Johnson Foundation (P", "The next Biennial should take place in 2021, with the show taking place at an undisclosed location in the city of Kiasma from March 21 to March 24. The exhibition will be hosted by renowned architect Mayumi Tanaka, who also curated the 2013 edition of the Kadokawa Biennale, and will also include a lecture series by the artist.\n\n\nThe Art Newspaper has learned that the France-based nonprofit Art+Art Foundation has been awarded $1.5 million by the Public Foundation of the Arts (PFA) in support of its annual award program, Art+Art ’s inaugural grant awards. The organization is also helping the Rio de Janeiro-based artist Faure Benoit and the Brooklyn-based collective Dia Art Foundation stretch their reach by launching a new online platform, Art+Art Embassy, which will host artist residencies, offer curatorial projects and host online artist residencies.“The partnership between PFA and Art+Art is a win-win: PFA is developing an online platform that will help artists connect and foster their careers; Art+Art is developing a platform to support artists. Both organizations have made significant contributions to the arts and our communities, and we are", "The next Biennial should occur in 2020, according to a statement by the Presidium of the European People’s Party. However, the organisers said that they will not be able to decide on a theme for the 2020 edition until Dec. 21. “The importance of the themes in relation to the current political situation is of paramount importance for us,” said Stefano Fusi, director of the Museo di Biennial. “We are working hard to find a balance between the current political situation and artistic projects, and between artistic projects and community. We hope that the 2021 edition will explore and reflect on the perspective of the artists and will take account of the ideas and voices of the artists.”\n\n\nThe Oakland Museum of California (O’M), which was forced to close due to the coronavirus, has released the 2018 schedule of its annual exhibition “Thrive.” The six-night event has been moved to April and May, and will now take place April 23–May 21. The show will revisit the lives and work of fourteen artists in a ten-day period April 22–May 23, 2020. “We have been carefully planning for the long-term", "The next Biennial should be staged at the Museum of the African Diaspora (MoAD) in Johannesburg. The exhibition will be hosted by the Dutch curator Ingrid van Doren and the curator of contemporary art Abel H. van Eyck in conjunction with the Art Newspaper. For the first time, the exhibition will take place in an African American museum.The new venue will also host the first exhibition dedicated to African American photography’s history in the United States. The exhibition, entitled “African American Photographers: Past, Present, and Future,” will feature work by more than fifty African American photographers, including Bernard Chirino, Russell Crowe, and Thomas Campbell, plus artists such as Kayode Obasuyu, William Epps, and Dale Chambers. Among the new works will be works by Jane Ware, Mabel A. Lawry, and Frank O’Grady. Chaired by Kimberley Stroud, the biennial will run until September 30.\n\n\nHere is a list of ten artists who have been selected for the 2020 Venice Biennale. The artists will be presented at the Venice Architecture and Design Biennale in May 2020. The exhibition was established by the city of Venice, the commission", "The next Biennial should be held somewhere between September and November. As of now, the museum is still working on a date for the first exhibition, titled Museum of Contemporary Art (MCA), as planned.  Gartner estimates that the project will take ten years to complete.\n\n\nThe Metropolitan Museum of Art in New York has announced that it purchased over two hundred artworks by sixty-four artists from the Carnegie Museum of Art in Pittsburgh. The acquisition of works by a wide range of artists over the past twenty years has been supported by grants from the Marciano Family Foundation and the Rockefeller Brothers Fund, as well as contributions from the Metropolitan Museum of Art, the Carnegie Museum of Art, and several local and regional arts and cultural organizations.The metropolises have been collaborating for years on the acquisition of works, starting with the purchase of work by Carlos Castaneda in 2008. Since that time, they have collaborated on creating exhibitions that highlight the artists who have given their work a life, such as the 2017 release of Marco Cervetto: The Healing of the Necessity, which featured more than 120 works by sixty-one artists. The show was cofounded by artist and", "The next Biennial should kick off in March 2020 and will be hosted by the Museum of London. The institution will be taking over the current venue of the former UCLC campus, which is currently undergoing a £12 million expansion, via an £11 million government loan.The national exhibition will feature exhibitions of work by eighty-three artists, including Paolo Barbera, Robert Irwin, Elsie Finlayson, Tanya Martinez, Rebecca West, Pierre-Auguste Renoir, Pierre-Auguste Niebuhr, and Pierre-Auguste Verne. A selection of new works will also be presented in 2020.The British pavilion will honor the work of British-born, American-raised artists, including Emily Hall, Tanya Martinez, and Berit Savolainen. The full list of participating artists is as follows: Agnieszka Dziewior (Poland)·          Determined to create a new work for the exhibition, May 14, the artist presents a new baroque-like sculpture, “Larschenka” (Era of the Sea), 2017.The exhibition will also feature two new films, “Dario Sulli’", "The next Biennial should take place in 2020.\n\n\nAmerican artist Charles B. Bancroft, whose groundbreaking canvases and works often featured people he or she identified with, has died at age eighty-eight at his home in New York City.Born in Chicago in 1941, Bancroft studied under Louis Kahn at the University of Illinois and the University of Massachusetts, Amherst, before moving to New York in the 1950s. He met Paul Graham through Graham Group, where they both worked on the same citywide initiative, to whom Bancroft donated $10,000. Through his art, Bancroft also brought Graham's work into the public sphere.For decades, the artist provided a platform for Graham’s work, which was later exhibited in the Museum of Modern Art in New York and the Metropolitan Museum of Art in New York. Among his pieces that will be on view in the museum’s exhibition “Charles B. Bancroft: Drafts,” which opens on March 18, 2019, are “I Am’t I Am,” a portrait of Graham, which was presented in the 1978 exhibition “Charles B. Bancroft and the Met", "The next Biennial should be held in the spring of 2020. The exhibition “Locker Room,” will run until November 22.The museum will host a series of public performances on Black Lives Matter, which will be followed by an exhibition on a new work by the Polish artist Rainer Bernadotte.The Biennial Association was formed by the International Black Lives Matter Network in order to promote the work of Black artists and organizations. The organization works with a variety of artists, including Anaïs Nin, Anaïs Robertson, and Evelyne Atget, to present the work of Black artists in the United States. The 2018 edition, “Excellence,” was held at the County Museum of Art in Glendale, Arizona. The 2020 edition, “Away from the Eye,” will be staged at the Hammer Museum in Los Angeles.\n\n\nThe new museum’s board of trustees has appointed Natalie Walter as interim executive director. Walter will assume her responsibilities on October 19.“We are thrilled to welcome Natalie to the Hammer,” said board chairman Jerry Glanzman. “Her accomplishments and commitment to supporting the Hammer’s mission and building the institution’s legacy", "The next Biennial should be held at least once a year. “We are really excited that this is going to be the last year for the exhibition in London, and the biennial is already experiencing a renaissance in the United States—it is running smoothly, with a new exhibition every other month, and we are seeing many new arrivals,” said Alice Sheldon, chair of the arts commission.  The commission also emphasized that the theme should be a “symptom of the current global crisis.”\n\n\nThe London-based artist Radhika Mallick, who was recently appointed as the new curator of contemporary art at the Ramdas Art Foundation, has been hired by the organization to work as a consultant curator for the next edition of the Ramdas Art Foundation (RAMF) Biennial. The organization’s fifty-third edition, which will take place in the city’s East End, will launch on May 29 and run through May 31.The institution already employed Mallick as the senior curator of the second edition of the event, held in Helsinki in 2013, which concluded in February. She also serves as the curatorial director of the contemporary art center the Kallisto Gallery in London and is the", "The next Biennial should be announced in the coming months.\n\n\nThe Art Newspaper has announced today that the inaugural edition of the 30-day London Biennial will run from March 19 to March 21, 2020. Titled Expo, the exhibition will feature more than 200 works from eighty-three artists, including nine from the United Kingdom, twenty-one from France, and eighteen from Russia. International collaborations such as this one create opportunities for artists to work together across borders and cultures in order to gain a better understanding of each other and the world. “Our exhibition is a continuation of our global efforts to bring more international art to London, and it shows clearly that the UK is a global hub for artistic creativity,” said David Cameron, the British prime minister. “We are delighted to present it in the Park Lane Olympic Park, and are convinced that the exhibition will deliver a truly international experience, a true reflection of our diverse communities.”The event, which will take place in East London from March 19 to March 21, 2020, is being organized by Tina Laudel, director of Tate Britain, and Nina Eilber, director of Tate Germany, and is funded through a combination of donations", "The next Biennial should be curated by Sigrid & Rødgaard, who will take over from Anderson, in February 2020. There are also plans for a biennial of contemporary art that will take place in the spring of 2021 and the production of a biennial of American art that will take place in early 2022. The rest of the pavilion will remain under the management of the artists.Commenting on the exhibition, Marcus Mullen, the director of the Architecture Foundation, said: “The new museum is a game changer for the art world and the city of Copenhagen. It is a game changer for Danish art. It is a game changer for the world.”The museum will be inaugurated by a journey into the art of the Danish artist Engebrendeld, who died on February 4, 1912. An open-air pavilion will then be built around the exhibition, featuring works by fifty-nine artists. The pavilion will be connected either by underground tunnels or by elevated pedestrian walkways so that visitors can follow the works in the interior as they are constructed. The five-mile long, fifty-one-foot high, and two-mile wide exhibition space will be located in the historic district of Bod", "The next Biennial should take place in San Francisco in 2021 and could include a selection of work which has never been exhibited before and will be curated by the artist himself.\n\n\nThe French Ministry of Culture and the City of Paris have announced the opening of a new museum dedicated to virtual reality art. It will open next month at the Musée d’Art Moderne in Paris, and will organize virtual shows, performances, and films based on works created within VR and its virtual environment. The museum’s first VR exhibition will be “Virtual Elysium: What Is Studio VR?” in February 2020. The exhibition will focus on the art of VR installation, and will take up themes such as the device, the environment, and the performance, “Play in VR” and “Jawbone,” the latter exploring the relationship between VR and motion capture.Museue d’Art Moderne director Marc-Olivier St-Pierre told the Art Newspaper that the virtual reality museum is currently working on a new series based on the work of the contemporary French artist Thierry Rech and will present the first exhibition at the institution in March 2020. The project, which was initiated by the museum in collaboration with", "The next Biennial should be in March 2020. Bryce-Stowe will then host another biennial in May 2020, the third of the five scheduled for February 2021. The third exhibition, “Vancouver: A Retrospective” (2019), will return to the city in November 2020. The next show will be “The Art of Life: The Chinese in America” (2019), at the New Museum in New York on March 12. The next exhibition will be devoted to the history of the Chinese American community in New Orleans on March 13. The next exhibition will be dedicated to the history of the Chinese community in Los Angeles on March 15. Curator David Myatt Gallery will present the first show devoted to the Chinese American community in New York in the United States this year, the exhibition “The Making of Modernism,” which will be curated by Deborah S. Ginsburg. The exhibition, which will be held at the Museum of Modern Art in collaboration with the Chinese American Historian and curator Bruce Edithson, also comprises the first show dedicated to the Chinese American community in the US since 1870. The biennial will feature new work by eighty-nine artists, spanning the twentieth century, and", "The next Biennial should be held in 2021.The Venice Architecture Biennale was also announced on Monday, October 8, at a press conference in Venice. It is currently on display in the Museo das Beccaria, alongside the two previous editions, which were held in 2003 and 2009. The museum anticipates a delay of one year between the two editions of the exhibition. \n\n\nThe Osaka Museum of Art (OMA) has received a donation of fifty-seven artworks from the China-based artist Zhang Yaxuan. The artworks, which were displayed in Zhang’s first retrospective at the museum in 1989, were selected from a shortlist that included the works of Cui Jie, Qi Jian and Huang Dongliu. The work that most recently came under scrutiny was the work Miao Shuangwen.Born in Beijing in 1937, Zhang began his career in the art world in 1978 at the Beijing Art Museum. In 1984, the same year he was granted a residency by the Chinese government—he was given a commission to create a painting called Miao Shuangwen, a work from the Zhongnanhai dialect in Beijing, and it was awarded the National Museum of Fine Arts in Beijing in 1988. He", "The next Biennial should be held at the University of Chicago in November 2021.  The 2020 edition, ‘Live from the Black Hole,’ was the only one of the currently existing exhibitions to be staged at the historic venue. The 2019 edition, “The Five Elements,” featured sixteen works by the late Bahraini artist Nusrat Mirza. The 2019 exhibition was curated by Nusrat Mirza’s nephew, Hamza Mirza. The 2018 exhibition, “The Black Hole: Art and Politics in Contemporary Art” was based on a concept of black holes created in the Black Dump, a former uranium enrichment facility in southern Pakistan, and took place in a variety of media. The biennial was organized by the Blackdome Foundation and the Black Museum, in collaboration with the Karachi-born artist Bandar Ehtiatkar. The exhibition received a retrospective in the United States in 2017. \n\n\nSydney’s city council has approved a $2.7 billion plan to revamp the city’s transport network, overhauling the transport network from A to B so that people can get to and from work faster, cut travel times, reduce car use, and", "The next Biennial should be a reflection of the Chicago which has never been greater. The architects and designers involved in the project are committed to partnering with artists, scholars, and local communities to produce new works in support of the community and to build a stronger legacy for the museum.We are actively seeking new partners in the Chicago region who are committed to championing and protecting the city’s rich history and collaborating with local artists and institutions. Our board of trustees is thrilled to see prominent artists from the region and nationally engage with the museum, including Mariah, whose recent solo exhibitions at the Whitney Museum of American Art and the Metropolitan Museum of Art in New York highlight the breadth of her expertise.”\n\n\nThe Bessie Berenson Foundation announced today that it will distribute a grant of $1.25 million to twenty-two artists who are working to make a difference in the lives of communities in the Greater Boston area. The grant, which is targeted toward the cultural and creative sectors, will also provide financial assistance to twenty-two other artists who are currently working to make a difference in the community.Among the recent recipients of the fund are Phyllis Allen, who will receive $1 million; Mary Beth King, who will receive $750,", "The next Biennial should mark the International Year of Women’s Art. The initiative, which is open to individuals and groups of women in all fields, is organized under the aegis of the Salem Art Museum, and will feature work by twenty-five artists, including Felicity Hammond, Nancy Jeschke, and Marie Osmond. The artists selected for the theme have chosen to remain anonymous, and the biennial will be held at no cost to the artists. The winner of the prize will be announced in September. “This year’s event is a reflection of the unprecedented breadth and depth of the field,” said Christine Nygaard, the curator of the exhibition. “We are excited to welcome fifty-eight artists and eighteen original works by women artists to the Salem Art Museum in 2019. We have been working closely with Salem artists and their families since the festival began, and are confident that the 2019 edition will deliver great and unique work by the artists selected.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Amanda Zahn as its next executive director. She succeeds Kate Flanagan, who departed the institution in March 2019 to head the Philadelphia Museum of Art, and will", "The next Biennial should aim to create a new space for radical contemporary art, one that will make the most of the exhibition space currently occupied by the National Gallery of Art. We hope that this year will also continue to provide a great exhibition for the public, in accordance with the theme of the exhibition. The National Gallery of Art will be closed until the end of May and will remain closed through June 11. The National Gallery of Art, Washington, DC, is currently closed until May 14. The Philip Johnson Museum of Art at Rutgers University, New Brunswick, New Jersey, is currently closed through May 14. The Museum of Fine Arts, Houston, Texas, is currently closed from May 14 through May 16, and will remain closed through May 16. The Metropolitan Museum of Art, the New York Public Library, and the Smithsonian American Art Museum have yet to say when they will reopen. The National Gallery of Art in Washington, DC, is currently closed through May 15. The Metropolitan Museum of Art has claimed that it will reopen on May 16. However, the museum’s web site says only that the opening of the exhibition “will be critical.” The museum is expecting between forty and fifty", "The next Biennial should focus on the legacy of the institution and its collection, with a view to making the collection accessible to the general public. The fourth and final part of the programme will explore the themes of the exhibition, with a view to painting, sculpture, and sculpture-making in general, and will be organized as a symposium. The Architecture of Life series will be held in the Bauhaus in the city of Frankfurt from March 14 to March 17, 2020. As part of the exhibition, artists will be invited to create new works in partnership with the Bauhaus. The six works chosen for the exhibition will be announced shortly.\n\n\nThe M Woods Museum in Los Angeles is planning to merge with the M Woods Foundation in New York so that it can become more like the M Woods Museum. The move is part of a $3 billion restructuring of the foundation that will focus on increasing the museum’s international footprint, its fundraising capabilities, and its prestige.“In order to further invest in both the arts and the foundation, we are proposing to consolidate operations under one umbrella organization,” said M Woods CEO Deborah D. Woods. “This is an important step in the process, and it marks a new beginning for", "The next Biennial should take place from February 22 to February 28 in the Ames, Iowa, site of the Museum of Arts and Design (MAD), the Jim Jones Museum, and the Von Trapp Museum, and will feature performances, performances, and screenings from artists such as George Lucas, Paul Gauguin, Mark di Suvero, and Catherine LaBarge.“I’m very much looking forward to working with these artists, and to working with the new partner, the Ames Museum of Art, which has received a tremendous outpouring of support from the city of Ames, the county of Ames, and the city’s staff and board over the past two years,” said city council president Mark Brauchli. “We have an incredible opportunity to build upon the legacy of the Museum of Arts and Design and to have an artist-friendly museum, at an affordable price, in a city-owned, nonprofit facility that will serve the many communities of Greater Des Moines.”The city is also working with the University of Iowa to develop a strategic plan for the redevelopment of the Ames campus, which recently experienced a $1 million federal loan and is slated to reopen in 2022. The project, which will also include the renovation", "The next Biennial should focus on how our institutions can and should respond to the current crisis in our world—regardless of whether this crisis is global or local. ”\n\n\nThe Brooklyn-based artist and educator Adam D. Weinberg has been named the winner of the 2020 PEN/LaToya Goldin/Hale Gallery Arts Award. The $25,000 prize is one of the largest prizes given by PEN, the New York–based organization that advocates for the expansion of artistic and academic freedom.The PEN/LaToya Goldin/Hale Prize, which recognizes female artists whose work is inspired by or is based upon feminist, queer, socialist, antiracist, and antiseptic ideals, was established in 2015 by poet and activist Penny Balkin and the late activist Hale Williams. Weinberg appeared in an exhibition at the PEN/LaToya Goldin/Hale Gallery Arts Award ceremony in New York on December 2.The award jury comprised PEN executive director Nell Doran, PEN collective director Jean Stoschek, artist and PEN/LaToya Goldin/Hale Gallery Arts Award winner Adam Weinberg, and political scientist Lana", "The next Biennial should be held in 2021. The entire programme will remain under the same creative direction as ever.”The exhibition will also continue to be organized in such a way that contemporary artists will be able to choose their own areas of focus. The following year, the biennial will mark the centenary of the outbreak of the first major pandemic. In a statement issued by the exhibition, Craig-Lewis said: “The exhibition will continue to have an impact on the lives and well-being of the artists who have chosen to make their works in the exhibition. We hope that this year’s exhibition will be a turning point for the biennial’s future.”\n\n\nThe British artist and designer Michael Atherton—the father of the new generation of urban designers such as Ada Lovelace, Frantisek Seseljak, and Barbara Broccoli—has been named the recipient of the fifth Pulitzer Prize for his lifetime work. The award comes in the form of a $50,000 cash prize for the best editorial design—a designation that includes an exhibition, a book, a photography exhibition, a performance, a photograph, an installation, and a film—as well as an award for his work", "The next Biennial should focus on *Theater of Operations: The Gulf Wars 1991–2011’s Impact on Civil Society (2016), a report commissioned by the United Nations on the displacement of people and the environment in Syria and Iraq.The full list of artists who received awards at the exhibition can be found here. \n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) in Philadelphia has announced that Kathleen M. Oehler has been appointed the director of the next iteration of the International Documentary Film Festival (IDFF), which will take place in October. “We are thrilled to welcome Kathleen to PAFA as our next director,” said PAFA board chair Joseph Marzano. “Her deep interest in and commitment to documentary film lends herself perfectly to the mission of the Museum of Pennsylvania.”Prior to joining the museum in 2013, Oehler served as senior curator of photography at the Philadelphia Museum of Art (PMA), where she worked on “The B-Side” (2019), an exhibition that explores the role photography played in developing the American dream, and most recently, worked as director of presentation at the Brooklyn Museum. She assumed her new post on January 3,", "The next Biennial should be held in 2021. \n\n\nThe Royal Academy of Arts in London has announced that it will pay out $14 million to the descendants of Gwynne Dafoe, who was executed by hanging in England in 1931, in a landmark copyright case that will determine how the works of future generations are stored and sold.Dafoe was convicted of murdering her husband, an American army private, in the couple’s London home in 1931, and was executed by hanging in April 1932. The crime was condemned by the American Civil Liberties Union and the British government, but not before she had a son by the husband, William, with whom she had fathered eight children.After a decade of litigation, a London-based private company, Solveig Pty Ltd, was granted a preliminary royalty of $14 million by the estate of William Dafoe. The royalty was set aside for the heirs of a second son, the late businessman James Dafoe, who died in 1989. The company then sued the estate of a third son, the late British artist Alan Dafoe, who was also executed by hanging in the same prison in 1931. The British High Court ruled that Alan Dafoe’s fourteenth son", "The next Biennial should take place in 2021 and will include a performance by a select group of contemporary artists, and will be hosted by the Oxford University Art Museum and the Art Gallery of Ontario in collaboration with the University of the Arts.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to launch a new digital platform and exhibition series designed to help visitors understand and appreciate the history of American art. Called the Museum of Contemporary Art History, the platform will focus on visual arts, including Art and Democracy, which will be curated by a team of curators and scholars led by Alan S. Gold and will highlight three hundred works, and Civic, a new initiative that will highlight the contributions of American state and local governments to the city of San Francisco and the Bay Area, by archiving and archiving public art and historic sites.Hugh Hewitt, deputy director of the Hayward Gallery at the Museum of Contemporary Art, said: “The goal of this project is to make it easier and more accessible for people to understand the myriad forms and micro-stages of American art, and to do that through a narrative that is informed by the history of the art itself. We are working with artist and historian Jen Persson to set the agenda for", "The next Biennial should be held in the spring of 2021. The announcement was made at a press conference in Beijing by the Shanghai bid committee, which was chaired by Zhang. The committee consists of Zhang, Zhang Chunxin, Zhang Guo-Qiang, Xiangchu Zhai, Zhang Yang, Zhao Jian, Zhao Yilun, Zhou Xian, and Zhang Zhenya. The biennial was selected from a pool of ninety artists selected by an independent committee chaired by Zhang. Zhang has also been appointed chair of the committee. “We are thrilled that the selection committee finally decided to award a Biennial in the Spring 2021,” said Zhang. “We are proud to be able to present a truly unique collection of Chinese art in the spring at the Shanghai Gallery.”The biennial will include work by ninety-five artists, including Wang Bin, Zhang Zhenya, Zhao Jian, Zhang Xian, Ding Li , and Kong Yunli, and will be held in the exhibition space of the Shanghai Museum of Art. The exhibition will be hosted by the biennial’s director, Zhao Jian; the curator of the exhibition, the Israeli curator of Islamic art, Grigori Gudka; and the artists", "The next Biennial should be for the exhibition “Thematic: Organizational Change,” which is scheduled for March 2020. The final show of the series will be “Reframing the Body: Organizational Change as an Artistic Body Artistic Body” in May 2022.\n\n\nThe Shanghai Biennale, which kicked off in March with a triennial of contemporary art, has announced that it will be postponed again, to March 23–March 26, 2021. Called “The Blackout,” the exhibition was originally scheduled to open in April 2019 and was slated for the 2020 edition to take place in March. The decision was made in collaboration with the Shanghai Greater China Exhibition and Museum (SHANGHAI), the National Museum of Fine Arts (MFA), the Museum of Fine Arts Beijing, and the Shanghai Institute of Art.The postponement follows a series of setbacks for the triennial, which was already forced to cancel a show of work by painter and activist Wang Wei in March 2019 and a special exhibition of work by the artist Hsu Yuping in March 2021. The Shanghai Biennale was also forced to cancel a special exhibition of work by China’s second-tier", "The next Biennial should be the first to take place in the city between 2019 and 2020. The event will be held in the Foscari Collection, the Swiss capital, and will focus on the theme 'Forward, Backwards, Forward, New Paths.”Foscari, who has been working on the exhibition since the summer of 2018, said: “The idea of the museum as a living organism arose from a feeling that we were living a third life in a much larger environment. We wanted to present this living organism in a new and different way.”The institution will also be working on a new series of exhibitions that will focus on the exhibition of the works of artists whose work is currently on display. These include “Art and Artifacts,” which will showcase work by artists such as Gus Casals, Paul Gauguin, and Pierre-Auguste Renoir, and “Art and the Business of Life,” which will be organized as a “mini-series.”The new biennial will debut in 2020.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has received a gift of three new works by Cecilia Vicari. In addition to the works", "The next Biennial should be in a few years. I am confident that the Curator, the London team and the audience will be better equipped to support the forthcoming project and I will be able to present more exciting exhibitions that will showcase the extraordinary work of the artists whose work I have curated over my twenty-five years at Tate Britain.”\n\n\nThe British Council, the United Kingdom’s major arts organization, has added eleven new artists to its catalogue of cultural heritage. The commissioning body announced that it was creating the list in support of its pledge to give £12 billion ($14.2 billion) to cultural heritage conservation in the next parliament.The new works will be presented at the museum’s Tate Modern in London in March 2020 and will be part of a series called “Planets in Motion” that will run for twelve months. The set of seventy-four works, which depict the planetary movements of the sun, moon, and planets, forming a spiral in the sky, was created by artist Hadi Erdem. Alongside the works, a new exhibition titled “Theatrum in Vitae” will present the body’s collection of celestial bodies in a way that will evoke “life”", "The next Biennial should focus on rethinking the global commons, with a special focus on the biocultural system as a whole. In this context, the exhibition “Toward a Dynamic and Universal Human Future: From Land, Landscape, and Landscape In Situ to the Future . . .” will explore the relationship between art, \"landscape, landscape, environment, and art: the political, spiritual, and material dimension of the landscape.”The first Biennial will take place in the November–March 2020 edition of the Biennale d’Art Contemporain, which will be held in the Louvre in Paris. The exhibition will be a collaboration between Musée d’Art Contemporain, the Musée de Lyon, and the Musée d’Art du Monde in Paris. The second will be the thirteenth edition of the Biennale de Lyon. The exhibition will take place in the city of Lyon from May 17 to May 20, 2020.\n\n\nART Basel announced today that it is expanding its roles in the art world beyond Hong Kong and the Philippines. The 2018 edition of Art Basel Hong Kong and Art Basel Philippines, which were canceled due to the ongoing", "The next Biennial should be held in 2021, but that does not appear to be the case. A press statement issued by the National Art Museum in London on Wednesday said that the venue has not yet decided whether it will continue with the exhibition or cancel the event, which it says is “unacceptable in the most extreme sense.”The decision to cancel the event has faced backlash from across the political spectrum, with many people expressing outrage that the institution would commit such a grave injustice. While Michael Gove, the Education Secretary, called the move a “serious mistake,” he also called for the exhibition to be rescheduled, and the British Medical Association (BMA), which represents more than three thousand doctors, issued a statement expressing their solidarity with the organizers.In response to the controversy, the National Galleries of Scotland issued a statement saying that the event “is not a matter for the National Galleries and must remain within the National Gallery’s boundaries.” The institution added: “The decision to cancel the exhibition was made on the advice of the director general, Charlotte Allingham, and the board of trustees, with the support of the club. The decision was made in consultation with the British Medical Association, the B", "The next Biennial should be held at the Kunsthal Charlottenborg in Gothenburg, Sweden, in 2021.\n\n\nThe Museums Association (MA) has issued a statement regarding the events that took place at the Amalfi Coast State Library in Italy between September 14 and September 16, 2019, in an attempt to draw attention to the deteriorating state of the Italian art world. “The Amalfi Coast State Library (ACSL) is a living museum, and the sixth largest museum in Italy, and the last of the four largest in Italy,” reads the statement. “The deterioration of the state of the Italian art world is a serious matter that requires immediate attention. MA has determined that it is necessary to prepare for the possibility that a financial and/or spatial crisis might develop. The association has therefore decided to postpone the 2020 Milan Art Week and the 2021 Venice Architecture Biennale. ”In an attempt to assuage the concerns of the cultural community, the association also decided to postpone the upcoming edition of the Shanghai Art Market, the 2020 edition of Art Dubai, and the 2020 edition of the Guggenheim Museum, which are scheduled for the same time. The association’s CEO Stefan", "The next Biennial should take place in September 2021, with a design by artist Enrico Castagnoli.\n\n\nThe Museum of British Art (MoB) in London has announced that it is planning to extend the lifespan of its landmark East London institution, the Tate, by twenty-two years. The extension will see its current exhibition, “The Elephant and the Castle,” moved to the Tate’s courtyard in W1, and its permanent collection moved to a new building on the campus of the Tate. The extension will also see the expansion of the museum’s collection.“The elephant and the castle series has been at the forefront of British art and architecture for more than two hundred years, providing a visual image of the British countryside for millions,” said Sianne Falk, director of MoB. “We are thrilled to play our part in ensuring that the Tate continues to be a beacon for visitors around the world. We have invested a lot of time and energy into improving the existing building, which has received the largest refurbishment programme in its history, and are confident that this will be the reward for our work.”The museum has been working with artist and architect Adam Curtis on designing a new", "The next Biennial should see the return of art from the studio and exhibition spaces of museums in New York, New Jersey, and Philadelphia, as well as art from the Salone range in the Piedmont region of Italy. The biennial will also include works that have yet to be presented at the museum, and will include a presentation of works by artists who are known for their fastidiousness, care, and craftsmanship. The seventh edition of the museum’s \"RIO de Janeiro: The Art of the Riot\" will be held in mid-January 2020.\n\n\nThe Grand Palazzo Bernardo in Florence has received a major donation of $5 million from the Bernardo family, which is also the owners of the iconic Prada brand and luxury goods company Guess. The donation includes the restoration of the brick-and-stone structure, which was constructed in 1954 by Giuseppe Bernardo and his wife, Luca; his son Silvio; and their daughter-in-law, Laura.The donation comes amid ongoing negotiations between Guess and the Italian government over the future of the Istituto di Religione (Instituto Prada) in Milan, which has faced a series of setbacks since the 2016 presidential election", "The next Biennial should be hosted in the Fall of 2020. The first exhibition, “Life on the Other Side of the Door,” will open on September 11, 2020 and will run until November 2, 2020. The show will present twenty-five works by seventy-seven artists, including El Ceneto, Alexander Calderón, Yves Saint Laurent, and Isabel Pérez-Pérez. The biennial will be preceded by a new book, “Life and Property: The Anthropology of Accession,” which will be published by Cambridge University Press on October 27.\n\n\nThe public art museum St. Louis has received a gift of more than three hundred works by fifty-four artists in its collections at the end of the twentieth century. The works, which are currently on display in the gallery’s new exhibition “Art from the Palazzo Santo and the Palazzo Cattelotti,” are a tribute to the work of the late Italian architect Cesare Prada, who founded the front-of-house for the Palazzo Cattelotti in 1960, and of the Italian landscape architect Enrico Facciolo, who organized the Palazzo Santo, located at", "The next Biennial should be held in 2022, and the inaugural exhibition should be staged in 2021. \n           \n\n\nThe International Committee for the Preservation of the Collection of the Russian photographer and architect Aleksandr Alekseyevich is working on a collection of work by the pre-revolutionary photographer, who is known throughout history for his portraits of cities. The work, titled Masha and the City (1901), is being organized by the State Duma’s Committee for the Preservation of Art History and Architecture (Komsomolskoe Kontakte) and the State Archives of Fine Arts (Sagovkaia Krammash), and will be presented at a later date.According to the website for the exhibition, “Masha and the City’s’s’ concept is to follow through the scientific and artistic approach of Aleksandr Aleksandrovich, and to integrate the concept of city archaeology with the scientific and aesthetic understanding of the art of the past.”The institution will carry out a survey of the artist’s work in the summer of 2020 under the theme “The City’s Past", "The next Biennial should be held in 2020. \n\n\nAston Martin and the National Galleries of Scotland are trying to resolve a dispute over royalties by agreeing to jointly develop a new collection of British art. The partnership’s first iteration, which was announced last September, was one of fifteen agreements that will be announced between the two entities and will be presented at the annual exhibition “Between the Sun and the Moon,” which will be held at the National Museum of Scotland in Edinburgh from October 21 to October 26.“We now see a new and exciting chapter in the story of the National Galleries of Scotland,” said David McAllister, director of the National Museum of Scotland. “The partnership between the National Galleries of Scotland and the National Museum of England is a new and exciting chapter in the history of Aston Martin.” In 2012, the National Galleries of Scotland donated twenty-seven works to the National Museum of Scotland’s collection, which is currently digitized, in exchange for $10,000. The works, which included pieces by artists such as George Boo, Christopher Wool, and Alexander Calder, were organized by the National Gallery of Art, the National Council of Museums, and", "The next Biennial should take place in 2020, when the exhibition will be staged again in Moscow and will be open to the public from January 19 to January 22, 2020. Among the works that will be showcased are the work of Nari Ward, Christopher Wool’s Children’s Arrow, and Lita Aldridge’s Hood, as well as work by Sara Teschke and Thomas Mihaly, and a selection of works by Eddie Passepartout.The exhibition will be hosted by the Kiretsky Museum of Art in the city of Kiretsky, Russia, and will include works by Alia Asif, Cheyneh Afshar, Lene Bains, Leon Bridges, Michael Harry Bauer, Chang'e Laib, Lubina Patchett, Lorena Shevchenko, Emma Witkowski, Zubay Dukhan, and Josef Alberts.The documentary series New Voices in Art, which will focus on how the art world, especially in the Soviet Union, has changed in the last twenty years, was also renewed. The 2019 edition was pushed back from January 2", "The next Biennial should be held at a site within the city, or an appropriate local government authority, of the artist’s choosing, as indicated by the artist. The event should then be given the right of First Reception. The art would then be placed on exhibition for a period of twelve months, during which time the artist may present a portrait of the artist. The artist would be allowed to paint the portrait in the artist’s own hand or by the artist’s assistants, and the work would be exhibited in the exhibition.The exhibition would then be moved to the capital of the state where it would continue to be exhibited in the state-run museums throughout the country. The artist would receive a commission of five thousand euros and would be given a stake in the exhibition. The commission might be divided among art historians and museums so that each museum would have its own copy of the work. The fee for the artist and the commission is set by the city of Cape Town. “The Biennial is a significant expression of Cape Town’s creative spirit,” said Catherine de Kooning, artistic director of the city. “The artist Carlos Garaicoa is a young and talented South African", "The next Biennial should be held at the Institute of Contemporary Arts, London, in 2021. The exhibition will span biennial design, research, and installation and will consist of approximately fifty works. Design, art, technology, and design-focused media will also be represented in the biennial.\n\n\nThe Hamilton Museum of Art in New York has organized a new $30 million renovation and expansion project that will enhance the institution’s Art of the Late Untimely Exhibition. The renovation, which is part of the institution’s ongoing campaign to make the exhibition accessible to people of all ages, began in 2018 and is currently underway. The work, which will consist of approximately two hundred more works, was commissioned by the artist’s son, Alexander Hamilton, and will be photographed by the Hamilton’s director, Mihai J. Parekh.“Hamilton is celebrating its sixtieth anniversary this year and has had its fairs open for forty consecutive days,” Parekh said in a statement. “With the construction of the exhibition, we are creating a new chapter and setting in which the exhibition can become an important tool for the promotion of Alexander’s art.”The future of the exhibition will", "The next Biennial should be on display in the new exhibition “Francis Bacon: The Making of an Icon,” curated by the Spanish curator Javier Téllez. The exhibition will bring together more than three thousand works by forty artists. It will also include a section dedicated to Jean-Michel Basquiat’s “Existence Exists” and a selection of works by Andre Breton.For the first time the museum will be allowed to stage a concert—the first time that has ever been attempted. Originally scheduled to start on September 22, the event has been pushed back a week and will now take place in December. “The future of the Gallery is at stake,” said Margot Adler, the director of the Schädel Institut für Internationale und Sicherheiten. “The exhibition is a step in the process of moving the exhibition to the new site, but only a step. First the building must be completed and the exhibition must go on display. The institution cannot go on display if the exhibition is not open. There are many technical and financial obstacles that need to be overcome before the exhibition can move to the gallery. The building is at a critical stage, and", "The next Biennial should focus on the role of social media in sustaining and chronicling social movements, as an instrument for the transformation of society, and should include an examination of the role of digital media in the perpetration of racial and gender inequality.”The 2019 edition of the inaugural festival, which was held in September, will feature thirty-five works by twenty-one artists, including María Berrío Maya, Mò Nara do Carmo, and Isabel Pérez-Perez, as well as a presentation of the work of the late Chilean artist and theorist Pilar Corrias. The festival will also include a performance by artist and activist Angel Mates.“This year’s biennial is a reflection of the ongoing social movements in the United States, Mexico, and Latin America,” said biennial director Astrid Schaaf. “The artists, the organizers, the sponsors, and the many other stakeholders who have contributed to this year’s event are the ones who shape the future of the biennial and the field. We are thrilled that this year’s edition will draw from the work of these artists.”\n\n\nThe Museum of Contemporary Art (MoCA)", "The next Biennial should be on December 15, 2020. With the opening of the exhibition, the exhibition will be considered the last in the series. The Shenzhen Biennale will reopen on April 24, 2021.\n\n\nThe Metropolitan Museum of Art (MoMA), in New York, has launched two new initiatives focused on art and creativity. The first, the Metronome, will partner with local and national arts organizations in the United States to put on events and performances featuring work by artists in their communities. The second, the Adolescent Art Challenge Program, will provide $50,000 grants to organizations that believe they can create meaningful and lasting art experiences for young artists.The programs were established in the wake of the 2015 university-wide lockdown and the subsequent pandemic. According to Artnet, more than 5,700 arts organizations are eligible to apply. Each grant of $50,000 can be used for a single artist or organization, but can also be used for a variety of purposes. It cannot be used to create work, but can be used to arrange for a show of work for an upcoming event.Applicants will be asked to describe their aspirations and to provide a brief description of their interests and their organizations. The first grant round started", "The next Biennial should be held in the third quarter of 2021, with the theme “Destiny in the Balance.”\n\n\nThe Washing Plant Museum in Queens, New York, is introducing a new two-year initiative that will draw from the curatorial skills of prominent contemporary artists and scholars in order to foster the exchange of visual art. The program, “The Art of Sharing,” will focus on the collection and exhibition of the work of four artists whose mediums are acrylic, painting, sculpture, and video art and will be curated by Barbara Steinman, regional curator at the Museum of Modern Art, New York; Ruth L. Burke, curator of photography at the Institute of Contemporary Art, Los Angeles; and Carlotta Gallardo, director of the New York Museum of the Arts.“I’m thrilled to be participating in this year’s Washing Plant Museum’s annual The Art of Sharing,” said Barbara Steinman. “The program will draw from the records of the four artists whose works will be featured in this year’s exhibition, in hopes that they can inspire further conversations about the art world’s relationship to the environment and the future.”Commenting", "The next Biennial should be held at least three years from now, and probably sooner. The most recent exhibition of work by female artists was organized by The National Center for the Visual Arts in Washington, DC, in 2018.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is now suing the city of Los Angeles to protect the cultural landmark from the ongoing threat of development. The landmark, which is one of the most-visited cultural attractions in the United States, is currently being pressured to take drastic action to comply with an order from the California Coastal Commission, which is attempting to build a massive development on the site of the former Pacific Electric Station at the mouth of the San Gabriel River.The coastal commission is suing the city to prevent the demolition of the structure, which would bring millions of square feet of retail, gallery, and restaurant spaces to the city, and is demanding that the city agree to sell the land to the commission for $640 million. The commission argues that the demolition will result in the premature abandonment of the cultural landmark, which is currently undergoing a $2.5 million expansion.The project is being spearheaded by the Los Angeles–born, California–based developer Joe Leshur, who in April of 2018 filed a", "The next Biennial should have been held in the summer of 2019. It has been postponed again and again and again. Because of the restrictions imposed by the Covid-19 pandemic, many events in the artistic community have been canceled or moved abroad. Many events, including the Milan-based Adrienne Prouvé: Biennial, which was set to kick off in March, have been rescheduled or moved elsewhere.Events canceled or postponed include the Art Institute of Chicago’s March exhibition, which was originally set to begin in March; the Whitney Biennial, which was originally scheduled to run from March 19 to March 21; and the Whitney Biennial: The Present, which was originally scheduled to run from March 13 to March 15. The Paris-based program, which was organized by the French Ministry of Culture, said: “I’m deeply concerned by the constant postponement of the upcoming Bénédicte and Susa (2019–20) and by the fact that they will no longer be able to take place in the autumn. ” The 2020 edition of the Prague Biennale will now be staged in March.\n\n\nThe Ninth Venice Art Market will now officially open on", "The next Biennial should focus on the concept of the Parabola, which will take place in the city of Nantes, France, in 2021. The exhibition will also aim to present a new research program, curated by Richard Shireman, a curator of contemporary art, and will be dedicated to a new work by the artist Walter De Maria in collaboration with Nicoletta Beck, a curator of modern and contemporary art.According to Dean, the new program will be based on the premise that the paraboloid is a continuous place; a self-contained, self-organizing whole. It will also explore how artworks can be restored to their sculptures, and how the relationship between culture and the environment can evolve in the presence of a heavy-metal factory and a nuclear power station.The redesigned exhibition hall will be located in the museum’s 5,000-square-foot, four-story building and will be inaugurated by the commission of the show “Anxiety of Change: Politics and the Parabola.” The exhibition will follow “Nuclear Holocaust” (2017–18) and “The Parabola and the Garden of Berlin” (2017–18), curated by Richard Berry, and “", "The next Biennial should be held at the Museo de Arte Contemporáneo in Lisbon in 2021.  Erika Bochereau, the executive director of the European Bay Area Council, said: “We are thrilled to have the opportunity to continue this work with the museum’s exceptional collection and the extraordinary staff. We are already seeing the results of this work in the extraordinary exhibition programme created by our Foundation for Contemporary Art (FCA), which will be presented at the European Museum in Berlin in 2022.”\n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco is bringing two of its most popular works by artist Olympia Roy to the Bay Area. The first is a new two-channel, 360-degree video installation by the artist\u0097a work that dramatizes her relationship with her late husband, the late sculptor Frank Gehry, at the end of a nearly five-year-long project\u0097that will open in the fall of 2020. The installation, called “Olympia and Gehry”\u0097a reference to the couple’s long-running collaboration and the sculpture\u0097will be located in the museum’s new Frank Gehry & Partners", "The next Biennial should take place in 2021. The current iteration of the event has been held at the Center for Contemporary Art in London since 2013 and was attended by forty-seven artists, including Nada Rivera, Khaled Hosseini, Zina Saro-Wiwa, and Vito Acconci.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has released the list of the seventy-eight artists who will participate in the fourth annual LA Art Biennial, which will take place at the museum from March 21 to March 24, 2020. In addition to the artwork and writing exhibited, the biennial will include an open-air workshop and a performance, titled LA: A Biennial, and an experience that will include traveling to Mexico City and experiencing “art in action” with David Montiel.“The exciting news is that we are back to LA: A Biennial with an even more exciting event,” said MCA director and CEO Sarah Basseches. “The exhibition is centered around three themes: urbanism, the human condition, and art as a tool. We invite you to join us, explore the city, and experience the work of some of the most relevant", "The next Biennial should be held in 2021. Art historian and curator Mia Ortega-Vargas, who curated the first Biennial in 2010, was named the jury president for the second iteration of the event. “The exhibition format of the first Biennial was very promising,” she said. “The subject matter of the second Biennial was very different, but I believe it was created with the same purpose of presenting the work of the first Biennial.” The first Biennial—which was based in Cordoba, Spain, and took place in August—wasn’t actually held in Barcelona. Instead, the exhibition was staged at the Kölnischer Kunsthalle in Germany. The exhibition was renamed the International Contemporary Art Summit (UCCA) in 2007, and the main auditorium of the König Galerie in Frankfurt, Germany, became the Forum for Contemporary Art.The 2018 edition of the fair, which was held in the German city of Baden-Baden from March 22 to March 28, featured work by sixteen artists from thirty-six countries. The biennial’s inaugural exhibition included work by Pierre- and Marie-Louise Bénédicte de", "The next Biennial should be a watershed occasion that will reflect both our collective history of discovery and the global trajectory of art, architecture, and design; and hopefully show how the creative power of design can help us realise the dreams of others.”Pace Gallery is planning to move its iconic building and much of its fleet in downtown Los Angeles. The museum announced it is working with architect Michael Epstein, who designed the original space and the contemporary Art Deco building, to create a new site-specific work, titled LA X.“The renovation of LAXCART and the future of the building remains at the core of that institution’s mission,” said Michael John Schwartz, chairman of Pace. Pace will also remodel its headquarters and create a new $250 million space for art exhibitions and community engagement. The center also plans to construct a new 1,500-seat, 750-square-foot gallery to house its permanent collection.The move comes after Pace’s acquisition of the commercial real estate company Richard Prince Holdings in 2018. Since then, the museum has added more than 2,500 square feet of retail space and has been working on revamping its historic campus. The first phase of the renovation is currently underway,", "The next Biennial should be held in 2021. A future exhibition of Sixteen, a work by Junot Diaz, will also be held in the United States in 2022.The festival, which has been held in New York since 1997, is currently trying to raise $175,000 to develop new programming for its sixteenth edition. It will also have a series of exhibitions dedicated to the art and culture of the Pacific Northwest in 2022.The event’s inaugural edition, “Sixteen Pacific Northwest,” was held in Bend, Oregon, in 2019. It was followed by a “Six Pacific Northwest,” in 2020, and a “Six Pacific Northwest,” in 2021. The twenty-fifth edition, “Mission: Pacific Northwest,” was staged at the Seattle Art Museum in 2021. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Laurie St. James as its new associate director for emerging and contemporary art. She succeeds Michele Ferran, who retired in February after eighteen years at the institution.“It has been an honor to serve as MoMA’s advisor to the Arts and to have the opportunity to", "The next Biennial should be held at the Museum of Contemporary Art LA in 2021. “Our vision is to create an immersive, transferrable experience for guests through our program, which will include art that reflects the diversity of American and will engage them in the history of the city,” said Bill Graham, chair of the board of trustees.The institution currently houses a total of sixty thousand works, with the largest collection in the United States. The museum prepares to open a new location in 2020, along with an expanded building. The five-acre site will also feature a new collection of more than four thousand objects from the late nineteenth century through World War II.The biennial will feature fifteen works by thirty-seven artists and collectives, including Robert Irwin, Ed Moses, Robert Rauschenberg, Henri Matisse, Jean-Michel Basquiat, Paul Gauguin, and John Ashbery. The exhibition will also include a presentation of new works by African American artists, including Washington, Henry Atkins, Rae Carson, and Jim Crow. The 2020 biennial will mark the fifteenth anniversary of the renovation and expansion project completed by architect Laurent Apollina, who in cooperation with the city of Los Angeles, installed more than sixty new", "The next Biennial should take place in December 2020. One of the main issues is that the museum has not yet decided on a date; the museum has also yet to decide whether to open the first official branch. The Contemporary International exhibition and the new exhibition section, “The Vintage Collection” will open on January 8, 2020. The new exhibition will focus on the collection of Harald Szeemann, a renowned collector and collector of contemporary art and recently retired from the collections of the National Museum of Sweden and the Museum of Modern Art in Berlin. The exhibition will also feature works by Tobias Madison, Peter Madsen, and Krzysztof Wodiczko.\n\n\nA group of artists and collectors have launched a campaign to have the Royal Academy of Arts (RA) in London taken over by the London-based group known as the Tate. They claim that the move would be in the interests of the artists and would serve as a “good start” in restoring the institution’s reputation. “Tate has been promoting the creation of a new organization that would provide an important platform for the visual arts in London,” said Richard Scudamore, director of Tate. “We have", "The next Biennial should be held in 2020, and the first Biennial will be held in 2021.The city of New York also announced that it will hold a biennial for the city’s public art, as well as the city’s public spaces, in 2021. The focus of the event will be “about a narrative, not an object,” and the city as an extension of the arts community.There will be multiple presentations of artworks and public spaces that will be curated by local artists. The first biennial will take place at the Javits Center in 2021. The other biennial presentations will be curated by private collectors in New York City and will take place in different venues around the city.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has appointed Loring Randolph as its next president and CEO. Randolph comes to the Met from the Ford Foundation, where she has served as a senior advisor since 2016. Since she has extensive experience in museums and has been involved in the museum for more than twenty years, she is well qualified to lead the museum through this difficult time.Randolph succeeds Marnie B. Tan, who retired after twelve years in January. As the museum’s director of cur", "The next Biennial should be held in 2022.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has launched a $500,000 fund for museums that have not yet received federal grants to create new jobs in the city. The fund was created in response to the ongoing occupation of federal buildings by workers from the Museum of the City of New York, which has been going on for ten days and fifty-two days in a row.The Occupation is part of a nationwide campaign by arts workers to improve working conditions at cultural institutions. The campaign was spurred by the financial crisis and protests against the austerity measures being pursued by the Obama administration in the United Kingdom, the United States, and Europe.Activists and artists are participating in the campaign by organizing protests outside of institutions such as the British Museum, the Metropolitan Museum of Art, and the Louvre in London, as well as at the Metropolitan Opera House, the Metropolitan Museum of Art, the Metropolitan Museum of Art, the Metropolitan Museum of Modern Art, the Solomon R. Guggenheim Museum, and the Metropolitan Museum of Art. The nonprofit Art Newspaper reports that protesters who have signed petitions supporting the campaign are calling for museums to be compensated for lost revenue and are demanding that the Occupation be stopped", "The next Biennial should be held in 2022, and the museum should reopen in 2021. For the past twenty years, the museum has been closed to the public as it underwent a massive expansion.\n\n\nThe museum’s current exhibition, “Alberto Burri: Painting the Eighteenth Century” (1952–1975), has been temporarily closed since August 29th. The exhibition opened on October 7th, 1952, and ran until May 29th, 1975. The first Modern Art retrospective organized by the Italian artist was organized by the Museum of Modern Art in Rome in 1964. In addition to the Exhibition, the exhibition included the first solo exhibitions of work by Mark Rothko and Pierre Turmel, as well as “Two Spaces” (1966), a project of the Villa di Rivoli.Burri’s work has been collected by many Italian institutions, including the Museo Dominicana, the Museo Almine, the Museo Becchetti, and the Museo Minenza. Among the works on display in the second exhibition, “Alberto Burri: Painting the Eighteenth Century” (2007–2008), were works by Sean Healey, Astrida Bara, Mark Rothko, and David Car", "The next Biennial should take place in 2024. If all goes as planned, the first exhibition will mark the return of the original work, which was stolen from Andrews in London in 1932. The exhibition will open in the UK only in 2020 and will be accompanied by a book of the work and a documentary about the exhibition.The Biennial Informer, or, as it is now known, will be hosted by Gertrude and Wernher Zwickau, who were sisters from the German town of Krefeld, and will feature work by more than seventy artists, including Wolfgang Paul Cézanne, Jules and Christian Boulez, and Urs Fischer, and will run from March 17 to March 19, 2024. The reception of the work and the exhibition will take place at the newly renovated Krefeldmuseum.  The Modern Art Museum Stuttgart: The announcement of the inclusion of the works in the exhibition was made by curator Stefan Küng, who was appointed curator of both the exhibition and the museum in 2016 and currently serves as director of the Graurich von Krefeld. “In this so-called ‘modern’ museum, we are entering a new era,” Küng said. “", "The next Biennial should be held at the lovely V&A, Sheffield, in December 2020.  The next exhibition should be held at the Museum of Contemporary Art (MoCA), New York; the museum will stage the first exhibition dedicated to women artists in October 2021.  The first edition of the Biennale at the Museum of Contemporary Art will be held at the newly renovated and expanded Museum of Modern Art in Manhattan on November 11, 2020. The biennial will also be held in London, Taipei, Berlin, New York, and Santa Cruz in March, June, and September 2021.\n\n\nThe National Gallery in London has received a gift of seventy-one works by the legendary artist Mies van der Rohe. The gift is a significant development in the ongoing relationship between the museum and the artist, who has long been known for his monumental paintings.Born in Minnesota in 1940, van der Rohe studied at the University of Minnesota before moving to New York in the 1950s. He would later return to the state, where he began a series of solo exhibitions at the Gallery of Modern Art and the Smithsonian American Art Museum, both in New York, and lived in New York and Minnesota. While living in Minnesota, van der Rohe", "The next Biennial should be held in early 2022 with the opening of the museum’s first exhibition “Beyond the World: Painting in the Age of Šukasiewicz in the Pova del Mar, Spain.”\n\n\nArt dealer Art Buchwald, the founder and former director of the Hamburg-based gallery Art-Nesse and the former director of the Sackler Museum in Paris, has been found dead at his home in the city of Essen, Germany, on January 22. He was sixty-six years old.The cause of death was complications of cancer and a heart attack, and the death was ruled a suicide. Buchwald began his paintings in the late 1950s, years before the development of the mass-produced artworks and electronic artworks of the 1970s that have intertwined digital and physical artworks and are sometimes called “artificial lifeforms.”“Buchwald’s paintings and works on paper are still as vivid and vivid as the paintings on paper themselves, and his paintings on paper are as rich and vivid for their graphic depictions of the human figure,” Simone Leigh, the former curator of art at the Institute of Contemporary Arts in Geneva, wrote in a review of the artist�", "The next Biennial should include the work of artists who have participated in the exhibition in the past and is scheduled to take place June 8–June 13. The full list of participating artists is as follows: Anne-Marie Berger, Paris, France: Exhibition #224: Nude in the Shape of a Heart, 2019; Curator: José Joseph Beuil (Bénédicte Savoy. Régional orca, Buenos Aires); Institut d’Arles, France: Nude in the Shape of a Heart, 2019; Laureate: Fernando Pérez García, New York: Art and the American Experience, 2019; Art Museum Houston, Texas: Conviction of a Slave, 2019; Art Institute of Chicago: Into the Inferno, 2019; Art of the American West, 2019; Art of the Americas, 2019; Art of the Americas, 2019; Art of the Americas, 2019; Art of the Americas, 2019; Art of the Americas, 2019; Art of the Americas, 2019; Art of North America, 2019; Art of the Americas, 2019; Art of the Americas, 2019", "The next Biennial should be held in 2020. \n\n\nThe Miami Art Museum (MAM) announced today that it is reopening to the public after months of construction. The project, which involved the dismantling of the institution’s 2005 expansion, began on August 2 and was completed on September 5.According to the museum, the reopening coincided with the opening of an exhibition titled “Long March: The Making of a Museum,” which highlighted the museum’s relationship with the architect who died in 1989 of a brain aneurysm.“What began as a simple expansion project has evolved into a remarkable journey that has taken in the evolution of a new relationship between MAM and the artist that is nurtured and created by MAM,” said Daniel H. Weiss, the museum’s board chair and president. “Through this project, the museum has become a laboratory for exploring the relationship between architecture and the body and the human condition, and of celebrating the diversity of our collections and our exhibition programs, including a new work by the late architect Lynne Nicholas.”The exhibition, which was curated by Nicholas and comprised of two hundred works, including “Die Meistersinger,” 2008, and", "The next Biennial should be held in 2019, when the yearlong event will run from March to October.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Patricia Pape as its new deputy director. In her new role, Pape will be responsible for the strategic direction and operation of the MFA. She succeeds Paul H. Patton, who retired in May after nine years at the helm of the museum.“Pace’s tenure at the MFA has been defined by bold, innovative, and collaborative growth, both in terms of both institution and mission, while maintaining an ambitious and forward-looking vision,” said Richard Armstrong, director and CEO of the MFA. “As we transition to a new era, with the completion of the installation and collection projects of the next two years, I’m confident in Pape’s ability to develop new and innovative ways to support contemporary art and to advance our contemporary mission and mission to the greater Boston area.”Pape, who previously served as director of the Yale Center for Art and Design, is the author of How to Un-Photograph: Photography and the Making of Modern Art (Yale University Press, 2018) and The", "The next Biennial should take place in 2021. Historically, the event has received strong support from artists and institutions in the United States. The 2019 edition drew nearly five hundred artists and won the 2019 National Book Award.\n\nIn a letter addressed to Christie’s and signed by collectors Patricia and Charles Herron, the phenomenon’s creators said: “We are deeply honored to be able to present the first annual Billion-Year Celebration of the Arts at our Los Angeles home, which will inaugurate the new 5000-year-old museum and reimagine what a Gardner Center can look and feel like. We are also deeply moved by the support of our collectors, collectors of collections, and collectors of art. We are grateful to our partners and friends in the art world, and especially to our gallery partners, who have shared their vision for the museum with us.”While the Awards and the Exhibitions department have yet to confirm or deny the authenticity of the letter, the decision to award the $25,000 prize was first reported by Artnet. The large-scale installation, which will include works from a collection of Hawaii’s Gator family, as well as", "The next Biennial should be set in 2021 and will be led by Jackie Khouri, the former curator of modern art, in association with a group of twenty-somethings who are returning to work on the exhibition. The ambitious project is designed to address the current global crisis, which has seen some five million people die from COVID-19.“The exhibition of the first exhibition of the new series will be a reflection on the themes of the exhibition, which are contemporary and new, and the curators’ efforts to engage with the exhibition as a whole,” says Khouri. “The second exhibition will be a commemoration of the people who died and will be about the biennial’s beginnings and the art of the modern state, with a view to introducing a biennial to the United States’ cities.”In a 2017 Artforum article, Khouri explained that the exhibition “will also incorporate a historical survey, a critique of contemporary art, and a discussion about the relationship of contemporary art to and in the city of New York.” \n\n\nThe Mercosur Visual Arts Market Intelligence (VAM) has announced that it expects the 2020 edition of the Venice Biennale to draw", "The next Biennial should take place in 2023. It will have a budget of $10 million and will feature more than 3,000 works by thirty-four artists, including Jeffrey Gibson, Humberto Lazo, and Tanya Salch, among others with a focus on women. It will also be housed in an architecturally designed building in downtown Los Angeles, and will be led by an executive director who will be a curator and an artistic director. The inaugural exhibition, GIB, is currently on view in the exhibition “The Art of Photography.”The next edition of the Art of Photography biennial will be held at the new Museum of Contemporary Art (MCA) in New York between December 20, 2019 and January 21, 2020. The theme for this edition will be “The Light of Photography.” For the first time in the biennial’s history, the work of thirty-one artists will be presented in the exhibition. Curated by Ali Fadel, the curator of photography at the New Museum, the exhibition will include works by artists such as Pierre Cardin, Pierre Huyghe, and Peter Hujar.“This is a moment of great change,” said biennial co", "The next Biennial should open in 2022. The art world’s most prestigious awards show in China, Art Basel Hong Kong, also announced that it will award a total of $250,000 to artists in 2020 and announced that it will award one prize to an individual. \n\nThe first five years of the new twenty-first-century edition of the Art Basel Hong Kong fair have been successful, according to Artnet, and the organizers are confident that the event will continue to be successful in the years to come.“I feel very good about the future of the fairs, their future, and the future of Hong Kong as a whole,” said Artnet editor-in-chief Tanya Gobbe. “Hong Kong is an important hub for the art world. It’s a very important base for global exchange and collaboration, and a very important corner for international artists.”The Hong Kong fair was established in 1999 by the Hong Kong–based collective Hong Kong Artists’ Association (HGA), which was founded by artists such as Jennifer Jack, Yung Woo, and Yuna Suh, alongside illustrators Li and Sun Young, and publishers Michael and Sun Yee. It was inaugurated", "The next Biennial should be in 2021, and the last Exhibition should run in 2022. The museum will also begin to work on a new eight-thousand-piece exhibition of the work of American artist Richard Anuszkiewicz. Anuszkiewicz, whose works often approached the surreal, has since died at age eighty-four. Although most of his work survives us, his art is in some ways lost in the global marketplace. Some 90,000 works are currently housed at the museum and are housed in collections that have yet to be opened. Since its founding by American sculptors John and Mary Lou Gehrig in 1961, the museum has staged more than 1,500 exhibitions. The museum has also organized more than 1,600 exhibitions of works by artists such as Charles Atkins, Diane Arbus, Edward H. Weinberg, Paul Gauguin, and Thomas Merton.\n\n\nThe Central Library of the University of Illinois (UMI) in Urbana, which recently underwent a $42 million renovation and opened to the public in 2016, announced that it will not be able to accommodate the anticipated demand for digital content from a diverse and growing list of artists and cultural organizations. The library currently comprises twenty-six", "The next Biennial should be held sometime in the second half of 2020. The selection committee will consist of art historian and curator Marc-Olivier Biassée, the director of the Biennial Institute Jean-Claude Biassée and the curator Martin Eider; biennial director Jean-Michel Savoy; biennial director Gilles Delors; and the major Taiwan artworks, Huang Shih-chiang's panel art, and the Sixto and Erma Schöffer’s composition. The next exhibition will be held in December 2021. \n\n\nThe Philadelphia Museum of Art (PMA) has received a gift of ten works by Irish artist Michael Ahearn, a collector who has worked with the institution since 1986. While the gift includes works by all six of the nine Irish artists whom Ahearn collected in the late 1980s and early 1990s\u0097Eamon Ó Mhurch, Michael Malin, Michael Boylan, Michael Dufour, and Michael Quinn\u0097and was part of a three-way deal worth $2.5 million, the work is the first given to the museum as part of its Centennial Year.Among the works given to the institution are", "The next Biennial should be held at the venue in 2022.\n\n\nThe Museum of Fine Arts (MFA) in Boston, Massachusetts, has received a gift of sixty-nine works by African American artworks from a Boston-based organization. The gift includes works by individuals such as J. P. Morgan, W. A. Griffith, and Robert Irwin, as well as many works by contemporary artists such as Debussy, Mark di Suvero, and Joan Miró. “Once again we are grateful to our donor for his generous gift of works by artists whose work we have long admired,” said director Matthew Teitelbaum. “MFA is thrilled to present this year’s collection to the public, and we will work hard to organize a spectacular exhibition of the works that were featured in the 2013–14 season.”The gift also includes work by several African American artists which will be included in the inaugural exhibition of the museum’s new \"African American Art Museum.\" The institution is currently working on a redesign that will incorporate new and updated works by prominent artists such as William Henry Fox Talbot, Charles Ray, and Paul Gauguin.\n\n\nThe Museum of Fine Arts (MFA)", "The next Biennial should focus on “the connections between the Ghetto and contemporary life,” said curator Walter Silber, a pioneer of the American gallery movement. The exhibition will feature work by thirty-one artists, including William Eggleston, Paul Gauguin, and Robert Irwin.Quentin de Bosque, director of the National Museum of Modern Art in Paris, said: “The new collection is interwoven with a history of human migrations, spatial politics, and political economy that will resonate for us and others in the city. The collection, which has a very specific history in every sense of the word, is a historical artifact, and today we are living with its legacy. We are proud to present it to the people of Paris as part of our Vision 2020 programme.” \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it is reopening to the public on Monday, October 3, 2020, following a $25 million expansion. The museum is reminding attendees that the opening of a limited number of exhibitions and events will be affected by the coronavirus, and is reminding visitors that the reopening date is subject to change.“We are preparing for the possibility that this outbreak", "The next Biennial should be held at least once a year for a maximum of six years, with a design that incorporates the art and architecture of the city of Oslo. The design of the new museum will determine the theme, the location, and the duration of the biennial. The art-filled space will be located on the second floor of the former Bergen-Bickelgatan building, which was completed in 1984. To facilitate the museum’s relocation to an adjacent campus, the building will be transformed into a foyer and will be equipped with a combined twenty-five engineering, underground galleries.The Biennial will be comprised of twenty galleries, each with its own outdoor area, which will be built into the city of Oslo. The gallery will draw visitors to both the museum and the city. Designed by architect Frank Gehry and the Tuxedo Factory, the complex will boast a gallery space for art, a restaurant, a library, a cafe, and a public green space.“This is a unique project for us, an international team, to create a new building in the heart of Oslo, to fulfill a dream that we shared in the 1970s to open a new museum in the city,” said architect Ulla", "The next Biennial should take place in 2021. The festival will bring together over fifty artists in the United States, and will include studio residencies, performances, workshops, and interviews.  The 2019 edition attracted 2,500 visitors. The organizers have yet to reveal the itinerary for the 2021 edition. Artworld America’s president, Michael L. Taylor, said: “We are excited that the 2021 edition will be hosted by the Biennial Foundation in conjunction with the AFI. We are eager to return to the theme of biennialism in a new, innovative way. We look forward to furthering the legacy of the Biennial at its next iteration.”\n\n\nThe National Gallery of Art in Washington, DC, has appointed Lynda Barry as its next chief curator. Barry, who currently serves as the chief executive of the National Museum of Women in the Arts (MoMA), is the first woman to helm the institution. In her new role, she will work with curator Lonnie G. James, who is retiring on May 29, and other key staff to reshape the institution’s exhibitions, education, and public programming.“The changes we’re making will help MoMA expand into new territories and", "The next Biennial should focus on community engagement, sustainability, and participatory design, and should be organized on a larger scale. Curator and historian Hanne de Bruijn has suggested that this should be an opportunity for the public to meet and interact with local people from the Saarland, the Saar-Biennale, and the Saar-Village, and to have a voice in the design process. \n\n\nThe Bauhaus Museum Vienna has appointed Giulia De Mark as its next general director. De Mark comes to the organization from the Museum of Modern Art (MoMA), where she has served as director of curatorial affairs since 2014. She succeeds Stefan Kallmann, who is retiring after a decade at the helm of the museum, and will take up the post on January 4, 2020.“I’ve been working in design for almost thirty years at the Bauhaus, and within the history of the institution, Giulia is an exceptional curator, educator, and provider of contemporary art,” said Klaus Biesenbach, the board chair of the Bauhaus and the museum’s former board president. “Her unique skills, such as developing the exhibition program for the Museum of Modern Art", "The next Biennial should be held in 2021. \n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Trisha MacGill as its next interim director. MacGill comes to the institution from the Metropolitan Museum of Art, where she serves as associate curator of modern and contemporary art. MacGill will assume her responsibilities at the museum on January 6, 2021.“Trisha MacGill and the Guggenheim Museum have been issuing forth new and exciting directions in recent years, and we are committed to bringing our audiences and exhibitions to even greater heights of intellectual and cultural depth,” said Guggenheim director Daniel H. Weiss. “We are grateful to the Guggenheim Museum for recognizing her vision and for the opportunity to work with her. Trisha is a leading curator, scholar, and educator, and I look forward to working with her.”MacGill joins the museum from the Metropolitan Museum of Art, where she has served as assistant curator of modern and contemporary art since 2014. In 2018, she created the first exhibition of American art in the United States and one of the first international exhibitions of American art in the United States, the “America Beyond the Modern” (", "The next Biennial should take place in 2021. \n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has placed more than thirty-five works in its permanent collection. The institution recently opened up its online viewings rooms to the public, which has led to a flurry of new exhibitions, including the exhibition “Avant-Garde Art,” which opened on February 2.The Hirshhorn’s new exhibition “Poster Model: Art in Motion” is a celebration of the work of forty-three artists, including Léonide Chery, Oriana Fallah, Delano Farina, and Judith and Stewart-Wheeler, and draws on the Hirshhorn’s collection for the first time. The exhibition will highlight new ways in which images, objects, and narratives can be altered and reconfigured to suit particular needs and goals.The Hirshhorn has also become more than a destination for cultural exchange. It now hosts more than three hundred exhibitions annually. In addition to its main building, the Hirshhorn also boasts two exhibition sites, the Hirshhorn Museum and the Hirshhorn Digital Archive. If the Hirshhorn is opened to the public again before 2021,", "The next Biennial should start on the first day of March and continue as scheduled.\n\n\nThe Smithsonian’s National Museum of African Art (NMNA) in Washington, DC, has moved the exhibition “An American Story,” which was slated to run as part of the sixth Biennial of African Art in 2021, to July 29 because of the coronavirus outbreak. The September 29 opening of the exhibition has been rescheduled for October 7–October 11.“The exhibition has been moved to June/July/November, 2020, as part of a global initiative to share stories of the past and present through the exhibition of American art,” said curator and chairman David G. Hart, who also chairs the exhibition’s editorial board. “This year’s exhibition marks the first exhibition in more than nineteen years that provides a variety of perspectives and narratives in a single location, offering a rare opportunity to see the work of American artists in the twenty-first century.”While the exhibition is now open to the public, the National Museum of African Art (NMNA) will not be able to open its doors to the general public until the end of April. The institution will continue to operate as normal until then", "The next Biennial should take place in 2021. The full list of participating artists is as follows:Amira Aubry, Africa and the AmericasAmira Bai, South AsiaAmira Boumaine, South East AsiaUlla Bojaxi, JapanB. Alex Bliss, AustraliaBooka Bailey, South America/EuropeB. Ayala, Sudan/CanadaPaul Coleman, South America/EuropeM. M. C.*, and E. J. Cohan, South AmericaB. E. Cole, and E. P. Cohan, South AmericaB. F. D. Cooper, and E. K. Lutz, South America/EuropeB. G. Claggett, South AmericaB. H. Coley, and E. A. Housman, South AmericaB. J. Cook, and E. R. Gidley, South America/EuropeB. J. Dey, South America/EuropeB. J. de la Peña, and E. B. de la Cruz, South America/EuropeB. J. Dominguez, South AmericaB. J. Gomes, South America/EuropeB. J. Gomes Jr, South AmericaB. J. Pimental, South", "The next Biennial should focus on “Arts and Culture”\u0097the term used by the artist-run museum to describe the exhibition space where the exhibition is currently scheduled. The exhibition will be a retrospective of the artist’s work, the oldest dedicated to a single artist. The artist-run museum will also be participating in the fifth edition of the International Arts Festival in Genoa, Italy, slated for November 30–January 1, 2021.\n\n\nA spokesperson at the National Galerie Anne-Marie Büttner in Vienna, which has been closed since March 28 due to the Covid-19 pandemic, confirmed on Tuesday that the café and exhibition space is still closed, but said there is still a possibility that it will reopen. Since March 28, the National Galerie has been closed due to the Covid-19 pandemic, which has forced the closure of the museum’s two other locations: the Beyeler-Brüggeri Arts Center and the Neue Nationalgalerie.After the National Galerie reopened in the early hours of the morning on March 31, the venue will temporarily move to a new 300,000-square-foot space in a connected building, the Beyeler", "The next Biennial should be held in the Fall of 2019. As we consider how to create a more just and inclusive world, we can only hope that this year’s will have a chapter dedicated to ‘intellectual property rights’ and how they shape the world we live in. The exhibition will also highlight issues that continue to influence the work of art, such as the perpetuation of the cycle of violence against women and girls. The exhibition will feature twenty works by forty artists and will be on view at the Biennale de Lyon until March 13, 2020. The exhibition will be hosted by the Grand Rapids Cultural Center in Michigan and will be accompanied by biennial-long activities, such as an exhibition of photographs by Annie Chan and work by the Danish artist Marta Irigaray, and a concert series. “I’m excited to be able to present the work of these artists to the Grand Rapids community in this unique and international context,” said Sarah Poser, chair of the collection. “Our artists are strong and distinctive voices in their respective fields, and their works can be a powerful inspiration to others. We hope that the exhibition and the biennial will give hope and inspiration to", "The next Biennial should be held in October 2020, and the first in November 2021.The exhibition will feature work by twenty-nine artists, ranging from the contemporary, such as Danny Kaufman, who presents Jason X (2019), to the historic, including Louise Bourgeois’s V/A (2017), which was exhibited in Berlin in 2017. \n\n\nThe Sandisk Art Gallery in New York has hired Adam D. Weinberg, who has served as an artist-in-residence at the institution for two decades, as its next executive director. Weinberg will assume his responsibilities at the Sandisk in January 2020.“Weinberg’s leadership at Sandisk demonstrates his ability to support a dynamic and innovative institution, and to build upon its reputation as a leader in the field as we continue to present our annual exhibition of works on canvas and in-house and expand our online offerings,” said director Christopher Salerno. “Adam has been integral in guiding the gallery to new heights after its acquisition by Sandisk and in developing new relationships with artists, including the recent selection of thin white lines by Michael Oehlen. The gallery has become an essential stop on the Hudson River, a museum for generations, and a", "The next Biennial should be held in either 2021 or 2022. \n\n\nThe National Gallery of Canada has confirmed that it will not reopen at the institution following the March 21 release of the second season of the critically-acclaimed American documentary Black Panther, which documents the life and death of George Floyd, one of several unarmed black men who were killed by a white police officer in Minnesota in the weeks leading up to their deaths. The series—combining archival research, interviews, archival research, and archival research exhibits, as well as performances, performances, and documentaries—had previously been scheduled for release on February 24 and March 21.The announcement follows the March 14 release of an official statement issued by the National Gallery of Canada, which said that it is “monitoring the ongoing situation with great concern.” The statement added that it will provide more information as soon as it has more information.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it has received a gift of more than six hundred works from Norway. The donation includes more than a thousand paintings in a variety of media, including paper, drawings, photography, photography-silks, sculpture, and installation. It also includes works by artist-singers", "The next Biennial should be uploaded to the Art Location Hub, which will then be able to host it. The institution will provide the artist with an online version of the exhibition and will charge the artists for the actual exhibition.The first show in the series was released last year, and the digital versions were shown at the Art Place and at the University of Amsterdam. The other works in the series, a collaborative project by Gore and Auke, are currently on display at the Museum of Modern Art in New York and the Museum of Modern Art, in New York.\n\n\nThe Institute of Contemporary Arts (CAA) in New York has appointed Alexandra Novec as its next president. Novec will be the first American to helm the institution for sixty years. She succeeds Tess Brown, who has helmed the agency since 2001, and will begin her position in November.“I’m thrilled and excited to welcome Alexandra to the CAA,” said Brown. “Her leadership of the agency will set the stage for our future vision and the beautiful work that we’ll do at the institute. I am confident that she’ll continue to advance the vision of working with the CAA to create new and innovative work that will", "The next Biennial should consider “the vitality of the life and work of a single individual,” said Jeffrey Manship, the director of the Center for the Arts at Columbia University.    The Center for the Arts, which has hosted the event since 1988, is currently closed due to Covid-19. \n\n\nThe Museum of Fine Arts (MFA) in Los Angeles has received a $125 million gift from the Robert M. Gates Foundation, which is supporting the renovation and expansion of the museum’s former home at 615 S. Santa Fe Avenue. The donation includes the restoration and expansion of the museum’s original building, which was completed in 1899 and stands on its original site on the east side of the Los Angeles County Museum of Art (LACMA), and the renovation and expansion of the museum’s Grand Canyon Visitor Center on the west side of the museum.Inaugurating the gift is a major expansion of the museum’s garden, its landscape, and its collections. The renovation included the addition of a new pavilion for the exhibition “The gardens are as good a home for art as any in Southern California,” said David Wachs, the director of the M", "The next Biennial should begin in 2020 and will be led by a selection of artists from across the globe. The concept will be to create a platform for reflection and collaboration between the artist and the public.\n\n\nThe Danish Nobel Committee has awarded the Danish artist Berit Biren, whose work depicts everyday life through feminine forms that are often sexualized and dehumanized, the 2019 Nobel Prize. Born in 1970 in the small town of Melk, in the North West of Denmark, Biren developed her own path as an artist. She published her first book, Sverige Værne (Sections of the Sea), in 2018 and has been the subject of numerous exhibitions, including the Copenhagen Biennale, the Helsinki Biennale, and the Copenhagen Book Fair. The Danish Museum of Art also displayed an exhibition of her work in June 2019. \n\n\nFrance and Italy agreed to create the world’s largest open-air observatory to study the atmospheres of four nearby red dwarf stars. The collaborative project between the two countries will take eight years and will use Laplace-class telescopes at the Catalle della Mare, in the city of Turin, to peer into the clouds of M-dwarf K2,", "The next Biennial should be held in 2022.\n\n\nThe City of Chicago has awarded $2.5 million to eighty-nine arts and cultural organizations in the city for their contributions to the city’s economic and social health. The funds will go toward enhancing access to and the enjoyment of arts and cultural programs, promoting the city’s arts by securing grants and engaging in community-based partnerships, and improving access to public spaces.“Chicago’s artists and cultural workers are among the most hard-working, dedicated, and creative in the country,” said Mayor Rahm Emanuel. “They are making vital contributions to Chicago’s economic and social health, and they deserve to be recognized and rewarded for their hard work.”The city’s awardees include the Chicago Alliance of Museums ($1.5 million), the Cultural Heritage Alliance ($1.5 million), the Cultural Fund of Chicago ($1 million), the Cultural Fund of the City of Chicago ($1.5 million), and the Cultural Fund of the County of Cook (CCCF) ($1 million), among other organizations. The civic funds are part of a $5 billion package signed into law by Mayor Emanuel\u0097the Comprehensive Plan", "The next Biennial should introduce a platform for international collaborations between artists. Joel and I believe that a future for art and architecture in the city should be a collaboration between art and city.”The project will be curated by architect Jørgen Persson, who built the Biennale’s iconic Pedersen-Kaarhus, the Danish pavilion, and Daniel Klint’s construction site in 2016. “We are eager to see how the exhibition will be organized, and eager to contribute to the creative process,” said Asgeir Bjerggaard, the chair of the board of trustees of the Biennale, in a statement. “The project will be an opportunity to engage with the city of Copenhagen in an exciting new way through a series of works by artists who are developing new projects as well as the city’s history.” The exhibition will be held on the same date as the 2020 edition of the Biennale, which will take place in the city’s historic Auditorium Jørnen and will run until November 23.Commenting on the forthcoming event, Bjerggaard said: “The Biennale is a very diverse", "The next Biennial should commence in 2022, and will be curated by the artist and the museum, according to the Times. Its inaugural edition will focus on the artist’s life and work through a series of six paintings. The exhibition will feature works by various artists, including Anna Atkins, Alan Brown, Niu Ngo, Norman Foster, and Tia Soltanoff.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has received a $500,000 donation from the Pioneer Fund. The $600,000 grant was advised by the Pioneer Fund’s board of directors and is dedicated to the preservation and advancement of the legacy of architecture by Lilly St. Denis.“Lilly St. Denis was one of the first artists to receive a grant from the Pioneer Fund, and we are thrilled that she will be the first to receive another grant from our board,” board president Simon Goodman said in a statement. “We are grateful that the sixty-five-year-old art historian, philanthropist, and educator will continue to be a true champion of architectural design.”The Pioneer Fund’s 2018 grantees include Amara", "The next Biennial should focus on “The Possession of Nature,” a work by José Pérez del Val, which examines the idea of the body and the body’s relation to the environment, and should include a “triangulation of the body’s body and the body’s body’s body.”In the first round of the biennial, artists Marc Temkin and Michael Langevin will present works from their respective specialties, which encompass sculpture, painting, and sound. Benjamin Harnwell and John Church will present works in a “polyrhythm” (i.e. four-dimensional) style. In the second round of the exhibition, Benjamin Harnwell will demonstrate how the body is a means of transporting and organizing information and that the information is compressed within the representation of the body. After a short introduction by Harnwell, the artist will present a sculpture of Harnwell’s body in three dimensions, which is meant to be completed in two months. The seventh edition of the exhibition will bring together thirty new works by twenty-six artists, including Adam Gilkes, Alejandro Cesarco, Brad", "The next Biennial should take place at the Stedelijk Museum in Amsterdam in 2022.\n\n\nThe Pérez Art Museum Miami (PAMM) has added three artists to its collection: newly commissioned work by Guangzhou-born artist Halim Ait-Agual and his wife, Katherine Ait-Agual, and the newly elected Pérez Art Museum Miami (PAMM) trustee.“We are excited to welcome these artists to PAMM, which has been committed to showcasing the work of emerging artists in the United States and Latin America for more than forty years,” said Christine Hoberman, director of Pérez Art Museum Miami. “It is a true reflection of the art of the Pérez Art Museum Miami as it has four of its artists already represented in the collection. Their work will be shown in a future exhibition at the museum, and we intend to continue to present their work in our exhibitions, exhibitions, and public programs.”The artists in question are Guang Yang, Chen Wei, and Shilpa Sengupta. Hiroshi Miyamoto, Pérez Art Museum’s curator of Modern Art, said: “The bi", "The next Biennial should focus on “Digital Cultures and Digital Future;” a biennial that “involves a critical examination of what it means to be digital within a digital culture,” the organizers said. The 2019 edition will continue the theme of the theme “New Digitalities” and will take place in Helsinki, Helsinki Fashion Week, and Helsinki Fashion Week.\n\n\nSinger-songwriter, actor, and filmmaker Ed Sheeran, known for his lush, inventive, and emotionally resonant film, theater, and video games, was found dead on Wednesday at his home in New York on Friday, March 4. He was sixty-seven years old.Born in Tehran in 1953, sheeran moved to New York when he was three years old and continued to write and draw after the country’s 1979 Islamic Revolution. He worked as a painter, sculptor, and puppeteer before moving to L.A. and eventually to the 1980s, where he continued writing and producing. The writer and artist was also involved in the Iranian resistance movement, which sought political reforms during the Islamic government of Mohammed Mossadegh from 1989 to 1989. He was imprisoned and exiled for over three", "The next Biennial should be held in 2021. The forthcoming show will commence in March.  The exhibition, titled Art and Politics in the Making of the Biennial, will consist of “eight biennials of a single theme.” The exhibition will run concurrently with the upcoming Art International. The announcement was made during a panel discussion on the upcoming exhibition held at the Art Forum in New York on February 27. The show will feature new work by forty-eight artists and will be curated by director Louis-Philippe Muller. “Our show will be a combination of essays on politics and art, with a particular focus on the current moment. We ask, what is politics without art?” Muller added: “This is not a new question, but it is a question that has been asked in a very specific way: what is art without politics?” The exhibition will be inaugurated with the biennial’s inaugural exhibition in Paris in December 2019. The show will be split into two parts: a one-hundred-day retrospective of the exhibition and a two-hour performance. The exhibition’s closing ceremony will take place at the Louvre", "The next Biennial should take place in the autumn of 2020. The theme of the event will be “The Future Is Present.” The exhibition will focus on issues of the past, present and future through the work of artists who have worked in the field. David Gordon Green will serve as a panelist for the event.\n\n\nAs New York City heads into Phase 3 on Monday, February 16, the city’s Department of Cultural Affairs is reconsidering whether it should shutter the fourteenth iteration of the Whitney Museum of American Art (MoA), which has been closed since March 13 due to the Covid-19 pandemic.According to the New York Times, the department is weighing the possibility of temporarily suspending operations during the first few days of March, when the first cases of the novel coronavirus were reported in the United States. The move would allow MoA and the Metropolitan Museum of Art—which already experienced a severe drop in visitors in March due to the coronavirus—more time to adjust to the pandemic.While some museums are already reducing their hours and opening their doors earlier than normal to avoid overcrowding and protect vulnerable populations, the department said it is still assessing whether it can keep the three-day shutdown program in place", "The next Biennial should be held in 2020, according to the organisers, will seek to place the exhibition at the heart of Asia’s cultural landscape and will be led by an international team of curators, producers, writers, and artists.\n\n\nThe Los Angeles County Museum of Art (LACMA) and the National Gallery of Art in Washington, DC, have announced that they are expanding the scope of a multiyear, $25 million renovation project that was completed in 2016 to include a retrospective of Japanese artist Yoshitomo Nara’s work in 2020. The exhibition will feature the first publicly view of Nara’s major retrospective, “The Real Housewives of Tokyo,” which opened at the National Museum of Contemporary Art in Tokyo in March 2019. The exhibition will also inaugurate a new biennial of Nara’s work, titled “Nara: Fashion” (Burma), that will run from October 5 to November 5, 2020.“Through a collaboration between LACMA and the National Gallery of Art, we are building a new narrative around Nara’s work that will present her work as not only a series of cultural artifacts, but also an ongoing exercise in craft and interaction", "The next Biennial should take place in 2020; the announcement was made on July 3. \n\n\nThe National Geographic Society in Washington, DC, has launched a new digital platform that will allow scientists, artists, and scholars to broadcast their scientific findings and public works. The platform, called the National Geographic Channel, will feature public presentations, scientific collaborations, and public artworks.“At a time when scientists are increasingly relying on social media as their primary outlet for engagement, the National Geographic Channel will provide a new and engaging platform for communicating scientific discoveries and public works,” said National Geographic president Michael Ferguson. National Geographic Channel will initially focus on presenting projects by leading scientists, including Jacqueline Drummond, Hans von Weide, Mary Roach, Richard Dawkins, and John D. Watson. The platform will also offer television series, documentaries, and other original programming. The platform will launch with a twenty-one-episode series titled “Topologies,” which will feature research from Diana Al-Hadid, Marc-Luca Bassi, Jill Corrigan, Katie Norbury, and James Patterson, and will also debut with a series of videos , “How", "The next Biennial should be held at the Museum of Modern Art in New York by the end of the year. The event will be hosted by the organizers of the Dusseldorf Biennale in April 2020 and will be held at various locations throughout the city of Dusseldorf, including the Museum of Contemporary Art Dusseldorf, the Museum of Modern Art, the National Museum of Art, and the Kunsthalle Dusseldorf.About the Dusseldorf Biennale: The upcoming Digital Edition of the Dusseldorf Biennale, titled “Digital Sculpture: Contemporary Dusseldorf” (digitalsculptureautow.de), will celebrate the twenty-fifth anniversary of the event. The exhibition will run alongside the theme “Art and Society in the Age of Digitality” and will present works by forty-three artists and collectives. The exhibition’s first digital-only exhibition was “Mikhail Klimentyye, 2006–2011” (2011–12) at the Creative Capital Group exhibition space in New York. The exhibition will also include an online version, “Art as Virtual and Real,” which will include", "The next Biennial should commence in 2022. The biennial, titled “A World of Color,” will be curated by Princeton University art historian Kenneth Ryan and will highlight the work of forty-eight artists\u0097including Ikon, Tremblay-Fauci, and Javier Flores-Sierra.“We are excited to present the work of these artists in their entirety to the public,” said Mark Stoeckel, director of the Biennial. “The theme of the biennial is ‘color,’ and the public will be able to see for themselves how the concept and practice of this term can create new and exciting art.”\n\n\nLocal authorities in London are facing backlash for temporarily closing down a large section of the British Museum (BMI) in an attempt to curb the spread of Covid-19, the virus that has been linked to at least eighty deaths and has infected more than 2.5 million people in the United States. As many as one hundred employees are facing layoffs and several buildings in the institution’s West End are being considered for redevelopment.On Tuesday, March 10, the museum announced that it is temporarily suspending the exhibition “The Future", "The next Biennial should take place in the early 2020s. “We are increasingly aware of the impact that environmental justice and sustainability initiatives can have on changing social and political systems, and we are committed to working constructively with our partners, including with our own local communities, to address climate change and its impacts,” said Oolanda Adams, the executive director of Artforum and a founding trustee of the Biennial. “This is an opportunity to follow the lead of other visionary institutions such as the African Museum of Modern Art and the Metropolitan Museum of Art and collaborate with our local communities to improve the health and well-being of our planet and its inhabitants.”The full list of participating galleries is as follows:Anderson/Beare (New York)Â1,Brooklyn Academy of Art (New York)Â2,Florida International University (Miami Beach)Â3,Lincoln Center (New York)Â3,Lincoln Center (New York)Â5,Lincoln Center (New York)Â6,Stern Gallery (New York)Â7,Stern Gallery (New York)Â8,Stern Gallery (New York)Â9,Stern Gallery (New York)Â10,Al", "The next Biennial should take place in 2022. \n\n\nThe British artist Neville Campbell, who often experimented with human skin and media in creating works of art, has died at age eighty-seven. His work has been collected by the Louvre and the Schirn Kunsthalle in Cologne, Germany; the Art Institute of Chicago, the Museum of Modern Art, and the Tate, London; and the Whitney Museum of American Art in New York.Born in London in 1926, Campbell moved to America in the 1940s, where he studied at the University of Wisconsin, the University of Chicago, and the University of Pittsburgh. His artworks are among the earliest that explore skin\u0097the early artist was already aware of the work of some of his peers, including Francis Ford Coppola, Claude and Ed Ruscha, and the Surrealists. In a retrospective of his work at the Schirn Kunsthalle in Cologne in 1960, Campbell was asked to participate by artists and asked to create a show about skin. He pointedly refused, however, denying that he was interested in skin at all. In 1970, Campbell moved to the Michigan Institute of Art, but his work was moved to the Michigan Museum of Art in the 1980s.", "The next Biennial should be held in 2020. Since the exhibition typically draws around 2.5 million visitors, the dates of the upcoming event will be determined by the city.  The exhibition is sponsored by the Shanghai Museum of Fine Arts (SEMFA). \n\n\nToccarra Artwork and Design, the Hong Kong– and Singapore-based contemporary art space, has announced that it is currently closed for a ninety-day period as a result of the Covid-19 pandemic. Founded by Tanja Wirrath in 2016, the Hong Kong–based contemporary art space has been accessible to the public since March 15. However, due to the high number of Covid-19 cases in Hong Kong and mainland China, the private contemporary art space’s staff and board have decided to temporarily suspend operations.“We believe that this is the right time to pause our exhibitions and events to allow our staff and guests to rest and to consider new and different ways of working together,” Tanja Wirrath said. “We hope that this temporary pause will allow us and our staff, including our artists and visitors, to embark on our future plans together.”Tanja Wirrath and", "The next Biennial should take place in 2020.\n\n\nThe Museums Association (MA), the trade body representing more than 1,400 UK museums, has welcomed the decision by the UK government to guarantee funding for the 2020 Museums Association General Election. Following a recommendation from its executive, the association announced on Wednesday that it would not be forced to cancel the general election in the case of a Brexit-related loss of revenue.The government will also offer £3.2 billion for institutions following the UK out of the European Union, which will be split equally between London, Edinburgh, Cardiff, and Liverpool. The money is divided between UK museums and the National Lottery Heritage Fund, which will try to secure £500 million in pledges from the public.The MA said that the guarantee of funding for the 2020 general election was  \"a historic day for all museums and the millions of visitors to our galleries and museums every year.” It added: The MA will continue to work with the government to deliver a wide range of programs to support the thousands of museums working across the UK.\n\n\nThe Museum of Contemporary Art (MoCA), Tokyo, announced on Thursday that it is expanding its scope for digital interaction with fans, increasing", "The next Biennial should be held at the Museum of Modern Art in New York from March 22 to March 26, 2021. The Museum of Modern Art (MoMA) is currently closed due to the Covid-19 pandemic and will remain closed through at least February 20, 2022, the same as it was when the artistic giant architect Tadao Ando—the architect behind such monumental works as the Metropolitan Museum of Art in New York and the Whitney Museum of American Art in Los Angeles—was forced to resign in March of 2024.The Propaganda for the Arts Biennial will focus on how art and technology are reinterpreting the past and will examine the ideas of the twentieth century through an equated art and technology lens. The first exhibition will be titled “The Future Is Present: Art and Technology,” which will open on March 16 and run through February 21, 2022. The series will be curated by Tate Britain director Alice Black and will be curated by the British artist and writer Faisal Shah.One hundred of the ninety-eight artists invited to the event will be accepted to the Venice Biennale in March.\n\n\nThe Miami Beach Museum of Art (MBO), which was established in 1975 as a major cultural destination with", "The next Biennial should take place in the Ulughdanskéha River, where a leaked building permit in 2017 identified the complex as a cultural space and caused riots in 2017. The next show should be staged in the capital, in 2020.“We have a responsibility to ensure that cultural heritage sites and institutions are preserved in the future,” said museum director Zbigniew Brzezinski. “Existing conflicts are not mitigated in the least by the current state of affairs. Therefore, we must work together to create an environment for peaceful and cooperative development, in a respectful and sensitive manner.”The institution is currently working with the world-renowned artist Ekaterina Novitskova on a project for which she will create a permanent home for his works in the museum. The exhibition, titled Željko and Ekaterina, will open in the year 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Sherry Yellin as its next director. She succeeds Trina Thompson, who left the institution after nearly a decade to join the Los Angeles County Museum of Art (LACMA), and takes the helm from Laura Hoberman, who has been the L", "The next Biennial should focus on the history of social practice in the US through the inquiry of leading artists, including Allen Jones, D. H. Lawrence, Alice Pink, and Anne-Marie Russell. The ten-week event will be presented by the New York–based artist and curator Joan Miró. The event will run concurrently with the museum’s annual Biennial of American Art, which is currently on view until October 28.\n\n\nThe Lebanese-American artist and activist Soltan AlQasimi, a prominent critic of the Israeli occupation, has been charged with trying to remove a performance-based sculpture by Omar Khayyam, a leading member of the Lebanese Resistance, from the grounds of the American University of Beirut. According to the Art Newspaper, the eighteen-foot-long, twenty-nine-foot-wide work by Khayyam, who was recently detained in Jordan for attempting to cross the border into Israel from Syria, was installed in the courtyard of the university on January 8. When the artist was trying to take the piece all the way to the university, security forces opened fire on him. The incident led to the temporary evacuation of the entire campus of the American University of Beirut.The institution has since been placed under a", "The next Biennial should be in 2021. In the meantime, the museum will continue to host numerous exhibitions dedicated to classical art in its existing space, the Bibliothèque Nationale de France, and will present an eighth edition of the Biennial Tremblay in 2021–22.\n\nA new partnership between the Danish and German governments has been announced that will see the works of more than 500 artists from Denmark, Germany, and Sweden featured in the upcoming biennial. Titled Art and Power, the twenty-third edition of the German-Austrian artist-run exhibition will take place at the Museum Freiheitstannforschung in Berlin from March 17 to March 20, 2021.The Manchester Art Gallery and the Museum of Manchester, which is located at Hull Street in the city, will partner with the National Museum of Denmark to produce an exhibition dedicated to Lars-Peter Svensson. The exhibition “will introduce Lars-Peter Svensson’s contemporary art and its influence on modern art,” the museum said in a statement. “Together we intend to rediscover and rediscover the legacy of Lars-Peter Svensson and to supplement his legacy with modern art.”The Danish pavilion will", "The next Biennial should begin in October 2020 and run until December 2021. The programme will consist of a retrospective of the work of forty-five artists, selected from a pool of ninety-four, in conjunction with an open-air performance, the exhibition of six works in the exhibition “Biennial.18” The exhibition will open on November 7 and run until December 15.“The 2017 exhibition featured work by twenty-four photographers, including Roberto Ferrer, Cécile Duvernay, and Lucio Fontana.”In the report, Yoon said: “The next iteration of the Biennial will focus on photography’s relationship to art, with a view to understanding how photography has shaped, shaped, and is shaping the film canon. Based on the work of the artists I’ve selected, the exhibition will explore how photography has changed and will continue to change art, both in its production and its reception. By connecting the biennial’s production and reception, by examining how photography has impacted the history of art, and by reflecting on the question of photography’s relationship to art, the biennial will provide a platform for the collaboration of artists and scholars and will serve as a point of departure", "The next Biennial should take place in 2020, but the festival’s organizers are still waiting on the inaugural edition.\n\n\nThe BBC will open its new, expanded and expanded-in-the-box global arts and culture channel, BBC World, in the UK next month. The new service will be hosted by BBC programming director Nick Pickles and will be accessible via a variety of new platforms including the BBC iPlayer, BBC World Mobile, the BBC iPlayer app, and the BBC News app.The BBC’s president, Tony Hall, said: “We have long believed that supporting artists and arts professionals was a vital and unrivalled way of delivering on the BBC’s mission. With the launch of the new BBC World, I believe that we are putting the BBC back into the artist’s hands. The BBC World app and BBC World Mobile allow people to access BBC programming on their phones or tablets anywhere in the world. They are also ideal for those who want to watch BBC programs across platforms, wherever the programmes are currently being aired. As a pay-what-you-wish platform, BBC World will always be free. But we believe that the future of the BBC lies with the artists, with their expertise", "The next Biennial should take place in the second half of 2020, alongside the first in the United States. The 2020 edition is tentatively scheduled for September 21–September 23.\n\n\nThe William and Flora Hewlett Foundation (H/F) and the Smithsonian�s National Museum of African Art (MoCA) have announced that they have entered into a partnership to present a series of exhibitions, performances, and other events in partnership with the American Folk Art Museum (AFAM) and the Smithsonian American Art Museum. The intention behind the program, created in partnership with the Hewlett-Packard Company, is to present work by African American artists in the northern half of Virginia, the Carolinas, and South Carolina. Participants in the project will be selected by a panel composed of the Hewlett-Packard Exhibitions curators, Naima J. Keith, and Leslie Duggan; the Smithsonian American Art Museum curators, J. R. Bernbach, and Lawrence G. Brown; and the Hewlett-Packard artists.The project, called “Gusula” and organized by the Hewlett-Packard museums in conjunction with the partnership between the foundation and the Smithsonian, will premiere work by fourteen artists, including Arlie", "The next Biennial should be held in 2020. The Museum of Modern Art (MoMA) in New York is planning to reschedule its next iteration of the biennial in December. The institution also recently abandoned its original 2020 date, which was originally announced in 2020. It is currently unsure when the Landscape and Sculpture Biennials will be held. \n\n\nThe Royal Ontario Museum (ROM) in Toronto has established a new $2 billion initiative to support the growth and preservation of the local arts and culture through the collection, exhibition, and exhibition program of the institution. The new initiative, the Advancement of Arts and Cultures, was launched in partnership with the City of Ontario and the Province of Ontario, which will receive $1.4 billion of the total $3.4 billion in funding. The initiative will include the creation of a new fund that will provide direct support for the development of Canadian arts and culture through the collection, exhibition, and exhibition program of the institution; the transfer of funds from the museum’s current endowment to the fund; and the creation of a new award for the advancement of Canada’s artistic and cultural heritage.Conceived as part of the 2017 budget for the federal government,", "The next Biennial should be held in 2020. “The inquiry into the history of art has been an outstanding source of inspiration for me since I was a child,” said Humano Stele. “I was fortunate to have been born and raised in St. Petersburg, so the prestige of the institution was fostered by a great curator. When I was eight years old, an exhibition of the work of Lutz Bacher was presented at a Venice Architecture Biennial and I became interested in architecture and design from an early age.”Stele, who was named as a winner of the first Artforum Student Award in November 2014, is also the founder of the Italian art biennial, the Bienal Calçadé. The biennial, which has been held in Rome since 1987, is supported with funding from the Erskine Foundation, the Italian Ministry of Foreign Affairs, and the Italian State.\n\n\nThe Gallery of Modern Art (GMA) in New York announced today that it has closed its doors following a twenty-year artistic endeavor, announcing that it will focus on “the art of the future.”GMA was founded by artist-operatives Krist Novitsky and Barbara", "The next Biennial should take place in spring 2021, and a twenty-first edition, which will be curated by Sarah Green, will be held in spring 2021. The exhibition will consist of ninety-eight works and will run for an eighteen-month period.\n\n\nThe Guggenheim Museum in New York has appointed Ludwig Kaus as its next president and CEO. Kaus will take the helm of the institution, which was established in 1934 by Monopol founder Eduard von Karajan, from Charles B. Kaufman, who died in 2013, on January 7.Kaus succeeds Sally Kornbluth, who retired on May 31 after eighteen years at the helm of the museum, which has a permanent collection of more than three thousand works. Kaus will succeed Charles R. Hoffman, who has led the institution for more than twenty years, when he retires on December 31. “Ludwig has been instrumental in transforming the Guggenheim into one of America’s leading cultural institutions, and his leadership has served us well during this challenging moment,” said Alexander H., the Guggenheim’s director and CEO. “At a time when the", "The next Biennial should be a celebration of the biennial as a whole,” said Art Director Gregory B. Smith. “The upcoming exhibition will address the exhibition space and the biennial through an exploration of the relationship between the exhibition and the ground itself.”\n\n\nArtist-run museums such as the Solomon R. Guggenheim Museum in New York and the Metropolitan Museum of Art in New York have been attacked by activists who say that they profit from the mass incarceration of black and brown people in America. On Wednesday, the New York City Department of Cultural Affairs (DCLA) released an open letter by twenty-four artists, including George Atkinson, John Barrow, B.o.B., Jane Panetta, and D'Arcy McNeal, who called for the deactivation of the Metropolitan Museum of Art in Harlem and the closure of its doors for three months.In the letter, which was addressed to officials from the DCLA and the Department of Cultural Affairs, the artists claimed that the institution’s acquisition of a new $1.2 billion building in the city’s Harlem neighborhood is a “direct attack on communities of color, including those most in need of support.” In a statement, the", "The next Biennial should take place in 2021, according to Arts London. The hall will once again be housed in the former Commonwealth Bank building, which was completed in the 1950s and is currently undergoing a major renovation. \n\n\nA group of artists and collectors have launched a new crowdfunding initiative in the hope of saving the National Poetry Library (NL), England’s largest and most prestigious poetry reading library. The fund, called the National Arts Fund (NÜ), is crowdfunding an initial £2 million out of a twenty-four-hour-a-week creative commons license in support of the library’s staff and volunteers. “We are delighted by the support of our incredible staff and supporters, especially the amazing NL staff, who have been tirelessly working to save the library,” said Natalie Bennett, director of Arts London. “More than 70 percent of the library’s current staff are on a year-long contract, and we want to thank them for sticking with the effort. We know they deserve better and we know that the library is in desperate need of more resources to support its incredible collection. We know we need to make a difference and this is the best way to do that.”", "The next Biennial should be held in 2021. If it does not, the museum will cancel its next edition, which will be staged at the Marrakech Art Biennale. The decision to cancel the event came after the museum, which had previously said the event would be staged in three parts, decided to move the event to 2021. The decision to cancel the event coincided with a sharp drop in the global cost of life pill, which has been the mainstay of the biennial since 1998. The fall of the global price of life pill is estimated at $17.5 billion. The decision to cancel the biennial, which was announced on September 5, has also been condemned by Arab artists and scholars, who called the decision a betrayal. \"The Arab and international art scene is facing new challenges and it needs to be supported in these challenges through a combination of support and self-organization, not by isolating itself and by focusing on one institution or another, said Hassan El Saadi, the director of the department of the history of art at the University of Edinburgh. \"The Arts Council has made it clear that this is not the way to start a new multi-disciplinary event in 2020 and we hope that whatever happens next", "The next Biennial should be on the site of the former workshop, which has housed a number of exhibitions, such as “The Cartographer” (2009), “Olympus and the Human Body” (2011), and “Postwar Art” (2013). The exhibition will also include a catalogue of work by artists in the exhibition.Inaugurating the Biennial are the inaugural exhibition “Series 7: Art and Life in the Twentieth Century” (2018) and “Series 8: Art and Life in the Twenty-First Century” (2019). The exhibition will draw from the work of seventy-five composers and the biennial’s previous years.\n\n\nThe National Museum of Scotland has commissioned artist Amara Abdulkadir to create the feline equivalent of the final episode of the television series Game of Thrones, “The Hedge Knight.” The commission, which was commissioned by director Kim Mitchell, was made between the artist and the institution and was initially presented at the institution in April.In the episode, the Hedge Knight, a famous medieval knight who has the power to transform his surroundings, including his surroundings into fantasy realms, transforms to a throne room of the castle", "The next Biennial should be held in 2030, and the new Exhibition Programme should be implemented biennially. The first Biennial, in 1992, was a collective show of work by a number of artists, including Gertrude Stein, Ibiza Kuk, and Robert Irwin. In the show, Kuk cast herself as the main character from a long-lost children's novel, and Irwin displayed his paintings of landscapes and his sculptures of human figures.The Biennial, which was organized by the Hudson Yards Development Company (HDDC), was founded as a way for local, state, and federal governments to share in the economic development of the city. Its first iteration, held in 2009, drew at least 463 artists from over sixty countries. Its second iteration, held in 2021, drew at least 665 artists. In addition to the biennial, the city has also staged other exhibitions, including a study group exhibition of the work of the artist Nude City, a community event of the artist-run space Plastic Beach, and a rock concert.\n\n\nThe Walker Art Center in Minneapolis—the first institution in the United States to be shuttered by the climate emergency—has appointed Ellen Brown as its next director. Brown comes to the institution from", "The next Biennial should be held at least ten years after the age of sixty-six.  In the meantime, the museum has announced that it will present the first public exhibition of the work of Mihai Ilić at the museum. The exhibition will draw from the artist’s extensive body of work to examine the relationship between art and technology in the 1980s, and will include the artist’s first public installation of a 3-D printer in the United States.Ilić’s work, which explores creativity, technology, and the inherent processes of our world, can be found in the collections of the Metropolitan Museum of Art, New York; the Solomon R. Guggenheim Museum, New York; and the Proctors Center in Prague.\n\n\nThe Turkish art historian and scholar Kemal Atatürk, who served as Turkey’s prime minister from 1981 to 2003, has died at age eighty-one. Atatürk’s work, which includes the monumental monumental Turkish exhibition “Photographs from the Istanbul Biennale,” is enshrined in the National Museum of Turkey, which opened in Istanbul in 2008 and has since celebrated its thirty-sixth anniversary. Since", "The next Biennial should inaugurate a new series of public exhibitions, the first of which should be a “public platform for the production of works in the spirit of the three monotheisms,” the institution said in a statement. The exhibition will be curated by an American curator, not an Israeli, and will center on “The Future of Israel,” a painting by Israel Katz, a former deputy director of the Israeli Ministry of Culture, that was on display in the exhibition “Beyond the Walls,” in 2021.The museum has also said that it hopes to present an “international story of Middle Eastern art through the chronological and spatial archaeological lens of the Islamic world.” It added that the exhibition will “provide a window onto the historical consciousness of a select few people,” and that an “interdisciplinary debate will unfold over the next ten years on the global evolution of the Middle East through the personal narratives of its artists.”The exhibition will be in the form of “a chronological narrative of artists and their spatial relationships with each other, places and objects,” and will be housed in the museum’s building in downtown Ramat Gan. The exhibition’s curator,", "The next Biennial should be announced in the next few weeks.  After that, the artists may begin applying for a slot in the fourth edition of the New York Biennial. The museum will then select one from the shortlist to participate in the fifth edition, which will take place in 2021.  Following the Fifth, the exhibition will now return to the city for a seven-day run, from October 19 to October 22, 2020. The biennial was established in 1992 by artist-in-residence Bob and Barbara Bienni as a platform for the exploration of contemporary art and the city. It was nominated for a Pulitzer Prize in 2002, and for a Golden Lion in 2008. The exhibition returned for a second edition, titled The Limits of Design, in 2012. \n\n\nThe Pérez Art Museum Miami (PAMM) has launched “Design the Future,” a new initiative that will give Miami residents a platform to develop new and creative ways to improve their communities. The show will feature more than 60 exhibitions, seminars, and other events that will examine topics such as the power of design throughout history, redefining the role of designers in our contemporary world, and the dilemmas and opportunities presented by", "The next Biennial should be held in the spring of 2022, and from the spring of 2022, the museum should expect to welcome visitors from the public and the private sector. \n\n\nFrench cultural minister Franck Riester has said that Lévy Gorvy, the private museum founded by a wealthy businessman in Paris in 1957, will remain closed during the coronavirus pandemic. The upcoming exhibition “Between the Sun and the Moon” will not return to the city in March. French art historian and architect Christophe Berthold, who is also the director of the Centre National de la République (CNRS), said the closure will “damage the public image of Paris, and we will take this into account.”The Paris Salon de Lyon, which received more than 1,300 visitors on Saturday, March 3, extended its three-day edition, which was canceled due to Covid-19, until March 10. The event, which was scheduled to begin on March 13, canceled the show “Avant Gardes” and “Sculpture of Life” and introduced a new programming program of talks, screenings, exhibitions, and performances. Berthold told a news conference:", "The next Biennial should be held in the spring of 2022. The DGSI will open its new office in the city of Cologne sometime in the spring of 2021 and will continue to operate in the city until March of 2022, at which point it will move to Hamburg, Germany, for a three-month stint. The DGSI will also be based in Paris and London, and will host around seventy exhibitions every year. “The DGSI’s work has been selected for exhibition at every Palais d’Or in the world, and for the catalogue at the Venice Architecture Biennale in the summer of 2018,” said Matthias Neuendorf, the Berlin-based director of D. Gottfried Kreis, the German organization that organizes the annual exhibition. Nominated for the honor this year, an exhibition of work by renowned contemporary artists such as Linda Evangelista, Kasper Hoffmann, and Guy Debussy, among others will take the organ’s space in the eastern Berlin city center, which served as the venue for the inaugural exhibition in 2020, as it embarks on a major renovation.The DGSI’s new 11,500-square-foot space will be inaugurated by a", "The next Biennial should be held in September.  The museum will also open its new, larger and more modern facility in the summer of 2021. The decision to move the exhibition was made after the museum received a $20 million gift from the estate of Edward Adair. The donation includes the original works in the collection of the museum, as well as two hundred years of prints.This is the second time the museum has moved a large-scale biennial—the first was for the 1930s, when a new installation was added to the center. The exhibition “Rebellion: Contemporary Art in the Eighties” will surely be a highlight for visitors to the museum. \n\n\nThe Smithsonian’s National Museum of African Art (NMFA) in Washington, DC, is seeking a new director. It has appointed Terese Akiko as interim leader and CEO of the institution. Upon her arrival at the institution, the post is slated to run through 2020. During her five-year tenure, Akiko will oversee the museum’s programming as well as the development of the institution’s collection and collection experiences.“We are looking for someone who has the ability to bring a new", "The next Biennial should be held in 2018 and will be organized in Zambia and the United States. The show will be located in the capital cities of Zanzibar and Zanzibar, and will take place in two phases: First, a special exhibition, titled \"The Biennial of Mirrors, 2019, will be held in Zanzibar and the historical city of Dar-es-Salaam; then, in 2020, “The Crucifixion,” will be staged in St. Peter’s Square. “The Crucifixion’s artistic director, Kathleen Hausmann, told the Art Newspaper that the exhibition, which will include works from all over the world, will be a ‘wakeup call,’ and ‘a chance for all of us to look at the world with new eyes.”\n\n\nOn Saturday, the National Post reported that the Solomon R. Guggenheim Museum in New York has received a gift of approximately six hundred photos by artist Robert Irwin from the artist’s wife, Susan Irwin. The museum purchased the prints from the artist’s estate in 1958 and has been working with him ever since to digit", "The next Biennial should be held in 2021. The next will be held in 2022. \n\n\nThe Metropolitan Museum of Art (the museum), in partnership with the Metropolitan Museum of Art, the New York Public Library, and the National Endowment for the Arts, announced today that it has established a pilot program to award $5 million to projects that strengthen the museum’s collection. The grant program will launch with a $1 million challenge grant, and will launch with a $2 million grant in the first quarter of 2020.The program will be led by the museum’s director and curator of modern and contemporary art, David Kastner, with assistance from the curator of European art, Helen Cammock, and the curators of the exhibition “The Metamorphosis,” “Michael Pfeifer and Michael Schwarz,” and “Andrea Dwork,” and will run throughout November, December, March, and April. The money will be distributed in the form of a “subscription,” “that is affordable to participants, and that offers a variety of opportunities for curating, research, and sharing.”The first round of grants will be given to the museum’s", "The next Biennial should take place in 2020, at the latest. All of the artists represented in the exhibition were invited to reapply for the 2019 exhibition. The first round of the 2020 edition, which Koenig curated, was held in November 2019.Koenig was selected by a vote of the prize jury\u0097which comprises Franz Kapp, Marina Konstantinova, Johannes de Koonen, and Christoph Lüter\u0097in the exhibition’s category of Contemporary Art. “The Biennial is highly anticipated by the international art world. The exhibition, which will be hosted at the Hirshhorn Museum in Washington, DC, as part of the Biennial, features work by twenty-five artists and is expected to generate some sixty thousand visitors.” \n\n\nThe Metropolitan Museum of Art in New York has announced plans to open a new outpost in the city’s Chinatown, the Chinatown Museum, on the southeast corner of Fifty-second Street and Thirty-Third Street in Chinatown. The outpost, which will be inaugurated by an exhibition of works by Chinese-American artist Huang-Chin Lee, will be located on the fourth floor of the museum.“In recent years", "The next Biennial should take place at the new site of the National Museum of Anthropology in Athens and will be hosted by the State University of Museum of Art, the University of Antwerp, and the Museum of Modern Art.Mitsubishi recently announced its plans to open a new museum in the capital city. The institution will also be the site of a new exhibition, “Practical Biosynthesis” (2019), which will highlight the work of biophysicists and biochemists working in the fields of biology and chemistry. \n\n\nThe official website for the sixth annual Venice Biennale has announced that the event will move to the city of Venice from February 23 to March 14, 2020. The move is part of a broader strategy orchestrated by the Venice Architecture Biennale (VAB) to improve connections between the event and the city of Venice.“We are delighted to celebrate the occasion with you in Venice,” organizers wrote on the website. “We hope this new structure will help to encourage the cooperation between the Venice Architecture Biennale and the city of Venice, and will help to strengthen the VAB’s relationship with the city.”The Venice Architecture Biennale is supported with funds from", "The next Biennial should focus on “intersection of art and technology,” said the jury. “And should not exclude the visual arts, and should show how ‘artificial intelligence is advancing our vision of what art can be.’”The exhibition, “Art and Machine Intelligence,” will be hosted by the MIT Media Lab, and curated by Yoram Korenman, who is currently working on an exhibition at the Venice Biennale. The exhibition will run from March 13 to March 16.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of twenty-five works by the late Israeli artist Nita Bar-On, who was the subject of a 2016 documentary, “Nita Bar-On: The Truth of Life” (2017), directed by filmmaker Issa Rae, which premiered at the Museum of Modern Art in the fall of 2016. In addition to the works, which were made in Israel between 1957 and 1971, the institution received a trove of Bar-On’s published works, which are currently on display in a new home-made installation, “Nita Bar-On: The House,” at the Museum of Modern Art.�"]