["The next Biennial should be held in the spring of 2021.  \n\n\nThe Los Angeles County Museum of Art (LACMA) is preparing to reopen its doors on March 22 following a $55 million expansion, following the city’s request. The installation was part of the revitalization plan established by Los Angeles mayor Eric Garcetti and councilman Mitch O’Brien, who also pledged $55 million for the renovation of the institution.According to the Los Angeles Times, the museum, which consists of two buildings that were completed in 1963, became the first major arts center in the United States to open in the depths of the pandemic. The remodeled building, which opened to the public in 2016, features new works by thirty-four artists.The museum will also be able to hold more than 1,000 visitors at any one time. The reopening date has not yet been set.“This is a monumental milestone for LACMA, and for our city,” said Garcetti. “We are grateful to the mayor for recognizing the importance of LACMA, and for his leadership in crafting this ambitious and ambitious master plan, which moves us closer to restoring and revitalizing our city.”\n\n\nThe Museum of", "The next Biennial should be held within the next two years. The new format will feature a selection of works by twenty-five artists, and will be centered around themes such as the curves of beauty, the beautiful in the dark, and the divisibility of opposites. John Mullen, director of the Black-Box Arts Center in Atlanta, said in a statement: “The new Biennial will engage in critical and provocative explorations of the notion of beauty, both as a biological reality and as a concept in art.”\n\n\nThe Los Angeles–born, New York–based artist Jude Law, whose vast chartreuse-toned forays into painting, sculpture, drawing, and printmaking became the subject of a Grand Central Station exhibit in New York City in 2018, died Thursday at age seventy-nine. He was no longer buried in his native Los Angeles, where he had lived and worked since his death, but was buried in the city where he began the process of carving out of the desert in the 1960s.Born in New York City in 1940, Law moved to the United States to pursue a career as a painter. He taught at the University of California, Berkeley, and the University of Nevada, Las Vegas", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) has announced that it is planning to open a new, privately financed museum dedicated to the work of the twentieth century that will introduce more than two hundred contemporary artists to the city of Los Angeles. In a statement, the institution said that the move is meant to “remain true to the mission of the museum.”The museum will double down on its engagement with local communities by providing more opportunities for education and community engagement through programming, including the introduction of the artist-in-residence program and the exhibition “Artist in Residence: The Art of Life” at the Museum of Contemporary Art, Los Angeles, in 2020. The program will seek to “explore the lives and visions of artists who have made significant contributions to our society.”“The work of the twentieth century is inspiring and humbling,” said museum director Christopher Lee. “As we continue to present the work of this century's greatest artists in new and meaningful ways, we are committed to serving as a model for how we think about the future of art and the museum. At this critical juncture, we are excited to revisit the work of our", "The next Biennial should take place in 2022. The 2020 edition, entitled Representations, was staged at the National Art Gallery in London, the Cirque du Soleil in Paris, and the Architectural Record in New York; the 2021 edition, titled Homo Anthropologicus, was held at the Museum of Modern Art in London; and the 2020 edition artistically and conceptually integrated cultural events, with the show continuing with a reopening of the National Museum of Art in Washington, DC, on December 31.Other shows scheduled for the biennial are Theater & Design, with Karl Lagerfeld and Aretà Castellani; Art of Life: The Art of Life, with Juliette de Morais; The Art of Living, with Marianne Bélier; and Beyond Tolerance: Art and the Human Experience, with Kirsten Bruguera.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that Kimberly Stearns has been named the new associate director for contemporary art at the museum. Stearns previously worked as an associate curator at the museum and previously served as a curatorial assistant and as", "The next Biennial should aim to present a total of forty works by artists in the inaugural edition, which was staged at the Kiruna Art Museum in Mumbai in 2020. “In an age of constant disruption and disruption caused by technology, it is not surprising that art has struggled with the loss of its meaning,” said Sawant. The governor pointed to work by artists such as Renzo Piano, Andrea Dutton, Jane Panetta, and John Turner, as well as a number of exhibitions that she said “show the lifeblood of art’s future,” and said she hopes the 2019 edition will be a snapshot of where art is today. \n\n\nArtist-run pilot programs that support independent arts and cultural enterprises in New York and New Jersey have become a key part of Mayor Bill de Blasio’s push to reduce the city’s carbon footprint and create new funds to fight climate change. As part of his de Blasio for NYC initiative, which was launched in 2015 as part of the mayor’s plan to reduce the city’s CO2 emissions by 40 percent by 2025, over ten thousand individuals and ninety pilot programs have been initiated since the campaign began.The pilot programs, which", "The next Biennial should take place in January 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed the French curator and architect Emmanuel Chateaubriand as its next director. Chateaubriand, who has been working at the museum for over thirty years, has helmed the institution since its inception in 1989 and is credited with creating a platform for critical thinking about contemporary art through collaborations with Michelangelo Antonioni, Monir Shah, and Percival Molina.“Emmanuel Chateaubriand’s project for the next biennial will be a celebration of the two millennia of the influence and the creativity of Michelangelo’s work on architecture and sculpture,” said James Cuno, cochair of the museum’s board of trustees. “A true visionary, he has been instrumental in bringing MoMA’s architecture and design center and modernism to fruition. We look forward to watching what he brings to the institution as we move into the twenty-first century.”Another visionary and prolific architect, Isamu Noguchi, who designed the museum’s design for the building of the Noguchi Theater, died last", "The next Biennial should be held in the spring of 2021. \n\n\nThe National Gallery of Art in Washington, DC, has appointed Hisham Atoui as its next director. Atoui, who has helmed the National Museum of African Art in Washington, DC, since 2013, will take the helm of the National Gallery of Art at the end of the current president’s term.“The National Museum of African Art is an important and dynamic institution in the country of Ghana,” said Atoui, who has been appointed by President Janet Museuzo, the first president of the country. “Hisham Atoui’s leadership and vision for the museum is a perfect match for the National Gallery of Art and the National Museum of African Art. We look forward to working with him to further the theme of our 2020–21 season, and to shaping the future of the National Gallery of Art.”Atoui comes to the institution from the Metropolitan Museum of Art, where he has served as chief curator since 2013. He is the founder and director of the Haus Mädchenstalt, a nonprofit that provides programming for Ghana’s rural communities. He also has a long-", "The next Biennial should take place at a new location in the city. The event will then return to its usual location in the old campus of the Art Institute of Chicago, and will likely return for a second edition in 2020. The 2020 event will be held in the new indoor venue, which will be developed by the same team of architects and conceptual thinkers that designed the museum’s campus in the 1980s.According to the Chicago Architecture Center, the project’s design will include more than 180,000 square feet of underground galleries, an expanded collection, and an additional ten thousand square feet of exhibition space. The museum will also be able to incorporate a new public green space, an outdoor plaza, and a new pedestrian overbridge. The existing museum will remain open during construction and will continue to function as a cultural gathering space for Chicagoans.The design has been in the works for over a decade and is currently under construction by the Chicago-based firm MAD Architects. The project, which was funded in part by the Sargent’s Daughters Trust, was awarded a $115,000 grant from the Daughters of the Duyvil family in 2015, and the organization has since received more than $150,000 in support of the project", "The next Biennial should be held sometime in 2018. In addition to the exhibition, the Foundation will create a new platform for the preservation and promotion of the work, which will be hosted on the Facebook group Remembering Anna-Maria Bernina. “The Foundation is very much focused on creating new opportunities for artists and the possibility of cooperation between art and culture in the city of Bonn and the surrounding region. We hope that the new initiative will provide a platform for the Regeneration of Art, our active artists, to have a real impact on the future of the Biennial and the art of Bonn,” said Bettina Neugroschel, Director of the Foundation.\n\n\nThe German government plans to hold a referendum on whether the country should return to the Nazis after a Jewish-majority state was established in East Prussia in 1933, reports the Art Newspaper. The initiative comes amid an ongoing legal campaign against the reparations movement spearheaded by the descendants of the approximately one hundred people who were murdered by the Third Reich in the Holocaust.“The question of restitution will certainly become a major point of departure for many Germans,” said Ministry of Culture spokesman Joachim Minzsch. “We are in a", "The next Biennial should be held in 2021.\n\n\nThe Royal Academy of Arts (RA) in London announced today that the twenty-first Biennial of Contemporary Art will take place at the Royal Festival Hall, in Stratford-on-Avon from January 5 to January 6, 2021. The 2019 edition, “Qi Jinping” (which marked the debut of artist Ai Weiwei), was canceled when the pan-Chinese artist and educator was arrested on suspicion of stealing thousands of documents from the artist’s home in Beijing in March.In March, the artist was released on bail after a judge ruled that he was not guilty of the theft allegations, and the court sentenced him to twelve months in prison. He was also fined $3,500 and ordered to pay $560,000 in damages. The performance, which was to have taken place at the RA in 2019, was supposed to have been staged at the RA in 2019, but was postponed because of the pandemic.The 2019 edition of the Royal Academy of Arts featured sixteen artists, including Tao Lin, Lu Jie, Bianca De Matteo, Tao Greaves, Gaia Farago, and Vincent", "The next Biennial should include work by fifty artists from the US, Europe, and Japan—a group showcasing work in the exhibition should take place in the summer. For the first time in the exhibition, the work of a single artist at a time will be presented.\n\n\nThe Skowhegan Museum of Art in Lewiston, New York, has appointed Carrie Coudenhove-Kalergi as its next executive director. She succeeds Gia Delimont, who retired in August 2019 after fourteen years at the institution.“The Skowhegan Museum of Art is pleased to welcome Carrie to the team,” said executive director Christopher Biggins. “Her deep experience, proven ability to prioritize and execute projects, and proven track record of growing the Skowhegan Museum’s audience and collection over time will be a great asset to the organization as we carry out our long-term vision to build a new building and a new collection on the campus of the Skowhegan Museum of Art.”Coudenhove-Kalergi comes to the Skowhegan Museum of Art following three decades at the University of Massachusetts at Amherst, where she served as associate curator of modern and contemporary art. Previously", "The next Biennial should have taken place in 2021, but the organizers were not prepared for the failure of a second edition in 2018. The museum has already received three awards for its exhibition “Meshes and Objects,” and the works of artist-in-residence, Ekaterina Gaskova. Although the museum has awarded the prize to a total of sixteen artists, they have yet to announce the winners of the 2019 and 2020 awards. In a letter sent to the recipients, organizers stated that they “feel it is our responsibility to not only affirm the event, but also to further, foster and strengthen the growth of the local community.”\n\n\nThe Tate has launched an online calculator, called the Tate Scorecard, that will give visitors in the UK and around the world an in-depth, visual guide to the state of their local arts and culture through 2020. Titled 'Tate Scorecard: 2020,” the service will offer users a tool that will compare their local area’s ratings of the top fifty UK galleries and arts institutions by topic, rating them along with other categories such as design, design making, design incubation, design grants and galleries that are currently accepting funding, and galleries and museums that", "The next Biennial should be held in 2022, and the final will be held in 2023.\n\n\nToppled Art, the New York–based nonprofit that raises funds and provides support for artists and activists who are Black, African American, Native American, or otherwise excluded from funding and other opportunities in the arts, has received a gift of $6.2 million from the estate of Henry Evans Hughes. The family confirmed the gift in a statement on Thursday.The elder Hughes, who passed away in November 2018, amassed an impressive collection of 14,000 works by some three hundred artists and collectives. Known for his generosity and passion for his art, Henry was an avid collector of works that were already in his possession and that were on display in his New York gallery. His daughter, Linda, and her brother, Henry Jr., also an artist, donated the works when they were in the collection and are now preserving them at their home in Queens.The family, which also includes their son-in-law, Jeffrey, are philanthropists who had several long-standing relationships with the arts and social justice movements. In addition to supporting the works, they were active in the community and were involved in creating the foundation Toppled Art. A testament to their", "The next Biennial should be completed by the end of the year, and the first exhibition in the new venue will open in 2021.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the development of art and cultural programs in the city. “The DCLA’s Cultural Impact Statement (CIS) helps drive the direction and implementation of culturally responsive public programs,” reads a statement issued by the city. “CIS describes the Creative Economy as ‘a new kind of community-based production that is focused on the community, the community on the world, and the world on the community.’”The guidelines suggest creating a central collection of cultural artifacts such as objects that have been or are about to be displayed in galleries and museums, as well as a cultural and educational platform that will engage with questions of identity, history, heritage, and the environment. They also outline how to establish and structure an exhibition space that can serve as a rendezvous point for visitors from a variety of backgrounds.The document states that “there should be a central location for the display and research of contemporary art.” It stresses the importance of maintaining a diverse collection, of creating an open platform for exhibitions", "The next Biennial should include a discussion of concepts such as the artist as an image, world, or physical object, and how images can be used as metaphors for the experiences of others.” The 2019 event was curated by Shirley S. Hartshorn, the award–winning curator, and Shalimar E. Boone, the award-winning director of the A.S. Foster Art Gallery in Los Angeles. In addition to the gallery, which also holds gallery residencies at its own Art , for Women in New York, the group will turn to the artist Cooper Lichtenstein for its visionary work.  The 2019 theme of Life and the Arts: The Importance and the Limitations of Art is Time: “Time is the central subject of the museum’s collection. Time is the subject of all art and all art is the subject of all time.” The 2019 exhibition “The Art of Life” was organized by Anne-Marie Peterson, the curatorial director of the A.S. Foster Art Gallery in Los Angeles; Ralph Van Pelt, the director of the Contemporary Arts Museum in New York; and Volodya Kievskaya, the director of the", "The next Biennial should be held in 2022.\n\n\nThe Pérez Art Museum Santa Cruz in Spain is planning to move several hundred artworks from its headquarters in the capital city of Madrid to Rio de Janeiro, the country’s largest city, in anticipation of the upcoming Olympic and Paralympic Games. The institution also noted that the move would reduce the amount of waste produced in the city, which is located on the Amazon River, and will analyze the potential environmental impact of moving works.The Pérez Art Museum Santa Cruz will open a new exhibition space in the southern town of Santa Cruz in March 2021. The exhibition “Uno de las mujeres en el Viaje,” curated by Ana Maria de Córdoba, will feature twenty-four works by forty-eight international artists, including Antony Gormley (Italy), Carlos de la Fuente (Spain), Ida Leonhardt (Germany), María Báezal (Argentina), and Nuria Ibarra (Spain). Attaching to the curatorial team’s previous exhibition of work by the same artists, \"Avenir novae,\" in 2015, the show was dedicated to the artist’s own artistic practice. The", "The next Biennial should be held in 2020. But the twentieth, which was canceled last year due to the pandemic, will not be back-filled until 2023. The decision to cancel the event has resulted in a backlash from some who feel the move is intolerant and discriminatory. The Art Newspaper reports that artists and activists have condemned the move as an attack on their freedom of expression, and others have called for the exhibition to go on. The twenty-second edition of the exhibition, titled “Nirvana 2: A Retrospective,” was scheduled to run from January 20 to February 20, 2020. The exhibition is being held at the Palais de Tokyo in Paris, and will be the subject of a major exhibition at the Museum of Modern Art in New York next month. The museum will also stage the artist’s “Classic Albums” series, “The Power of Music” and “Piano Intervals” in the United States. The exhibition will come to the United Kingdom and will run until December 29, 2020.\n\n\nThe Bahraini government has ordered the arrest and detention of 13 people for “terrorism-related offenses,” The Guardian reports. The", "The next Biennial should be held in 2020.\n\n\nThe Taizhou Exhibition and Photo Show in China will also be relocated to Beijing and will be held in the capital from April 15 to April 22, 2020. The first event, “Shanghai Art Biennials,” will be staged in the early morning on April 6 and will be presented by Shanghai Dangdai, Shanghai Art University, and the Shanghai Art Museum. The 2019 edition of the fair, which was held in Shanghai from March 14 to March 16, also featured the exhibition of photographs by Lucian Freud and Thomas Harris. The 2019 edition of the Taizhou Art Biennials, which was launched by Shanghai Art Museum and Dangdai Art University in partnership with the Chinese government, took place at the Shanghai Art Museum and was held in conjunction with the National Museum of Fine Arts in Beijing.The show is being held on the third floor of the Dangdai Art Museum, which is scheduled to open in 2020, and will run from April 7 to April 11. The event is being held in early April to try to avoid the March blackout, and it has been cancelled in the past. “As the opening date of 2020 has been moved", "The next Biennial should be held in 2021. \n\n\nOn Friday, the National Council on the Arts (NCA), the National Council on the Humanities (NCHM), and the National Council on the Arts (NCA) released a joint statement about the upcoming National Museum of the American South (NMAS), which will be located in Florence. “The existing National Museum of the American South in Washington, DC, and the new NMAS are complementary works of art,” reads the statement, which was issued in response to the ongoing protests over the reopening of the National Museum of Women in the Arts (MoMA), which is currently undergoing a $225 million expansion project. “MoMA is an essential cultural space, providing a platform for the collection and presentation of more than two thousand works by artists of color and women, and has played a central role in the development of the collection over the years. Our long-term vision for NMAS is to make it a powerhouse of contemporary art and to promote the work of women and underrepresented artists across the United States.”The NCA’s statement continued: “MoMA represents a rich and diverse collection of works by American artists in the Northern Hemisphere, especially", "The next Biennial should begin as soon as possible, in accordance with the institutional guidelines for the year 2020 and be held in the same location as the exhibition.”The institution has faced numerous setbacks in its bid to host the Art and Design Biennial, which was originally scheduled for June, and has been working with a group of financial and business leaders in an attempt to find a solution. The biennial is also trying to secure new sponsors and is evaluating new venues for the exhibition.“This year’s edition of Art and Design was a milestone for us, our partners, and our guests, and we have had the opportunity to collaborate with some of the most distinguished and innovative artists in the world,” said Art and Design director Harry Shainman. “We look forward to the 2020 edition, with artist teams from the United Kingdom, Germany, the United States, and Italy, and the upcoming years.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MCA LA), has appointed Neil MacGregor as the next director and CEO of the organization. MacGregor comes to the institution from the Chicago-based nonprofit group Art Garden, where he has served as interim director and CEO since January 2019. He", "The next Biennial should take place in Hawaii in 2021. The following year, the museum will stage a new exhibition “Revival,” a collaboration between the New York– and London–based artist Amitav Ghosh, and the artist Derek Kravitz, as part of a new program. The event will be hosted by the architect Susanne Vielmetter at the institution.Vielmetter, whose practice is situated in the heart of the Museum District, said the theme of the show will “be about the convergence of modern and traditional, about the museum itself and the city of Honolulu.” The exhibition will introduce the museum’s new structures, the exhibition “Towards the Future—” an exploration of the future of the waterfront, and will present “Lincoln: The American Story,” a new collection of photographs by Benito Cerezo from the artist’s most recent exhibition at the museum. The show will be guided by the artist’s design studio and will open on September 23.\n\n\nThe collection of the Kunsthalle Basel (Basel, Switzerland) has revealed that it plans to organize a “legitimate event” for the fifth edition of", "The next Biennial should be held in December 2022.The next edition of the Guggenheim will take place in March 2020. The structure will be redesigned to accommodate the venue’s additional exhibition space, and the Guggenheim will expand to a three-story pavilion. The Guggenheim’s building will also be reconfigured to make room for the exhibition. The project is projected to cost around $100 million.The renovation of the Guggenheim’s former space, the Biennial Garage, is being spearheaded by the architectural and design firm Landreth & Partners. The firm designed the museum’s previous residence, the Museum of Modern Art (MoMA), in Manhattan, and is also working on a redesign of the building next door. The work is expected to be completed by spring 2020.According to the Museum of Modern Art, the work is part of a multi-year project to create a new, contemporary workspace for the museum’s collection, which includes the acquisition of two former auto assembly plants and the refurbishing of the existing building. “This is an essential moment in the museum’s history,” said Mark Doty, chairman of the board of trustees. “", "The next Biennial should be held in March 2021, and the next in October 2022, according to the organizers. The 2020 installation will be a collaboration between Oolite Arts and the Philadelphia Museum of Art, and will offer thirty-six works by thirty-two artists, including Rintoul, João Teixeira, and João Vigo. The 2021 biennial will be hosted by the National Gallery of Art, Washington, DC. The 2020 exhibition will be held in the United Kingdom, and the 2019 exhibition was staged at the National Gallery of Art, London. The 2019 exhibition will be staged at the National Museum of Fine Arts, Washington, DC. The 2019 exhibition will be hosted by the Museum of Modern Art, Washington, DC. The 2019 exhibition will be held at the National Gallery of Art, Washington, DC. The 2019 exhibition will be held in the United States. The exhibition will be one half of a series the artists have called the “Cinematic Series.”The 2019 exhibition will be the culmination of eleven years of collaborations between the National Gallery of Art and the Washington, DC–based nonprofit organization The National Endowment for the Arts (NEA). The NEA is an independent agency charged", "The next Biennial should be in 2020. \n\nThe European Space Museum Stuttgart, which was already planning to move its exhibition from the city to the countryside, announced on Thursday that the exhibition will move to the forest as part of an agreement with the city authorities. The exhibition will remain in the city, but will instead be located in a special exhibition space in the forest. “We have been following the city of Stuttgart’s initiative to create an environment for the future generations and now we are ready to move forward with the biennial,” said Ralf Schlegel, president of the European campaign group Artforum. Forests are a key tool for the preservation and restoration of natural landscapes and for the protection of biodiversity, and the exhibitions in the museum will showcase the work of more than sixty artists.\n\n\nThe Noguchi Museum in New York has received a gift of more than 4,200 photographs, prints, and videos from the late American photographer Charles Noguchi, who passed away in New York on January 5. The Noguchi Collection, which also includes photographs by David H. Koch, William Kentridge, and many other famous figures, including Thomas Dolby", "The next Biennial should be held in 2021. The Arts Council England said that the 2019 event “made a positive contribution to promoting the arts and drawing internationally.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has hired Wesleyan University art historian and curator of Modern and Contemporary Art Michael Eisenman as its new curator of contemporary arts, art history, and architecture, Josh Kalla, and executive director. Eisenman is the author of Esche Toch: “The Politics of Practice” (2016) and the forthcoming Esche Toch: First World War’s Art and Strategy (2019). His work has been published in Artforum, Artforum Perspectives, Artforum, and Artforum.com and is in the collections of the Museum of Modern Art, the Metropolitan Museum of Art, and the Whitney Museum of American Art.Last year, MoCA held an event, “MoCA Forum,” at the museum to promote Eisenman’s work. The exhibition was organized by MoCA curators David Kordansky and David Levine, and featured works by Eisenman, Milton Berger, and Phyllis Allen.“Wes’s appointment represents an exciting", "The next Biennial should be a “grand historical document of contemporary art,” said Hannes Nilsen, director of the Kunsthalle Basel in Switzerland. The next iteration of the Glasnost Biennial will take place at the Forum Basel in Hamburg in September 2020. The full list of participating artists is as follows:Arts & Culture and the Haus der KunstKunst, Munich (NARA)Gothic Museum, Munich (NARA)Gothic Museum, Munich (NARA)Kunsthalle Basel, Munich (NARA)Art of Life, New York (NARA)Art of Life, New York (NARA)Art of Life, New York (NARA)Art of Life/Kunsthalle Basel, Frankfurt (NARA)Art of Life, New York (NARA)Art of Life, New York (NARA)Art of Life, New York (NARA)Art of Life, New York (NARA)Art of Life, New York (NARA)Art of Life/Kunsthalle Basel, Frankfurt (NARA)Art of Life, New York (NARA)Art of Life, New York (NARA", "The next Biennial should be held in March 2019. The first will be held in September 2020.\n\nThe New Sanctuary (N) is an independent arts organization that was founded in 1998 by artists and writers, and has been a supporter of the Bougainville’s work since 1999. In 2009, the organization gave the Bougainville $100,000 for the completion of a five-year residency program. N also helped raise the artist’s profile through a series of exhibitions at the Amsterdam Museum of Modern Art in 2012 and the Contemporary Art Museum St. Louis the following year.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it will open its new 800,000-square-foot headquarters in the new Vauxhall region of London, marking the institution’s first expansion in more than forty years. The museum will welcome guests in 2022, and in 2024, it will hold an exhibition for the first time.“The expansion team’s goal was to create a space that would provide MoMA with additional space and a more collaborative approach to presenting its collections, which has always been one of the museum’s core values,” said MoMA director Daniel H. Weiss. �", "The next Biennial should be held in the spring of 2021, with the 2020 winner announced at the Cannes Film Festival in May. The 2019 winner was Bénédicte de Malle, who will perform the first part of a new opera that will be staged by the Japanese artist Chiaki Kawamura, who lives in Osaka.The Danish artist Lars Yttinggaard will present the work of the Norwegian artist Nata Mazzei. The Danish artist Lars Yttinggaard is currently working on a new painting by the Norwegian artist Anna-Sophie Haralds. The Danish artist Lars Yttinggaard, an American citizen, was granted a residency in Paris by the Ministry of Culture in 2015. The Danish artist Lars Yttinggaard, who was born in 1971 in Oslo, is one of a number of American artists who are currently facing extradition to Denmark from the US. The artist and his wife, Astrid, were granted a residency in the French capital in 2012.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released new guidelines for the fairs and international fairs that will take place in the city in 2020. Titled “NYC Architecture: From Movement to Design,” the document", "The next Biennial should celebrate the work of women artists whose work is currently being exhibited in the United States; the list is currently comprised of Federighi, Kimes, and Ramón Núñez. The inaugural event, “Arts and Art,” will mark the first time the Museum has staged an event dedicated to celebrating women artists in its thirteen-year history. The exhibition will include solo presentations of work by thirty-eight artists.Over the last twenty years, the museum has staged more than eighty exhibitions featuring work by women artists. It has also collaborated with women artists on projects such as “Sisterhood” (2014), “The Power of Art” (2008), “Women and the Arts: A Feminist History” (2007), “Black and Latinx Art” (2009), “Lazaretti: Stories of a Journey” (2010), and “Inside the Studio: A Feminist History” (2012).\n\n\nThe Egyptian Museum of Art (EMAM) has announced that it is planning to open a new exhibition devoted to the country’s contemporary art scene in 2020. The exhibition, titled “Egyptian Contemporary Art: A Presentation of Modern", "The next Biennial should take place in 2021, and the project will now be led by curator and director Elias Donohoe, who has helmed the museum for more than twenty years. “[Being a curator] is a very different thing from being a director. It requires a very different kind of relationship to the museum,” Willoughby told Curbed. “The museum would be a family, and we would not be able to do things on our own. We would have to have the support of the director.”Since the exhibition space was built for the first edition of the Biennial in 1984, the institution has been forced to relocate several times due to the pandemic. According to the New York Times, the museum is currently working on revamping its exhibition space to avoid overcrowding and to run more exhibitions in urban settings.While the general public is protected from the virus, the risk of contracting the virus increases as people become exposed to the virus from close contacts or from people who are ill. In the US, the risk of the virus is considered to be one in five thousand per year. According to the CDC, the virus can be spread mainly from person to person, but it can also be spread through direct contact with", "The next Biennial should take place in 2022.”In a recent letter to the Art Newspaper, the Berlin-based group C++ Solidarities said that it was “disappointed” that the preview for the 2019 edition was “fixed” and “contrary to the spirit of the event,” and described its boycott as “costing the whole world.” The letter said that the decision to boycott was made in solidarity with the art community, and that it was “protecting the very principles of the exhibition.” It also said that the festival “must not be confused with the upcoming exhibition, ” adding that the decision to boycott was not a “choice but a necessity.”The boycott has also been met with criticism from other arts organizations in Europe. The German federal arts agency, BILD, said it “regrets” the decision but said that it was made in the context of a “growing sense of disquiet” among Berlin-based cultural professionals that the festival was becoming increasingly politicized. Bild’s director, Sabine Haag, said that the agency was not “trying to be politically correct.�", "The next Biennial should be held at the Museum of Contemporary Art Chicago next year. In the meantime, Nicoletta and Tom will be traveling to New York to continue their work, and new artist-in-residence projects are being planned. In the meantime, the Biennial is accepting donations of art for its upcoming exhibition, “Life & Art: The Legacy of Jack Kirby,” which is slated to open at the Museum of Contemporary Art in Chicago next month. Go to the Biennial’s website for more information.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has received a gift of fifteen works by the late Japanese sculptor Hito Steyerl, who created more than 1,500 works over the course of his career. According to the Art Newspaper, the works are the Hirshhorn’s first acquisitions by a Japanese collector, and the works are in the public collections of several major Japanese art museums.The gift includes a selection of works dating back to 1923 by Steyerl, who was known for crafting works that reflect both his artistic and philosophic approaches to sculpture, as well as his unique and challenging experiences in American life. Steyerl’s house in Kyoto is", "The next Biennial should focus on the body politic, the environment, and the state of contemporary art, with a particular view to our contemporary world. We will also discuss ways to support and promote contemporary art as a whole. The next Biennial will take place at the Barbican in London, from September 8th to September 10th, 2020.\n\n\nThe Museum of Arts and Design (MAD) in New York has appointed the Beirut-born, New York–based artist Ahmed Mokrou as its next executive director. Mokrou, who is also the cofounder of the collective Are You Afraid of Virginia Woolf? (If I Had a Dream), was recently selected by the M&G Foundation to represent the United States at the Fifty-Ninth Venice Biennale. He joins MAD from the same conceptual space that produced works that address issues such as race and loss, namely in “Marjorie Margolye” (2013), with artist and poet Esha Moteva.Born in Beirut in 1980, Mokrou relocated to New York in 2001. Since 2015, he has been critical of the international art world, which he sees as “irrelevant,” and has worked to secure funding from the", "The next Biennial should be held sometime next year.\n\n\nThe Museum of Contemporary Art (MoCA) is planning to give more than $100,000 to more than 1,600 artists who have participated in the Elizabeth Grant Foundation’s Elizabeth Grant Awards for their work in the last five years. The program, which was launched in 2008 to give prizes to emerging and established artists, was established to help support the financially struggling arts and cultural institutions in Rochester, New York.The foundation’s previous awardees include Derrick Alberts, Lee Baden, and Xaviera Barlow. Awardees who received $100,000 or more include Laura Adamson, Helen Frank, Domenick Guarani, and Haim and Lana Baldrada. A selection of the awardees will be presented at a special awards gala at the Louvre on February 15.The awards are given out monthly, with the first and most prestigious awards typically presented by the foundation on the occasion of the artist’s seventeenth birthday. Among the artists selected for the 2020 awards are Adamson for her first work created for the program; Barlow for his first solo exhibition at MoCA; and Guarani for his first solo exhibition at the museum. The", "The next Biennial should be held in the autumn of 2020. The 2019 edition, which was organized by the central government-backed Initiative for Development of Arts and Culture (IDAC), was moved to the end of the year and the institution was forced to cancel the 2020 version, which was scheduled for March 21–March 29.The First Biennial of the Diaspora was held in Paris in October 2019. The show, which was co-organized by the Paris-based NGO the Diaspora Foundation and the Paris-based arts organization the Diaspora Village, drew more than 1,300 participants from twenty-six countries and forty-two municipalities. The show was part of IDAC’s initiative to build a more cohesive and inclusive France.“We’re still in the process of creating an exhibition that will represent the diversity of French visual arts,” said artist Christian Mendy. “I’m excited for what the biennial might be able to become.”\n\n\nThe National Gallery of Canada in Ottawa has announced it is reopening to the public on January 23, 2020, following a $2 billion expansion. The National Museum of Jewish Heritage (NJM), which is currently undergoing a major renovation,", "The next Biennial should be announced in the mid-February, but the event has not yet been canceled. The artist-run nonprofit Artadia has labeled the exhibition “a failure.”\n\n\nSoumya Aluko, the Nigerian artist who created a series of sculptures and paintings that combine African and Asian traditions, has died at the age of ninety-nine. Her work, which explores the concept of mythological realms and the relationship between myth and African and Asian traditions, began in the coastal town of Kano in Nigeria’s southeastern state of Ogun, and has since been exhibited at the Museum of Modern Art, New Delhi; the Museum of Contemporary Art, New York; and the Shandong Museum, Shanghai.Born in 1950 in the Nigerian city of Tobruk, Aluko moved to Tokyo with her family at age twelve, where she studied at the Tokyo Institute of Art before settling in Tokyo in 1963. She met and married Japanese artist Kiyosuka, whom she married in 1964, and their children were born in 1965. Aluko’s art began to gain recognition in Japan, where it was included in the exhibition “Otomo Otomo: Shun no Kuni no Kami,”", "The next Biennial should be on December 23–January 5, 2021. \n\n\nThe Duchy of Kent, which has had the historic site of a medieval monastery since 1607, will be restored to its full medieval glory through the renovation of its buildings and grounds. The ambitious project, which involved the excavating of more than 450 thousand Roman bricks and plans for a landscaped garden in the grounds, will reunite the historic monastery and the historic town of Kent.“We are thrilled to be able to open our doors and welcome visitors back again,” said Peter Wootton, the director of the museum. He added that the restoration of the museum and its grounds is “a major milestone in the museum’s history, and the culmination of a long-standing ambition to make the museum as accessible as possible for visitors from all over the world.”The renovation of the museum—which was completed in 2009 and received its first major facelift in 2011—is part of a major overhaul of the museum, which is currently undergoing a $75 million facelift. The project will also involve the installation of new displays and the creation of a new public gathering space in the museum, which will offer a more immersive experience for", "The next Biennial should take place in the urban districts of Paris, New York, and Hong Kong in 2021-2022, and in the former Azure Works in London in 2023. The 2019 edition was held at the architect-designed Grand Palais on the Boulevard Saint-Jean in Paris, and the 2020 edition will take place at the newly renovated Tate Britain in London. The biennial will also include a virtual reality exhibition.\n\n\nThe National Galleries of Scotland announced today that it is expanding the scope of its partnership with the Royal Institute of British Architects (RIA), with a new two-year grant. The extension of the RIA’s partnership with the National Galleries of Scotland comes on the heels of the RIA’s acquisition of the historic Scottish architect John Galloway’s design, the National Museum of Scotland, Cardiff, and the National Maritime Museum, Newport, in Wales. The acquisitions are part of a $25 million expansion program that also brings the National Maritime Museum's collection of former shipwrecks within reach of the public.“This is a pivotal moment for our partnership with the National Galleries of Scotland,” said RIA director Joanna Black. “We are now well positioned to support", "The next Biennial should take place on the thirteenth of February 2019 at the National Museum of Fine Arts, Tokyo. The exhibition will showcase the work of around 400 artists, including the last ten winners of the prestigious Art Prize, and will be preceded by a retrospective of the exhibition at the National Gallery of Art, Tokyo, in November 2020.\n\n\nThe museum that has hosted the first international MoMA concerts in New York City since the institution opened in 1962—the Metropolitan Museum of Art—is being investigated for violations of the 1933 Wagner v. United States Rebellions against the Imperial Japanese Army (USRA) Act. In a lawsuit currently before the Southern District Court in Manhattan, New York, a group of veterans is asking for the prosecution to drop the charges.“This is a victory for the brave men and women serving our country and our country’s flag,” said Jesse Eisinger, a lawyer who represents the plaintiffs. “The Met is now facing a serious and immediate threat of losing millions of dollars in revenue as a result of the actions of these protesters. Today’s ruling sends a clear message that these actions will not be tolerated.”According to the New York Times, the David H. Koch Foundation,", "The next Biennial should be held in 2020, but the festival has since faced cancellation due to concerns over the coronavirus. In a statement issued by the festival, organizers said that the decision to suspend the event was made after a thorough review by the board of directors of the Biennial Art Foundation. It said then that it would only consider whether an extension of the event was necessary if there was a risk of a second wave of Covid-19 cases. The board found that the risk of such a second wave was remote, but they said that the board would consider whether it was in the best interests of the festival. \n\n\nThe Los Angeles County Museum of Art (LACMA) announced today that it plans to open an outdoor sculpture garden in the museum on Saturday, February 22. The new venue will be called the Foster Art Institute and will host a series of performances, including The Shepherd, a collaboration between Zina Saro-Wiwa and Jim Jarmusch, and Art + Politics, a solo exhibition organized by the artist and activist Yoko Ono, and the artist Leonor Carron, on February 25.The first show, titled “In the Garden,” will be in the museum’s outdoor plaza", "The next Biennial should begin the month of March with the exhibition of the work of artist and political theorist Michel Houellebecq. The exhibition will feature work by twenty-one artists in addition to the exhibition, which will be preceded by a biennial of contemporary art in the capital city of the French Republic, the city of Lyon. The first show in the series will open on March 19. In the second exhibition, thirty-six contemporary artists will present their works in a city in the heart of the French Republic. The biennial will last for three weeks and will be the last.“We had hoped to create a show of the work of the young in Paris, as well as the work of the great French artists of the 1960s, but the recent attacks and the possibility of the imposition of a system of terror in France, especially in the Parisian suburbs, has seriously affected the series,” said Marc Payot, the CEO of the biennial. “We will continue to present the work of the young and the artists of the 1960s through our online platform, and we will continue to work with the French government, with the approval of the artist’s association, to ensure the security of artists and the artists’ associations", "The next Biennial should launch in the spring of 2021 and will take place in the backyard of the artist’s apartment in New York, where he remains based. The exhibition will include works by such artists as Monir Shahroud, Kiki Smith, and Eva Lechner. The exhibition, titled “Creative Destruction” and curated by Marina Kudacki, will be on view until January 20, 2021, at the artist’s studio in Manhattan. In June, the museum opened its first permanent installation of work by the Croatian artist Maria Dallin, of whom the Biennial is currently a part. Italian artist Dario Catellani will also present a solo exhibition at the museum in the spring of 2021. \n\n\nThe National Gallery in London, which was forced to cancel a major retrospective of the artist-designed works of American painter Frank Gehry in January due to the virus, has appointed Mark Hudson as its new head of contemporary design. Hudson is the first non-British Indian to hold the post. He succeeds Caroline Criado, who served for five years as director of the museum before she was appointed chief executive by director Maria Balshaw.Balshaw has announced that she plans to leave", "The next Biennial should take place at the Museum of Modern Art in Chicago in 2021. \n\n\nThe Rose Art Museum in Seattle and the Seattle Art Museum in Queen Anne's have announced that the institution will reopen to the public in September. The museum’s new 140,000-square-foot building will feature more than 850 works by fifty-five artists, including Eduardo Paolozzi, Ed Moses, Ed Ruscha, and Andrew Kreps, as well as a new section dedicated to the experimental work of modernist/post-apocalyptic artist Werner Herzog.The Rose opened to the public on September 5, the same day that the second edition of the Seattle Biennial, “Vision,” was set to take place. The exhibition focused on the work of twenty-six artists, including Samuel Beckett, H. G. Wells, and Pierre-Auguste Renoir. The exhibition also unveiled the first permanent works by thirty-six other artists, including Billy Rose, Laura Owens, and Harry and David and Mary. The fourth edition of the Seattle Art Museum biennial, “The Wires,” opened on August 31. In the spring of 2019, the museum had already staged an exhibition of work by twenty-", "The next Biennial should be held in 2020, the artist said. \n\n\nA group of artists and filmmakers from the United States, Canada, and Israel have been invited to participate in the sixth iteration of the Israeli pavilion at the Fifty-Ninth Venice Biennale in May 2020, which will take place at St. Mark's Cathedral in Jerusalem from March 28 to April 3. The event, titled “The Future Is Present,” will highlight work by underrecognized and/or forgotten artists. “In the current political climate, the Venice Architecture Biennale is particularly vulnerable,” said a statement issued by the fair, which was founded by the American architect Michael Sikora and the American urbanist Zaha Hadid. “We are honored to be supporting these three talented young artists, whose true potential lies not only in their ability to expand our understanding of the history of architecture, but in their ability to unpack our own preconceived notions and open up new modes of expression and thought.”The pavilion is comprised of eleven pavilions with multi-purpose platforms: the Orient House, a contemporary art experiment in Haifa; Medici Gallery, a contemporary exhibition in a former munitions factory in", "The next Biennial should be held in 2020. According to the New York Times, the museum will also be taking steps to reduce its carbon footprint through a number of initiatives, including installing new energy-efficient light fixtures, installing more local materials in its displays, and redesigning the museum’s collection, which comprises more than 3,000 objects. In order to push the installation of a new exhibition, titled “The Unseen World” in 2020, the museum will hold a special exhibition that will take up themes of “the unseen world” and will partner with the Electronic Slavery Museum (ESM) in Amsterdam and the Deweze Gallery in London. The full list of participating arts and cultural institutions is as follows:Academia - Berkeley, California: Closed until further notice, beginning March 14, 2020, and beginning March 16, 2020. Amsterdam: From March 14 through March 16, the museum will stage three exhibitions per week. Art Forum, New York: From March 14 through March 16, the museum will stage ten exhibitions weekly. New York: From March 16 through March 19, the museum will stage twenty-five exhibitions. Autodesk New York: From March 14", "The next Biennial should take place in the fall of 2020.Submissions for the 2020 edition are currently open and open to the public.\n\n\nThe Lisson Foundation at the University of Pennsylvania has appointed Amber Brackens as its new senior curator. Brackens currently serves as an adjunct professor at the Graduate Center of the City University of New York, but is also a scholar and the co–director of the Center for Urban Research and Development at Penn.The foundation has released new guidelines for how institutions are preparing for the 2020 edition of the Lisson Affair, which is expected to open in March. The guidelines, which have been inspired by the history of the exhibition, emphasize the importance of institutional engagement with the event.“Like the past, the 2020 event will be a collective work that unfolds with the Lisson Foundation at the center, showcasing the work of emerging and established artists and local scholars, with a view to demonstrating the richness of the collection,” said Bridget K. Lisson, chair of the Lisson Foundation. “It will be a collective experience, and the foundation’s efforts to advance the work of emerging artists will be recognized anew.”Brackens, who arrived at the foundation from the University of", "The next Biennial should be held at the end of the second year of the exhibition, as selected by the Art Newspaper for its 'most important art of the last six months'.”The commission of the prize was announced by the museum in conjunction with the exhibition “The Host: Art and the Culture of Life” (2017–18). The first show, “Photographs by Franz Kline, 1955” was opened at the Museum of Contemporary Art, Los Angeles (MCA) in January 2018.Kline’s work will be included in “Photographs by Franz Kline, 1955”“and ‘Photographica’ (”2019),” as part of the exhibition “The Art of Photography” (2019). The other works in the show will be included in “The Nude: Photography and Visuality” (2019); “Avant-Garde Art and Cinema” (2019); “Anna Atkins: The Nude” (2019); and “Laura Owens: The Naked” (2019).\n\n\nThe Holmdel Gallery in the Netherlands has received a gift of more than 3,300 works by artists such as Piet Mondrian", "The next Biennial should be held within the next four years. The first Biennial on the Georgian-Egyptian city of Ashkal in Georgia will be staged in 2020.  The next will be the first dedicated to the history of art in the former Soviet republic of Kazakhstan. In subsequent years, the exhibition will focus primarily on culture, symbolically and historically, and will be divided into two halves, one half curated by state-run institutions and the other by independent organizers.The 2019 edition of the Biennial, titled “Зодольном,” was organized by the Central Institute of Contemporary Arts and the Arts of the Russian Federation (ММИКК), and marks the culmination of the second half of the project, which was conceived as a “Museum of Modern Art” in the city of Astana. The museum will be modeled after the Museum of Modern Art in the United States, with the addition of a gallery, a digital library, and a library of more than one hundred works. The first full-scale exhibition of works by the artist-in-residence, “Kalina,” will open in the city of Kias", "The next Biennial should take place in the autumn of 2021. The exhibition will involve artists from twenty-two countries and will be curated by Adam Tinker, director of the Museum of Contemporary Art, Los Angeles; Karen Woon, curator of modern art at the Museum of Contemporary Art, Los Angeles; David Zwirner, director of the Museum of Contemporary Photography, New York; and Rory Mulligan, curator at large of modern and contemporary art at the Contemporary Art Museum St. Louis. \n\n\nThe British Museum in London announced today that it will invest more than $460 million into its collection, including more than $90 million in works on display, to ensure that it remains a significant cultural and global force in the decades to come. The Tate’s investment includes the sale of eleven works by artists whose work has recently resurged, including Kenzo Tange, Robin White, and Lynn Kaplan, and the investment in its collection comes at a time when the museum is rebuilding its holdings following a major renovation project, which will take more than a decade, and is focusing on acquiring works that will strengthen the museum’s reputation and attract new audiences.“The museum has faced many challenges in its history, but none was as challenging", "The next Biennial should be titled “A Matter of Life and Death.” The theme will be the actions of a man in a desperate struggle to save a child from drowning. Figures such as John Lennon, Paul McCartney, and John Waters will be featured in the exhibition, which will run from March 14 to March 17, 2020 at the Museum of Fine Arts, Boston.\n\n\nThe Free Museum of Art in New York has announced that it plans to remove a monument commemorating the victims of the 2012 terrorist attack on the United States diplomatic mission in Benghazi, Libya, which killed Ambassador Christopher Stevens and three other Americans, including an Australian diplomat.The renovation of the museum’s David Hall of Honor, which opened in 2012, was completed in 2017. It included the unveiling of the museum’s first permanent installation of art, an exhibition titled “Museums and the State: An Exploration of Art and Politics,” a three-dimensional sculpture by artist Tawanda Akbarnāhr, and the museum’s first performance-based installation, “Ions in the Sky,” a live performance installation by contemporary artist Hernán Díaz.The political unrest spurred by the death of George Floyd in the", "The next Biennial should be staged at the London site in 2021. Artforum will be attending the opening ceremony. \n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of thirty-one works by artist Kerry James Marshall from the late Chinese-American artist Jia Yu, whose works were among the first to be digitized by the Art Fund in 2010. The works, which also include works by both Chinese and Western artists, are on display in the exhibition “The Present: Contemporary Art in the Age of Xinhua” at the Whitney Museum of American Art in New York.“Upon learning that MoMA’s collection included works by some of the most important artists of the twentieth century, I was inspired to organize a special exhibition dedicated to these artists,” Marshall told Artnet. “I wanted to engage with the artists’ practices and their legacy in order to ask questions about their practices and their own practices. I wanted to find ways to bring their works to life.”The gift includes works by artists such as Wen Ling, Li Zhijie, Zhou Duyi, and Yaxue Cao. The exhibition will also highlight the relationship between the artists", "The next Biennial should be held at least once a year and should include artworks by at least four artists in each category. It will be hosted at the São Paulo State University (São Paulo) and will be preceded by a book club event. The 2019 edition of the Art Biennale will be held at the Resseade de São Paulo, the opening of which was postponed due to the Covid-19 pandemic.The Brazilian city of Recife, which is home to more than 70,000 people, has also pioneered new ways to distribute aid. Its new $80 million city-wide emergency food and emergency relief plan, which went into effect on January 1, will distribute 4.4 million meals and 850,000 rupiah (approximately $75 million) worth of nonperishable food items in the city. According to the New York Times, as many as 15 million people will be served meals in the first month.The new policy has proven controversial , and the city has faced numerous attacks from protesters who have accused the government of using the emergency food and relief package to push through unpopular social programs. The government counters that it only plans to distribute food and other emergency relief supplies when there is a need for", "The next Biennial should be convened in the spring of 2020. According to Erdogan’s spokesman, the president is confident the security situation will remain under control. The text of the document sent to the assembly reads: “The security situation in Turkey is not allowing people to re-emerge from the resort area. It is allowing them to return to their homes and enter the country from the borders of the Kurdistan Region, which is also taking part in the regional dialogue. We hope that the authorities of the Kurdistan Region will clarify the decision and implement the decision in accordance with the laws of the country.”\n\n\nThe City of Atlanta, Georgia—which was the epicenter of the coronavirus outbreak in the United States—has announced that it will not build a new hospital or add new medical centers in its downtown area. Instead, it will create over thirty thousand square feet of free outdoor space in the city for local artists and other cultural workers. The city’s Department of Economic Development announced the expansion of the Atlanta Cultural and Arts District (ACAD) in a release, which reads: The City of Atlanta has invested more than $100 million into the revitalization of the downtown core in the last twelve months. We", "The next Biennial should be announced in the fall. The commission will draw from the biennial’s existing collection, as well as from new works created and arranged by artists whose practices have not yet been formally recognized. The full list of artists is as follows: Daniel José Otero Daniel Abraham Daniel Lewis Daniela De Sousa Daniela De Sousa’s first solo exhibition in the Americas, 2017. Daniel J. Martinez Daniela De Sousa’s first solo exhibition in the Americas, 2017. Danielle Gregson Daniela De Sousa’s first solo exhibition in the Americas, 2017. Danielle Oliver, Daniela De Sousa, Daniela De Sousa’s second solo exhibitions in the Americas, 2017 and 2018. Danielle Oliver, Daniela De Sousa’s second solo exhibitions in the Americas, 2017 and 2018. Danielle Oliver, Daniela De Sousa’s second solo exhibitions in the Americas, 2017 and 2018. Danielle Oliver, Daniela De Sousa’s third solo exhibition in the Americas, 2017 and 2018. Danielle Oliver, Daniela De Sousa’s", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it plans to open its first digital museum in the United States, called the Digital Museum, in 2020. The museum will be located in the architecturally-pleasing former auto body shop at 801 West Twenty-Fourth Street and will house the collection of the Israeli artist Nona Friedman, who first traveled the world by plane in the 1930s.The museum will house thousands of artifacts from the work of hundreds of prominent non-Western artists including Ellen Frankenthaler, William Kentridge, and Robert Irwin, among others from the first wave of artists who immigrated to the United States from Europe in the 1920s, including Ellsworth Kelly, Cézanne, and Pablo Picasso. The museum will also be able to host an exhibition of work by contemporary artists such as Heidi Segal, Hélio Oiticica, and Zina Saro-Wiwa.\n\n\nArtist-run spaces in London have been targeted by a new series of mysterious but destructive fires, which have forced evacuations and destroyed at least twenty buildings and leveled entire neighborhoods. According to the Art Newspaper, the fires have damaged at least sixty buildings and are", "The next Biennial should be held in the spring of 2021. The organizers have proposed that the exhibition be staged in the city of Barcelona, which has a population of around 363,000, and that a retrospective of Art and Architecture be presented in the summer of 2021.The exhibition will be curated by Leo Castelan, director of the Institute of Contemporary Art. The fifty-ninth edition of the 100-seater exhibition will be held in the city of Almaty, Kazakhstan, from March 22 to March 26, 2021. The event will be held at Galerie Nari to the south of the Museum of Modern Art, which has relocated from its original location in the city of Almaty to the Kiasma Art Museum in the capital of Kazakhstan.The new venue will be inaugurated by a retrospective of artist Karol J. Munk’s most recent exhibition, “Munk’s New World,” at the Kiasma Art Museum in Almaty. Closing the exhibition will be a film by Maren Roesler, entitled “Avant-Garde” and presented by the late Italian architect Dario Franceschini. A retrospective of the Italian artist and theorist Landini,", "The next Biennial should take place in the spring of 2021.\n\n\nBillionaire collector Diane Ravitch has been accused of illegally funneling more than $1 billion into the controversial art museum in Jerusalem, the Al-Aqsa Mosque complex, and other charitable organizations. Dr. Deborah Gonsalves, a lawyer and art historian, discovered that she was the target of a politically motivated lawsuit after she launched a complaint on behalf of the Sakhnin Foundation, a Palestinian organization that works with Palestinian artists and promotes their work.The complaint alleges that the Detroit-based collector and philanthropist funneled funds into her personal and family wallets through charity auctions, gift cards, and other risky business practices. Gonsalves claims that the situation became untenable when she learned that the Sakhnin Foundation was planning to move its headquarters to the West Bank. She claims that the move would harm Palestinian artists and that she is prepared to go to court to stop the organization from moving to the West Bank and take their works elsewhere.Gonsalves claims that she spoke with the founder of the Sakhnin Foundation, Heba Saleh, and the two agreed that the move would not harm the artists and that the organization would remain in Israel. However, when", "The next Biennial should take place in the United States. Another is being held in New York, in 2022, with a third in Amsterdam, in 2023, and a fourth in Detroit, in 2027.  The fifth and final edition of the Biennial will be held in Chicago, in 2029, and will be held in partnership with Chicago Architecture Center (CAC), the Museum of Contemporary Art (MoCA), and the City of Chicago, in 2021. The museum will also stage a new exhibition on the life and work of Karl Lagerfeldt, “In the Beginning,” which will open in 2020 and run until 2024. The 2011 exhibition “In the Beginning” attracted some 2,500 visitors, including hundreds of children and adults.  The exhibition, which was organized by the Dutch architect Karl Lagerfeldt and his wife, Frida; the family’s descendants; and the descendants of the original owners of the estate, which includes the historic Winnebago Cultural Center and is home to the Winnebago Art Museum, the Catoctin Museum of Art, and the Museum of American Art. The new partnership between CAC and the Museum of Contemporary Art", "The next Biennial should focus on “art and politics,” said curator and curator-at-large Nina Adams. “We should be able to see how these historical events—the birth of democracy, the fall of the Berlin Wall, the release of political prisoners, and the denial of fundamental human rights—have much in common across art and politics.”The new initiative will be organized as part of the 2018 exhibition “Art and Politics” at the Museum of Modern Art, which opened on September 4 and runs until November 3. It will also feature works by artists such as Louise Bourgeois, Alighiero Benitez, and Leslie Buell. The exhibition was curated by artist-in-residence João Martins and will feature new works by selected artists from the biennial’s 2019 collection. The show will be accompanied by three digital exhibitions.The exhibition will also feature new works by artists from the exhibition “Colombia,” which will be presented on November 27. This exhibition will include “New Worlds from the Biennial: Two Color Narratives,” by the Colombian artist María Berrada. The exhibition will be followed by an exhibition of the work of Laura", "The next Biennial should be the fourth, and it is possible that the first will take place in 2019. The theme, “My Body, My Rules,” will be about the body as a tool for our social, political, and economic life, and will revolve around a question that has bedevilled contemporary values: what is the body? The exhibition will also be organized as a series, with the theme of the exhibition being its own work.“This is a critical moment for the body and the body’s place within the political and social life,” said Sir Kent Jones, chair of the Royal Commission for the Creation of the Royal Institution of Arts. “The Biennial is one of the few places left where the body can engage with the world in the way that the body can engage with the world.”The biennial, which was commissioned by the RCA and will run from May 20, 2019 to April 23, 2020, was established in 2009 in response to the 2012 London bombings, and is a collaborative project between artists, academics, and researchers. The exhibition, which will take up the theme of the biennial, “The Body and the Politics of Color” , will present the", "The next Biennial should take place in 2020 and will be a follow-up to the upcoming editions of the Museum of Modern Art (MoMA) and the Whitney Museum of American Art. Christopher Wool, curator of contemporary art at the Museum of Modern Art, told the Art Newspaper that the exhibition should include a rethinking of the museum’s holdings and the museum’s relationship with the artist and institutions that have donated works—and a new discussion of the future of art collections.In a review that appeared in the March 2019 issue of Artforum, Edward Chiu wrote: “Wool emphasizes the fact that the need to receive the art of the 2019-2020 year is not a luxury that can be had again and again. Rather, it is a necessity. This is a time of great change and it needs to be understood as a necessity.” The full text of the review can be found here.\n\n\nThe Carnegie Museum of Art in Pittsburgh (CMA) has announced that Jonathan Pryce will be the next director of the large and beloved Art Institute of Chicago. He succeeds Helen Flagg, who retired in March after twenty-two years at the helm of the museum in May.“The museum is thrilled to hire Jonathan", "The next Biennial should focus on reinterpreting symbolic lifeworlds through a feminist, queer, and trans-explicit lens in order to address the question of what it means to be a woman in a patriarchal and trans-historical world. The 2020 edition of the Biennale will be staged on February 27–March 2, 2020 at the Bienal de Paris, the Centro de Cultura della Artes, and the Montparnasse, respectively. The twenty-third edition of the Biennale will be hosted in the city of Alminey, Turkey, on March 3–March 5, 2020.\n\n\nThe Lisson Gallery in New York is launching a new commission-based platform to support artists and critics in need. The platform will be powered by a collection of works by the artist-in-residence, the biennial’s programming director, and the artist-in-residence’s daughter, as well as by a collaborative platform called the Artist-in-Residence Coop.The platform will allow curators, critics, and artists to social-gaslight each other and collaborate online. The platform will also include resources and resources for artists, including a monthly cash stipend", "The next Biennial should be held at the Museum of Modern Art, New York, in 2021. The next Panorama Film Festival, which will be held at the Museo de Arte Contemporáneo, Buenos Aires, in 2022, will be held at the Arteporía, Madrid, in 2024. No date for a new Artforum film festival has yet been set.\n\n\nAfter the Museum of Contemporary Art (MoCA), Los Angeles announced on Tuesday that it is restructuring its artistic program in order to decrease the museum’s reliance on donations. The announcement comes on the heels of a statement made by MoCA director James Turrell, who said that the institution is planning to “use the last of our fundraising to reinvest in our artists’ work, our mission, and our artists’ relationships with the museum.”Turrell made the comments in an attempt to address how art museums should be governed under the new California Values Act, which will take effect on January 1, 2021. The bill aims to “balance the economic and cultural needs of California’s arts and cultural institutions, while ensuring access to funds for vital capital repairs and to create new opportunities for the arts and cultural workforce.”", "The next Biennial should take place at the venue in 2021.Commenting on the forthcoming exhibition, Biennial Director Susanne B. Vossen said: “The Biennial is a medium for which to share in the experience of life on earth through the art of humanism. In a time when we are overwhelmed by ideologies, we find it difficult to reconcile our belief that art can shape our world with the reality of artmaking. We are proud to present the art of the future at Diller Scofidio + Renfro’s headquarters on Ashford Street. The new exhibition will showcase the work of around seventy artists that will be exhibited in the exhibition in May.”\n\n\nIn the months leading up to the fifth edition of the Edinburgh Biennale (ED5), which will take place at the historic Old Exhibition House in Edinburgh on September 25–29, organizers of the event were preparing to provide critical guidance for the 2019 edition, which will focus on the themes of “life and death,” “spirituality and technology,” and “the spiritual journey.”“We are very excited to be bringing the Edinburgh Biennale to New York next year, and to engage our contemporary audiences", "The next Biennial should be held in August 2020.\n\n\nThe Institute of Contemporary Art (ICA) in Vienna and the Kunsthalle BIS at the University of Vienna have teamed up to launch the Future of Art Workshop. The fourteenth edition of the ICA Inaugural will take place at the BIS and will feature twenty-three artists and their works across twenty-six themes. The project aims to create a new platform for research, dialogue, and collaboration on European contemporary art.The show will be organized in three parts: part one will be a cataloguing of the exhibitions that will be on display at the program; part two will focus on the themes of the exhibitions; and part three will explore the visual arts. The first part of the show will be on October 14–November 16. The full list of participating artists is as follows:Casey-Marie Charbonneau (France)NINA KLEIN (Germany)Ticke Bakken (Norway)Catherine Bohl (Germany)Dina Bohl (Germany)Christoph Bergmann (Germany)Yara Bolzano (Italy)Xavier Bonham-Hammadi (Switzerland)Simon Brown (United Kingdom)Josée Bon", "The next Biennial should take place in 2022. \n\n\nGerman artist Rainer and his wife Wolfgang Gropius, who won the Prix d'Or for their space-age work The City of Flying Spaghetti and The City of Sirens, will collaborate again in the not-too-distant future. The two have been working together for twenty-four years and are currently collaborating again, this time on a new project that will be held in a new National Museum in Berlin. The Gropius brothers first collaborated in the late 1980s, when they built a geometric schematic of the cosmos in the form of a silver cylinder. They then collaborated again between 1996 and 1999, when they created a two-dimensional landscape of preludes and postludes in the form of a single, multi-limbed sculpture, called Sacher Kirchengesi. The Sacher Kirchengesi also features a palace-like setting, a temple, and a massive sculpture, the Sacherkirchengesi, which was made to stand twenty-six columns, each twenty feet tall and weighing more than twenty thousand pounds. In the past, the Gropius brothers have been working together as a team, with Rainer at the helm", "The next Biennial should be held in 2022.  The artists who were chosen for the twenty-fifth edition of the competition are:  A.J. Panza (Mexico), Christo,  C.J. Andrew, D.J. Christopher, Dara Denée (United Kingdom),  Daniel D. Koyama (Japan),  David Koster (New York),  Dirk Martensen (Germany),  Daniel Martensen (Germany),  Dirk Neugroschel (Germany),  Dingdai Dangdai (China),  Dorothea Rockburne (United Kingdom), Dorothy Spring (Japan),  Dorothy Tung (Taiwan), Dorfán Tesar (Switzerland), *Theatre of the Modern Girl (India), Dorothy Wong (China),  Dorothy Wong (China),  E. Methuselah Koerner (Germany), E.J.C. Jones (United Kingdom), E.J. Hoffman (United States),  E.J. Hoffman (United States),  E.K.D. (", "The next Biennial should be here soon.”\n\n\nThe British Museum (BMP) in London has appointed Kate Pickering as its new senior curator of works by artists such as Renata Coroni, Yinka Shonibare, and Hans Christian Andersen. She succeeds John Peacock, who left the institution in February 2019 to become head of the US-based design studio M&K; the newest member of the BMP’s curatorial team, and will assume her post in September 2020.“I am extremely excited to take on this new role as curator and to work with the extraordinary team at the BMP,” Pickering said. “This is a challenging and exciting time at the BMP, and I look forward to working with you to help shape the future of our exhibition program and the BMP. I am eager to collaborate with the BMP’s talented curators and artists to better understand how art and design intersects with art and design today and into the future.”The new curator will be responsible for showcasing the museum’s collection of more than 6,400 works by artists in the United Kingdom, which comprises works in its permanent collection at the institution and works on view in", "The next Biennial should be held in Italy, in November 2021. \n\n\nThe Newark Museum of Art (BMAs) in New Jersey has received a gift of more than sixty thousand photographs by renowned African American artist Norman Mitchell, who often used his body to expose the dehumanizing effects of institutional racism and the state. The donation of the works, which were donated by a group called the Mitchell Trust, comes at a crucial juncture for the museum, which has been struggling since its founding to rebuild its holdings of Mitchell’s work\u0097with the goal of eventually restoring a full-scale exhibition dedicated to him.The 1936 exhibition “Norman Mitchell: The Man in the Mirror,” was the first major retrospective of Mitchell’s work, and the first to be organized at a museum in the United States. The exhibition drew some of his earliest critics, including Robert Irwin, the author of Norman Mitchell: The Man in the Mirror, and its curator of the same name, but was cut short by the Great Depression. The show’s final year featured thirty-one works, many of which were never exhibited.The trust’s gift of the works was a major victory for the museum, which has been working since March to", "The next Biennial should focus on the possibilities and challenges of new media, especially as it relates to the production and preservation of art in digital time, and should focus on issues of data and technology, the digital environment, and the relationship between artists and the digital world. The deadline for the Submission Awards is January 13. The first exhibition, “On the Spreading of a Black Sun,” will be on view at the Museum of Modern Art in New York from January 15 to March 7. For the show’s second semester, the biennial will follow the 2013–14 academic year, with the opening of “Ghost and Space” and of “Theater of Operations: The Gulf Wars 1991–2011” at the Art Institute of Chicago.\n\n\nThe museum has appointed David McAllister as its new deputy director for research and exhibitions. He succeeds Robin D. Salter, who has helmed the department for more than twenty years.“David has been instrumental in developing and building the museum’s collection of modern and contemporary art, and in driving the museum’s artistic vision,” said John Fitzgerald, the director and CEO of the Chicago Art Institute. “The museum is in", "The next Biennial should be held at the museum, in 2021.The museum has also received a $2.5 million grant from the Nelson-Atkins Foundation.  \n\n\nThe Centre Pompidou in Paris is once again facing a major lawsuit after a group of local residents complained to the museum about a high-speed rail link between the institution and the Centre Pompidou, the former site of the Pompidou in the French capital. The city council of Paris has launched an investigation into the complaints and hopes to receive more information from Toulouse-Le-Claire-Atlantique (TEC), the French state agency tasked with overseeing the project, in the coming months. The lawsuit was filed by a group of activists after the Centre Pompidou opened in 2005 as part of the redevelopment of the Sursock Square area of the city. The Center Pompidou was set to open in 2020 but halted the project after the local municipality of Toulouse–Les Réserves (the governor of the region, Laurent Gnevin, objected to the construction of a new building on the site of the former Simca Museum in 2007, the same year a bill granting him a major increase in", "The next Biennial should take place in the city in the seventh or eighth month of the year, and should include a selection of ninety works by artists, including Felix Alÿs, Tuyma, and Haitani.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it will divest from the fossil-fuel giant Royal Dutch Shell and reinvest in local communities throughout the region through its Baltimore-based nonprofit, the B.I.C.E. and its arts and culture incubators, the Baltimore Rebuilders Center (BRCC), and the Baltimore-based Center for Cultural Innovation (BCCI), which seek to advance the civic, educational, and economic revitalization of Baltimore.“The museum is committed to the local communities that Shell serves and that creates for our local communities,” said Elizabeth Gilbert, president of the museum. “We will continue to work with our partners at every level to support local families, communities, artists, and businesses to create and strengthen the local economy.”The trustees of the B.I.C.E., which was created in 2017 by Charles and David Rothenberg in partnership with the nonprofit organization Artscape, also announced that ten local artists will be given", "The next Biennial should take place in 2021. Artforum has contacted Richie and Deborah for comment and will update this report with their assistance. The full list of participants in the inaugural Biennial:\n\nFirst Place: Katherine Jennings Kahler (New York)Second Place: Jean-Michel Basquiat (New York)Third Place: Carla Silver (New York)Fourth Place: Josée Bénédich (New York)Fifth Place: Charlotte Byrd (New York)Sixth Place: Merry C, Jr. (New York)Fifth Place: George A. Lucas (New York)Participants of the following year’s show in New York: Jean-Michel Basquiat (1957), Tamara Dean (1958), Dario Catellani (1959), Claudia Corrigan (1960), Nina Corrigan (1962), Maggie Crosby (1963), Thierry Dalladian (1973), Alfred A. Nesper (1975), Carlos Alberto Balsom (1979), Paul Baranek (1979), Marc Baran", "The next Biennial should be held at the Museum of the African Diaspora (MoAD) in Cape Town, South Africa, in early 2020. The event will be hosted by a multidisciplinary group of curators and scholars.Among the curators who have been nominated for the award are Jared Diamond, László Sze, and Ana Mendieta. The ten shortlisted artists are: Munem, Bamba, Michelangelo, Pierre Huyghe, and Simone Nickerson. The future of the award, which was established in 2018 by a group of curators, is currently in the hands of the American Foundation for the Arts, which will decide whether to award the annual $10,000 award. The work of the shortlisted artists was selected from a shortlist of three artists, who are not from the US, that were nominated by a panel of curators, including Trinneya Kukama, Hilda Schuman, and Lémence Bénétière. Schuman and Bétière are among the curators nominated for the prize this year, which will be given in the coming months. The shortlisted artists are: Munem", "The next Biennial should focus on the trans- and interdisciplinary work that has been published or is on display at the museum. The next exhibition should focus on life and art from the fifteenth century to the twentieth century, with a particular interest in the work of the Florentines, the Palazzo Grassi, and the Flemish artist Jan Kral and the late Italian architect Carlo Cipollini\u0097the Concretists. The entry criteria for the forthcoming exhibition include visual art, sculpture, performance, writing, and photography.“We are certain that the sixth Biennial will be a watershed event, as it will mark the end of an era,” said Joachim Neugroschel, president of the German-based German-Italian Cultural Foundation. “The exhibition will be a new type of performance/art, integrating and enriching the works already exhibited in the museum. The theme of the exhibition is ‘Nature and the artist’s body, and the exhibition will be a reconceived life and its art in a radical way.”In February 2019, the Flemish museum Luzernägen, in the city of Baden-Baden, announced it would no longer exhibit", "The next Biennial should be held in 2020. As a result, the institution will keep its location in Montréal and will donate the proceeds from the event to the local community.The exhibition “Touched’s Embrace: How Art and Technology Are Remaking Life,” which will be presented by curator and curator of modern and contemporary art Adrienne Edwards, will reopen with a three-day event. The event will focus on artists and their works, including works by the late American artist and dancer Eva Hauser, the French avant-garde artist and activist Frida Kahlo, and the late British artist Oliver Hall, as well as on the intersections between art and technology and will celebrate its thirteenth anniversary in March.The first event of the new decade will be the 2018 Bienal de Paris, which will be held at the Paris Institute of Contemporary Art in December. The biennial will be curated by Marta Lluís da Pontecorva, a curator of modern and contemporary art, culture and architecture, the life sciences, and sustainability, and will include three quarters of the works by the twenty-seven-member group. The biennial’s inaugural exhibition, “Touched: Art", "The next Biennial should be held in 2021. The 2019 event was held at the National Museum of Fine Arts in Beijing. The date for the 2020 event has yet to be announced.\n\n\nThe Museum of Modern Art (MoMA) in New York is working with the Egyptian Museum of Art (EMI) to create a new exhibition devoted to Egyptian art. The initiative, called the Egypt Beyond the Walls, will explore how Egyptian art has survived and reemerged in the United States.The exhibition will feature works by fifty-three artists and will open in January 2021. The exhibition will also feature recordings of works that MoMA curated in 2015, including El Hadjiyeh’s Surrounds, 2016, and Lygia Bicchier’s “Just a Quiet Voice,” 2012–13.The exhibition was inspired by MoMA’s acquisition of an original work by Egyptian artist Ali Atef, who created the work Abu Dhabi, in collaboration with MoMA curators Dayana Atef and Saleh Al Shehab. In the exhibition, which will be on view until May 21, the artists will stage a retrospective of the work in the United States in 2020.In", "The next Biennial should celebrate the work of the forty original artists who have participated in the exhibition. The artists will be selected by a biennial committee comprising artist and curator Alexandre Lanard; architect Alexandre Ahtone; educator Xavier Hufkens; and artist Joseph Benalou. The exhibition will be held at the Museo de Cultura Curatorio in the city of Madrid from April 21 to April 23 and will include the works of the artists whose work is currently on display in the exhibition.\n\n\nThe National Gallery in London has been awarded a £7.5 million grant from the National Lottery Heritage Fund, which was created to reinvigorate and support the collection of art from the National Lottery and is currently running a £200 million campaign to raise £500 million for its future. The building society SCAD Fund also donated £5.5 million to the project, which has been described as a “gift from the heart to the collection’s collection,” and the Samuel Johnson Trust also pledged £5 million.The Tate, which has five hundred and fifty-two works on display at the National Gallery, was handed £3.5 million from the Lottery Fund. SCAD Fund, which has", "The next Biennial should be held in February 2019, with the theme “The Emergence of Experience in a Post‐Crisis World.”\n\n\nThe Centre Pompidou in Paris has received a gift of 180 works from the wonderful Maurizio Cattelan. The gift includes approximately ninety works from the collection of the Italian architect Bimbo Milo, who was a friend of Michelangelo’s, and from the collection of the artist Nino Gattoni, who is a friend of John Casanova. “The work of the two men is truly exemplary,” said the architect, who is known for his intimate relationships with both men.Together with their families, the four artists will present the work “L'Ancienne Turin,” a monumental reconstruction of the world’s oldest fountain, on the city’s rue Saint-Louis, in February. The work will be exhibited at the Museum of Modern Art in New York in October.Cattelan, the CEO of the firm Cattelan Posen, donated the works in the first place. He bought the works from Milo in 1988 and presented them at the Venice Architecture Biennale, where they were", "The next Biennial should be held in 2020. \n\n\nThe Goethe-Institut in Munich, which will shutter August 5 to September 3 due to Covid-19, has announced that it plans to open a new digital art space in the building’s former space on September 5. The new event, called “Unter Kunstbau im nach dem Kunstischen Künstler,” will be organized in collaboration with museum guests, and will follow a series of lectures, performances, seminars, workshops, and presentations that will focus on the themes of how art and culture can be understood as both spiritual and material objects, and how art and culture may serve as a means of re-creating the spiritual landscape.“The digital art space will be accessible to visitors from September 5 to September 7, with free admission for everyone on September 5 and free admission for children and youth from September 5 to 27. The exhibition will be free to the public from September 5 to September 7.”The Goethe-Institut was founded in 2002 as a nonprofit, and then a photography museum. The institution also added a private exhibition space in 2011, and expanded its collection by twenty-five years in", "The next Biennial should take place in 2021–18. Paris’s Stedelijk Museum is helming a 2020 iteration of the Hong Kong pavilion.  The 2020 edition of the Deutsche Pachse Berlineled Kunsthalle (DPK) featured the artwork Die Lauternöse and the 2018 edition of the Hong Kong pavilion was a bit more eclectic. Described as “a mixture of European and American art,” the fair will draw more than 3,500 visitors. “Traditionally held in late spring or early autumn, the 2019 edition was held at the end of May, and the 2015 edition was held in late July or August,” said Frank van der Heide, director of the DLR Berlin. The 2020 edition will be held in the autumn. \n\n\nThe Museum of Contemporary Art (MoCA), London, has appointed Victoria Miro as its next director. Miro comes to the institution from the London-based consultancy firm WPP, where she previously served as director of London’s Tate Modern and as chief executive of Zugspitzeil, a UBS bank. During her tenure at MoCA, Miro helped the", "The next Biennial should be held in 2021. It will then have a new title: 'The Artist’s Millennium.” “The Artist’s Millennium: Drawing From the Past to Present,” will be the theme for an exhibition organized by the same five artists as the exhibition, called “The Artist’s Millennium: Drawing from the Past to Present,” in November 2019. The show will showcase the work of ten artists from the Palazzo delle Papesse in Rome, Italy, and will run for twelve weeks. The exhibition will mark the sixty-fifth edition of the Venice Biennale.\n\n\nThe South African Institute of Art (SAI), Cape Town, has announced the launch of a new public platform, “Art South Africa,” which will present the work of seventy artists from twenty-seven countries and territories through August 2020. The platform will also offer digital content and support services for artists and their families.“We are thrilled to launch this new platform, which will engage directly with the South African art world,” said curator Selwyn de Kooning, SAI’s director. “The platform will provide artists and collectors with tools to", "The next Biennial should focus on the history of cinema and the exhibition process in Italy,” said Michelangelo Cattelan, director of the institute. “The next edition of the Biennial will not only reflect the current artistic and artistic-historical situation of Italy but may also be a timely project for the Italian cultural landscape.”The first edition of the biennial, curated by the Italian curator Bruno Mocenigo and presented by the Italian architect Vittorio Benigni, was held in 2017 and was nominated for a Pulitzer. The exhibition was nominated for a Golden Lion for its exhibition “Cinema,” which was organized by Filippo Mazzoli. The finalist for the award was Italy’s Andrea Bertolotti, who created several masterpieces in the exhibition’s “Definitive” section.\n\n\nThe Museum of Modern Art (MoMA) in New York has acquired the expansive works of Israeli-born artist Nava Gershon, whose surreal, painterly compositions embody a sense of poetic justice and the power of a form that is both both narrative and mythologized. Gershon’s work will be included in the museum’s", "The next Biennial should take place in 2020. \n\n\nThe Art Newspaper, an English language publication representing the British art world, has received a gift of the rare metal aluminum from London-based collector and philanthropist Martin Gilbert. The bronze sculpture, which was created by the artist John Guildford, will be installed in a major overhaul of the National Portrait Gallery in 2020. The first phase of the renovation began last fall, and pushed the installation date to 2020. The second phase will likely be completed next year.“The gift of aluminum is a momentous occasion,” said Martin Gilbert. “It marks the richly originality of Guildford’s monumental sculptures, which are so much in keeping with his style. The work of Guildford and his family are one of the most important works of contemporary art.”Guildford’s aluminum sculptures are a diverse array of works that combine sculpture, painting, photography, architecture, and design. They are a departure from the conventional, which has been considered a luxury, and are rooted in the past. In emphasizing the past, he avoids the modernism and the idealized that is prevalent in contemporary art. Instead, he injects a warm environment of natural elements that evoke", "The next Biennial should be ready in the spring of 2020, and the first in the autumn of 2021. The biennial’s organizers, Art Basel, say that the design team worked for months to develop a new project for the 2020 edition in the form of a cage sculpture. “At first we were going to create a new floor plan and a completely new experience for the exhibition, but we eventually realized that this was the best way to present it,” the museum’s director, Marta Kudacki, said, “and that the best thing we could do is to continue to design and innovate, which is why we are creating more opportunities for our artists to develop their own projects.”While the theme of the 2020 iteration of the Biennial is “expanding the limits of the body” and the 2020 version of Erasmus+ will be a “multi-layered exploration of the concept of the body,” the theme of the museum is “emotion.” “We are striving to create a new kind of exhibition, a new kind of museum,” Kudacki said. The 2018 and 2019 editions of the show, “Idole", "The next Biennial should take place on January 22, 2021. The exhibition will include works accompanied by a letter from the artist requesting a grant from a bilateral foundation to purchase the materials necessary to complete a work. The grant will be given to the artist for the purpose of crowdfunding.The winner will be chosen by a jury consisting of Bertrand Guénel, director of the institution, Jean-François Meynell, director of the Biennale de Lyon, and Diego Césaire. The jury consists of Angel H. Alighier, the founder of the biennial, and Amane Jouanno, the director of the Biennale de Lyon. The award is one of the most prestigious in the country\u0097the France Adventure Foundation will also receive a generous $1 million for its inaugural edition.\n\n\nThe French government is planning to set up a new federal agency to oversee the restoration and conservation of France’s historic monuments. The plan, announced on Wednesday, outlines five broad categories: cultural monuments, heritage sites, places of worship, historic monuments and cultural artifacts, and heritage sites with special cultural value. Under the plan, the Culture Ministry will create seven new bodies to oversee the", "The next Biennial should take place in 2021 to coincide with the centenary of the birth of Rosa Luxemburg.\n\n\nThe Donald D. Simon Prize for Contemporary Art has awarded $5.6 million to the artists and organizations that have made significant contributions to the development of American art over the last ten years. The award, which was established in 2006 by a 2000 act of Congress, was established to honor the achievement of the late multi-award-winning artist D. Mery. Since its inception, the prize has awarded $3.5 million to forty-three artists and organizations.The 2018 prize cycle, which included work by sixty-five artists and institutions, featured work by twenty-eight finalists. The winners were selected by a jury made up of Kirsten A. Miller, director of the Whitney Museum of American Art; Jerome Alan Simon, executive director of the Brooklyn Museum; Jay-Onie Hsu, the director of the New Orleans Museum of Art; and Junot Diaz, the executive director of the Los Angeles County Museum of Art. The biennial will run from October 19 to October 26, 2020.“The award cycle for the Simon Prize is an exciting opportunity for the community to engage with the artists and consider", "The next Biennial should begin in the autumn of 2020, and would likely take place in the Fall of 2021. Alexandra Vassallo, a specialist in modern and contemporary art at the Museo de Arte Contemporáneo in São Paulo, added: “The legacy of Biennial Maribor will be strengthened through a meaningful revival of the exhibition program. The Biennial Foundation will continue to support and promote the future generations of Brazilians with programs that, in turn, will inspire future generations.”\n\n\nThe National Galleries of Scotland’s acquisition of the iconic Cullom Art Museum in Edinburgh is set to begin in July, and will be accompanied by a second sale, of the National Museum of Scotland, in Aberdeen. The acquisitions will comprise works by fifty-eight artists, including François Truffaut, Pierre-Auguste Renoir, Hans-Ulrich Obrist, and Sixto Pozo, and will be on view in the institution’s new building, which will be completed in 2021, in the autumn.The acquisitions were made in the months of November and December 2016, the month of the 2016 European Union–2017 general elections, and the month of the first anniversary of the coron", "The next Biennial should take place in spring 2021. The goals of the biennial are to \"implement a digital and social experience of the exhibition\"; to present twenty new works by forty-four artists; to present a film by the Colombian artist Lina Gallardo; and to focus specifically on the work of Colombian artists.\n\n\nDia Art Foundation has announced its representation of Mpagi Sepuya, whose remarkable, multi-layered works are filled with self-reflexive and abstractions. Sepya’s paintings are characterized by their ability to play with the idea of light and shadow, their use of light and shadow, and their delicate balancing of light, light and shadow, and the light and shadow of light. Their work has been exhibited at the Berlin Biennale (2017), the Aichi Triennale (2016), the Florence Biennale (2016), the Venice Biennale (2015), and the Minneapolis International Biennale (2014).Dia Art Foundation is represented by Mark Beasley Gallery in New York. Lichtenstein Associates, New York, has represented the artist for twenty years. Sepya’s work has been exhibited in forty-five international exhibitions, including the Fifty-Sixth", "The next Biennial should be the tenth edition of the Edinburgh Biennial, which will take place in 2020 and will be hosted at the Four Seasons Hotel in Edinburgh, the Hilton Artspace in London, and the Edinburgh Festival in 2021.Selection committees comprising artist, art historians, and curators set the theme for the event and will showcase works by forty-two artists. Each biennial will culminate with a gala reception for the artists, followed by a book signing for the artworld and for the galleries.The Edinburgh Art Gallery will host the inaugural edition of the Edinburgh Festival in 2021, which will take place next year. The Royal National Life Gardens in London will stage the inaugural exhibition of the Royal Institute of British Architects (RIL), which will be staged at the Rimmer Group in 2018, and the Royal Shakespeare Company, which will stage the fifth edition of the Royal Festival Hall in 2021. The Tate will stage the Edinburgh Festival as part of its 'Edinburgh Documentary' series in 2020 and the Tate Modern will stage the Edinburgh Festival as part of its “Edinburgh Triennial.” The three-day event will be followed by a three-day retrospective of the work of twenty-six British-based artists in 2021.\n\n\n", "The next Biennial should be held in 2021. The first was held in 1998 and featured work by some thirty artists. The biennial was organized by the Museum of Contemporary Art Berlin and was curated by Wolfgang Maximilian Schäfer.\n\n\nThe Kunsthalle Basel in Switzerland has decided to cancel the next edition of the Kunsthalle Kunstverein (Kunstverein Waldorf) in March 2021 because of the Covid-19 pandemic, the German daily Frankfurter Allgemeine Zeitung reports. The exhibition was supposed to take place in March, the previous date for the 2020 edition. Although the event will now be moved to spring 2021, organizers said the move was not related to the novel coronavirus.The cancellation comes two weeks after organizers of the event, whose previous venue in Saint Paul, Minnesota, was forced to move the event to February after the city of Minnbach in Germany received a novel coronavirus. The exhibition was originally scheduled for March 26–March 29. The museum has since been given an extension to move the exhibition, titled “The Technicolor of Jörg Strassburger,” from March to April, and will now hold an extra month", "The next Biennial should be one that addresses the history of the exhibition and will aim to create a new kind of reception for the collection. The exhibition should take place in a museum in a city designated for it by the city of Zurich, and the biennial’s curator should be chosen by the city’s mayor, Dieter Bode, and the city’s board of directors.The Biennial of Contemporary Art, which will be held in 2022, will be hosted by the Museen Kunst-Bauhaus in the Swiss Alps and will feature works on all four major continents—Africa, Asia, Europe and America. The full list of participating artists is as follows:Ariana Heller (NYC)Michael Kors (LA)Anish Kapoor (India)Tania Mpagi Sepuya (India)Karrar Khalili (Africa)Michael Kors (CA)Kunsthof.Bauhaus. Berlin.Bienalbau. Frankfurt.Bienalbau-Kunsthof. Frankfurt.Caucasus Foundation (USA)Jeffrey Gibson (USA)T.J. Dillinger (USA)Steven Knapp (USA)Rebecca Larsen (USA)", "The next Biennial should take place in the autumn of 2021. The exhibition of works by the selected artists, which will feature the work of forty-three artists, will also be moved from the Museum to the newly constructed venue. The opening of the new exhibition will be on September 21.\n\n\nThe Chocolate Factory in Moscow, which was scheduled to open in June and has been closed since April due to the Covid-19 crisis, has announced that it will reopen on May 27. The show, which is curated by Anna-Sophie Ruiz, will move to a new venue in the city of Nizhny Novgorod. The reopening will coincide with the International Chocolate Festival, which will run from May 25 to May 28.A full list of the participating galleries is as follows: Alexandria Gallery, Moscow; Art and Cheese, Moscow; Casa Del Pilar, Madrid; Carriageworks, London; David Kanda Gallery, Nairobi; Dada-Workspace, Berlin; Diller Scofidio + Renfro, New York; Diller Scofidio + Renfro, Brooklyn; Gallery of the Contemporary Los Angeles; Koch Gallery, London; Morello Show, New York;", "The next Biennial should be held in the second half of 2020. The twenty-third is currently on view, and the twenty-fourth is scheduled in February 2021.The announcement of the seventy-seventh edition of the Venice Biennale comes on the heels of the seventeenth Venice Architecture Biennale, which was also held in the spring of 2020, and the twenty-fifth Venice Design Biennale, which was held in March 2020.  “For the past fifteen years, Biennale organizers have devoted their time, energy and passion to develop and deliver the physical and intellectual environment for the exhibition,” said Bernd Wunder, the organizing director of the Venice Architecture Biennale. “The upcoming edition brings together the best of contemporary architecture and design in a special and innovative way. The partnership between the sixth and the ninth architecture stages is based on the foundation of two principles: the importance and the necessity of the body, and the building itself not only as an artistic and cultural space but also as a practical tool for innovative thinking.”The Venice Architecture Biennale will be held at the Palazzo Veneto, Venice, from March 25 through March 28, 2020. \n\n\nThe National Gallery in London", "The next Biennial should be held in the spring of 2020. The festival will run from March 19–March 22 and will draw twenty-one artists and forty-five contemporary designers. Its theme will be Design and Resistance.\n\n\nThe Minnesota Museum of Fine Arts (MFA) in Minneapolis is launching a new digital platform and training program to help artists and collectors identify and preserve works in the collection. Called the Minnesota Works of Art, the platform will be developed with the help of a team of curators and researchers from the MFA. The program will include a database that allows the public to search for works by artists and their families, a portal where the public can purchase works and other materials by the same or a different artist, a community forum and artist retreat, and an online catalog.“The MFA’s digital works and exhibitions have helped make this a challenging time for many collectors and we are committed to helping them navigate a challenging world,” said MFA director and CEO Glenn McClellan. “This project began as a way for me and the curators to collaborate and develop new opportunities for our artists and collectors, and it has become a way for our artists and collectors to connect and collaborate.”The new platform is", "The next Biennial should examine the role of food and culture in the formation of new identities, identities shaped by visual imagery and language, and identities that are linked to the body and the environment. We are still in the process of understanding the ways in which food and visual culture are connected to the body and the environment.”\n\n\nThe United States Congress voted yesterday to establish a new national museum of the American Latino, which has been dormant since 2009. Established by a single-member majority, the museum’s board of directors voted to authorize $7 million in funding to create the museum, which will sit on the National Mall, the Smithsonian Institution, and a 50,000-square-foot building adjacent to the National Museum of Hispanic Art in Washington, DC.The museum will consist of a collection of more than two hundred thousand artifacts that have come from the Southwest, including burritos, burrito plates, burrito cravings, burrito crepes, burrito drinks, burrito tins, burrito sheets, burrito stamps, burrito tamales, burrito tifos, burrito trays, burrito cups, burrito plates, burrito bases, burrito palaces, burrito plates and burrito dishes", "The next Biennial should be held at a location that currently hosts a Chinese institution and should involve the collection and display of contemporary art; and a third conference should be held in the spring of 2020.\n\n\nThe Nevada Museum of Art (NMA) has announced that it will reopen its doors once more than six months of the year have passed since the institution’s March 2020 reopening. The institution is now planning to charge visitors $10 per day to visit its galleries, a move that will significantly reduce the museum’s annual operating budget.Museum director Morgan Neville-Lochner said: “We are reopening because we believe it is the right thing to do. The NMA’s physical spaces and collections are better positioned to withstand the effects of the pandemic and financial hardships for the many years to come. Our staff, our students, and our visitors deserve a real and tangible return on their investments. We are optimistic about the museum’s future.”The NMA was forced to lay off thirty-three employees, reduce the hours of more than 1,500 employees, and furlough or reduce programming in April. In May, the museum announced it would temporarily close its locations at 1575 S. First", "The next Biennial should take place in 2020.  \n\n\nThe New Museum in New York has hired D.J. Thomas as its new senior curator of contemporary art. Thomas will be responsible for presenting the institution’s first exhibition of contemporary art since 1989, “The Island of the Real,” in January 2021.“D.J. has been an outstanding curator for twenty-six years, and his work has appeared in more than twenty-five exhibitions, including the Fifty-Fourth Biennial of the Modern Art in Miami Beach and the Fifty-Fifth Biennial of Japanese Art in Tokyo,” said New Museum director Daniel H. Weiss. “His gifts and talent are a perfect match for the museum and a perfect fit for the city of New York. We are delighted to be able to present his work at the New Museum, and look forward to his continued engagement with the museum and the city of New York.”In the spring of 2020, Thomas received an award from the New Museum for his curating of the exhibition “The Elimination of Fear: Modern Art and the Destruction of Life” at the museum. The show, which was organized as part of the museum’s divestiture initiative,", "The next Biennial should be held in the spring of 2021. The new exhibition “Art and the Body: Contemporary Art from the Twentieth Century” will be inaugurated by a special exhibition of works on paper by the Italian artist Lucio Fontana at the T.G.E.C.E. on September 25. The exhibition will be followed by a special exhibition of work on paper by the American artist Panacheka Matera in the spring of 2022.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has launched a new digital platform designed to help artists and collectors navigate the museum’s collections. Called the Gallery Search, the platform will index the holdings of the museum to help users determine their future exhibition plans.An artist seeking to buy one of the fifty works on display in “The Color of Life” will be able to select from a list of fifteen works, which will be accompanied by a personal video describing the experience. The artist will then be able to select one of the works to view in the gallery, and the museum will present the subject of the exhibition in the gallery for six weeks. The user will be provided with a free preview of the work in the gallery. Digital previews of", "The next Biennial should take place in the city, in the capital, and will be open to the public between February 17 and February 23. The first show, titled Art in the Time of Crisis, will feature new works by twenty-five artists in the midst of various social and political upheavals. A second exhibition will be entitled The Sea and the Trees, in collaboration with architect and former city designer Yayoi Kusama, in January 2020.  While the exact date for the third show, titled Constructing Futures, has yet to be announced, the artists involved say it will be in April.* \n\nThe Institute of Contemporary Arts (ICA) in Vienna has received a gift of twenty-seven works by German artist, Bernhard Lüders, whose kaleidoscopic, even avant-garde, paintings of sculptural and landscape forms, frequently clad in thin cloth and often in cardboard boxes, make up Human Flow.Lüders, an Austrian-born artist whose practice spans painting, sculpture, performance, photography, sound, and installation, amassed the works over a two-year period, starting in 2011, during the height of the global financial crisis. The corpus includes Japanese contemporary", "The next Biennial should be held in the spring of 2022. \n     After Charlotte Brontë, James Joyce, and Virginia Woolf, the British Museum finally voted to abolish its long-standing ban on female curators. After an outcry from activists, the institution reversed itself and voted to allow women to serve as curators again. The decision was hailed as a victory for cultural equality. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has removed a work by German-born, New York–based artist Janice Brill that was included in the exhibition “Architecture of Consent: Women and the City of New York” (2016–17), which was organized by the Museum of Modern Art (MoMA) and the Brooklyn Museum.The work—which was on display in “Architecture of Consent” alongside work by contemporary artists such as Renata Graziano, Hela Benito, and José Camargo—captures the emotions of two women, a housewife and her daughter, in a conversation that takes place in the kitchen of the family’s two-story home in the Adirondacks. The exhibition also featured the work of local native artists such", "The next Biennial should be held at the same time as the upcoming exhibition, which will feature work by twenty-four artists from the Department of Painting, Design, and Textiles. It will also be the first major retrospective of the artist’s work in Italy since the death of Silvana Cipolletta in 2016.\n\n\nThe Italian government is considering creating a new national museum dedicated to the art of postwar and contemporary art. It has invited conceptual artist Francesco Cipolletta to present the museum’s first exhibition, “The Future of Art: Its Historicity in the 21st Century,” at the Museo d’Arte Moderno in Rome in September.Cipolletta’s exhibition will take the form of a traveling retrospective of his work, which consists of thirty-six long-term collaborations with international and local artists over a twenty-year period, from January to June 2020. The institution will present the works in a variety of media including film, television, sculpture, painting, photography, and printmaking.Cipolletta’s first project for the museum will feature three paintings, each commissioned by different artists, which have an extensive and interlinked narrative. The", "The next Biennial should be held in 2020. If the theme is “Toward a Spiritual History,” the twenty-seven-week, artist-in-residence program would follow the biennial’s theme, “Spirituality and History: From the Christian Middle Ages to the Present.” The next edition of the biennial will be held at the Washington Art Museum in 2021.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for how museums and cultural institutions that receive federal financial assistance should interact with the local, state, and federal government. The guidance, which address issues such as the display of artworks, the distribution of materials, and the repair and restoration of historic structures, was issued in response to a new law passed earlier this year that aims to provide millions of Americans with more affordable, accessible, and effective health care.The guidelines outline how museums can collaborate with local, state, and federal governments to enhance the health and well-being of residents of their communities through the promotion of cultural exchange and the collection of local cultural resources; provide direct financial assistance to museums that may not be able to otherwise afford to repair or restore structures in their communities; and offer grants to help museums", "The next Biennial should be held in 2019, and the thirty-sixth in 2020. For the foreseeable future, the event will remain open, with the exception of the usual programming.\n\n\nFrance will soon begin restricting the number of people allowed entry to its national museum sites. The country’s Culture Ministry has issued an order that requires that visitors must book time slots online and will suspend the weekly visit by visitors to the Palazzo del Prado, the Punta della Dogana, and the Centro della Dogana, and the Museum of Modern Art in Rome, among others.The ministry also announced that it plans to boost the number of visitors to the Palazzo del Prado by 40 percent, and the Museum of Modern Art in Rome by 30 percent. The Centre d’Arte Moderne (CAFAM) in Paris, which only recently received a renovation and expansion of the Palazzo del Prado, will also see its attendance and revenue increase. The National Museum of Fine Arts in Bordeaux, France, will also see an increase in visitors, with the museum planning to double its capacity to 390,000 visitors by 2020.The museum of modern art, which sits on the Via della Citt", "The next Biennial should take place in 2021. The 2019 edition, titled “Past Present,” was held at the Museum of Contemporary Art (MoCA) in New York. The museum was forced to cancel the exhibition after organizers received a $125,000 protest from a group of former exhibitors who claimed the show wasn’t worth their time. The exhibition was rescheduled for 2022, but only after a similar protest from the group of former exhibitors.\n\n\nThe German government announced on Thursday that it plans to allocate €150 billion ($168 billion) to help the country’s cultural sector in the wake of the Covid-19 pandemic. Chancellor Merkel said that the funds will go “well beyond the scope of current Federal aid programs” and will go “where necessary” into “institutions of higher education and research and think tanks.” The funds will be divided into three categories: $150 billion for institutions and $100 billion for think tanks.The move has drawn a mixed response from cultural figures. For Bonnier Stiftung des Bundes, which organized the announcement, the plan represents an “historic step” and is supposed to “serve as a clear", "The next Biennial should aim to 'dismantle' the European Union’s migrant policies, while at the same time considering the sustainability of cultural institutions and their buildings, the exhibition and transport system, and the cultural sector, as well as the sociocultural and artistic landscape in general. The fourth edition of the Barcelona Biennial will open in the city of Almería on October 27.\n\n\nThe Museum of Modern Art (MoMA) in New York has removed a display featuring drawings and paintings by Stanley Donenfeldt and Adrienne Atget from the museum’s public viewing rooms in an attempt to promote a more egalitarian, environmentally friendly future. The institution said that the exhibition, “Out of the Blue: Art and the Environment” was “part of our mission to present works that address important philosophical and aesthetic questions.”In the exhibition, a selection of paintings by the American artist, which were acquired through Donenfeldt and Atget, titled Away From the Sun (1969), were staged in order to show how the environment is affected by the sun and how such changes affect the evolution of plants and animals.“The change of climate is the process that began with the melting of", "The next Biennial should take place in January 2020, at the Museo de Arte Contemporáneo in Beijing. The exhibition will be a continuation of the previous editions of the Shanghai Biennial, held in November 2017 and February 2021.\n\n\nThe Kunsthalle Basel has announced that it will not participate in the upcoming edition of the Basel Salon d'Art Contemporain (BSAC), which is scheduled to take place in June 2020. Instead, it will host a special edition of the event hosted by the museum in August 2021.“We believe that the future of our art and design communities lies in collaboration with our peers, in the digital world, and in the physical world,” said Kunsthalle Basel director Beverly Dufgran. “We hope that our participating gallery will support us in this important work and in this final stage of our collaboration.”The event will be hosted by the Kunsthalle Basel in its new and upgraded space, the Bodega republik, on the ground floor of the museum. Excluding the galleries, the event will take place in a contemporary auditorium on the main floor of the museum. The exhibition will be divided into", "The next Biennial should be on the history of art in the United States, in 2020, and will include a selection of works by forty artists\u0097including Michelle Alanbault, Denzel Curry, Frances Adams, and Joyce Carol Oates\u0097in the city. The event will then return to New Orleans, in 2020, and will reconvene in the city again in 2022, when the theme will be “holiday.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $1 million donation from the Lin-Manuel Miranda Foundation, a group that supports organizations working with and for Latino artists. The donation, which comes in conjunction with the completion of the organization’s 150th anniversary, will support the MFA’s arts and culture programming, the museum’s collection, education, and outreach.“The gift is an extension of the foundation’s ongoing work to support artists and their practices in Los Angeles,” said Veronica Bautista, director of the foundation. “We are grateful to the Lin-Manuel Miranda Foundation for helping us to finish the project, recognizing the impact that the work of our museum has had on the development of our collection and the creative", "The next Biennial should be in the spring of 2020. The next will be in the fall of 2020. The next will be in the spring of 2021. The next will be in the fall of 2021. The next will be in the spring of 2022. The next will be in the spring of 2022. The next will be in the spring of 2022. The next will be in the spring of 2022.The next will be in the spring of 2022. The next will be in the spring of 2021.The next will be in the spring of 2021. The next will be in the spring of 2021.The next will be in the spring of 2021.The next will be in the spring of 2022. The next will be in the spring of 2019. The next will be in the spring of 2021. The next will be in the spring of 2021. The next will be in the spring of 2021. The next will be in the spring of 2019. The next will be in the spring of 2020.  The next will be in the spring of 2019. The next will be in the spring of 2021. The next will be in the summer of 2021. The next will", "The next Biennial should focus on “architecture and design” and “art and art history.” The exhibition’s aim is to look to “architecture and design” as a kind of ‘grand narrative.”The exhibition should be led by two artists, Pierre and Yulia Gavrilova, in collaboration with Boba Fett and Karl Lagerfeldt. The biennial will be held at the foundation of the new museum in the city of Oren and will be inaugurated by a symposium on the history and design of the Russian city of Tomsk. Three of the artists selected for the inaugural exhibition are active artists of the Russian avant-gardes but are not associated with the museum.\n\n\nThe National Gallery of Scotland announced today that its director, Stewart Jackson, has been appointed as the new director of the National Museum of Scotland. Jackson will be responsible for leading the institution for twenty-four months, during which time he will visit Scotland every other year and will serve as an advisor to the institution. “We are thrilled to welcome Stewart to the National Museum of Scotland,” director Rines Brown said. “He brings with him an exceptional record", "The next Biennial should be held in the spring of 2021. \n\n\nThe Centre Pompidou in Paris has named its next president, Nathalie Bondil, the artist-in-residence by invitation. Bondil, who has been representing Paris’s Art Nouveau group since the 1990s, will take the helm of the institution from Marcel Prouvé, who retired after a decade in March 2019.“Prouvé was in the process of forging a project for the extension of the museum and of the Centre Pompidou, which would become the new Center Pompidou-Dieu [COPD]),” said Bondil. “Now that we have a new project, an important institution, I am equally excited to take on the role of director and to continue to work with experts and students. The work of the CTD and the art of the Centre Pompidou are very closely linked. I am deeply interested in working with them to strengthen the visual arts and to develop a new kind of museum that embraces the city of Paris and the city of Pompidou.”She added that she is eager to work with the CTD and Prou", "The next Biennial should be held in 2021. The Museum of Modern Art, New York: The museum is planning to hold its next major self-organized exhibition in 2022.  Dubai: The Dubai Art Museum has released a statement in response to the recent terror attacks: Dubai: The Dubai Art Museum and the Ministry of Culture are under the full control of the authorities. The institution is conducting internal investigations and is working with relevant authorities to prevent any mishaps or disruptions to the exhibition and programming. The Museum of Modern Art, New York: The museum is currently conducting an analysis and evaluation of its security arrangements to better understand the lessons it may have learned from previous incidents. We will share more information as it becomes available.  The Chicago Art Institute: Chicago’s celebrated contemporary art institution, the Chicago Institute for Art, has postponed its thirteenth-annual, which was scheduled for October 25–28, 2019, and is instead planning to move its next iteration, which will take place in Helsinki in 2021, to the fall. The move represents a commitment to the local arts and culture in both the United States and the City of Chicago. The move also coincides with the conclusion of a $110 million renovation", "The next Biennial should be held in 2020, with the original date of 2019. The biennial will take place on the former site of the Pompidou in Paris and will feature works by thirty-four artists, including Amalia Catellani, Carla Calvo, David Abdal, Hélio Mariscal, Iris Moll, and Omari Ramírez.\n\n\nThe museum is reopening to the public in West Palm Beach, Florida, following a $400 million expansion, on January 21, 2020. The complex, which comprises fourteen exhibition spaces and an audio-visual center, will transform the Museum of Contemporary Art (MCA), the Museum of Fine Arts (MoFA), into a world-class contemporary art museum.“The newly expanded MCA is proud to present the exhibition ‘Architecture of Bliss’s ‘HORIZON: 1988’ at this year’s Venice Architecture Biennale,” said MCA director Susana Bruguera. “We will also present the exhibition ‘REMEMBER’ at a special event at the MCA in 2020 as part of the celebration of the twentieth anniversary of the rebuilding of the museum. The exhibition will introduce", "The next Biennial should take place in the autumn of 2021. The question is whether this will be enough to persuade the artists and intellectuals of the region to commit to the city of Sydney to host the next edition of Art Basel. In a letter delivered to the Art Gallery of NSW, the institution wrote: “This is a challenging time to be a student of art in Australia and to be a contemporary artist—the future of the Art Gallery of NSW seems inextricably linked to the future of Australia. We are urging you to act in solidarity with our fellow Australians by working towards securing a future for art in Australia for all of us.”\n\n\nAubrey Plaza, the groundbreaking artist, activist, and advocate for indigenous rights in the United States, has died at age ninety-two at her home in Los Angeles. The cause of death was cervical cancer, which was diagnosed early on in her illness, and was her last act of self-care.Born Aubrey Edward Plaza in 1937, she moved with her family to the small Pacific Northwest town of Mission Viejo, California, as a teenager. In the mid-’50s, she moved back to Los Angeles to live with her mother, who was working on a book about", "The next Biennial should take place at the iconic Barbican Art Museum in London between March and June 2020. The theme for this year’s edition, “Ecology”\u0097which is named after the English word for life\u0097will be “Intelligent Design”\u0097a phrase coined by artist and philosopher Noël Carroll. The theme of the twenty-fourth edition, “Future Tense: An Exhibition of Art and Science”\u0097which will temporarily open an expanded version of the Tate’s Science Museum in London in March 2021\u0097will be the same: “What is the future of art and art and science?”The 2019 edition of the prestigious international biennial, which was organized by the National Galleries of Scotland, featured work by more than 1,500 artists and was curated by Tate director Maria Balshaw. The event’s first performance was by Bechdel, who played with the concept of a “future post-human.”\n\n\nThe Museum of Fine Arts (MA), Boston, has appointed Michael Bird as its next director and CEO. Bird will assume his new position on March 1. During his tenure at the institution, Bird will oversee the", "The next Biennial should take place in December 2020 and will be open to the public. The event will be hosted in the Exhibition Hall of St. Louis, the museum’s former home. “We are excited to welcome our international audience to our next exhibition,” said Geert Aarhus, Biennial curator and director of the museum. “The exhibition will be a showcase of the works of internationally acclaimed artists. We are working to secure funds to bring the show to Saint Louis and are working with an artist and her family to develop a show for the museum.” Museum director Akira Okada added: “The work of these artists is so deeply rooted in BØST’s history. It is a tribute to them that their work is featured in our nineteenth-century institution. Our artists play a central role in shaping the course of our cultural and political landscape. I am thrilled that they will be included in the first exhibition of this kind.”The first exhibition of the new work\u0097“Annie Blair”\u0097which will be staged at the Contemporary Arts Center and will be curated by artist Jody Rogac\u0097will open on December 29. \n\n\n", "The next Biennial should take place in 2021, the year of the bicentennial. The 2019 edition, titled Blackout, was also canceled due to the coronavirus. What will happen next? Well, we'll just have to wait and find out. \n\n\nThe Roskilde Art Festival has announced that it will not be returning to Denmark next year. Organizers cited the coronavirus as the reason for the cancelation. The Danish Center for Contemporary Art (DCMA), which sponsored the 2019 edition of the event, said that the decision to suspend the event was made on the basis of patient safety concerns. Artforum has reached out to DCMA for a statement. The Danish National Museum, which will be closed for thirty days following the March 19 coronavirus outbreak, has yet to publicly comment on the circumstances of the canceled exhibition or the health of its artists and staff. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Stefan Cousin as director of its group show “The Power of Paintings” in its new partnership with the nonprofit MedCenter.“We’re thrilled to work with MedCenter to keep the show on schedule, on budget", "The next Biennial should take place in 2020. \n\n\nThe Four Seasons Hotel, the Bluebell Art Museum, and the Museum of Contemporary Art in the Arts have announced their partnerships with Sotheby’s. In a joint statement, they said “Connections is a collaborative program that provides the opportunity to present work by artists who have not yet received a solo exhibition at the museums. We are committed to continuing to support and develop works by artists who are currently in the process of connecting with museums.”The Los Angeles County Museum of Art (LACMA) announced that it will begin a series of engaging exhibitions by female artists. The first exhibition will open in March 2020 and will include work by Christina Benita Cisneros, who was awarded the 2013 Getty Medal, and will run until March 26. The exhibition will also feature work by members of the Los Angeles–based collective Nude Animals, whose members mostly work in the visual arts but also have significant experience in sculpture, film, and performance.The announcement follows the launch of its Women Artists Program, which aims to present new work by women artists. The program will focus on the work of women artists in the United States and will feature work by twenty-four artists, including Ana", "The next Biennial should take place in the 2020s and will be devoted to the history and the evolution of the American landscape from the perspective of indigenous peoples. “The museum now has the opportunity to engage with the very history within its own institution that is housed in a museum. As we work toward this exciting new chapter, I hope our new members will enjoy the journeys,” said Nicholas.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Harald Szeemann as its new board chairman. Szeemann, who has served as a board member of MoMA since 2016, will take the helm of the institution until January 2021. He succeeds Thomas Szaszko, who departed in the summer of 2021 to head the Metropolitan Museum of Art in New York, and will begin his tenure in January 2021.“The board felt that the best way forward for MoMA was for Harald to lead the museum through a transition in leadership following his departure and its reopening in 2021,” said museum director Matthew Teitelbaum. “Harald brings a wealth of experience, knowledge, and leadership qualities to MoMA and is a leader who will help MoMA continue to thrive as a global urban", "The next Biennial should start in the spring of 2021.\n\n\nThe Centre Pompidou in Paris is preparing to celebrate its sixtieth anniversary this year, but it will still be completely closed until the spring of 2021. The institution suffered a major blow last month when a major structural collapse of the building, which houses the Centre Pompidou and the Louvre, forced the evacuation of the entire complex.The announcement of the institution’s construction in November 2018, with the opening of the Centre Pompidou Museum of Art (CPM), was met with excitement from the local community. In a statement published on the Centre Pompidou’s website, the architects said: “This is the building that is destined to change the way we think about architecture, and is the most important building in the history of the museums.” The building will also become a major destination for visitors to the region. The project is expected to cost approximately $37 million.In a recent interview with the Art Newspaper, the architect Jean-Pierre Prouvé, who is responsible for the renovation of the Centre Pompidou, said that the building, which is located on a 9,600-square-meter site, will", "The next Biennial should be held in 2021. \n“The Academy is committed to supporting and defending the biennial’s objectives and its artists, and we’re working with our partners to develop a new vision for the biennial that reflects the contemporary artistic landscape,” said prize–winning curator and president Antony Hudek. \nThe inaugural edition of the Academy Awards, titled “For the Love of God” in honor of the milestone fifty-fiveth anniversary of the award, was canceled last month after the organizers discovered that the event would indeed take place in 2022. “The Academy has always been about making art,” said Wright Thompson, director of the Academy. “I’m glad that we don’t have to deal with this uncertainty, and glad that we can focus on our artists and on the work that we love.”The 2019 edition of the Oscars, entitled “Award of the Arts,” featured the works of seventy-six artists and was filmed in Los Angeles. The 2020 edition, titled “Award of the Arts,” will air on December 22, 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA", "The next Biennial should be held in 2022. “The dream is to create an exhibition that involves art in the city of Toronto and in the city of the arts more broadly, and that utilizes unexpected materials, new technologies and new materials that have not been used before in Canada’s history,” said Mark Towhey, chair of the board of trustees of the Biennale. “While there is a long way to go, the Biennale is moving forward in a way that is collaborative, collaborative, and forward-looking, an extension of our community.”The 2021 edition, “Between the Sun and the Moon,” featured work by fifteen artists, including Kate Crawford, Todd Henry, and Kelly Rind, among others from the United States and Canada, including Rita Gonzalez, Jodi Throckmorton, Phyllis Wheeler, Pia Zucher, and Robin Williams. The 2022 edition, “Unearthed,” will include work by artists from twenty-five countries and will be staged at a high-altitude laboratory in the city of Aachen, Germany, and will also travel to the Makran Desert in the Austrian Alps. \n\n\nThe Museum of Contemporary Art", "The next Biennial should take place in 2020. \n\n\nThe UMB Foundation, which is dedicated to the preservation and restoration of historic art and remains of African American heritage, has added more than twenty works by seventy-three artists—including Don Suggs, Sam Graves, and Larry Ossei—to its collection. Curated by Dwayne Chey, the director of the African American Studies Center at the University of Maryland, the exhibitions are part of the Foundation’s cataloguing initiative for the 2020–21 academic year, titled the Art of Blackness.“The collection’s exhibition format and the series of exhibitions that will unfold across its five floors will be aimed at examining the various narratives of African Americans, as well as the ways in which African American art has historically been represented, identified, and created,” said Chey. “This year’s iteration of the Art of Blackness exhibition will be a reflection of the themes that have been explored throughout the collection, and of the work that will be presented throughout the year.”Dwayne Chey and Sam Graves.  \n\nThe Institute of Contemporary Arts (ICA) in New York has appointed Deborah E. Russell as its next chief curator.", "The next Biennial should be held at the CNE in the fall of 2019.\n\n\nThe London-based cultural nonprofit the National Poetry Library (NPL) has appointed Caroline Ashenden as its new chair. She has been appointed by the Board of Trustees of the National Poetry Library (NPL) following the resignation of Yvonne Peacock.In her new role, Ashenden will work closely with Tom Sherwood, the former director of the National Poetry Museum (NPMS), to develop and implement a new set of guidelines for the collection and use of the institution’s collection of National Poetry, which comprises poetry, fiction, and nonfiction. Sherwood will serve as chair of the new commission.“The National Poetry Library is proud to appoint Caroline Ashenden as its chair,” said Sherwood. “She brings to the role of chair a wealth of experience and knowledge, having served as a curator at the NPMS for thirteen years and currently serves as the head of a consultancy firm. Her appointment enables us to further develop and enhance the NPMS’s collection of national poetry and her contribution will ensure that the NPMS is in the best possible position to continue to thrive under", "The next Biennial should be held before the end of the year, and the next one after that. For the past decade, the exhibition has presented works by contemporary artists such as Alexander Calder, Adam Clayton, and Tomás Saraceno. The few remaining works that have not been destroyed are the Russian artist Fyodor Dostoevsky’s unfinished The Birth of Venus, the final work of the 1960s Soviet artist Andrei Rublev, and a painting by the French Indian artist Clauss de Coucy.Prior to the exhibition’s permanent closure in 2008, the Biennial received global recognition, including the 1971 Venice Prize, the 1977 Venice Biennale, the 1987 Barcelona Triennale, and the 1992 New York International Biennial.\n\n\nThe Houston Museum of Art (HMA) said it is planning to reduce the physical footprint of its flagship exhibition “The Art of Life” by a third thanks to a $2 billion renovation, which will focus on removing the museum’s two-thousand-year-old glass-enclosed structure and allowing the environment to reshape the show\u0097the museum’s underground courtyard. The renovation, which is being spearheaded by architect Don", "The next Biennial should be held in 2020. \n\n\nThe Tate has announced that it is working with the University of Leeds to expand its online catalogue. Titled Symphony of the Senses, the exhibition will showcase work by forty artists in the exhibition and will also consist of an online version of the artist questionnaire.The launch of the online catalogue coincides with the launch of the Tutu “Sensations” series, which is curated by Keiran Lee. “Symphony of the Senses’s: a curated collection of contemporary work by forty-six distinguished contemporary artists,” reads a statement on the show’s website. “The essence of these artists’ lives is expressed in their collaborative efforts to reveal their collective lives through the use of a variety of media. Their work embodies the essence of their lives in the most direct and personal way possible. They live their lives through their media, creating images, sounds, and performances that express their lives in various ways but also address themes and feelings that are central to their lives.”Based in London and New York, the artists featured in the exhibition include Gertrude Albrecht, Edmund Barlow, Yvon", "The next Biennial should take place in 2020. “We are committed to the future of the exhibition and are planning for a future that is inclusive and responsive to the needs of all audiences,” said Philip Schwendener, director of the Kunsthalle Basel and former chair of Themes. Schwendener explained that the forty-second edition of the show will be integrated into the museum’s major renovation and expansion project, the massive new acquisition of its collection and its collection architecture. The museum will also be transformed with the aim of introducing new works by artists such as Édouard Vuillard and Édouard Gabouil. The exhibition will also be the subject of a major reopening of the Kunsthalle in the spring of 2021. Inaugurating the same venue will be the exhibition “1917: A Retrospective,” a wide-ranging survey of the work of its curators, including Hans Ulrich Obrist and Jörg Schubert. Curated by Robert Hooper, the biennial will also offer new exhibitions and collaborations with artists.\n\n\nThe Metropolitan Museum of Art in New York is rehiring twenty-six staff members who were laid off", "The next Biennial should be held in October 2019. The museum has also announced that it will reevaluate the Museum’s relationship with the Island of Guadalajara, which was reopened in January of 2019, and the next iteration of the exhibition, “The End of an Era,” will be staged in May 2020, with the full complement of the Island of Guadalajara, as well as all of the El Museo del Barrio.The museum has received a pledge of $5.5 million from wealthy American collector Richard Seymour, who lives in New York, to pay for a redesign and preservation of the institution. The funds will also go toward preserving the collections of three of the five former trustees of the museum: David K. Martin, Robert M. Lee, and Paul Mpagi Sepuya and Wangechi Mutu. \n\n\nThe Centre Pompidou is launching an ambitious new arts and culture plan to protect and care for the curatorial and artistic legacy of its famed façade. The plan will include the construction of a new twenty-seven-thousand-square-foot building that will serve as the Centre’s main exhibition space and will encompass two of the Centre�"]