[["Gracelynne Pinckney (b. 1968, Emmerich, Germany) is a physical and linguistic artist whose practice since 1994 has been perhaps closer to sculpture and painting than any other domain. She is preceded by two decades as the artist training herself as a nurse, and an MA from the University of Colorado in her prolific use of pigments and ceramics.\nQ. Was she trained as a nurse?\nA. Yes, she was trained as a nurse.\n\nQ. And were you educated as a nurse?\nA. Yes.\n\nQ. And did she practice for many years in Hyde?\nA. Yes.\n\nQ. And was she a long-standing member of the Hyde branch of the Royal College of Nursing?\nA. Yes.\n\nQ. And was she more recently with the Royal College of Nursing?\nA. Yes.\n\nQ. And were you its Chair?\nA. Yes.\n\nQ. And did you also work long-standing relationships with local nursing homes?\nA. Yes.\n\nQ. And was that in association with Mrs. Pinckney?\nA. Yes.\n\nQ. And was she indeed the hospital's general practitioner for many years?\nA. Yes.\n\nQ. Were you also responsible for drafting a number of the hospital's official medical records?\nA. Yes.\n\nQ. And was that in association with Mrs. Pinckney?\nA. Yes.\n\nQ. And did Dr. Shipman's attendance at the home in 1994 as described in his death certificate?\nA. Yes.\n\nQ. Were you also responsible for researching and writing the patient history in this case?\nA. Yes.\n\nQ. And did you also research and write the death certificate?\n"], ["Cothron Lask (b. 1959, Kyaiklat, Myanmar) is an artist who lives and works in New York. Recent exhibitions include Under the Big Black Sun: California Art 1974-1981 (Museum of Contemporary Art, Los Angeles, U.S.A., 2011) and The Crystal Quilt, installation at Tate Modern, 2012.\nQ. And the book that you were referring to a moment ago, what was that?\nA. Seashells and Sand.\n\nQ. And the type of material that you had in mind that you wanted to express?\n\nA. Just sand.\n\nQ. And what about the particular piece of sand that you were looking at?\n\nA. Under the stars.\n\nQ. And did you go and examine it?\nA. Yes.\n\nQ. And did you find any other markings on that particular piece of beach?\nA. Not that I can remember.\n\nQ. Did you then go and examine the canvas that you had just removed?\nA. Yes.\n\nQ. And what did you find?\nA. I found that the piece had been painted over, the scallops had been painted over, the paint had been applied to the canvas and the sand had been removed.\n\nQ. And the piece that you had just removed?\nA. Yes.\n\nQ. What did you do once you had found that?\nA. I painted over the paint.\n\nQ. And when you say painted over what did you mean?\nA. The paint had been peeled off, the paint had been peeled off and then there was a large amount that had been left in the paint.\n\nQ. And did you then go to the location where you had found the body of Mrs."], ["Maggese Tieng (b. 1940, Niš, Serbia) lives and works in the Serbian city of Kajak. At the age of sixteen, Kajak has already become a cultural icon around the world, and internationally.\nQ. And you have already mentioned the importance of the Serbian language and culture in your work, so would it be fair to say that writing in Serbian is more of a personal interest than it would be for a general practitioner?\nA. Yes. I always try and write in Serbian if I can.\n\nQ. So far as your mother is concerned, if you could please state please for the jury the state of her health?\nA. Yes. She had only been off work for about 3 months when a terrible incident happened which put her out of commission for a year and a half.\n\nQ. And of course if you could just explain to the jury how that dreadful incident happened?\nA. It was a car accident.\n\nQ. And how long the accident had been going on for?\nA. For the past 3 months and a half.\n\nQ. And the time at which she came back to work?\nA. She had just come back from her holiday.\n\nQ. And what time had she been back from her holiday?\nA. 5 pm.\n\nQ. And had she been back from her holiday?\nA. Yes, I think she had gone to the beach.\n\nQ. And then what happened?\nA. I went to the house. I tried to get hold of her but couldn't. I worked on her until, I don't know how long it was before I left her.\n"], ["Hazrat Francesco (b. 1935, Rạch Giá, Vietnam) was an artist who lived and worked in Los Angeles, USA. Since the 1980's, Francesco has been involved in a number of group exhibitions that have been compiled from the multitude of items that accumulate in his studio.\nQ. Would you just, first of all please be specific please about the exhibit that you are describing?\nA. That is a group exhibition of photographs and papers relating to the investigation of the death of Mrs. Lizzie Adams.\n\nQ. I am sorry but that is a document that has been produced by the Greater Manchester Police in 1994?\nA. Yes.\n\nQ. And is it a photograph of a house that is on the 1st floor of which only one bedroom is available?\nA. Yes.\n\nQ. And you have told us that that house is a flat number?\nA. Yes.\n\nQ. And you have told us that it is a flat number not a number in the middle of a house?\nA. Yes.\n\nQ. Where are we please?\nA. I am at the front door.\n\nQ. Who lives at the front door?\nA. The front door is unlocked.\n\nQ. In effect what is the situation?\nA. Mrs. Adams is in the room.\n\nQ. There is a view from the front door which we can see through?\nA. The front door is unlocked.\n\nQ. And you told us that the door is locked as well?\nA. Yes.\n\nQ. And you told us that you went into the flat number and that you saw Mrs. Adams sitting on the couch?\nA. Yes."], ["Femmy Manni (b. 1977, Najībābād, India) lives and works in Dhaka, Bangladesh. Recent exhibitions include A journey to the Moon, Postcards from the Moon (2017), and A Journey to the Heart of the Most Beautiful Day (2017).\nQ. You have received a number of different exhibits over the years. Were there other exhibits that you were able to review?\nA. I have read the full thing.\n\nQ. In general, did your comments and conclusions as to these particular exhibits?\nA. Yes.\n\nQ. And then finally, did you find any other exhibits that you were able to review?\nA. Yes.\n\nQ. Now did Dr. Shipman state that the exhibits were from the body of a deceased patient?\nA. Yes.\n\nQ. Can you tell us in general terms, please about the nature of the patient?\n\nA. She was a lady of average height and build.\n\nQ. And of average build?\nA. Yes.\n\nQ. And of average height?\nA. Yes.\n\nQ. And of average build?\nA. Yes.\n\nQ. And were you able to examine the body externally?\nA. Yes.\n\nQ. And the extent of internal decomposition?\nA. Yes.\n\nQ. And the extent of the internal organs?\nA. Yes.\n\nQ. And the degree to which they were affected by the decomposition process?\nA. Yes.\n\nQ. And the extent of the internal organs was there any pathological abnormality?\nA. No.\n\nQ. Can I ask you about the condition of the internal organs"], ["Mundhenk Plotzker (b. 1938, Bogovinje, Macedonia) is an artist who lives and works in Bogotá, Colombia. Despite being born in Croatia, Mundhenk has remained connected to the art world and to the underground world of art museums.\nQ. And the artwork on that site?\nA. The artwork is a large mural entitled \"A Permanant Issue\" that depicts, \"A Permanant Issue: World War II.\"\n\nQ. And the characteristic attributes of the artwork?\nA. The artwork is of a large black and white canvas.\n\nQ. And the date and the name of the artist?\nA. It is 1988. That is the date.\n\nQ. And the workmanship and the method in which that artwork has been produced?\nA. The artwork is produced in the form of a series of rectangles that are then glued together.\n\nQ. And the order in which those rectangles are assembled?\nA. That's right.\n\nQ. And what is the understanding of the method and the result of that process?\nA. That's right. The rectangles that are put together are then glued together.\n\nQ. And the final result?\nA. That is a large black and white painted artwork.\n\nQ. And you were asked about the width of the piece and the height of the piece as well?\nA. Yes.\n\nQ. And did you then examine the canvas surface?\nA. Yes.\n\nQ. And the surface content of the piece?\nA. Yes.\n\nQ. And did you then have a look at the back of the canvas?\nA. Yes.\n"], ["Anežka Poplawski (b. 1963, North Highlands, United States) is an artist who lives and works in Los Angeles, U.S.A. Rüdiger’s sculptures, installations and drawings are for people who have experienced the traumas that are common in hip-hop ‘culture’: its primary subject, celebrity culture, and the marketing of unhealthy eating habits. Popular culture is a particularly vulnerable source of emotional support, with its assumption that celebrities are magically transformed by diet, celebrity culture and drugs, into iconoclasts and cultural observers of this cultural conflict.\nQ. And what is your understanding of the role that diet plays in the making of art?\nA. It is, in fact, a central concern of mine. I think a lot of what I do is looking at the very structure of the world as it is and the way that certain things are produced and consumed. So I am interested in how we produce art and how we can make things more accessible and affordable and how we can make things more accessible to the masses.\n\nQ. And the use of technology in the making of art?\n\nA. Yes. For example, I do color and optical effects in my drawings and I use computer generated imagery in the making of the drawings. I also use software to create 3-D models of objects from photographs.\n\nQ. Did the use of a stylus by you in the making of art require any discussion with the client?\n\nA. I did not ask that.\n\nQ. Did you find any other technology that may have been used in the making of art?\nA. Yes. I found a large number of different technologies in the course of the work. One of the technologies I found was a form of 3-D printing, which is, as I say, a technology that allows you, you do not have to be a professional artist to produce things. You can create 3-D models from photographs.\n\nQ. And did you find any indication that it was possible to alter the form"], ["Corderio Agy (b. 1982, Ardea, Italy) is an Italian stage artist and writer. Her stage sets and installations are invariably well thought-out and encapsulate a rigorous academic analysis of the form that confronts the audience.\nQ. And then the next artist, who is of course a man, is a woman, is that right?\nA. Yes.\n\nQ. Can you tell us please about that work?\nA. The first work that I did was a series of paintings called A. W. Shipman and his wife. These paintings were done in the early 1980s.\n\nQ. And the second work that you did was the installation of a photograph in your home?\nA. Yes.\n\nQ. And the third was a gift, is that right?\nA. Yes.\n\nQ. Can you tell us what that was?\nA. It was an installation that was the work of a private individual called David Bowers.\n\nQ. And can you tell me about how long it took to complete that work?\nA. It would have been several months.\n\nQ. And how long it would have taken to create such a piece as this one?\nA. It would have been several months.\n\nQ. And finally, the final piece of art that you created?\nA. No, no. I painted the door at the bottom of the stairs and the windows.\n\nQ. The doors and the windows in this room?\nA. Yes.\n\nQ. The door at the bottom of the stairs and the window on the window?\nA. Yes.\n\nQ. Are those two upholst"], ["Levonne Blinston (b. 1953, Bājitpur, Bangladesh) blends performance and design with automotive and electrical components, creating a visual and tactile experience that clashes with and antagonises the native landscape. In Designs for the Real World, Wilson and Blinstetteroise (2008-2009), they collaborated on the multi-part International 2002, organised through the fashion archive of the Italian fashion house Giulio Briani Institute of the Fine Arts in collaboration with Cenneto Macchi at Tate Modern.\nQ. And on the 26th August of that year did you receive a call from Francesca Mazza, a freelance fashion designer based in Milan?\n\nA. Yes.\n\nQ. And did you learn, from that call, that Francesca Mazza was looking for someone to commission a design that would suit the needs of a general audience for a children's book?\n\nA. Yes.\n\nQ. And were you able to assist as to her qualifications and experience?\n\nA. Yes. She has a degree in Architecture and Urban Planning. She has also worked as a consultant in the public sector as a planner and planning consultant for the past 10 years.\n\nQ. And did she send you a number of designs that she had received from various people?\n\nA. Yes.\n\nQ. And did they have any function in the design process?\n\nA. Yes, they are the body and soul of the design. They were involved in the design process from the beginning.\n\nQ. And did you carry out your task to commission those?\n\nA. Yes.\n\nQ. And can you tell us about the nature of the work that was being carried out?\n\nA. Yes, they were research and development.\n\nQ. And could you explain the nature of the research and development that was being carried out?\n\nA. It's a type of research that tries to develop a new technology or a"], ["Liudvikas Budish (b. 1925, Taunsa, Pakistan) and Janine Öğlu (b. 1924, Taksim, Turkey), to whom Budish contributed several drawings and essays. In 1997 he was awarded the Special Prize of the Future Generation Art Prize of the Academy of Fine Arts.\nQ. In his last will and testament, Dr. Shipman left to his son, Dr. Shipman died on the 18th day of the month of the same year, the day of his brother-in-law, the Sultan of Brunei, Mohammed bin Rashid al-Maktum.\nA. Yes.\n\nQ. And in that will he also left a will administration business to his son, Dr. Shipman, and that was his son's management practice?\nA. Yes.\n\nQ. And did you receive a copy of the will, the will of the 20th October of 1997?\nA. Yes.\n\nQ. And did you notice on the Will that the Will covered the practice and management of the practice?\nA. Yes, that's correct.\n\nQ. And did you notice any other aspects of the Will that you would regard as being of relevance to this case?\nA. Yes. For example, there was a clause that dealt with the practice of Mr. Shipman, which I take to mean that he had been a patient of Dr. Shipman's and he had left the practice as a result of what he had heard about the Will.\n\nQ. And did you find any evidence of any other work experience in the Will?\nA. Well, it was only in passing, but I would have expected it.\n\nQ. So far as this Will was concerned, was Dr"], ["İhsan Yelton (b. 1929, Shitanjing, China) lives and works in Shanghai, a coastal city renowned as a filmmaking centre in the 1920s and 1930s. Her film work includes Lampedoku (1930), Zhongshi (3ds DVD, first film in the Yangtze River, located in the Dardis mountains of southern China), and Xianshan Muongmo (Vide).\nQ. Can you tell us about the film Lampedoku?\nA. This is a historical drama about the history of China from the 15th century. It tells the story of how in the 16th century the Chinese government came to be established in what is now China. It goes back to the classic historical narrative of how the Chinese came to be established in the 15th century.\n\nQ. And the film Zhongshi?\nA. This is a historical drama about the history of China from the 19th century to the present. It tells the story of how in the 19th century the Chinese government came to be formed in what is now China, how in the 20th century it was reformed, and how it continues to be reformed today.\n\nQ. And did you also receive a copy of the DVD containing the film?\nA. Yes.\n\nQ. Did you also receive a copy of the 1st August, the police notifying the public of the arrest of your brother-in-law in connection with the murder of your mother?\nA. Yes.\n\nQ. And did you also receive a copy of the death certificate, the police notifying the public of the death of your mother?\nA. Yes.\n\nQ. And did you also receive a copy of the Will?\nA. Yes.\n\nQ. And did you also receive a copy of the Will in the form of the Will in the form of a"], ["Emerito Mischnick (b. 1950, Swābi, Pakistan) is an English language artist whose practice since 1994 has been perhaps closer to street-art than sculptural installation. Her installations are often dense with graffiti and typography, but rather than relying on printed or glass images, they are set in the form of a graffiti font.\nQ. And just to add, did you find evidence of any such type on the previous day, Monday 25th April 1998?\nA. Yes.\n\nQ. And there had been no indication of that type on the previous day, the 27th April?\nA. Yes.\n\nQ. And indeed the previous day, the 27th April, had there been anything in the form of graffiti in relation to that day?\nA. No.\n\nQ. So in that sense the previous day had been a good one for you?\nA. Yes.\n\nQ. And then you came across the type of graffiti that you have just described?\nA. Yes.\n\nQ. Can I ask you this, had you seen anything of that kind in relation to the previous day?\nA. Yes.\n\nQ. And was it something that had caused you particular concern?\nA. Yes.\n\nQ. Could you describe the type of graffiti, the type of work that you had found?\nA. Simply that it had been set in the form of a type of graffiti.\n\nQ. Can I ask you in general terms please. What type of work is that?\nA. Art decoration, interpretive signage.\n\nQ. Can I ask you in particular to describe the type of graffiti that you have found?\nA. At the time of writing this report, yes.\n\nQ. And the work"], ["Hugues Kobashigawa (b. 1963, Corigliano Scalo, Italy) is an Italian landscape architecture student and curator who has been working within a diversity of approaches in his practice. He is interested in the impact of particular communities on each other, and in the way that their histories and identities are formed and reformed in post-modern contexts.\nQ. Having heard from Dr. Shipman about Mrs. Grundy's health and how she might have been able to provide for herself, how often would you expect to see her?\nA. Her health would have been of quite a poor standard, in my experience. Her condition would have been an impediment, because she would have had a lot of difficulties getting to and from her home and from her home she would have needed to pass through a gate, and she would have needed to walk across the road to get to her home. Her walk would have been of considerable difficulty.\n\nQ. And were there times when Dr. Shipman would meet with her to discuss her condition?\nA. Her health would have been discussed on a regular basis. I suspect that she would have been someone who would have discussed the condition of her health with Dr. Shipman, because she would have been someone who could give an opinion about the problem of her health.\n\nQ. But when would you expect to see her?\nA. I would have expected to see her on a regular basis, because we would have had that in common.\n\nQ. Now did Dr. Shipman ever say that he had seen Mrs. Grundy?\nA. No.\n\nQ. Did he say I had seen her on the day before her death?\nA. No.\n\nQ. When did he say that he had seen her?\nA. He said"], ["Ayeshah Donayre (b. 1935, Pīrgaaj, Bangladesh) is an artist living and working in London, U.K. After moving to the U.K. and starting a photography studio, Donayre heads to Liverpool to work on new work for Liverpool Biennial 2018. He is one of the most celebrated artists of the new century and a cultural figurehead for Liverpool Biennial.\nQ. Can you tell us about his style?\nA. His style is very contemporary. His work is very bright and often it is just a single image or a single line on a page or two that stand out.\n\nQ. Yes?\nA. I think it is just one image, \"A woman walking on a treadmill,\" or a single line in black and white, and I think that is the kind of work that he did.\n\nQ. And then the next image please, page 503 AU, \"A man walking down a street,\" and then he is about to leave the room?\nA. Yes.\n\nQ. And then, \"A woman sitting on a chair?\"\nA. Yes.\n\nQ. And you saw that in the room that you have described?\nA. Yes.\n\nQ. Now you heard a great deal about the history of the surgery and the surgery's involvement in the Bangladeshi diaspora. Did you also hear any discussion about how that history has been told to the public?\nA. Yes.\n\nQ. And was it your understanding that there was no official record of any Bangladeshi diaspora in the surgery's books?\nA. Yes.\n\nQ. And so it is with great sadness that you heard of the passing of Dr. Shipman?\nA. Yes.\n\nQ. And then did you hear any discussion about his wishes as a doctor"], ["Shelan Latshaw (b. 1945, Chaoyang, China) lives and works in Shanghai, a coastal city renowned as a filmmaking centre in the 1920s and 1930s. Latshaw is known for her finely choreographed sets, which often incorporate tubas as main motifs.\nQ. And you worked with her on a number of occasions.\nA. Yes, well, yes.\n\nQ. And she is one of the few Chinese directors of modern times whose works you would expect to find at the back of her hand?\nA. I would expect to find that.\n\nQ. And you saw in the film a close-up of her face?\nA. Yes.\n\nQ. And then you saw it was a close-up of her eyes?\nA. Yes.\n\nQ. And you saw her earlier this year as she was performing a blood test?\nA. Yes.\n\nQ. And you noticed that your gloves were somewhat damp?\nA. Yes.\n\nQ. Was it necessary to dry a number of her hands?\nA. Yes.\n\nQ. For example, when you first saw her in the theatre, you had on hand a number of instruments to test her blood?\nA. Yes.\n\nQ. To see if she was able to sing?\nA. Yes.\n\nQ. To see if she could speak?\nA. Yes.\n\nQ. And how long had you worked with her?\nA. I had worked with her for about 15 years.\n\nQ. And were you aware that she had a number of health problems, illnesses?\nA. Yes.\n\nQ. And would she have thought about those health problems"], ["Frizzle Gularte (b. 1968, Golitsyno, Russia) is an artist who lives and works in Moscow, Russia. He follows the trajectory of the artist’s own artistic practice, and considers his work as mostly into himself.\nQ. And he is the author of the art book \"The Artist, 2nd Edition\", which is available for pre-order?\nA. Yes.\n\nQ. And did you also write a book of art history for the first edition of the book?\nA. Yes.\n\nQ. And did you also receive a copy of the book earlier this year?\nA. Yes.\n\nQ. And did you also receive a copy of the second book?\nA. Yes.\n\nQ. And did you also receive a copy of the third book?\nA. Yes.\n\nQ. And did you also receive a copy of the fourth book?\nA. Yes.\n\nQ. And did you also receive a copy of the fifth book?\nA. Yes.\n\nQ. And was the work that you had done on the art of this woman Karen Grundy important in the preparation of the second book?\nA. Yes.\n\nQ. And did you also receive a copy of the sixth book?\nA. Yes.\n\nQ. And did you also receive a copy of the seventh book?\nA. Yes.\n\nQ. And did you also receive another copy of the seventh book?\nA. Yes.\n\nQ. And did you also receive a copy of the eighth book?\nA. Yes.\n\nQ. And did you also receive another copy of the eighth book?"], ["Briyan Shigley (b. 1938, Collingwood, Canada) blends performance, painting and sculpture. Shigley combines a fascination with an interest in the psychological and artistic side of art.\nQ. Your mother's artistic background?\nA. Her father was a portrait painter and her mother-in-law was a sculptor.\n\nQ. Her mother's profession?\nA. Her mother-in-law was a sculptor.\n\nQ. And was she the artist that she described to you?\nA. She described her mother as a very active and active woman. She would come to the studio all the time for that one, for that one painting, and then she would go on to do another one because she was so involved in the studio.\n\nQ. Was she a patient of your mother's?\nA. Yes.\n\nQ. And in 1992 did she die?\nA. Yes.\n\nQ. And did you learn about her medical history?\nA. Yes.\n\nQ. And did you learn that she had been prescribed morphine by her general practitioner?\nA. Yes.\n\nQ. And she was a patient of Dr. Shipman's?\nA. Yes.\n\nQ. And was she in your opinion suffering from a mental illness at that time?\nA. Yes.\n\nQ. And when did that illness begin?\nA. I don't know.\n\nQ. Did you ever see your mother alive?\nA. I saw her at the time, yes.\n\nQ. Did she appear to be in a state of distress?\nA. Yes"], ["Anya-beth Morales-morales (b. 1988, Espírito Santo do Pinhal, Brazil) lives and works in New York. Her work follows her development of a sequential writing process in 2006-07, when she creates her own space within objects and installations designed for display within her own home or studio.\nQ. And in that first year of that project, is that when you first began to conceive of the concept of the project?\nA. Yes.\n\nQ. Could you help us please? First of all, can I ask you this, what is the primary focus of the project?\n\nA. The primary focus is the exhibit. If there is something that I can't think about because it's not important, if it's simply I don't want to think about it, then I am going to not put it on the exhibit and I don't want to have to read it.\n\nQ. And that is what happened in that first year of work?\nA. Yes.\n\nQ. And the things that are your primary areas of activity?\nA. Well, I work on a lot of different things. I write a lot of different things.\n\nQ. And the number of things that you write about?\nA. Well, I would say that I do have a pretty good idea of most of the stuff.\n\nQ. What is the purpose of your writing?\n\nA. Well, I usually just, well, here it is.\n\nQ. Can you tell us about some of the things that you write about?\nA. Well, I write about a lot of different things. I have written about the history of the company from 1891 up until 2016.\n\nQ. And the history of the company"], ["Humo Tarufelli (b. 1959, Mokwa, Nigeria) is one of the most gifted artists working in the field of contemporary Nigerian art. His practice explores modes of expression that pivot between visual language and acoustic composition.\nQ. And speaking of visual language, what visual language would you use to describe this work?\nA. This work centers on the visual composition of the church?\n\nQ. The church as it appears to be?\n\nA. Yes.\n\nQ. And speaking of the church as it appears to be, how does that visual language serve your purposes?\nA. To describe the appearance of the building and the beauty of the place.\n\nQ. And in preparing to describe that, how does the use of language vary from one context to another?\nA. The language of the description is influenced by the way in which the visual imagery is presented and the way in which the words appear.\n\nQ. And you have described the appearance of the church as being of a typical church in Nigeria?\nA. Yes.\n\nQ. And have you considered the means by which that appearance can be conveyed?\nA. Yes.\n\nQ. And have you considered the ability of the individual items of information contained within the photograph to convey that appearance?\nA. Yes.\n\nQ. The photograph has been produced and placed in the jury's bundle. Could you tell us about its production and its handling?\nA. The photographs were taken and retained for archival purposes.\n\nQ. And the process by which they are preserved?\nA. The photographs are kept in a plastic bag and they are kept in a drawer in our laboratory."], ["Aile Potterson (b. 1957, Majorna, Sweden) has a longstanding fascination with the skin. He has a personal collection of plants and animals in his Copenhagen-area home, but the primary use of his artistic and artistic space is as a means of expressing cultural and political opinions.\nQ. So you're saying that the only other potter that he's got access to is that potter who works in Germany?\nA. Yes.\n\nQ. Why do you say that you can find that particular potter?\nA. Because he's one of the very few people who has the skill and the ability to create something from scratch.\n\nQ. So you can reach the conclusion that he's the only potter that he's got access to?\nA. That's correct.\n\nQ. You see, I think, first of all, how much skill you have in drawing and in lettering and you see that there's been some reworking of the plans. Can you tell us about that?\nA. I've worked on a lot of projects in the past, and one of my primary skills is making the drawings and the design work.\n\nQ. And then, you told us that you were also concerned about the level of detail that was being revealed to the public in relation to this particular project?\nA. That's correct.\n\nQ. Were you able to work with the planning office to come up with any particular plans for the site?\nA. Yes, they came up with a plan.\n\nQ. And can you tell us about the planning office?\n\nA. Yes, it's a planning office within the planning commission. It's a small office located on a corner of St. Michael's"], ["Persephonie Duonola (b. 1992, Mělník, Czech Republic) lives and works in London, UK. Recent exhibitions include Provisions for the Future (Museum Villa Stuck, München, Germany, 2012), Modern Essays 1 (Museum Villa Stuck, Galerie Ströze, Berlin, Germany, 2011) and Appropriate Spaces (Studio One, London, UK (2014)).\nQ. And she was born on the 9th day of January, 1952?\nA. Yes.\n\nQ. And she died on the 11th day of February, 1995?\nA. Yes.\n\nQ. And she was a member of the Czech Academy of Sciences since its inauguration in 1966?\nA. Yes.\n\nQ. And she had been a member of the Czech Academy of Sciences since the 9th day of January, 1952?\nA. Yes.\n\nQ. And she had been a member of the Czech Academy of Sciences since the 11th day of February, 1995?\nA. Yes.\n\nQ. And she was a member of the International Academy of Medical Proliferation since its inauguration in 1966?\nA. Yes.\n\nQ. And she was a member of the International Academy of Medical Proliferation since the 11th day of February, 1995?\nA. Yes.\n\nQ. And she had been a member of the International Academy of Medical Proliferation since the 9th day of January, 1952?\nA. Yes.\n\nQ. And she had been a member of the International Academy of Medical Proliferation since the 11th day of February, 1995?\nA. Yes.\n\nQ. And she was married to a Mr. Steele?\nA. Yes.\n\nQ. Who was a partner in a company called Orbis?\nA. Yes.\n\n"], ["Fjóla Gearin (b. 1973, Rybnik, Poland) is an artist who lives and works in Brooklyn, USA. Recent exhibitions include State of the Art: Radicalism in Contemporary Art, 2012; and Other Television Art, Kunstverein, D.C.\nQ. What is your occupation?\nA. I am an artist.\n\nQ. And your display of media within the exhibition?\nA. My installation is a series of platforms, I think, which resemble a number of forms. One of them is a stage set that, you know, it's got speakers and it's got a little table and a chair. The other one is sort of like a reception area where people could gather and have a look at the work.\n\nQ. You told us earlier that the work that you were doing was not a political one?\nA. No, it was political in nature. It was political in relation to the Israeli occupation of Palestine.\n\nQ. And in your latest installation, the largest in terms of area, the largest of the three, is that a giant mural?\nA. Yes.\n\nQ. Yes?\nA. It is, yes.\n\nQ. And in respect of this particular installation is that in effect a giant mural in which all the people of Palestine have been represented?\nA. Yes.\n\nQ. And do you have access to, as it were, a massive amount of information on the Internet in order to prepare for any such installation?\nA. Yes.\n\nQ. And so far as this particular installation is concerned, how well prepared are you in relation to this particular task?\nA. I'm a very well-versed computer user, yes"], ["Llinda Seigart (b. 1993, Witzenhausen, Germany) is a sculptor whose practice since 1994 has been perhaps closer to architecture in that it is based on an acute responsiveness to particular situations. He has worked mostly with new environments, bringing with him a challenge to create spaces where the light is directed and a sense of progression is allowed.\nQ. The space at the heart of the new structure, the rear entrance?\nA. That's right.\n\nQ. Now the plan?\nA. Yes.\n\nQ. The plan is drawn, as it were, in a circle around the entrance as it appears on the plan?\nA. Yes.\n\nQ. Circle?\nA. Yes.\n\nQ. And the plan has been drawn round the entrance?\nA. Yes.\n\nQ. And in respect of the building as it appears on the plan, that is the rear entrance that you have described?\nA. Yes.\n\nQ. And you have described a view from the rear of the building?\nA. Yes.\n\nQ. And your description of the view from the rear of the building?\nA. Yes.\n\nQ. And in respect of this particular view, you say it is of an angle?\nA. Yes.\n\nQ. And you have described the view from the rear of the building, it is a view from the rear of the front entrance?\nA. Yes.\n\nQ. And the angle is from the front entrance?\nA. Yes.\n\nQ. And in respect of this particular view, you have described it as being of an angle?\nA. Yes.\n\nQ. And in respect of this particular view, you have described it as being of an angle from the front entrance"], ["Kewanda Englehardt (b. 1983, eSikhawini, South Africa) is an artist and writer who lives and works in Los Angeles. Recent exhibitions include Under the Big Black Sun: California Art 1974-1981 (Museum of Contemporary Art, Los Angeles, U.S.A., 2011) and The Crystal Quilt, installation at Tate Modern, 2012.\nQ. Who was the artist that was doing the installation at Tate Modern?\nA. It was an installation by a young woman named Kathleen Grundy.\n\nQ. And did you have any prior art experience?\nA. Yes, I did.\n\nQ. What is your qualifications and experience in art?\nA. I am a mural artist.\n\nQ. And did you have experience in commissioning murals?\nA. Yes, I had.\n\nQ. And did you do this work primarily or mostly by yourself?\nA. I was mostly doing it by myself. I would do it with several people.\n\nQ. And did you receive any remuneration for your work?\nA. Yes, I did.\n\nQ. And did you receive any such remuneration in kind, such as a commission for a commission or anything like that?\nA. Yes.\n\nQ. Did you receive any such remuneration in kind from anyone other than by commission?\nA. No, no.\n\nQ. Did you receive any remuneration in kind from any other person?\nA. No, not in kind.\n\nQ. And so far as any funds from any sources for the installation were concerned, was that the work in itself or was it undertaken in partnership between the two of you?\nA. It was their full-time work. I was responsible for the installation.\n\n"], ["Carthel Hallsten (b. 1979, Hamamatsu, Japan) is an artist and visual artist living and working in Tokyo. Her art practice centers around making (plastic surgery), incorporating bodily functions and sounds in everyday objects, and social behaviour.\nQ. And how often have you worked with her?\nA. I've been working with her for about 7 years now.\n\nQ. And what type of work do you do?\nA. She does a lot of work in the public eye around health and well-being. She's an advocate, a very involved advocate. She's concerned about the health of all people. She's concerned about the well-being of the people of Japan.\n\nQ. And how frequently did you see her?\n\nA. I saw her fairly regularly. She would come and see me.\n\nQ. And what was her manner like?\nA. Her manner was almost always positive and upbeat. She was always smiling and joking.\n\nQ. What was her manner like when meeting you?\nA. She was always positive and upbeat.\n\nQ. And was she ever involved in sport?\nA. She was, yes.\n\nQ. And of course that was the woman who was your mother's doctor?\nA. Yes.\n\nQ. And how often did you see her?\nA. I saw her as far as I could.\n\nQ. And did you see her at all in terms of exercising?\nA. Had her on a number of occasions. I saw her on a number of occasions, yes.\n\nQ. And were you able to tell us of her general health in terms of her general physical condition"], ["Laytin Amaya (b. 1929, Toumodi, Ivory Coast) lives and works in Paris, France. Amaya is interested in the power relations and hidden politics presented in much architectural design, and in how contemporary environments might contain coded messages that state our survival depends on it.\nQ. And is that something that you would be open to receiving or screening for in a work environment?\nA. Yes.\n\nQ. Is it something that would in your view be appropriate for use in a case in which there is a history of suicide?\n\nA. Well, I think that in the case of Mrs. Grundy there were several indications of a prior suicide attempt and I would have thought that this would be appropriate.\n\nQ. Is it also something that would in your view be appropriate in the circumstances?\nA. Well, it appears that Mrs. Grundy was contemplating a suicide, and I think that in my view this is a reasonable conclusion to draw in this case.\n\nQ. Could you therefore be explained please the significance of the finding that she was considering a suicide?\nA. Well, the reason I say she was contemplating a suicide is because she had been receiving threatening phone calls from people who apparently believed that she was planning suicide.\n\nQ. And in your view should a formal complaint have been made to the police?\nA. Well, the police should have been called to the scene, but the circumstances of this case are extraordinary. Mrs. Grundy was a frail lady, and I think the circumstances suggested to me that she was at a high risk of taking her own life. I think in the circumstances of this case it would have been necessary for the police to be called.\n\nQ. Yes"], ["Filareta Kolinsky (b. 1927, Wolfen, Germany) is an artist who lives and works in Berlin, Germany. Recent exhibitions include Utopian, You are Still Here (Museum, Berlin, Germany (2012)) and In Praise of Scientific Knowledge (Kunst-Werke Berlin, Germany (2012)).\nQ. And of course you have visited Germany before?\nA. I have yes.\n\nQ. And have you been involved in the art and sculpture of different sorts in Germany?\n\nA. Yes.\n\nQ. And what was it that you were doing that was bringing about a change in the way that people were interacting with each other?\nA. That was to change the way people were interacting with each other and the way that they were interacting was they were just standing around and talking and laughing and joking and joking. And that was the impression that I wanted to get across.\n\nQ. And what was the impression you were getting from that particular visit?\nA. Well, I just thought that, you know, to be honest with you, this was a country that I had never seen before and I really didn't know much about. And to do what I did I must have known a lot more than I did.\n\nQ. And you had been there for a few days?\nA. Yes.\n\nQ. And you had been there when the incidents took place?\nA. Yes.\n\nQ. Who was observing that?\nA. I was shocked. I couldn't believe that anybody could be involved in something like this.\n\nQ. And what was the next?\nA. Well, I went into the house and found that the woman had been brutally murdered.\n\nQ. And did you see any"], ["Corderio Agy (b. 1938, Luena, Angola) lives and works in Angola. Agy studied Fine Art at the Roski Institute in Moscow and completed his studies at The Mary Boone School of Fine Arts at the University of Southern California.\nQ. And in your opinion, was that a school with a history of providing artistic training to people in need?\nA. Yes.\n\nQ. And in your opinion, was that a school in need of improvement?\nA. Yes.\n\nQ. And you heard her speak of the difficulties that she had in financial management?\n\nA. Yes.\n\nQ. And in your opinion how long had you worked as a steward for Werneth House?\n\nA. I had worked as a steward for the past 14 years.\n\nQ. And you were responsible for keeping the house tidy and tidy. Did you have any concerns about the house?\nA. Yes.\n\nQ. Did you have any concerns about the house?\nA. Yes.\n\nQ. And you heard her speak of the difficulties that the house had in transport and the difficulty that she had in getting to the house?\nA. Yes.\n\nQ. When you arrived at the house was your first impression that a lady had been there?\nA. Yes.\n\nQ. Did you later learn that she had died?\nA. Yes.\n\nQ. And the reason for that?\nA. That's what she told me.\n\nQ. And the reason for telling you that she had died?\nA. Well, I wasn't very well when I arrived but I managed to get her to talk. She was"], ["Ruaa Randlett (b. 1956, Montbéliard, France) is one of France's foremost visual artists. His large-scale installations – often patterning repetitive actions such as riding a bus, running a shop, speaking a foreign language or even murdering an animal – are carefully constructed and positioned so as to defy any suggestion of physicality.\nQ. And then the last is the one at the foot of the page, the last one which is a two-dimensional sculpture. Is that a correct description of the work that you have just described?\nA. Yes.\n\nQ. And you went on to explain that the aim of that particular installation was to create a space for contemplation and reflection?\nA. Yes.\n\nQ. And in the middle of that space were you able to find traces of paint?\nA. Yes that's correct.\n\nQ. Can I ask you about the painting for a moment please, the third, the canvas for the third painting. Can you see that?\nA. Yes.\n\nQ. Can you see the inner workings of that?\nA. Yes. It is a white canvas.\n\nQ. And did you then go on to paint on the canvas?\nA. Yes I did.\n\nQ. And what effect do you suggest that the paint may have had upon that surface?\nA. It obscured the figure quite a lot, but it also made it appear as it was.\n\nQ. You were asked about the inner workings of this particular painting and you told us about the way in which the paint would appear. I would like to ask you please about the outer workings of the painting itself. You told us that it was somewhat difficult to get hold of, and even more so to get hold of the paint would not necessarily reveal"], ["Belul Rennemeyer (b. 1972, Kalach, Russia) is a Russian artist whose practice since 1994 has been perhaps closer to post-punk in its ambition, fear of alienation, and anarcho-syndicalist in its politics. He is the recipient of numerous awards, including nine from Documenta 13, the Venice Biennale in 2014; the Venice Art Biennial in Kassel, Germany in 2017; and the Venice International in Malmo, 2014 as well as at the Whitney Biennial, U.S.A.\nQ. What do you mean by \"post-punk\" by that?\nA. Post-punk is a term that I coined in the mid to late '90s to describe how Russian society has changed over the last 20 years or so. It is a society in which the state controls the means of production and distribution of goods and services, there is no private ownership of any asset, and there is a strong central government.\n\nQ. And how does that differ from the kind of society that you know about in the U.S.?\nA. Well, post-punk society is a society in which individuals and groups have the freedom to develop and to innovate, to change how things work, and to create wealth or to make a product or to build something. It is also a society in which individuals are free to pursue legitimate careers or engage in other legitimate economic activity.\n\nQ. And what do you mean by legitimate career or other legitimate economic activity?\nA. A legitimate economic activity is one that is in the public interest and not in the interest of a single person or company. It includes all activities that are likely to produce goods or services for sale, are in the public interest, or are of public interest, such as privatization, for instance, or using public funds for private gain.\n\nQ. And so what did you mean by the term \"likely to produce goods or services\"?\nA. That is the option that people have when they are free"], ["Aalani Akley (b. 1930, Çorlu, Turkey) came to Liverpool as a young man. His sound engineering studies led him to Liverpool, where he began to study at First Objectives in the first week of the school year 2001.\nQ. And you are now a sound engineering expert?\nA. Yes I am.\n\nQ. What is your full name please?\nA. My full name is Aalani Akley.\n\nQ. And are you married to an older woman?\nA. Yes.\n\nQ. And are you the son of Mrs. Akley?\nA. Yes. I have two daughters.\n\nQ. And did you see your mother in the early part of the morning?\nA. Yes.\n\nQ. And did you see her sitting in the doctor's surgery chair?\nA. Yes.\n\nQ. And did you see her earlier that afternoon?\nA. Yes.\n\nQ. And did you see her sitting in the waiting area?\nA. Yes.\n\nQ. Did you see her again after that afternoon?\nA. Yes.\n\nQ. When you say in the waiting area?\nA. Yes.\n\nQ. And on that day did you see her again?\nA. Yes.\n\nQ. And did you see her again in the evening?\nA. Yes.\n\nQ. And did you see her again in the evening?\nA. Yes.\n\nQ. And did you see her again in the evening?\nA. Yes.\n\nQ. How much did you see of her this afternoon?\nA. Well, I saw her drinking"], ["Ladell Munderville (b. 1984, Zhuzhou, China) lives and works in Shanghai, China. Recent exhibitions include A trip to the Moon.\nQ. And what is your full name please?\nA. I am Ladell Munderville.\n\nQ. And were you born in 1932?\nA. Yes.\n\nQ. And have you lived ************** in ************** for the past 13 years?\nA. Yes.\n\nQ. And did you attend ************** school in *************?\nA. Yes.\n\nQ. And have you been ************** a ************** teacher for 13 years?\nA. Yes.\n\nQ. And are you ********************* on the Internet?\nA. Yes.\n\nQ. And have you had an opportunity recently, if I may say so, to look at the computer records of the accused and to read the indictment relating to the offence of murder in Great Britain?\nA. Yes.\n\nQ. Has the accused been ********************* held in custody since the 23rd day of May this year?\nA. Yes.\n\nQ. And are you able to tell us please of the manner and the state of health of the accused?\nA. The accused has been in custody since the 23rd day of May. He has been in custody since the 23rd day of May.\n\nQ. And are you able to tell us please as to the state and condition of health of the deceased?\nA. The accused was in a room in the ******************* **********,"], ["Kayon Bronstad (b. 1991, Flers, France) lives and works in Rotterdam. Recent exhibitions include A trip to the Moon.\nQ. And would you just pause for a moment?\nA. Yes.\n\nQ. And answering the question on the 12th, did you see her prior to her death?\nA. Yes.\n\nQ. And have you seen her since her death?\n\nA. Yes, I have.\n\nQ. And did she appear to you to be in a particularly good health?\n\nA. Yes.\n\nQ. And how often would she go to the doctor?\n\nA. Well, she used to go to the doctors about her health a lot.\n\nQ. And did she appear to you to have any particular problems with her health?\nA. Well, she always used to complain about the pain in her neck.\n\nQ. And did you notice any indication of any problems with her health?\nA. Well, she used to complain about the pain in her neck.\n\nQ. And did you notice any indication of any problem with her health?\nA. Well, she used to bring me tea when she came to see me.\n\nQ. Did she seem to have any difficulty in walking?\nA. No, not really no.\n\nQ. Did you notice any difficulty in keeping up the pace of walking?\nA. No.\n\nQ. Did she have any difficulty getting on a bike?\nA. No.\n\nQ. Did she seem to have any difficulty getting"], ["Carrelli Antoniou (b. 1993, Pathein, Myanmar) lives and works in Rio de Janeiro. Antoniou’s solo exhibitions include Romana Arboresa, Varese Diorama, Seville, Brazil (2017); São Paulo International Art Festival, Sao Paulo, Brazil (2016); and Palais de Tokyo, Paris, France (2016).\nQ. Do you have a particular interest in the history of art and its practitioners?\nA. I do.\n\nQ. And what is your specific field of expertise?\n\nA. Art history and its practitioners.\n\nQ. And of course, you have worked in this field for a considerable period?\nA. Yes.\n\nQ. And have you had your share of interaction with experts in this field over the years?\nA. Yes. I've met people from around the world.\n\nQ. And have you generally received a fair amount of information from them?\nA. Yes.\n\nQ. And what is your opinion as to the reliability of their information?\nA. Well, I think I generally agree with their general conclusions. I think they have a point. Some of their details about certain people and things are very accurate. I don't agree with the details they give. Some of them, I don't agree with the details they give. For example, they say, \"He was a banker,\" that's something I disagree with completely and I can't believe they would make that statement.\n\nQ. And have you had occasion in the course of your research to meet with representatives of the American government?\nA. Yes, I've met with representatives of the US government.\n\nQ. And have they been consistent in the accuracy of their information?\nA. Yes. I've met them. I have met with"], ["Sanzia Sifa (b. 1957, Heroica Caborca, Mexico) lives in Mexico City. Sifa is an artist and critical theorist.\nQ. And did you see her in your home town on Thursday 24th June?\nA. Yes.\n\nQ. And did you see her at that time?\nA. Yes. She was sitting in the living room on her couch.\n\nQ. Had she arrived earlier?\nA. Yes.\n\nQ. Was she sitting in the living room?\nA. Yes.\n\nQ. And did she appear to be in her element?\nA. Yes.\n\nQ. And did you see her touch?\nA. Yes.\n\nQ. And did she appear to be in a state of shock?\nA. Yes.\n\nQ. And did you see her walk over to where you were sitting?\nA. Yes.\n\nQ. And how long was she sitting for?\nA. Just a couple of minutes.\n\nQ. Did you say anything to her?\nA. Yes.\n\nQ. How many people were present at that time?\nA. There were a half dozen people.\n\nQ. And how were they at that time, can you remember?\nA. They were all standing and staring at the ceiling.\n\nQ. And did you hear anything?\nA. Just the door opening and the door closing.\n\nQ. And how long did that take?\nA. A minute.\n\nQ. And then what did she do?\nA."], ["Gracelynne Pinckney (b. 1976, Cambé, Brazil) lives and works in Sao Paulo. Her work follows her evolution of anthro-cynical constructs, which originate in the tropical forests of Brazil and which continue to evolve with the climate.\nQ. How long have you worked on this project?\nA. I have been working on this project for the past 4 years.\n\nQ. And are you able to tell us generally what your results have been?\n\nA. Yes. I have been able to describe the morphology of the roots, the morphological appearance of these roots, the chemical composition of these roots, and the genetic material of these roots which I have described.\n\nQ. And in particular can you describe the morphology of the roots of this particular plant?\nA. Yes. The roots of Theobroma cacao were well preserved. Some were more well preserved than others. Some were quite poorly preserved. The leaves and stems were all well preserved.\n\nQ. And can you describe the chemical makeup of the roots?\nA. Yes. The roots contained no significant levels of any key psychoactive substance, nor did they contain any significant levels of caffeine.\n\nQ. And can you tell us about the genetic material?\nA. Yes. The genetic material was predominantly of European descent with a small amount of African ancestry.\n\nQ. Did you then go on to describe the morphology of the leaves and the stem of this plant?\nA. Yes. The leaves and the stem were all well preserved, although the skin was quite damaged. The skin was scarring from the scarring process which we have described.\n\nQ. And did you then go on to examine the chemical"], ["Taygun Graboski (b. 1977, Astana, Kazakhstan) is an artist and writer who lives and works in Berlin and San Francisco. Recent exhibitions include Under Deconstruction (Museum Kunst der Westküste, Alborgin, Germany, 2011), At Home in the Body (University of Virginia Art Museum, Charlottesville, U.S.A., 2010) and Up Against (Luhring Augustine, New York, U.S.A. 2009).B.I.G.S. (British Pakistani-American and Torres Strait Islander of Hizbul Mujahid’s Afghanistan) is a non-profit research and educational organisation founded in New York in 2011.\nQ. And is your husband, you work together?\nA. Yes.\n\nQ. And what about your daughter are you working with?\nA. She is doing some research on child marriage and family planning in Pakistan.\n\nQ. And are you currently working on issues relating to the freedom of expression?\nA. Yes, I am currently working on freedom of expression in Pakistan.\n\nQ. And have you been involved in the work for Human Rights Watch on the freedom of expression and the right to freedom of expression?\nA. Yes.\n\nQ. And have you had a role in researching and writing a book about the right to freedom of expression and researching child marriage in Pakistan?\nA. Yes.\n\nQ. With whom was that research and writing done?\nA. Human Rights Watch.\n\nQ. And did you receive any requests for information from Mr. Steele?\nA. Yes.\n\nQ. And were you provided with information and documents?\nA. Yes.\n\nQ. And did you obtain copies of the research by Mr. Steele?\nA. Yes.\n\nMR. WINTER: Thank you.\n\nMR. JUSTICE FORBES: Thank you.\n\nMR. WINTER: And did you make any other arrangements with Mr. Steele?\nA. Yes.\n\nQ. Did you have any further contact with Mr. Steele?\nA. Yes.\n\nQ."], ["Bunkley Viltz (b. 1972, Lithia Springs, United States) is an artist who has developed a fascination with the human condition and sociality of animals. Since the 1970s, Haley has been working with a fascination for the social and exotic life of the enclosure.\nQ. Is that a zoo?\nA. That's correct.\n\nQ. And did you know a lady by the name of Lizzie Adams?\nA. Yes.\n\nQ. And did you know that she was a volunteer with the Houston Humane Society?\nA. Yes.\n\nQ. And did you know that she had come to Houston in 1984 for the first time that she had ever seen a pet?\nA. Yes.\n\nQ. And how long had you known her?\nA. Well, I was a volunteer as a young lady.\n\nQ. And was she a volunteer at the time of her death?\nA. Yes.\n\nQ. And did you know that she was a member of the Animal Welfare League?\nA. Yes.\n\nQ. And had you been a member of that organization for sometime?\nA. Yes.\n\nQ. And did you know that she was on the board of directors of the Wellness Center for Animals?\nA. Yes.\n\nQ. And did you know that she was also a volunteer with the Feral Cat Coalition?\nA. Yes.\n\nQ. Did you know that she had been a friend of Animal Welfare League volunteer coordinator for many years?\nA. Yes.\n\nQ. And did you know that she had been a volunteer with the Feral Cat Coalition for several years?\nA. Yes.\n\nQ"], ["Nadilee Newsham (b. 1989, Huauchinango, Mexico) lives and works in Chicago, USA. Recent exhibitions include Under the Big Black Sun: Art Newspaper, Williamson Gallery, Chicago, 2013; Culture and Sport, Grundy Art Gallery, Blackenburg, Switzerland 2013-14; New Statesman, 2012; Look at the Sun, Tate Britain/Harrisburg, UK archival centre for cultural and artistic studies, Sheffield Shield, UK 2012; Punk, Greene County Museum of Art, UK 2011.The German photographer Ute Klophaus (b.1940, Germany) is best known for her extraordinary photographic documentation of Joseph Beuys’s performances in the late 1960s and early ’70s.\nQ. And the final work of art which is on display at the exhibition is the installation by yourself and yourself and two colleagues, Art Gallery of Liverpool, staff member and Anna Maria de Crespo (b. 1966, Spain) ?\nA. Yes.\n\nQ. And of course that was the case of the Beuys, is that right?\nA. Yes.\n\nQ. And the Beuys were a famous figure in the 60s, were they not?\nA. Yes.\n\nQ. And did you and Anna Maria de Crespo go on to make a number of other works?\nA. Yes.\n\nQ. And did you also carry out postmortem examination of various body parts?\nA. Yes.\n\nQ. And did you find that some of the organs were relatively well preserved?\nA. Yes.\n\nQ. And were those of a particularly gruesome nature?\nA. Yes.\n\nQ. And did you examine the brain?\nA. Yes.\n\nQ. Yes. Was the brain sufficiently well preserved for analysis?\nA. Yes.\n\nQ. And the respiratory system?\nA. Yes.\n\nQ. Did you examine the musculoskeletal system?\nA. Yes.\n\nQ. Did you examine the thoracic and abdominal muscles?\nA. Yes.\n\nQ. Did you examine the spleen glands?\n"], ["Derlyn Krishama (b. 1965, Roseville, United States) lives and works in Chicago, USA. In her work and art, she considers not only the visual space but the notion of authorship, participation, and authority.\nQ. Was this work commissioned by the City of Chicago?\nA. Yes.\n\nQ. Did you have any prior knowledge of the history of the Orinda Medical Center?\nA. No.\n\nQ. And the history of the practice?\nA. Yes.\n\nQ. And the practice's overall role in relation to the general medical practice of the hospital?\nA. It is a very active hospital. There are many different departments within the hospital.\n\nQ. And is the practice was that of a visiting doctor general practitioner?\nA. Yes.\n\nQ. And was the practice primarily of delivering general practitioners' services for the patients and in the case of Mrs. Melia was that through her practice?\nA. Yes.\n\nQ. And the role of the practice in relation to the general medical practice of the hospital?\nA. Yes.\n\nQ. And the practice's overall role in relation to the general medical practice of the hospital?\nA. That is the practice's main responsibility. If there was anything in the practice which was not necessary for the patient, if there was something which was outside the scope of the patient's care, it would be passed on to the next available practitioner.\n\nQ. But your general practice colleagues and you have, as it were, brought this practice into being?\nA. Yes.\n\nQ. And how long has Dr. Shipman been general practitioner at the"], ["Gbemisola Strek (b. 1992, Nogales, Mexico) lives and works in New York and Mexico. Her work follows her imagination, exploring the possibilities of creation, the imaginative and the imaginative directedness of material experience, and the relationship between mathematics and language.\nQ. Did you have any specific concerns with regards to her health in the past year or so?\nA. No, not really. I do remember?\n\nQ. Have you had any medical treatment since her death?\n\nA. No.\n\nQ. And if you could just describe her health and how she was because she was not well?\n\nA. She was a very fit and healthy lady.\n\nQ. And to what extent was she reliant upon you for her health and well-being?\n\nA. She relied upon me for her health and well-being, yes.\n\nQ. And in the year 2000 did you see her at least once a month?\nA. Yes.\n\nQ. And how frequently would you see her?\nA. She would visit me on a daily basis.\n\nQ. And what was the range of events that would be associated with a visit from her?\nA. Well, she would call on me for any errands, errands of any sort.\n\nQ. And what was her manner like?\nA. Very little at all.\n\nQ. And as you had heard some of the reason for her being so well?\nA. Well, she used to make me laugh. She was a very funny lady, yes.\n\nQ. And how often would you speak with her about her health and well-being?\nA. I would say once"], ["Augustowski Littlehale (b. 1984, Okap, Haiti) lives and works in New York, USA. Her work follows her spirit of exploratory critical work, which she uses in her writing, film and in new media projections.\nQ. How long have you worked on the project?\nA. I've been there for about 9 months.\n\nQ. And what is your full name?\nA. My full name is Anna Marie Q. Stevens.\n\nQ. And you are employed by the firm Baker Hostetler, Inc.?\nA. Yes.\n\nQ. And in September of last year did you receive a telephone call from a client of the firm?\nA. Yes.\n\nQ. And did you learn that that client was seeking to have a meeting with you?\nA. Yes.\n\nQ. And did you go to meet with that client?\nA. Yes.\n\nQ. And was that meeting arranged for that day?\nA. It was arranged for that day.\n\nQ. And did you learn that he was a long-time client of yours?\nA. Yes.\n\nQ. And did you learn that he had been a long-time client of yours?\nA. Yes.\n\nQ. And did you learn that he had been a long-time client of yours?\nA. Yes.\n\nQ. And did you learn that he had given to the firm a number of grants over the years?\nA. Yes.\n\nQ. And did you learn that one of those grants was to the firm - did you learn that from the firm?\nA. Yes.\n\nQ"], ["Sheshe Sathre (b. 1950, Dhāruhera, India) lives and works in Dhaka. Sathre is a visual artist and filmmaker using archival material and elements of fiction to illustrate the relationship between individual stories and collective history.\nQ. When you were working on the research for this film did you see any connections between the historical events and the characters that you were researching for this film?\nA. Yes. I saw that connection in the form of David Irving's son-in-law who is the president of a company called Irvingstein.\n\nQ. And have you had a chance to read the full report?\nA. Yes.\n\nQ. And the conclusions that you reached?\nA. Yes.\n\nQ. Have you had a chance to consider the findings of the report?\nA. Yes.\n\nQ. And did you reach the conclusion that the actions of the individuals who were present during the Holocaust were in keeping with the character of the individuals who would be involved in such an exercise?\nA. Yes.\n\nQ. Can I ask you this, what was the next step? Was there to contact your family in Germany?\nA. Yes.\n\nQ. And then the following day did you meet with your family in Germany?\nA. Yes.\n\nQ. So far as this particular exercise was concerned were you able to get any information from them?\nA. Yes.\n\nQ. Did you see any physical evidence of the existence of the Holocaust in your mother's presence?\nA. No.\n\nQ. How long had you been in Germany?\nA. I had been in Germany since the late 70s.\n"], ["Mary-louise Tate-lee (b. 1931, Timbaúba, Brazil) lives and works in Sao Paulo. Recent exhibitions include Involuntary (Musée d’art Contemporain de Montréal, Canada, 2012), Madame Tussaud (Museum of Contemporary Art, St. Gallen, France, 2011) and Madame Tussaud Suite DES Japonis (Schamsterdam, the Netherlands, 2010).\nQ. Did you go to see her on Tuesday the 9th?\nA. Yes I did.\n\nQ. Did you see her?\nA. Yes.\n\nQ. And did she make any comment to you?\nA. Just that she wished she was with her daughter.\n\nQ. Did you see her then?\nA. Yes.\n\nQ. And did she come back?\nA. Yes.\n\nQ. And did she continue to make a statement?\nA. Yes.\n\nQ. Did you ask her to speak as she had left?\nA. Yes.\n\nQ. And was that done in her presence?\nA. Yes.\n\nQ. And how did her manner appear that evening?\nA. She seemed completely normal.\n\nQ. Did she have a chest infection?\nA. Yes.\n\nQ. Was she coughing or inhaling anything?\nA. No.\n\nQ. Did she appear to have any difficulty hearing what she was saying?\nA. No.\n\nQ. Was she clear of any illness?\nA. No.\n\nQ. Could you hear what she was saying?\nA. Yes.\n\nQ. Did you ask her to look at a chart?\nA. Yes.\n\nQ. And did she appear to have any difficulty hearing what she was saying?\nA. No.\n\nQ. Did"], ["Ifzah Rouselle (b. 1963, Langenfeld, Germany) lives and works in Berlin. Exhibitions include Under the Big Black Sun (54th Venice Biennale, Spanish Pavilion, Venice, Italy, 2011), Modern Parallels (54th Venice Biennale, Spanish Pavilion, Venice, Italy, 2010), and Figures and Fictions: Contemporary Art and the Politics of Identity (54th Venice Biennale, Venice, Italy, 2009).\nQ. And in your opinion will this exhibit be good for the general public?\nA. The exhibition is intended for people who have no special knowledge of architecture, who, for example, have attended the opening of a new or a second exhibition.\n\nQ. And can I ask you about the purpose of this exhibition. What is the purpose of this exhibition?\nA. The exhibition is intended to bring together people with a common interest in architecture and in contemporary art, people who are interested in the history of architecture and in the politics of identity and the history of modern art.\n\nQ. And can I ask you about the exhibition in Venice?\nA. Venice, of course, is the financial center of the Italian economy, the financial center of the world. It is also the financial center of the European Union.\n\n\nQ. And can I ask you about the financial center of the European Union?\nA. Venice is the financial center of the European Union, it is also the financial center of the Italian economy.\n\nQ. And can I ask you about the political and economic climate in Italy in general?\nA. Yes. In the early part of the 20th century it was a very difficult and turbulent time in Italy. The economy was in a severe recession. There were social and political movements, there was a lot of conflict between the various social groups over economic matters. The civil war that started in 1966 that has been referred to as the Civil War of"], ["Griglik Martirano (b. 1953, Pingliang, China) lives and works in Shanghai, China. Recent exhibitions include Under the Big Black Sun: Art, Theory, Experiments, Texts, and Real-life Action.\nQ. And are there any particular themes that you would expect to find in such a book?\nA. Well, the major theme is the participation of women in science and technology.\n\nQ. And have you had a chance to read this particular book?\nA. Yes.\n\nQ. Is it your opinion that it is the work of a woman who has been involved in science and technology research?\nA. Yes.\n\nQ. And did you examine the technical notes in this book?\nA. Yes.\n\nQ. And did you find anything to suggest that she had been involved in any particular research relating to the geothermal industry?\nA. Nothing.\n\nQ. What were the next topics that came up?\nA. I examined the technical notes and I began by looking at Dr. Shipman's medical certificate of cause of death. This is the medical certificate that lists the causes of death. I then looked at the medical history in the form that we all have, the typed history. I found nothing.\n\nQ. And where can you find that?\nA. You can find it on the medical history in the form itself.\n\nQ. And can I ask you this, did you see anything in Dr. Shipman's medical history in the form of a valid claim for a pension?\nA. No. I saw that he had been prescribed morphine for the morphine addiction and that he had not been able to manage"], ["Dut Deems (b. 1990, Payyannūr, India) lives and works in London, UK. Dut Deems’ practice continues to inform their solo exhibitions and performance works, as well as the collaborative activities of their museums and memorials.\nQ. And in that case, I would ask you please to look at the to-be-published volume of your mother's medical history?\nA. Yes.\n\nQ. Are you able to tell us how much each of your mother's medical events in the last 12 months had to do with her health or her physical condition?\nA. Well, I think that's obvious. Her physical condition was anything like a visitor would expect for a grandmother. She was quite well.\n\nQ. And the reason she was so well was because she had been a long-term smoker?\nA. Yes.\n\nQ. And she had for many years been suffering from lung problems, including asthma?\nA. Yes.\n\nQ. And did she have to stop smoking?\nA. Yes.\n\nQ. And to make a long-term effort to get her lung condition under control?\nA. Yes.\n\nQ. And how long did you see her?\nA. Well, after I saw her she was going to a day centre and she was coming back this week to the site and that. So after I saw her she was coming back this week to the site and that.\n\nQ. And did she have a problem with her cholesterol?\nA. That's correct.\n\nQ. And did she have to do what was best for her health?\nA. Well, she always looked after her health, if I"], ["Cezariusz Ravenhall (b. 1942, Nashville, United States) is a sculptor whose practice since 1994 has been perhaps closer to architecture in that it is based on an acute responsiveness to particular situations. He has worked increasingly with tent structures, making highly ecological and economic shelter provisions in beautiful and appropriate shapes for urban and rural settings.\nQ. And do you have any special knowledge of architecture in general?\nA. I have studied architecture in the United Kingdom and I have also studied planning and environmental engineering.\n\nQ. And when did you go to school please?\nA. I went to school in the city of Hyde from 1974 until 1977, when I moved to Market Street in Hyde.\n\nQ. And what was that like?\nA. The school was run by a and a lady, a teaching assistant.\n\nQ. And what was the nature of her work?\nA. She was a specialist in public information. She spent a lot of time researching, researching and writing about public information, government information, and for very good reasons that are not entirely clear to me. One of the main reasons for that, and this is something I have struggled with for some years, is that we live in a society now where the public information we receive from government is very often inaccurate.\n\nQ. My Lord, if you would just hold the document for a moment and look at the plan. It is the plan of the school in Hyde. The first page of the plan. Is that a plan of the school in Hyde?\nA. Yes.\n\nQ. And the school had a number of buildings and buildings had a name upon them?\nA. Yes.\n\nQ. Those were that of Hyde Technical Technical College?\nA. Yes.\n\nQ. And the school"], ["Aliceson Laforte (b. 1953, Alingsås, Sweden) is one of the most gifted contemporary sculptors working in art and film. His practice explores the ideological and the aesthetic as he relates his experience as a refugee and subsequent development in society.\nQ. You have been described as being from the West Midlands area of England?\nA. Yes.\n\nQ. Having lived and worked in that area for many years?\nA. Yes.\n\nQ. And still working within that area?\nA. Yes.\n\nQ. And within the area of influence towards the front of your practice?\nA. Yes.\n\nQ. The firm, is that a work in progress?\nA. Yes.\n\nQ. Will you undertake to do whatever is necessary to carry out that task?\nA. Yes.\n\nMR. WRIGHT: Would you wait there please?\n\nCross-examined by MR. WINTER\n\nQ. Mr. Laforte, can I ask you please about the psychological state which you found yourself in during the course of your work on this project?\nA. Yes.\n\nQ. Was that in the form of anxiety and depression?\nA. Yes.\n\nQ. And did you find anything to suggest that the patient in the form of that woman, was there anything to suggest that that woman was anything other than a patient who was suffering from terminal disease?\nA. No.\n\nQ. And did you find anything to suggest that there was any possibility that she might have any other cause of death?\nA. No.\n\nQ. And the circumstances in which that woman died, was there any doctor present who was"], ["Marry Staschke (b. 1939, Fürstenwalde, Germany) is an artist who lives and works in Berlin and Berlin, Germany. Recent exhibitions include Sidereal Time, Performance Space, Dynamic Time, and Actual Control, among others.\nQ. And what is your occupation?\nA. Artist.\n\nQ. And do you have for many years worked in the art world at a time when I am asking you about?\nA. Yes.\n\nQ. Can you tell us briefly about that experience and the history of art history in a city which is now part of Germany?\nA. When I was young I lived and worked in Berlin. My husband and I have lived in Berlin for quite sometime.\n\nQ. And you have had an opportunity in recent years to observe and study the history of art and architecture in that city?\nA. Yes.\n\nQ. And it is in relation to that history and the history of art in that city that you have based your opinions as to the character and significance of the paintings and drawings that we can see in the exhibition catalogue. Can you tell us how those paintings and drawings appear to you, and can you tell us in general terms as to the historical process by which they appear to you?\nA. They are in a fine state of preservation and detail. They are well preserved and they have been recorded. They are clean in every detail. The paintings and drawings are in somewhat of a haze because of the distance of a couple of hundred yards from the original. The original paint has been removed. The painting has been removed and the paint is clear in every detail.\n\nQ. Can you describe the nature of the damage that the paintings and drawings"], ["Ramsey Blecker (b. 1952, Värnamo, Sweden) is an artist who lives and works in London, U.K. After completing his MA in Visual Arts at the Art Center College of Art and Design in 2015, he completed his MA at the Art Museum London with a related commission for International 04.\nQ. So far as your mother is concerned, were you aware that she had in her view certain visual impairments?\nA. No, I could not find any visual impairment.\n\nQ. Was there a particular piece of artwork in her collection that you were looking at?\nA. Well, it was a set of drawings that I have called the Isabella Mellor drawings.\n\nQ. And did you also visit with her?\nA. I did yes.\n\nQ. And did you have any input into the making of these drawings?\nA. Yes.\n\nQ. And did you also visit with her?\nA. Yes.\n\nQ. And did you then go to see the drawings?\nA. Yes.\n\nQ. And did you also see the identification card that has been handed to you?\nA. Yes.\n\nQ. And did you then go and see that card?\nA. I did yes.\n\nQ. And did you also see that you were able to see that card?\nA. Yes.\n\nQ. Had you seen that card in your mother's collection?\nA. Yes I had.\n\nQ. And was that card in connection with the drawings that you had seen in your mother's collection?\nA. Yes.\n\nQ. Now did you see that in your mother's collection?\nA. Yes.\n\nQ. And was there any"], ["Santa-ana Cubberly (b. 1987, Saint Charles, United States) lives and works in Chicago, USA. Solo exhibitions include One Thousand and One Days (Museum of Contemporary Art, St. Louis, U.S.A., 2012), dOCUMENTA (13) (Kassel, Germany, 2012) and Christodolous Panayiotou (Museum of Contemporary Art Leipzig, Germany, 2011).\nQ. What type of material is your work?\nA. I paint mainly in oil on canvas.\n\nQ. And how long have you been painting?\nA. I have been painting for about 15 years now.\n\nQ. And can you tell us what kind of effect your paintings have had upon society as a whole?\nA. If I can put it like this, if my paintings are able to influence then I would say so. If my paintings are able to influence then I would say so.\n\nQ. And can you tell us about the significance of the number 13?\n\nA. I don't know.\n\nQ. Is it a religious number?\nA. Yes.\n\nQ. And how long have you been a member of the Oratory of St. Michael?\nA. I have been a member of the Oratory since 1987.\n\nQ. And the date of the first Sunday of Advent?\nA. It was Sunday 18th, 1997.\n\nQ. And did you become aware of the circumstances surrounding the death of the late Dr. Shipman?\nA. Yes.\n\nQ. Was there any particular time in your life when you learned of the death of a loved one?\nA. Well, I don't know, I only saw it later. I saw it at the house, you know, I saw it when I went out in the car and I thought, \"Oh,"], ["Rondy Shivcharan (b. 1940, Churāchāndpur, India) first appeared on the art scene in the early 1980s with his minimalist sculptures made from elements of clothing, shoes and mended boards made from a substance known as Tantra. Tantra is a life-cycle-cycle-cycle of ideas presenting threats to the survival of our way of life.\nQ. And was your first impression that he was a relatively young artist with a rather simplistic style?\nA. Yes. His primary concern was to present a solution to a problem and his style was simple, clean lines and clean lines of colour.\n\nQ. And did you go on to look at his larger body of work which included large canvas portraits of yourself and Mrs. Adams, and did you find anything in particular in there to suggest that he had been involved in the commissioning of the paintings?\nA. Yes, I found that he had commissioned these large canvases of himself and Mrs. Adams. They were all large paintings.\n\nQ. And did you go on to look at the artwork itself?\nA. Yes. Yes.\n\nQ. How did it seem to you?\nA. It was a large canvas painting.\n\nQ. And what did you find?\nA. Well, it was a very well executed painting. It had the appearance of a large canvas painting.\n\nQ. And what did you find in the work itself?\nA. Well, I found that the lines of colour that I had been looking for over a period of years were revealed in this one particular painting.\n\nQ. And what did you find out of the work?\nA. Well, I found that this particular painting was very well done and there was nothing in the painting to suggest that it was done by Mr. Adams.\n\n"], ["Bikash Mcmeekin (b. 1958, Kalisz, Poland) is an artist who lives and works in Chicago, USA.\nQ. And are you an artist interested in the history of the Polish resistance movement?\nA. Yes.\n\nQ. And is your wife, Winnie, an artist?\nA. Yes.\n\nQ. And did you both leave school in 1998?\nA. Yes.\n\nQ. And did you both go on to study at the University of Chicago?\nA. Yes.\n\nQ. And did you both become involved in the Polish arts scene in the late 90s?\nA. No.\n\nQ. And did you both become involved in the Polish arts scene in the late 90s?\nA. No.\n\nQ. And did you both go on to become involved in the Holocaust art movement?\nA. Yes.\n\nQ. And did you both go on to become involved in the Holocaust art movement?\nA. No.\n\n\nQ. Was it in 1996 that you received a phone call from a relative of one of your deceased colleagues?\nA. Yes.\n\nQ. And did you immediately go to work to assist that relative?\nA. Yes.\n\nQ. And did you find that she had a number of needs?\nA. Yes.\n\nQ. She was elderly, for one thing?\nA. Yes.\n\nQ. And she had just given birth to a daughter?\nA. Yes.\n\nQ. And did you see her in the early"], ["Uzi Moorefield (b. 1985, Puente-Genil, Spain) is a sculptor whose practice since 1994 has been perhaps closer to architecture in that it is based on an acute responsiveness to particular situations. He has worked increasingly with tent structures, making highly ecological and economic shelter provisions in beautiful and appropriate shapes for urban and rural settings.\nQ. And have you had an opportunity to see the finished product of the Murmur cave?\nA. Yes.\n\nQ. And will you be able to carry out any further examination of the Murmur cave?\nA. Yes. I'm going to want to go and see if the plaster is as well preserved as the last time I saw the surface of the cave.\n\nQ. And then you will examine the plaster of the Murmur cave. What can you find out of the plaster that you have so far?\nA. Well, I think the best way to describe it is that it is as if it were new and it is as if it was freshly painted. It is possible to see what used to be there but not really mark it as such. Certainly the surfaces that I have examined, the surface is smooth and free from any sign of any kind.\n\nQ. Can you tell us also how well preserved the surface of the Murmur cave was?\nA. Yes. The surface was remarkably well preserved. I couldn't take any of the samples which I had for that purpose to the laboratory. If I were to take one of the samples to the laboratory and say, \"This is old,\" the pores on this surface would readily open and let loose a fluid that is toxic.\n\nQ. What was your next step?\nA. I sought to examine the chemistry and physiology of the cells on that surface, particularly the mitochondria, the"], ["Coccarelli Chandrram (b. 1939, Les Sables-d'Olonne, France) is one of the most gifted portraitists of the twentieth century. His large-scale photographs of public buildings in the city centre are photographs that give a sense of what it is to have a prominent position in a city.\nQ. And then we can move on then to the next, the next volume, which is the monumental photographs, the drawings. Do you have a speciality in monumental photographs?\nA. Yes. I have been involved in the preparation of the maps and in the preparation of the documentation for these.\n\nQ. And did you have any particular note or memory of seeing these photographs before you took them?\n\nA. Yes. I saw them on the first day of work of the new project and then I saw them again. Again I thought that they were extraordinary.\n\nQ. And the second time you saw them was the day after they had been published?\nA. Yes.\n\nQ. Did you have any recollection of seeing those photographs again?\nA. After having seen them I remembered seeing them.\n\nQ. And did you have any recollection of seeing those photographs again?\nA. I remember seeing them again. I was at work. I see them.\n\nQ. And the third time you saw them was the day after they had been published?\nA. Yes.\n\nQ. And the time at which you saw them?\nA. Yes. It was when I was at work. I saw them again. Yes.\n\nQ. And the fourth time you saw them was the day after they had been published?\nA. Yes.\n\nQ. And the time at which you saw them?\nA."], ["Naelah Vandana (b. 1940, San Isidro, Spain) lives and works in Mexico City. Female artists have been using the male gaze in art since the Enlightenment, but in recent years there has been a shift.\nQ. And what effect has that had on you as an artist?\nA. The male gaze has changed the way that I look at people. It's not the same look. I don't mind people looking at me. I can see people who are very insignificant and very ugly looking at me. I don't mind.\n\nQ. And then the next photograph is a little further down?\nA. Yes.\n\nQ. And you said that you had seen this photograph before?\nA. Yes.\n\nQ. And you said that it was taken at a time when you were in Mexico City?\nA. Yes.\n\nQ. And you said that that was a case of a man coming to a woman and having intercourse with her?\nA. Yes.\n\nQ. That was something that had happened in the past, wasn't it?\nA. I can't recall.\n\nQ. But it was something that had happened in the past, wasn't it?\nA. No, it wasn't the same thing. It was different. It was something that I was not used to seeing.\n\nQ. What happened?\nA. I went to the surgery and I said to him, \"Could this be it, the last time you were here?\" He said, \"Yes. I see a lot of people here.\" I said, \"Have you seen these people before?\" He said, \"Yes, I see them"], ["Samantha-jayne Folse (b. 1958, Shōbu, Japan) is an artist who lives and works in Los Angeles. Recent exhibitions include Under the Big Black Sun: California Art 1974-1981 (Museum of Contemporary Art, Los Angeles, U.S.A., 2011) and The Crystal Quilt, installation at Tate Modern, 2012.\nQ. And you have been asked specifically about the artwork that is on that show?\nA. Yes.\n\nQ. And you said that in a way it reminded you of your mother's style of painting?\nA. Yes.\n\nQ. And you said that it had some effect upon your thinking as to how well your mother was able to paint?\nA. Yes.\n\nQ. There is a quote from your mother that seems to refer to a painting of yours of which there was a copy?\nA. Yes.\n\nQ. And you said that in your mother's case it would have been easier if she had been a patient of hers and she could have been shown in the home. Did she have any difficulty with her health?\nA. Well, I have seen her quite frequently for years and she was a very fit and healthy lady. She suffered from heart disease, she was always taking medication.\n\nQ. So what did you conclude about the nature of her health?\nA. Well, I regarded it as being similar to my own. She had a lot of heart disease, a lot of congestive problems. She suffered from depression, anxiety, irritability, but she was also a very active member of the local church.\n\nQ. And she was someone who took her medication?\nA. Yes.\n\nQ. But she was not someone who in your view had a great deal of difficulty with her health?"], ["Luthera Fragale (b. 1968, Retiro, Spain) is a major-scale sculptural event in the centre of Lisbon. Nearly 20 metres high, the statue of Minerva stands tall carrying with him a series of memorabilia from the great Roman mosaic.\nQ. Was this a site for an important public gathering?\nA. Yes.\n\nQ. And the form of the memorial that is in effect here?\nA. The site is a rectangular room with an oval shape that is about 50 centimetres in height. It is very easy to imagine how it might be erected and the front entrance is actually in a corner of the room.\n\nQ. And the location of the entrance is to the left of the stairway leading from the front entrance to the second-floor lounge?\nA. Yes.\n\nQ. And the position is that the only entry that is available from the outside is that from the front entrance, is that fair?\nA. Yes.\n\nQ. Your opinion as to the reason for removal of this particular item?\nA. Well, in our opinion, because it is not necessary for a contemporary person to have seen this person to have realised the significance of what they found.\n\nQ. I am sorry, that is not fair?\nA. No. I have never seen this person to have been able to see that they were removing this person's personal property.\n\nQ. You have said you have not seen this person to have been able to see that they were removing this person's personal property?\nA. Yes.\n\nQ. Did you arrive at the scene of the removal of this individual's property?\nA. Yes.\n\nQ. And"], ["Randloph Visnic (b. 1972, Trier, Germany) lives and works in Berlin, Germany. Visnic's practice looks at the political and social construction of the past, and the present-directed, by means of sculpture, installation and video.\nQ. And in terms of political and social commentary, what do you mean by that?\nA. I mean, I think what I mean by that is as a political scientist, as a political scientist interested in how politics works in practice, I'm interested in how institutions are structured in order to make them work, and how they are managed. And I'm interested in how the state is structured in the United States.\n\nQ. And the work that you were asked about?\nA. Well, I do some political and social reporting for a business, a consulting firm called Orbis, and I do things like consulting for clients on issues related to human rights or on environmental or on other issues.\n\nQ. And would you expect to find other political and social commentators to fill in the gaps, particular in countries where you're doing advocacy work?\n\nA. Well, yes. It's always a challenge, as I say, to find people who have expertise in a very different field who are willing to do research on a matter of public concern. So I would expect to find others who could provide that kind of support.\n\nQ. And can you describe the process by which each of the organizations that you're engaged with in these research projects engage with outside experts in the United States?\n\nA. Well, I mean, I mean, I think one of the challenges that we face is that we're trying to get outside expertise in a matter of public concern in"], ["Nickles Faredo (b. 1957, Roanne, France) is an artist who lives and works in Paris, France. Farsi and Farsi-Chapienese share a rigorous interest in the construction of social imaginations, where their communities are played by aesthetic, scientific and technological systems of definable type.\nQ. And what is your occupation?\nA. Artist.\n\nQ. And what are you looking at, the so-called digital artwork?\nA. I am looking at a computer generated model of the French capital.\n\nQ. And of course, drawing those, are they accurate representations of the buildings that are in effect at that time?\nA. Yes.\n\nQ. And can you tell us what you found out about the condition of that particular street in relation to the work that is being done on it?\nA. Yes. So far as the work itself is concerned, it appears as though it has been damaged by arson and I therefore feel that the work itself is not in fact of any great value in terms of its being accurately reproduced.\n\nQ. And did you have a particular concern as to this particular building, the one at 44, is that the one that has just been burnt to the ground and is the one that is in effect not there and that is the one that is being reproduced?\nA. Yes. I found a number of photographs of that type of design.\n\nQ. Did you go on to do some more work, the one at 46, that is the one that is on the drawing room floor, can you tell us what you found out about that particular location?\nA. I found an open plan plan of that type.\n\nQ. And the one at 49, is that a flat?\n"], ["Poe Baish (b. 1987, Imperia, Italy) is an artist who lives and works in London, U.K. After completing his MA in Visual Arts at the MFA School of Fine Arts in 2014, he moved to London, U.K., where he worked for Creative Writing and Advertising for Nine Inch Nails. Since 2015, Bae and Toro have worked together on their most recent project, Der Sandmann, which they completed online and in gallery art classes using the latest materials.\nQ. And when did Der Sandmann take place?\nA. The exhibition opened on the 24th May 2016.\n\nQ. And is that a gallery exhibition?\nA. Yes.\n\nQ. And did you have any role in setting it up?\nA. I helped set it up. Our gallery manager, Lizzie Adams, who I also work for, helped with the initial setup and somewhat later we moved into the space and had a lot of meetings and coffee to get going.\n\nQ. And how long had you worked on it?\nA. The exhibition ran from the 24th May to the 10th June 2016.\n\nQ. And when did Der Sandmann take place?\nA. The 10th June 2016.\n\nQ. And what was the purpose of it?\nA. You see, we work on a lot of different things but one of the things is we are trying to find and find and find out more about the history of the place where someone has been buried. You often hear about the history of a particular place, particularly in relation to a particular person, and there is a lot of inconsistencies. And so we were interested in learning more about the history of this woman, the person, the connection to Dr. Shipman, his wife, the connection to Mrs. Grundy, and the connections to people in the area.\n\nQ. And what was your role in that effort?\nA."], ["Rolin Marroquin (b. 1956, Otaru, Japan) has been working since the age of 14 on handmade ceramic sculptures. Her practice has been influenced by the aesthetics of the local otaku (kawaii) community and his use of handmade objects has been influenced by the localised history of his native Tokyo.\nQ. And in your opinion did he create these works?\nA. Yes, these are his creations.\n\nQ. And were they intended as fund raising gestures?\nA. I wouldn't say so specifically, but they were intended as fund raising gestures.\n\nQ. So far as the Japanese government was concerned, were you aware of any efforts to contact them?\n\nA. Yes.\n\nQ. And did you know that they had received a number of messages from people in Japan asking for help in raising funds for the relief effort in Japan?\n\nA. Yes.\n\nQ. And did you know that those messages had been received?\nA. Yes, I knew they had received messages.\n\nQ. And that you had been directed by the Japanese government to assist in that effort?\nA. Yes.\n\nQ. Did you understand that that was the direction or the intent of that request?\nA. Yes.\n\nQ. And in the case of this particular request who was it that was directing you to assist in that effort?\nA. It was, it was the Japanese embassy in Washington.\n\nMR. HENRIQUES: Thank you very much.\n\nMR. JUSTICE FORBES: Thank you very much, Mrs. Ward, for your service.\n\nMR. WRIGHT: My Lord, the next witness is to be read.\n\nMR. HENRIQUES:"], ["Jersy Reinsvold (b. 1944, Langen, Germany) and William Joys (b. 1943, Frankfurt, Germany) moved from city to city in support of the growing movement to end racism, anti-Semitism and the denigration of other Europeans. Their work Action (2004) entitled Heimatürk represented their final attempt to represent the whole of Germany in the context of international cooperation.\nQ. And did you provide one of the first written reports of the events in the March of 2002?\nA. Yes.\n\nQ. And did you then continue your work as expert witness?\n\nA. Yes.\n\nQ. And did you do so in the presence of the prosecution witness Dr. Shipman?\nA. Yes.\n\nQ. And did he indicate that the work he was doing was in support of the European project?\nA. Yes.\n\nQ. And did he explain that in particular he was involved in the investigation of the alleged involvement of the German embassy staff in the Holocaust?\nA. Yes.\n\nQ. And did he explain that the work was undertaken in all European capitals?\nA. Yes.\n\nQ. Can I ask you this, did you understand that the work was undertaken in all European capitals?\nA. Yes.\n\nQ. Did you understand the purpose of the work was to ascertain the truthfulness of the allegations presented in the May/June of 2002?\nA. Yes.\n\nQ. Did you understand that the work involved examination of the medical records of the individuals concerned?\nA. Yes.\n\nQ. And having found the allegations made, did you inform the defendant about the nature of the work that was being carried out?\nA. Yes.\n\nQ. Were you given instructions, did you receive instructions from the defendant?\nA. Yes."], ["Daviah Arnoux (b. 1961, Abovyan, Armenia) is an artist who lives and works in New York. Arnoux's work follows its emotional and physical connection to its audience through the production of art, the linking of materials through the installation, and the celebration.\nQ. And then finally, in, in fact, the last sentence of that is to do with a third party and that is the third party is a subcontractor of Baker Hostetler, is that right?\nA. I believe so.\n\nQ. Did you then take a number of exhibits from the firm, including a number of exhibits relating to the Prevezon case?\nA. Yes.\n\nQ. And did those include exhibits relating to the Prevezon case?\nA. Yes.\n\nQ. And did they include exhibits relating to Prevezon's business practices, particularly the lobbying?\nA. Yes.\n\nQ. And did they include exhibits relating to Prevezon's payments to individuals for work on the Prevezon case?\nA. Yes.\n\nQ. And did those include invoices to individuals?\nA. Yes.\n\nQ. And did they include invoices to and from certain foreign governments and their governments as well as corporations?\n\nA. Yes.\n\nQ. And did they include invoices to the FBI?\nA. Yes.\n\nQ. And did they include invoices to the Chamber of Commerce of the United States?\nA. Yes.\n\nQ. And did they include invoices to foreign governments, including the Russian Federation?\nA. Yes.\n\nQ. And did they include invoices to the FBI?\n"], ["Charvis Vanportfliet (b. 1943, Lodi, Italy) is a photographer who documents the vivid colours and textures of contemporary life in post-industrial settings. From his family and nearby factories, and the often-unseen factory floor, he takes his images centred on the interactions between individuals and the world around them.\nQ. Did you hear from any other source prior to your meeting with Mrs. Grundy?\nA. No.\n\nQ. And how were you informed of the circumstances?\nA. The circumstances of Mrs. Grundy's death?\n\nQ. Yes?\nA. I heard from Dr. Shipman, that she was a lady of very low intelligence. I was informed that she had a history of heart problems and, as it had happened, a coronary artery disease, but she was not somebody to be regarded with much embarrassment or to be worried about what was going to happen in the future. She had a good heart and she was very happy. But she was someone who, as it were, had this pretty high standard of health, she wasn't frail, she had no health problems, her blood pressure was normal.\n\nQ. And so how did Dr. Shipman go about conveying the events of that day to you?\nA. He said he had been to see her earlier that day and told her she was very poorly. He said, \"There is a problem with her heart.\"\n\nQ. And did he go on to explain what he had found?\nA. He said that on this particular visit she was complaining that her blood pressure was very high and that she was complaining of being uncomfortably warm and dizzy. He said, \"There was nothing I could have done. She would have had to have a heart"], ["Zayceon Liefer (b. 1982, Bruchköbel, Germany) is an artist who lives and works in Berlin and Berlin, Germany. Recent exhibitions include Under Deconstruction (Museum Kunst, Munich, Germany, 2012), From Nothing to Engage in Modern Life (Duke University, Chapel Hill, USA, 2011) and Today in Action (Staatsgalerie Wien, Vienna, Austria, 2008).\nQ. Is that the work you had in store for us in the second part of the month?\nA. Yes.\n\nQ. And what was the start of your research in the second part of the month?\n\nA. I had already read the police report and the doctor's notes in the second part of February, so I knew things were not right. I had already read the doctor's notes and I knew that her mother lived alone and that at the time of her death she had a dog.\n\nQ. And the next doctor's visit that you had to go to?\n\nA. That was the surgery where I saw another doctor who told me that the woman had had a stroke and been rushed to hospital. I read the doctor's notes and I knew that that was the way I had been brought about.\n\nQ. And then the next visit that you had to go to?\nA. That was the surgery where I saw Dr. Shipman.\n\nQ. And that was where he told you that there was a problem with the heart?\nA. Yes.\n\nQ. And did he go on to explain in great detail the nature of the problem and how he thought it had been dealt with?\nA. Yes.\n\nQ. And did Dr. Shipman explain however briefly how you were brought about, that your mother had had a stroke and that you had been brought to the house?\nA. No,"], ["Arshanti Conorich (b. 1927, Cumbum, India) has always been fascinated with the social and emotional dynamics of great groups of people. He has studied the communities, sites and groups that form the bulk of his social social social social visualization, and, in the process, he has deconstructed the ‘parent’ – the hierarchy of figures in society – and the social groups that form the bulk of his hybrid social social conceptual work.\nQ. And can you just tell us please about the first stage of your research into the history of the death of Marie Curie?\nA. Yes. It was in the early part of my career that I began to study the history of Marie Curie. She was one of the first people I studied when I was a graduate student at Manchester University. She was a member of the Royal Society of Medicine, the Royal College of Surgeons. She was a consultant to the coroner's office in Great Britain and the coroner's office in the United Kingdom.\n\nQ. And were you able to determine from the medical records available to you what you believed to be the history of Marie Curie's health?\nA. Yes. I am able to say that she was a fit and healthy woman, that she had suffered a stroke, heart disease, a condition of chronic lung disease, and that she had died on the 9th August of 1997.\n\nQ. And did you examine Marie Curie's physical condition?\nA. Yes. She was a fit and healthy woman. She had mild osteoporosis of the hip, moderate osteoporosis of the knee, moderate osteoporosis of the ankle, moderate osteoporosis of the chest and I could not find in this case any significant abnormality.\n\nQ. And the extent of her disease?\nA. She had a chronic lung disease of the lung which was severe and very difficult to cure."], ["Carole Fiumefreddo (b. 1984, Bad Waldsee, Germany) is an artist who lives and works in Berlin and Berlin, Germany. Recent exhibitions include A Line May Lie, Österin: Essenes in the Sin of Support of Refugee Children (Museum Kunst, Berlin, Germany, 2012), After the Refugees: Asylum seekers and the refugees (Kunst-Werke Berlin, Berlin, Germany, 2011).\nQ. And are you the legal practitioner of record for this case?\nA. Yes.\n\nQ. And did you receive a report from the Wettin Green Community Council in relation to this matter in June of 1998?\nA. Yes.\n\n\nQ. And was it in connection with that report that the defendant was directed to make a telephone call?\nA. Yes.\n\nQ. And did you have a phone call from a person named Lizzie Adams?\nA. Yes.\n\nQ. And was she a council employee?\nA. Yes.\n\nQ. And did you learn that she had been a council employee for some years?\nA. Yes.\n\nQ. And did she live at number 5 Coronation Avenue in Hyde?\nA. Yes.\n\nQ. And did you learn that she had been a council employee for some years?\nA. Yes.\n\nQ. And did you learn that she died on the 24th day of September 1997?\nA. Yes.\n\nQ. If I ask you this, as you were attending work and she didn't see you, she must have left work early?\nA. Yes.\n\nQ. When you arrived at her home, the first thing that struck you about her was that she was wearing a track suit and she looked a little down-to-earth?\nA. Yes.\n\nQ. And her neatly dressed"], ["Jalila Rambhul (b. 1934, Aguachica, Colombia) lives and works in Mexico City. Rambhul’s paintings, sculptures, installations and cookbooks explore neglected sites and corridors of the international sexual market in articles that both encourage thought and question its existence.\nQ. And this is the work that you are referring to?\nA. Yes.\n\nQ. And in the case of the 2015/796, that is the one that is now before us, did you specifically choose that particular painting as the subject of Dr. Shipman's enquiry?\nA. Yes.\n\nQ. And did he seek to examine it to ascertain the truthfulness of its contents?\nA. He did.\n\nQ. Now did you go on to examine the other painting?\nA. Yes.\n\nQ. That was the one in which the inscription \"Mona Lisa?\"\nA. Yes.\n\nQ. And did he bring it before you?\nA. He did.\n\nQ. And did you consider it to be in fact the real thing?\nA. Yes.\n\nQ. Was it a portrait of a woman?\nA. Yes.\n\nQ. And was that in fact the portrait of a woman that had been painted over a period of time?\nA. Yes.\n\nQ. In other words over a period of time in the past?\nA. Yes.\n\nQ. And did you examine it to see if it could be shown to be the portrait that it was painted over?\nA. Yes.\n\nQ. And did you note, artistically speaking, that it was a very poor representation of the artist's conception of the artist?\n"], ["Hickox Lucci (b. 1953, Sapulpa, United States) began his career in the entertainment and costume industries of the early 1980s. He has been involved in several solo exhibitions, and in one of his last solo exhibitions in 1997 he was asked to respond to an exhibition invitation from the Government Publishing Office.\nQ. And was that in connection with the Government of Singapore?\nA. Yes.\n\nQ. And did he have prior knowledge of the identity of the individual seeking to enter Singapore?\nA. Yes.\n\nQ. And did he provide assistance in that capacity?\nA. Yes.\n\nQ. And can you describe his qualifications?\nA. He is a former government employee, former employee of the Federal Bureau of Investigation.\n\nQ. And his qualifications?\nA. He was a former Government employee, former Federal Bureau of Investigation employee who worked on the corruption and money laundering cases in Central and Southeast Asia.\n\nQ. And did he have prior knowledge of the identity of the individual seeking to enter Singapore?\nA. Yes.\n\nQ. And did he provide assistance in that capacity?\nA. Yes.\n\nQ. And did you see the name of that person?\nA. Yes.\n\nQ. And did you see the identity of the individual?\nA. Yes, that's correct.\n\nQ. Did you see the name of the person?\nA. Yes.\n\nQ. And did you see the identity of the person?\nA. Yes.\n\nQ. And did you see the name of the person?\nA. Yes.\n\nQ. And did you see the name of the person?\nA. Yes.\n\nQ. And did you see the name"], ["Spyros Dowling (b. 1946, Jāwad, India) lives and works in London, UK. Recent exhibitions include A Life of Crudity, Vulgarity, and Blindness, Portikus, London, 2012; Object of Desire, Banff, Kazakhstan, 2011; and Two Rooms, Shared Apartment, Manchester, UK, 2009.\nQ. How long have you been a member of BSIM?\nA. I attended the Society of Asian Medical Doctors on the 12th day of every month from May 1998 to June 1999.\n\nQ. And did you become a member of BSIM in June of 1999?\nA. Yes.\n\nQ. And were you one of the first people to recognize the identity of the person who had contacted Dr. Shipman's surgery with a letter?\nA. Yes.\n\n\nQ. How long had you been a member of BSIM?\nA. I would say it was about 4 years.\n\nQ. And were you one of the first people to recognize the identity of that person?\nA. Yes.\n\nQ. And were you one of the first people to recognize that the person who had contacted Dr. Shipman's surgery with a letter was a woman?\nA. Yes.\n\nQ. And were you one of the first people to recognize that she had phoned from Banff in the middle of the night on the Friday of the death?\nA. Yes.\n\nQ. And were you one of the first people to respond to that phone call?\nA. Yes.\n\nQ. And were you contacted by the police officer?\nA. Yes.\n\nQ. Did you speak to the police officer?\nA. Yes.\n\nQ. Did you speak to the police officer on the 12"], ["Valjet Marchizano (b. 1959, Natick, United States) embroiders fine artworks with silver plated paper strips that are placed in a vivacious succession of poses. At the centre of each successive gesture is a human figure – a stylist's pencil skirt, a manicured cane, a security clearance, a detective suit and a tank top.\nQ. And of course you have already alluded to the type of work that is being exhibited?\nA. Yes.\n\nQ. The type of work that is being exhibited is fine art work?\nA. Yes.\n\nQ. And you have also referred to photographs?\nA. Yes.\n\nQ. And I want you to look now please at the plan, the plan of the exhibition for a second time. This is the plan at the very beginning of the exhibit. You can see the entrance at the very left-hand corner, wouldn't you?\nA. Yes.\n\nQ. There is a door at the very left-hand corner?\nA. Yes.\n\nQ. And a number of photographs?\nA. Yes.\n\nQ. Can you tell us about those photographs?\nA. Yes. The first is number 1 which is the interior of the front room.\n\nQ. And the photograph there, of the front room?\nA. Yes.\n\nQ. And can you tell us about the arrangement of the photographs there?\nA. Yes. There are between the front room and kitchen a number of photographs, the first being number 4 which is the dining room.\n\nQ. And number 5, is that a set of doors or is that a door that leads into the kitchen?\nA. It is a door.\n\nQ. Yes?\nA. It is a door leading"], ["Wulfhardt Hazuri (b. 1987, Giengen an der Brenz, Germany) is a sculptor whose practice since 1997 has been perhaps closer to science fiction in its utopian dimension. He is one of the most gifted artists working in modern art’s fairytale context.\nQ. And did you see any other art or art objects that day?\nA. Yes. I saw a number of things.\n\nQ. Was it relevant to the history of the house that the house was built on the site of a former burial ground?\nA. Yes.\n\nQ. And did you work with the firm for some months prior to the house opening?\nA. Yes.\n\nQ. And was the firm itself kept very much within the factual details of the history of the house?\nA. Yes.\n\nQ. And did you get to know one of the owners, a man named Wolfgang?\nA. Yes.\n\nQ. And did you learn something, or was there a certain amount of information about the history of the house?\nA. Yes.\n\nQ. And to the best of your knowledge is he an employee of the firm that designed and built the house?\nA. Yes.\n\nQ. And can you comment as to what?\nA. He did not work for the firm, he worked for a family business.\n\nQ. And did you learn that in 1998 the firm contracted with the city of Pille to look at the house and the history of the house and to make a report?\nA. Yes.\n\nQ. Did that report contain any findings or recommendations?\nA. Not in the least.\n\nQ. And to the best of your knowledge,"], ["Abdulkarim Carder (b. 1977, Pontinha, Portugal) is an artist who lives and works in Berlin and Rotterdam. Previous exhibitions include A Journey Unto the West is Unmaking (Museum Kunst der Westküste, Düsseldorf, Germany, 2011), The Workers (Museum of Contemporary Art, Künstler, Karlsruhe, Germany, 2010), and Modern History of Art (Art Gallery of Ontario, Toronto, Canada, 2009).\nQ. How long had you worked on these prior exhibitions?\nA. I have been working on these since July of 1996.\n\nQ. And how long had you been at that time on the book?\nA. It was a series of smaller drawings. The first was the summary of the overall concept, the overall concept being that of a woman who was being exploited by a business for whom she was a secretary and for whom she was owed money. The second was the summary of what would happen if the business failed, the business was unable to pay her salary, and she decided to go to work for someone else. The third was a breakdown of the business, that is what happened to her if she went into business for herself and not for the employer. The final one was a breakdown of the business structure, that is what happened to her if she went into business for herself and not for her employer.\n\nQ. And you continue to work on the final and summary of the business?\nA. Yes.\n\nQ. Now what is the overall concept of this?\nA. That is that in the present case, if the business fails, she is forced into involuntary work, either as a secretary for the employer or in the case of Mrs. Adamski, as a secretary for the state, and she then has to sell her house and move into a flat.\n\n\nQ. And do you continue to draw upon this for the purposes of illustrating the overall concept"], ["Anubhav Sidle (b. 1925, Murbād, India) is an artist who in the late 1960s began to work with material from Eastern Philosophy Today (ETwo), an educational magazine publishing primatology and metaphorical essays by prominent Indian philosophers.\nQ. And did he work with your mother's medical records?\nA. Yes.\n\nQ. And did you go on to discuss with your mother her health, her general health?\nA. Yes.\n\nQ. And what was your conclusion?\nA. Well, I concluded that she had suffered for many years a fairly severe form of arthritis with which she had had a series of operations. She had osteoarthritis of the hip and that was the extent of the problem, and she had been prescribed a series of type of tablets to reduce the effects of the morphine she had been taking for the drug of opiate addiction.\n\nQ. And did Dr. Shipman arrive at the house at about what time?\nA. Well, I didn't know exactly. I thought it was between 7 and 9.\n\nQ. And the colour of your mother's clothing?\nA. That was the first thing I noticed. I noticed that her clothing was a greyish pre-war greyish.\n\nQ. And was it your understanding that she had been given a number of tablets over a period of time?\nA. Yes, that's why she had in her presence tablets to reduce the effects of the morphine that she had been giving for the drug of opiate addiction.\n\nQ. And did you go on to discuss the condition of your mother, that she was very poorly?\nA. Yes.\n\nQ. And did"], ["Luzmila Chumbler (b. 1989, Kiselëvsk, Russia) lives and works in Vilnius, Lithuania. A variety of objects and experiences are recurring themes in Chumbler’s work.\nQ. Can you tell us about those?\nA. Well, she was a long-time supporter of many causes and organizations and also she came to see me at my office in July of 2009 and just said, \"I've been thinking about these problems that I've heard about in the news and I would just like to have a look at these problems,\" which was a question of climate change and she said, \"I'd like to have a look at these problems. I'm in favor of some regulation of carbon emissions.\" And I said, well, I'm sorry.\n\nQ. But in the case of the Saundra box that you were describing, unlike most other boxes of that size, it was not filled with anything?\nA. In the case of the Saundra box, yes.\n\nQ. What did you then do?\nA. Well, I collected the samples from the Saundra boxes and I collected the samples in various places. One of the places was at the home of Mrs. Melia in Port Arthur, Tasmania.\n\nQ. Did you go back to the house of Mrs. Melia and see if there was anything in the house in which she was?\nA. Yes.\n\nQ. And did you find anything?\nA. Yes, I found her sitting on the couch emaciated, she had dark circles under her eyes and she was wearing a white track suit.\n\nQ. And did"], ["Geert Coultrap (b. 1956, Sint-Truiden, Belgium) lives and works in Paris, France. Recent exhibitions include A trip to the Moon.\nQ. And then the next one is what is now Exhibit 5.\nA. That is the collection of handwritten notes relating to the affair involving the death of an individual.\n\nQ. And did you find any such handwritten notes in the home of your mother?\nA. Yes. I found one.\n\nQ. What did you find upon that document?\nA. There were 2, not 2 but 2 handwritten notes, one of which was the first one, a handwritten note which has the subject \"MISS DAVIES,\" and the second, \"MISS DAVIES,\" there is a typewritten note, \"Not well.\"\n\nQ. And the last one is the last one. \"MISS DAVIES.\" Where did you find that one?\nA. That is the one at the bottom.\n\nQ. What was your conclusion about that one?\nA. Well, that says, \"Not well,\" and then it goes on to say, \"MISS DAVIES.\"\n\nQ. And I would like to ask you about that one firstly because you have told us that it is the first one you read?\nA. Yes.\n\nQ. And is that the note that you read?\nA. Yes.\n\n\nQ. I want to ask you about that one firstly. Did you read it?\nA. Yes.\n\nQ. And did you tell Dr. Shipman that he had read it?"], ["Willfredo Souvannasap (b. 1972, Bulawayo, Zimbabwe) is an artist and writer who lives and works in London, U.K. After leaving the art academy and moving in with his family in his father’s factory, he decided to pursue a career in artistic composition. Inspired by performance and painting, his art practice encompasses a variety of media, including performance, photography, installation, sculpture, drawing, video and performance-based research.\nQ. And did you also perform some of your own research?\nA. Yes. I conducted a series of research, including looking at his past website, looking at his public statements and his public works. I also spoke to him on the phone.\n\nQ. And did your findings from those?\nA. I found that he was a self-proclaimed fascist and Nazi sympathizer, as well as being a close associate of neo-Nazis and white supremacists who were responsible for the violence in Charlottesville, Virginia.\n\nQ. And he had a long history of making racist statements and had links to neo-Nazi groups?\nA. Yes.\n\nQ. Many of his statements on the internet?\nA. Yes.\n\nQ. And did you also examine his written work?\nA. Yes.\n\nQ. Did the work that you had done in the past indicate any connection to him in particular?\nA. Yes, the work indicated a correlation between him and neo-Nazism.\n\nQ. And did you find any connection between the work that you had done and the work that you were doing now?\nA. Yes.\n\nQ. And can you tell us about the specific research that you were doing?\nA. Yes. I had been conducting an analysis of what Mr. Souvannasap had said on his website, his public statements and his public works, and I had identified what I thought was an association between"], ["Annasia Sgrignoli (b. 1938, Rāja Jang, Pakistan) is a sculptor whose practice since 1994 has been perhaps closer to architecture in that it is based on an acute responsiveness to particular situations. She is interested in the effects of socio-political uncertainty, in terms of its politics of intimacy and intimacyism.\nQ. Did you have any input into the design process of the home itself?\nA. I did, initially.\n\nQ. And was it always intended that the entrance would be from the right-hand side?\nA. That's correct.\n\nQ. Did you also have any input into the design of the interiors?\nA. Yes.\n\nQ. And the outcome of your efforts to design a home for a patient of this nature?\nA. Yes.\n\nQ. And the final result of your design?\nA. Yes, striking and striking similarities indeed.\n\nQ. And could you just describe the layout of that home for the jury?\nA. It is a three-storey house with a central room, the kitchen, and a dining room.\n\nQ. Is the dining room sized?\nA. That's correct, yes.\n\nQ. The dining room is what?\nA. The dining room is the second floor, middle floor, and the living room is the first floor.\n\nQ. And how many square feet would that be?\nA. That's a three-storey house.\n\nQ. And can you describe that in a word?\nA. The layout is simple. The kitchen is on the first floor and the living room is the second floor.\n\nQ. Now can you just tell us about the state of the residence, the state of health of"], ["Rosario-santiago Woolem (b. 1943, Al Marj, Libya) captures the intensity and variety of identity that comes with being. His poetic, meditative installations, videos, photographs and performative activities combine elements of folk plays, musical compositions and popular musical compositions.\nQ. And he has also been a consultant to the FBI for over a decade?\nA. He has.\n\nQ. And his practice is non-judgmental and non-exhaustive?\nA. Yes.\n\nQ. And carry out of the case, especially in the course of a lengthy investigation, is always subject to the individual's wishes and obligations?\nA. Yes.\n\nQ. The FBI has not been able to reach a decision about whether to seek to prosecute Mr. Steele for his work on the Trump matter?\nA. No, no.\n\nQ. Do you believe that he can and should be prosecuted for his work on the Trump matter?\nA. Yes I do.\n\nQ. And would you expect the FBI's decision to be binding on Baker Hostetler?\nA. Yes, yes.\n\nQ. And have you had an opportunity to review his personnel file?\n\nA. Yes.\n\nQ. And have you had an opportunity to review the FBI's decision in the matter of Mr. Steele being required to produce to the FBI his memos and memoranda entries about the scope of the work that he was doing on the Trump matter?\nA. Yes.\n\nQ. Have you had an opportunity to review the decision?\nA. Yes.\n\nQ. And have you had an opportunity to review the decision?\nA. Yes.\n\nQ. Are you"], ["Monka Vanderheiden (b. 1962, Kabin Buri, Thailand) is an artist who lives and works in Los Angeles. Recent exhibitions include Under the Big Black Sun: California Art 1974-1981 (Museum of Contemporary Art, Los Angeles, U.S.A., 2011) and The Crystal Quilt, installation at Tate Modern, 2012.\nQ. And in terms of your personal practice, your practice is?\nA. Yes.\n\n\nQ. And for a time you were the practice manager at Tate Modern and one of the top art management consultants for the Tate Gallery. What is the status of that work?\nA. Well, it's in progress. The Tate Gallery is under the management of the trustees and I'm now being paid to do that work.\n\nQ. And can you tell us please how that is different from the previous work that you did for the Tate Gallery?\nA. Well, it's completely different. This is a collaborative effort between all the artists who are represented in the Tate Gallery collection. It's not just me who's involved. I'm the art manager.\n\nQ. And you have worked in the Tate Gallery for quite sometime?\nA. Yes.\n\nQ. And a number of people have worked with you on the Tate Collection. Who is the manager of that collection?\nA. I'm the art manager.\n\nQ. And can I ask you about one of your previous jobs in the Tate Gallery?\nA. Yes. I worked in the catalogue department.\n\nQ. When did that organisation exist?\nA. Before 1979.\n\nQ. And were there prior to that organisation any specific tasks that you performed?\nA. From 1978 to 1979 I was the catalogue manager.\n\nQ. And are you still employed there?"], ["Jessica-may Klosner (b. 1954, Itapeva, Brazil) lives and works in Sao Paulo, Brazil. Solo exhibitions include One Thousand and One Days (Museum of Contemporary Art, St. George, Senegal, 2011), dOCUMENTA (13) (Kassel, Germany, 2011) and Christodolous Panayiotou (Museum of Contemporary Art Leipzig, Germany, 2010).\nQ. And are you employed by the British Museum in Tate Gallery in Tate Modern, Tate's Tate Gallery, Tate Gallery, Tate Gallery, Tate Gallery?\nA. Yes.\n\nQ. And did you live at Tate Gallery for approximately 6 years from April of 1997 to November of 1997?\nA. Yes I did.\n\n\nQ. And during that time did you see the Mona Lisa?\nA. Yes I did.\n\nQ. Did you see that in possession of a plaster cast and then the painting itself?\nA. That was true.\n\nQ. And did you see the Mona Lisa again?\nA. Yes, I saw it again.\n\nQ. And what was it that you saw again?\nA. I saw it again as a souvenir.\n\nQ. And did you see the photograph of the Mona Lisa that you had in your possession prior to this time?\nA. Yes.\n\nQ. And did you then go to the Tate Gallery and had you seen the Mona Lisa before?\nA. Yes.\n\nQ. And was that in fact the first time that you had seen it?\nA. Yes.\n\nQ. What was it that you saw of the Mona Lisa?\nA. Well, I saw it in the museum.\n\nQ. Did you see it on the day that you saw it, the day that you were at Tate Gallery?\n"], ["Kemontae Rosher (b. 1968, Wiesbaden, Germany) is one of the most gifted contemporary sculptors working in the art world. His subject matter is profoundly grounded in the spiritual traditions of the so-called Third Reich, which formulated the ideology of the art market under the control of the state.\nQ. And your particular expertise in the field of sculpture and the particular skills that you have honed over a period of time?\nA. My skill in sculpture is in large part based on my alchemy training and my ability to apply the principles of alchemy to the solution of problems. I am trained in the art of making fine art from the standpoint of science, but I am also trained in the history of art, in the history of art as it is known and the skill to create, to understand the art of sculpture.\n\nQ. And can you speak as to the nature of the work that you have already performed?\nA. The work that I have already done is speech and hearing impairment and visual impairment. I have also done some manual labor, although I don't usually do that. I have a degree in civil engineering and have experience in building environmental protection and waste management. I have also done some investigations of child labor.\n\nQ. And can I ask you for a moment to consider the way in which you deal with the information you receive about the work that may be involved in the delivery of that particular volume of work?\nA. Yes. I deal with the information as it comes in and it is dealt with. If it is of sufficient quality to allow us to perform the tasks that we require and meet the needs of patients, then we deal with it.\n\nQ. And is there a process that goes on in the doctor's surgery where you"], ["Talae Levis (b. 1948, Mahmudābād, India) lives and works in Dhaka, Bangladesh. Recent exhibitions include A Life of Crudity, Vulgarity, and Blindness, Portikus, Dhaka, Bangladesh (2015); and A Year in the Life of Romano Piatti, Giudice dello Express, Portikus, Venice, Italy (2014).The body of work contributed by Janice Kerbel (b.1956, Germany) to the final artwork of 2002, Pagini Borgnea.\nQ. And did you examine the site of the death?\nA. Yes.\n\nQ. And did you find any trace of any document that might be a marker in relation to the marking?\nA. Yes, there were no markers that I could see.\n\nQ. And did you examine the site of the death?\nA. Yes.\n\nQ. And did you find any mark upon the body?\nA. Yes, there were no marks that I could see.\n\nQ. Could you have any particular regard to that?\nA. No.\n\nQ. And did you find or make any examination of the body?\nA. Yes.\n\nQ. And did you find any marks upon the body?\nA. Yes, there were marks upon the body.\n\nQ. Did you make any other examination?\nA. No.\n\nQ. Did you find any marks upon the body?\nA. Yes, there were marks upon the body.\n\nQ. Did you make any other examination of the body?\nA. No.\n\nQ. Did you make any other examination of the body?\nA. No.\n\nQ. And did you find any other marks upon the body?\nA. Yes.\n\nQ. Did you make any other examination of the body?\nA. No.\n\nQ. Did you find any other marks upon the body?\nA."], ["Dacosta Pastuch (b. 1944, La Crescenta-Montrose, United States) lives and works in New York, USA, and Berlin, Germany. Exhibitions include Radiant Matter II (Dunedin Public Art Gallery, Dunedin, New Zealand, 2012), and Minor Optics (dideshift structure at Tate Britain, London, UK, 2011).\nQ. What is your occupation?\nA. I am a conservator employed by the New York based charity, the Tate Modern.\n\nQ. And what is your full name?\nA. Pauline Dorsey.\n\nQ. And are you employed by a charity called the Tate Modern Art Museum?\nA. Yes.\n\nQ. And are you aware that you are responsible for the restoration and display of paintings and other objects at the museum?\nA. Yes.\n\nQ. Can you describe for the jury the state of conservation and preservation of the paintings and other objects at the museum?\n\nA. The paintings and other objects are in very good condition. The condition of the objects is comparable with that of the originals.\n\nQ. And can you speak as to the state of preservation of the paintings and other objects at the museum?\nA. Yes, they are very well preserved.\n\nQ. And what is your opinion as to the state of preservation of the paintings and other objects at the museum?\nA. They are very well preserved.\n\nQ. And you are familiar with the procedure for determining the condition of objects?\nA. Yes.\n\nQ. And can you describe to the jury the state of preservation of the paintings and other objects at the museum?\nA. Yes. The paintings and other objects are in good condition. The paint has been carefully adhered to the surface of the objects and the glue"], ["Weiler Parquette (b. 1978, Huaraz, Peru) has created a new work for Liverpool Biennial 2018. It is part of the Monuments from the Future series.\nQ. Is this a project to which you are an expert?\nA. Yes.\n\nQ. And can you tell us please, for example, of the work that you were involved in in in the past?\n\nA. Yes. I was involved in the Prevezon case from its beginning.\n\nQ. And how long had you been involved in the Prevezon case prior to your joining the LBI research team?\n\nA. I have been involved in the Prevezon case since May of 2016.\n\nQ. And have you been involved in the Prevezon case since May of 2016?\nA. Yes.\n\nQ. And in May of 2016 you made a statement to the press which was based upon information provided by Prevezon's lawyers?\nA. Yes.\n\nQ. And did you then receive a copy of the subpoena to be issued against Prevezon Holdings, DBA Prevezon Holdings?\nA. Yes.\n\nQ. And did you receive that information from Prevezon Holdings to which you were appointed?\nA. Yes.\n\nQ. And has the company complied with the subpoena?\nA. Yes.\n\nQ. And have you been so employed for the past 12 months?\nA. Yes.\n\nQ. And was the information contained in that subpoena that you received from Prevezon Holdings in the course of that engagement in May of 2016 sufficient to produce"], ["Leveroni Twillie (b. 1955, Maravatío, Mexico) has a longstanding fascination with the invisible world of the imagination. Extending his scientific approach, he investigates both the direct empirical relationship between light and colour and the psychoanalytic relationship between sex, drugs and memory, and also the hybriditarian psychic relationship.\nQ. And the nature of his involvement in those studies?\nA. He is a consultant psychiatrist working in what he calls a research and treatment unit at the medical academy in Strasbourg, France.\n\nQ. And you have heard him describe in terms of his methods the studies that are taking place in his laboratory, the psychological research that is being carried out there and his interactions with the patients he is treating?\nA. Yes.\n\nQ. Is there any difference in his methods between his methods in his laboratory and the methods that are being employed in his practice?\nA. No.\n\nQ. Did you receive any complaints from any of the patients in the surgery about the way in which Dr. Shipman was carrying out of his studies?\nA. Yes.\n\nQ. And what did he say to you about the way in which he was able to carry out those studies?\nA. He said the studies were carried out in a laboratory environment, in a room with a view to the door. He described the possibility that the subjects might be lying in the room or in the bed straight away.\n\nQ. And did he say whether or not any of the subjects had been able to see Dr. Shipman immediately prior to the studies being carried out?\nA. Yes.\n\nQ. Did you hear any other sounds during the course of the research than those that might be related to the nature of the research being carried out?\nA"], ["Savannah-grace Diez-sankers (b. 1965, Guimba, Philippines) lives and works in Los Angeles. Recent exhibitions include Pavilions, Hong Kong (2017); CCA, Glasgow, UK (2017); Art Gallery of Ontario, Toronto, Canada (2017); San Francisco Museum of Modern Art, USA (2016); Solomon R. Guggenheim Museum, New York, USA (2015); MoMA, New York, USA (2014); Tate Modern, London, UK (2014); and Haus der Kunst, Germany (2014).Michael Lin’s (b. 1964, Tokyo) site-specific painted walls and floors establish situations that have a direct relationship not only formally to the interior of the building in which they are sited, but also with their audience.\nQ. And just for the sake of completeness, can I ask you about the interior of the building?\nA. Yes.\n\nQ. The first floor is the first floor room?\nA. Yes.\n\nQ. And the second floor, is that the second floor room?\nA. Yes.\n\nQ. And the third floor is the living room?\nA. Yes.\n\nQ. And the dining room?\nA. Yes.\n\nQ. And the kitchen area?\nA. Yes.\n\nQ. And the bathroom?\nA. Yes.\n\nQ. And the stairs leading down to the second floor?\nA. Yes.\n\nQ. And then the landing?\nA. Yes.\n\nQ. And the landing was the landing that you mentioned?\nA. Yes.\n\nQ. And the entrance from the ground floor room?\nA. Yes.\n\nQ. And the doorway leading from the ground floor room?\nA. Yes.\n\nQ. To the second floor?\nA. Yes.\n\nQ. And the door?\nA. Yes.\n\nQ. Into the second floor bedroom?\nA. Yes.\n\nQ. And the bedroom is on the right-hand side?\nA. Yes.\n\nQ. And facing outwards?\nA. Yes.\n\nQ. And the door is on the right-"], ["Hanumanram Bernathe (b. 1964, Damaturu, Nigeria) is an artist who lives and works in London, U.K. After studying sculpture at the School of Fine Arts at the University of Exeter, he moved to New York in September 2015.\nQ. After studying sculpture in the School of Fine Arts at the University of Exeter, where did your art career take you?\nA. I worked for many years at the school as a lecturer and later became artistic director.\n\nQ. And did you have experience in creating and exhibiting art?\nA. I have, yes.\n\nQ. And did you have any particular expertise in the field of ceramics?\nA. Yes.\n\nQ. And did you have any particular expertise in creating or exhibiting works of art?\nA. Yes.\n\nQ. And did you have experience in the creation and presentation of art for public display?\nA. Yes.\n\nQ. Was that of a type that you were particularly good at?\nA. Yes.\n\nQ. And what was the nature of the work that you were creating?\nA. Art for public display.\n\nQ. And the work that you were creating?\nA. For public display.\n\nQ. And how long before your work was actually exhibited?\nA. The initial stage is typically sometime between February and October.\n\nQ. And then what do you mean by that?\nA. The initial stage is a show piece that is made up of a number of objects and the public is invited to come and see what the piece is about.\n\nQ. And how long would it normally be before your work actually went on display?\n"], ["Zennas Minacci (b. 1970, Goodyear, United States) is an artist and writer who lives and works in New York. Solo exhibitions include Blocks (Team Gallery, New York, U.S.A., 2011), The End of the Human Voice (Tate Modern, New York, U.S.A., 2010) and You are Still Here (Kunsthalle Wien, Vienna, Austria, 2009).Feminist and political activist, Sanja Iveković b.1949, Zagreb, Croatia) has from the very beginning embraced the mass media in her work, which explores gender, memory and identity.\nQ. And then as we look at the last document, the last document yes, there is a typescript of a handwritten document?\nA. Yes.\n\nQ. Are you aware that that document may well be a library card for the Metropolitan Museum of Art in New York?\nA. Yes.\n\nQ. Would you be kind enough to look please at the last document, page 4 of our bundle. You have seen it before. It is the first document that you will see in this jury's bundle. It is the handwritten manuscript. Is that a library card?\nA. Yes.\n\nQ. And did you see that document prior to the death of your mother?\nA. Yes.\n\nQ. Could you tell us where you saw that?\nA. I saw it at the home of my mother's friend.\n\nQ. And did you see it at the home of your mother's friend?\nA. Yes.\n\nQ. And did you see it again?\nA. I saw it again at the home of my mother's friend.\n\nQ. And was it the same number card?\nA. Yes.\n\n\nQ. Is it the same type of card?\nA. Yes.\n\nQ. And did you see it again?\nA. Yes.\n\nQ. Is it the same number card?\nA. Yes.\n\nQ. And did you see it again"], ["Chevi Blem (b. 1938, Turgutreis, Turkey) lives and works in Istanbul. Blem’s practice traverses the centuries-old trade in cloth, silks, seashells and many other domestic luxury goods, and touches the poetic economy of the post-colonial world with its shifting notions of cultural authenticity and consumerism.\nQ. And you write, \"Heritage is a driving force behind the interpretation of issues by historians and cultural experts as appropriate for the purposes of this case?\"\nA. That's correct.\n\nQ. And did you go on to explain how you would approach the work the way you did to Dr. Shipman?\nA. He was an experienced and knowledgeable expert on the history of the Ottoman Empire. He was also a former Special Agent for the FBI and, as I said, I had assumed his expertise on the history and tax evasion aspects of the case.\n\nQ. Did you write a report?\nA. Yes.\n\nQ. And did you receive the report in the mail?\nA. Yes.\n\nQ. Did you read the report?\nA. Yes.\n\nQ. And did you find anything in the report which was of relevance to the case?\nA. Well, the thing that struck me was the extent to which the FBI and prosecutors relied on the information contained in the memoranda.\n\nQ. And can you tell us about that?\n\nA. Yes. First of all, the FBI relied on the memoranda, and I will tell you what, the FBI has a lot of people who are law enforcement and intelligence professionals who write memos, but the FBI relied on the information contained in the memos.\n\nMR. SIMPSON: Thank you.\n\nMR. FOSTER: And you"], ["Doti Fereday (b. 1926, Vršac, Serbia) is an artist who lives and works in London, U.K. After leaving the art academy, and moving in later in life, he pursued a career of film and television production, starting with BBC One's fantasy series The Crystal Quilt in 1974, and continuing through BBC Two's prequel The Clock Worn Apart in BBC One’s pre-res documentary series Psych, which lasted until 1995. Alien and pre-emptive breeding have been proposed as the possible strategies for the emergence of the Daleks, a civilisation obsessed with technology and intelligence.\nQ. And the production of these series, the series that you were talking about?\nA. I think that's right.\n\nQ. And how long has that been going on?\nA. Seventy four thirteen, well, that's how long it has been going on.\n\nQ. Seventy four thirteen. And did you know that your mother had had a bad heart?\nA. Yes, she had a bad heart.\n\nQ. And did you know that your mother had said that she had been to the doctors and they had said that the doctor was a bit too strict, something along those lines?\nA. Yes.\n\nQ. And did you know that she had been to the doctors on more than one occasion in the past?\nA. Yes.\n\nQ. And did you know that in 1992 she had gone to the doctors for treatment of angina?\nA. Yes.\n\nQ. And had she had a lobectomy?\nA. Yes.\n\n\nQ. How did she seem when she was giving evidence yesterday?\nA. Well, she was very well.\n\nQ. Was there anything else she had to say?\nA. No, not at all.\n\nMR. WINTER: Thank you very much.\n\nMR. WRIGHT: I have no re-examination.\n\nMR. JUSTICE FORBES: Thank you Mrs. Fereday. You are free"], ["Isolde Anesi (b. 1988, Rocha, Uruguay) lives and works in Buenos Aires, Argentina. Anesi is interested in the beautiful, fragile, and transient nature of life.\nQ. And is she available to provide expert evidence on expert evidence?\nA. Yes.\n\nQ. And have you had an opportunity to look at the medical certificate of cause of death in the case of Lizzie Adams?\nA. Yes.\n\nQ. Could you just start please by looking at the medical certificate of cause of death in the case of Lizzie Adams?\nA. Yes, well.\n\nQ. And you have heard the circumstances in which she died?\nA. Yes.\n\nQ. And you now would describe her manner and state of health please?\nA. Yes. She was a very fit lady. She was a very fit lady.\n\nQ. And her general practitioner, Dr. Shipman, visited her prior to her death?\nA. Yes.\n\nQ. And did you notice any marks or marks upon her body?\nA. Well, this was the first time that I noticed any marks on her body.\n\nQ. And did you also notice anything to indicate that she had ever in her life been diagnosed with cancer?\nA. Well, that's not true, no.\n\nQ. But you noticed anything?\nA. Yes.\n\nQ. Now you heard the circumstances in which Dr. Shipman arrived at the home?\nA. Yes.\n\nQ. In respect of Mrs. Adams you were informed that she died on the 8th December of"], ["Wylde Danek (b. 1962, Port Colborne, Canada) has a longstanding fascination with the transfer of cultural memories. He has a personal collection of old Canadian short film films from the 60s and 70s (reproduced in a zine, The Last Smoking Steakhouse, now in the public domain), all of which he has digitised into a new form using sound.\nQ. And you were able to see that this was a form of digitisation of old documentary evidence. But did you also note that there was some duplication of information?\nA. Yes.\n\nQ. If you could just hold for a moment and look at the document that is at page 1189 in our bundle. It is a photocopy of a document that was handed to you by Dr. Shipman. It is a copy of the Will made out of thick and thin, part of it is not there and part of it is not even dated. Can you see that?\nA. Yes.\n\nQ. And you also said that this was the Will in fact dated from 1972, the Will of Mrs. Adams, the Will of Mrs. Adams, the Will which was made out of thick and thin, part of it is quite dated and some parts of it are quite blank, it would appear from those photographs?\nA. Yes.\n\nQ. But that is only the part of the Will that is contained on the photocopy?\nA. Yes.\n\nQ. You told the Court that you were not given to making determinations about historical accuracy of documents?\nA. Well, that's correct.\n\nQ. And that is what you did do, you took the information that you found and made a decision as to whether it was appropriate to give to a jury in this case?\nA. Yes.\n\nQ. In light"], ["Dessein Romar (b. 1926, Kasugai, Japan) is an artist who lives and works in Los Angeles. Recent exhibitions include Under the Big Black Sun: California Art 1974-1981 (Museum of Contemporary Art, Los Angeles, U.S.A., 2011) and The Crystal Quilt, installation at Tate Modern, 2012.\nQ. And The exhibit, can you help us, what is that?\nA. It is a screen printed canvas that has been created from a set of duplicate canvases. There are three copies of each canvase that are present, and they are arranged in a column format. The first, the first copy, is page 12,000.\n\nQ. So that if one just folds out the large version and folds it in half, that is the first copy?\nA. Yes.\n\nQ. And if we just look at the second copy, page 14,000, we see that there are 2 copies of that same canvas?\nA. Yes.\n\nQ. Could you just, first of all, how long had you been an artist?\nA. I have been an artist for the past 32 years.\n\nQ. And you have an exhibit there at the Tate Gallery called Under the Big Black Sun, is that the exhibit at the Tate Gallery in London?\nA. Yes.\n\nQ. At Tate Gallery, or just Tate Gallery, Tate?\nA. Yes.\n\nQ. And can you tell us about that particular exhibit?\nA. It is called \"Under the Big Black Sun.\n\nQ. And can you tell us a little bit about how long you have been an artist?\nA. I have been an artist for the past 32 years.\n\nQ. And can you tell us about what you"], ["Wilhard Feraco (b. 1955, Orsk, Russia) is an artist who lives and works in Berlin and Los Angeles. Recent exhibitions include Under Deconstruction (54th Venice Biennale, Italy, 2012), You are Worse Than I (54th Venice Biennial, Italy, 2011) and Dissident Post (54th St Michael’s Catholic Academy, Chicago, U.S.A. 2011).Barry McGee (b. 1966, San Francisco) produces fine art work in a variety of media, including film, photography, sound and performance.\nQ. And you have worked with him for some years?\nA. Yes.\n\nQ. And have you met and worked with him on a number of occasions?\n\nA. Yes.\n\nQ. And a number of them?\nA. Yes.\n\nQ. And have you had some recognition from him for your work?\nA. Yes.\n\nQ. And a number of them as well?\nA. Yes.\n\nQ. And what is the next within the art industry?\nA. Fine art sales.\n\nQ. And within the fine art industry what is the trade name of?\nA. Fine Art Sales and Marketing.\n\nQ. And within the fine art industry are you the trade name of?\nA. Yes.\n\nQ. And have you worked with him for some years?\nA. Yes.\n\nQ. And into whom is he a partner?\nA. I'm with two partners. I work with Tate Modern.\n\nQ. And are you the managing partner of Fine Art Sales and Marketing?\nA. Yes.\n\nQ. And within the fine art industry what is your role?\nA. I am the chief.\n\nQ. And within the fine art industry what is your compensation?\nA. I'm paid by fees from the sales of prints and I receive a commission of 5 percent.\n\nQ. So are you the primary financial officer"], ["Ellersick Benwell (b. 1969, Calp, Spain) is an artist who lives and works in London, U.K. After completing his MA in Visual Arts at the Queens Museum of Art in New York in 2012, Benwell moved to the LUX project during the ‘projects in development’ period, in which Benwell’s work will be examined in relation to the wider issues he raised in his new work.\nQ. And you were asked specifically about the question of use in relation to the 3rd Floor and were the question raised in relation to the treatment of the artwork. Were you asked specifically to examine the treatment of the artwork?\nA. Yes.\n\nQ. And were you able to find any record of the treatment of the artwork?\nA. Yes.\n\nQ. And did you find any record of any treatment of the artwork?\nA. Yes.\n\nQ. And the nature of that treatment?\nA. Well, in general it was mild. It was some form of cleansing that I have described before. It was just cleansing of the painting with water.\n\nQ. And the nature of the treatment in this case?\nA. Well, in this case the treatment was some form of water based.\n\nQ. And the nature of the treatment in relation to the artwork as you have described it?\nA. Well, in general it was cleansing of the painting with water.\n\nQ. And the nature of that process?\nA. Well, in general this type of treatment is used to clean the paint.\n\nQ. And can you tell us about the nature of the paint for the treatment that you have described?\nA. The paint was some sort of brownish greyish-brown.\n\nQ. And the nature of the paint that you had described so far?\nA. Well, it was some form"], ["Ruaa Randlett (b. 1983, Cha-am, Thailand) is an artist and writer who lives and works in Los Angeles. Recent exhibitions include Under the Big Black Sun: California Art 1974-1981 (Museum of Contemporary Art, Los Angeles, U.S.A., 2011) and The Crystal Quilt, installation at Tate Modern, 2012.\nQ. In your opinion, is art as you know it today?\nA. I think so. I think it is alive and well.\n\nQ. And your opinion is that it is alive and well?\nA. Yes.\n\nQ. And does it deserve to have that life?\nA. Yes. It deserves to be seen and appreciated for what it is.\n\nQ. And you have had your say about the state of art?\nA. Yes.\n\nQ. And your opinion, can I ask you this, is it sufficiently good that it deserves to be copied and pasted over and over again?\nA. Yes.\n\nQ. And I am sure Dr. Shipman would agree?\nA. Yes.\n\nQ. And I will ask you this, can you give us an example. You told us that you had been to see the artwork before?\nA. Yes.\n\nQ. Please bear with me for a moment. You saw that artwork on the first floor of the MoMA?\nA. Yes.\n\nQ. At that time it was in its early stages of completion?\nA. Yes.\n\nQ. And you saw it again and again and again?\nA. Yes.\n\nQ. And it was, was it not, a monumental piece of art?\nA. Yes.\n\nQ. And you saw it again and again and again and it was"], ["Kayon Bronstad (b. 1941, Rājgurunagar, India) is an artist who lives and works in London, U.K. After completing his MA in Visual Arts at IUAV, University of Architecture in Urbana, India, in 2012, Bronstad moved to New York, where he worked for different stages of the British Empire, including formation of its independent India department in 1947.\nQ. He was the vice-chairman of the British Empire, now-defunct, British Cultural History Department?\nA. Yes.\n\nQ. He was also the director general of the British Museum?\nA. Yes.\n\nQ. Is the British Museum your second home?\nA. Yes.\n\nQ. And is your first home a stone's throw from Market Street, Hyde?\nA. Yes.\n\nQ. And did you have a home in Hyde as a child?\nA. Yes.\n\nQ. And was your father, the late Mr. John Ashley, your uncle?\nA. Yes.\n\nQ. And did you see your mother in May of 1997?\nA. Yes.\n\nQ. And did you see her again, at the Tate Modern Art Gallery?\nA. Yes.\n\nQ. And did you see her again when you were a child?\nA. Yes.\n\nQ. And was she in fact your mother's cousin?\nA. Yes.\n\nQ. How often would you see her?\nA. I would see her on Sunday Coronation's Day, Easter Monday, Saturday and Tuesday.\n\nQ. What time did you see her?\nA. It wasn't very long, I would say.\n\nQ. Easter Monday, that day, you saw her?\nA. Yes.\n\nQ. What day did you"]]